[
  {
    "title": "Surge in Immigration Cases in Minnesota Pushes Prosecutors and Judges to Brink",
    "link": "https://www.nytimes.com/2026/02/05/us/politics/minnesota-immigration-crackdown.html",
    "summary": "Remarks by a prosecutor opened a revealing window onto how the courts in the state are buckling under the weight of a deluge of cases arising from the Trump administration’s campaign."
  },
  {
    "title": "Major Nuclear Arms Treaty Expires, and Federal Prosecutor in Minnesota Says ‘This Job Sucks’",
    "link": "https://www.nytimes.com/2026/02/05/podcasts/the-headlines/nuclear-arms-treaty-us-attorney-minnesota.html",
    "summary": "Plus, Savannah Guthrie makes a plea to her mother’s abductor."
  },
  {
    "title": "Brad Karp Resigns as Paul Weiss Chairman Amid Epstein Fallout",
    "link": "https://www.nytimes.com/2026/02/04/business/brad-karp-paul-weiss-resigns-epstein.html",
    "summary": "The decision followed the release of a series of embarrassing emails between Mr. Karp and Jeffrey Epstein."
  },
  {
    "title": "‘My Crazy Friend’: The Royals Who Stayed Close to Epstein",
    "link": "https://www.nytimes.com/2026/02/05/world/europe/epstein-royal-friends-prince-andrew-sarah-ferguson-mette-marit.html",
    "summary": "Emails, texts, photos and videos show how Jeffrey Epstein, even after becoming a convicted sex offender, burnished his ties to royal family members from several countries and their advisers."
  },
  {
    "title": "Files Reveal Epstein’s Money Mingled with Silicon Valley’s Tech Start-Ups",
    "link": "https://www.nytimes.com/2026/02/05/business/epstein-investments-palantir-coinbase-thiel.html",
    "summary": "The disgraced financier regularly courted tech industry figures not just for their prestige but also for access to promising companies."
  },
  {
    "title": "China’s Xi Presses Trump on Taiwan in Phone Call",
    "link": "https://www.nytimes.com/2026/02/04/us/politics/xi-phone-call-taiwan.html",
    "summary": "Both leaders gave versions of what they discussed, but the Chinese president’s take made clear the issue of the island was front and center."
  },
  {
    "title": "How Trump Brought the Fight Over American History to Philadelphia",
    "link": "https://www.nytimes.com/2026/02/05/arts/george-washington-slavery-trump-history.html",
    "summary": "The administration took a crowbar to a site that focused on George Washington and slavery. But can the contradictions of the Founding Era be erased?"
  },
  {
    "title": "Trump Says His Unpredictable Style Gives Him Leverage. But It Has a Cost.",
    "link": "https://www.nytimes.com/2026/02/04/us/politics/trump-deals-allies-adversaries.html",
    "summary": "A year into President Trump’s second term, his threats, retreats, twists and turns appear to be wearing on allies and adversaries."
  },
  {
    "title": "Jessie Diggins is the Olympian Testing the Limits of Endurance",
    "link": "https://www.nytimes.com/2026/02/05/magazine/jessie-diggins-ski-winter-olympics-milan.html",
    "summary": "Jessie Diggins has become the best-ever American cross-country skier because of what she pushes her body through."
  },
  {
    "title": "Residents of Cortina, a Winter Olympics Hub, Are Angry About All the Construction",
    "link": "https://www.nytimes.com/2026/02/05/world/europe/cortina-olympics-construction-italy.html",
    "summary": "In Cortina d’Ampezzo, a hub for the Games in northern Italy, some residents, including a former Olympian, are annoyed about all the construction. Others are annoyed that they’re annoyed."
  },
  {
    "title": "Savannah Guthrie Addresses Mother’s Abductor: ‘We Are Ready to Talk’",
    "link": "https://www.nytimes.com/2026/02/04/us/savannah-guthrie-plea-statement.html",
    "summary": "Ms. Guthrie, the television anchor, and her siblings released a video on Wednesday night asking for proof that their mother, Nancy, is alive."
  },
  {
    "title": "What to Know About the Disappearance of Savannah Guthrie’s Mom, Nancy",
    "link": "https://www.nytimes.com/2026/02/03/us/savannah-guthrie-mom-missing.html",
    "summary": "Nancy Guthrie, 84, the “Today” show host’s mother, was last seen on Saturday night, the authorities said. The disappearance is being investigated as a possible kidnapping."
  },
  {
    "title": "Venezuela Said to Detain Maduro Allies Targeted by the U.S.",
    "link": "https://www.nytimes.com/2026/02/04/world/americas/venezuela-said-to-detain-maduro-allies-targeted-by-the-us.html",
    "summary": "The questioning of the politically connected businessmen, Raúl Gorrín and Alex Saab, signaled deepening cooperation between the two nations."
  },
  {
    "title": "‘It’s Collective Punishment’: Iran Exacts Heavy Price on Protest Supporters",
    "link": "https://www.nytimes.com/2026/02/05/world/middleeast/iran-protests-crackdown.html",
    "summary": "The authorities are making mass arrests, seizing assets and hunting down doctors who treated protesters. Some Iranians keep showing defiance anyway."
  },
  {
    "title": "U.S. and Iran to Hold Talks in Oman on Friday",
    "link": "https://www.nytimes.com/2026/02/04/world/middleeast/iran-us-talks-oman.html",
    "summary": "The White House confirmed a meeting would take place after days of conflicting reports on the talks’ timing, location and format."
  },
  {
    "title": "To Win Back the House, Democrats Take the Fight to Deep-Red Areas",
    "link": "https://www.nytimes.com/2026/02/05/us/politics/democrats-house-candidates.html",
    "summary": "Democrats are tapping candidates with unusual résumés — a Tejano recording star, a smokejumper and a fourth-generation farmer — to compete in areas long seen as inhospitable."
  },
  {
    "title": "After Taking on Trump and Backing Mamdani, Hochul Sees Her Star Rise",
    "link": "https://www.nytimes.com/2026/02/05/nyregion/hochul-democratic-convention-delgado.html",
    "summary": "Gov. Kathy Hochul has warded off most serious challenges to her re-election, but still faces a primary contest against her lieutenant governor, Antonio Delgado."
  },
  {
    "title": "Primary for New Jersey House Seat Is First Race of Pivotal Midterms",
    "link": "https://www.nytimes.com/2026/02/05/nyregion/new-jersey-special-election-congress.html",
    "summary": "Eleven candidates are running in a special primary election on Thursday to fill Gov. Mikie Sherrill’s former seat. They include a former member of Congress and the former lieutenant governor."
  },
  {
    "title": "Newsom, Shapiro and Other Democrats Whip Up the 2028 Book Buzz",
    "link": "https://www.nytimes.com/2026/02/04/us/politics/newsom-shapiro-democrats-2028-memoirs.html",
    "summary": "A number of potential presidential candidates are releasing memoirs as the shadow primary heats up."
  },
  {
    "title": "Bad Bunny Means a Breakthrough for Puerto Rican Athletes, Too",
    "link": "https://www.nytimes.com/2026/02/05/arts/music/super-bowl-bad-bunny-puerto-rico-nfl.html",
    "summary": "Puerto Rican football players are thrilled that Spanish will resound at the Super Bowl. “The stage is bigger than the N.F.L. itself,” one lineman said."
  },
  {
    "title": "William Shatner Pitches Raisin Bran in Super Bowl Commercial",
    "link": "https://www.nytimes.com/2026/02/05/business/raisin-bran-super-bowl-ad-william-shatner.html",
    "summary": "WK Kellogg is promoting Raisin Bran with William Shatner during the big game as cereal sales decline. It’s also tapping the latest health and wellness trend."
  },
  {
    "title": "A 60-Year Arc at The Washington Post, From Watergate to the Weather",
    "link": "https://www.nytimes.com/2026/02/05/business/media/washington-post-martin-weil-metro.html",
    "summary": "Martin Weil, one of hundreds being laid off at The Post, has worked on local news there since 1965, witnessing the paper’s rise and now retrenchment."
  },
  {
    "title": "When the Cold Turns Deadly, What Should New York City Do?",
    "link": "https://www.nytimes.com/2026/02/05/nyregion/nyc-cold-homeless-deaths.html",
    "summary": "Seventeen New Yorkers have died after exposure to frigid temperatures since Jan. 24, raising questions about how Mayor Zohran Mamdani has managed the crisis."
  },
  {
    "title": "Trump Brings Out the Worst in Everyone",
    "link": "https://www.nytimes.com/2026/02/05/opinion/trump-iran-ice-stephen-miller.html",
    "summary": "Us included."
  },
  {
    "title": "Maureen Dowd and Carlos Lozada on the Empty Propaganda of ‘Melania’",
    "link": "https://www.nytimes.com/2026/02/05/opinion/melania-film-review.html",
    "summary": "Glamour, silence and a very big hat."
  },
  {
    "title": "Jimmy Kimmel Hints ‘Melania’ Box Office Was a ‘Rigged Outcome’",
    "link": "https://www.nytimes.com/2026/02/05/arts/television/late-night-melania-movie.html",
    "summary": "Late night hosts were skeptical of a $7 million opening weekend for the new Amazon film about the first lady."
  },
  {
    "title": "Quick End to Second Day of Russia-Ukraine Peace Talks Hints at Impasse",
    "link": "https://www.nytimes.com/2026/02/05/world/europe/russia-ukraine-peace-talks.html",
    "summary": "American negotiators trumpeted plans for a prisoner swap, but that was small recompense for months of diplomatic efforts by the Trump administration."
  },
  {
    "title": "Nike, Accused of Bias Against White Workers, Is Under Federal Investigation",
    "link": "https://www.nytimes.com/2026/02/04/business/eeoc-nike-white-employee-discrimination.html",
    "summary": "It appeared to be the first time the Equal Employment Opportunity Commission has targeted diversity policies at a large company."
  },
  {
    "title": "France’s Raid on X Escalates Trans-Atlantic Showdown Over Social Media",
    "link": "https://www.nytimes.com/2026/02/04/world/europe/social-media-free-speech.html",
    "summary": "The French investigation into Elon Musk’s X illustrated a fundamental divide between European and American leaders about how to regulate social media — or whether to restrict it at all."
  },
  {
    "title": "Silver Is So Pricey That the World’s Largest Jeweler Is Switching to Platinum",
    "link": "https://www.nytimes.com/2026/02/05/business/pandora-silver-platinum.html",
    "summary": "Pandora, known for its charm bracelets, is trying to reduce its exposure to the volatility in silver prices, the latest setback for a company also facing wary consumers and steep tariffs."
  }
]