[
  {
    "title": "Europe Agrees to $105 Billion Funding Plan for Ukraine",
    "link": "https://www.nytimes.com/2025/12/18/world/europe/russia-eu-ukraine-frozen-assets.html",
    "summary": "European Union officials wanted to use Russia’s frozen assets to back a major loan to Ukraine. Unable to overcome opposition, they settled on another way to lend the money."
  },
  {
    "title": "Putin’s Year-End News Conference Set for Friday",
    "link": "https://www.nytimes.com/2025/12/18/world/europe/putin-russia-ukraine.html",
    "summary": "The annual news conference sets the Kremlin’s tone for the next year and highlights President Vladimir V. Putin’s grip over Russia."
  },
  {
    "title": "Judge Convicted of Obstructing Agents as They Sought Undocumented Immigrant",
    "link": "https://www.nytimes.com/2025/12/18/us/judge-hannah-dugan-trial-verdict.html",
    "summary": "The Wisconsin state judge, Hannah C. Dugan, was accused of ushering a man to a side door as federal agents waited outside a courtroom."
  },
  {
    "title": "Takeaways From the Trial of Wisconsin Judge Hannah Dugan",
    "link": "https://www.nytimes.com/2025/12/18/us/judge-hannah-dugan-trial-takeaways.html",
    "summary": "The Milwaukee judge was charged with obstructing federal immigration agents, who were trying to arrest a man who had appeared before her on a battery charge."
  },
  {
    "title": "Kennedy Center Board Moves to Rename It the Trump-Kennedy Center",
    "link": "https://www.nytimes.com/2025/12/18/us/politics/trump-kennedy-center-name.html",
    "summary": "The board for the John F. Kennedy Center for the Performing Arts announced that it would now be named the Trump-Kennedy Center, although a formal change may have to be approved by Congress."
  },
  {
    "title": "Trump Administration to Appeal Harvard Funding Case",
    "link": "https://www.nytimes.com/2025/12/19/us/trump-administration-appeal-harvard-funding-case.html",
    "summary": "Facing a deadline to appeal, the Justice Department told the courts late Thursday that it would try to overturn a judge’s ruling in favor of Harvard."
  },
  {
    "title": "Trump Signs Order to Ease Restrictions on Marijuana",
    "link": "https://www.nytimes.com/2025/12/18/us/politics/trump-marijuana-reclassify-order.html",
    "summary": "Marijuana’s classification as one of the most dangerous and habit-forming substances has long drawn criticism."
  },
  {
    "title": "Trump Announces $1,776 ‘Warrior Dividend’ for Military",
    "link": "https://www.nytimes.com/2025/12/18/us/trump-address-warrior-dividend-military-check-1776.html",
    "summary": "President Trump promised active duty troops a $1,776 check, citing increased revenue raised by tariffs, but the funding is coming from money for the military included in this year’s domestic spending law."
  },
  {
    "title": "‘A Singularly Turbulent Time’: Deeper Uncertainty in Store for Global Economy",
    "link": "https://www.nytimes.com/2025/12/19/business/economy/trump-trade-global-econ.html",
    "summary": "A reordering of the rules of trade, set on top of transformational change in technology, demographics and climate, is remaking jobs, politics and lives."
  },
  {
    "title": "Bank of Japan Raises Interest Rates to Highest Level in 30 Years",
    "link": "https://www.nytimes.com/2025/12/18/business/bank-of-japan-rates-inflation.html",
    "summary": "The Bank of Japan moved to slow inflation as the prime minister is borrowing more to fund an ambitious effort to build up industry and support households."
  },
  {
    "title": "‘Don’s Best Friend’: How Epstein and Trump Bonded Over the Pursuit of Women",
    "link": "https://www.nytimes.com/2025/12/18/us/jeffrey-epstein-donald-trump.html",
    "summary": "The president has tried to minimize their friendship, but documents and interviews reveal an intense and complicated relationship. Chasing women was a game of ego and dominance. Female bodies were currency."
  },
  {
    "title": "Britain Is Preparing for Attacks on Its Soil. Critics Say It Must Move Faster.",
    "link": "https://www.nytimes.com/2025/12/19/world/europe/uk-defense-russia.html",
    "summary": "As military officials sound the alarm over Russian hybrid attacks, the chair of Parliament’s defense committee said the government’s progress on ramping up home defense was “glacial.”"
  },
  {
    "title": "Rob Reiner Family Tragedy Strikes a Nerve for Families Fighting Addiction",
    "link": "https://www.nytimes.com/2025/12/18/us/rob-reiner-family-murder-addiction.html",
    "summary": "Nick Reiner, charged with murdering his parents, Rob and Michele Singer Reiner, spent much of his life battling drug addiction, an affliction that millions of Americans face."
  },
  {
    "title": "After Rob Reiner’s ‘North’ Flopped, He Proved He Could Take Criticism With Humor",
    "link": "https://www.nytimes.com/2025/12/18/arts/rob-reiner-north-movie.html",
    "summary": "Roger Ebert said he “hated, hated, hated, hated, hated” Reiner’s 1994 film “North.” The director took it in stride."
  },
  {
    "title": "Mamdani Appointee Resigns After Decade-Old Antisemitic Posts Re-emerge",
    "link": "https://www.nytimes.com/2025/12/18/nyregion/mamdani-resigns-antisemitic-da-costa.html",
    "summary": "Catherine Almonte Da Costa resigned from her just-announced post as Mayor-elect Zohran Mamdani’s director of appointments after the Anti-Defamation League resurfaced the comments."
  },
  {
    "title": "Trump Relies on Distortions to Support His Pressure Campaign on Venezuela",
    "link": "https://www.nytimes.com/2025/12/18/us/trump-venezuela-false-claims-misinformation.html",
    "summary": "The president has a long record of making false or misleading statements. But the sheer density of them in his administration’s boat attacks and Venezuela pressure campaign is exceptional."
  },
  {
    "title": "How Did a City of 10 Million People Nearly Run Out of Water?",
    "link": "https://www.nytimes.com/2025/12/19/opinion/tehran-iran-water-drought-crisis.html",
    "summary": "Restricting Tehran’s growth and water use — however politically difficult — would be more prudent than trying to engineer ever more elaborate workarounds."
  },
  {
    "title": "Justin Trudeau and Katy Perry Are Worth Rooting For",
    "link": "https://www.nytimes.com/2025/12/18/opinion/justin-trudeau-katy-perry-couple.html",
    "summary": "As a politician, Justin Trudeau was an excellent celebrity. And the rest of the world could learn a useful lesson from how he wielded his star power."
  },
  {
    "title": "Marjorie Taylor Greene, Donald Trump Jr. and More Conservative Figures Announce Their Engagements",
    "link": "https://www.nytimes.com/2025/12/17/style/conservatives-engagements-marjorie-taylor-greene-trump-jr.html",
    "summary": "Several prominent conservative figures have announced that they are engaged this week, news often celebrated by President Trump."
  },
  {
    "title": "Several Billion Dollars Were Lost to Fraud in Minnesota, Prosecutors Say",
    "link": "https://www.nytimes.com/2025/12/18/us/minnesota-fraud-scandal.html",
    "summary": "Federal prosecutors said they were now investigating fraud worth billions of dollars in 14 social services programs in the state."
  },
  {
    "title": "Palo Alto Confronts Billionaires Over Their Housing Compounds",
    "link": "https://www.nytimes.com/2025/12/18/us/palo-alto-billionaire-compound-law.html",
    "summary": "The Silicon Valley college town has changed drastically as Mark Zuckerberg, Larry Page and other tech founders have scooped up multiple properties."
  },
  {
    "title": "The D.N.C. Is Scrapping Its Report on What Went Wrong in 2024",
    "link": "https://www.nytimes.com/2025/12/18/us/politics/dnc-2024-autopsy-democrats-ken-martin.html",
    "summary": "Ken Martin, the Democratic National Committee chairman, ordered the autopsy months ago but is now said to believe that its release would be counterproductive for the party."
  }
]