[
  {
    "title": "In Announcing Pardon of Drug Trafficker While Threatening Venezuela, Trump Displays Contradictions",
    "link": "https://www.nytimes.com/2025/11/29/us/politics/trump-honduras-venezuela.html",
    "summary": "President Trump’s statements on social media less than 24 hours apart showed the dissonance in his campaign against drug trafficking."
  },
  {
    "title": "The Ex-President Whom Trump Plans to Pardon Flooded America With Cocaine",
    "link": "https://www.nytimes.com/2025/11/29/nyregion/honduras-hernandez-drug-trafficking.html",
    "summary": "Juan Orlando Hernández, whom Mr. Trump called a victim of persecution, helped orchestrate a decades-long trafficking conspiracy. It ravaged his Central American country."
  },
  {
    "title": "Trump Declares Venezuelan Airspace Closed",
    "link": "https://www.nytimes.com/2025/11/29/us/politics/trump-venezuela-maduro-airspace.html",
    "summary": "President Trump said days earlier that the United States could “very soon” expand its campaign of killing people at sea suspected of drug trafficking to attacking Venezuelan territory."
  },
  {
    "title": "Several Arrested as Protesters Block ICE Agents From a Potential Raid in NYC",
    "link": "https://www.nytimes.com/2025/11/29/nyregion/ice-raids-protests-nyc.html",
    "summary": "The confrontation appeared to foil a possible ICE raid nearby, underscoring the numerous challenges the federal government faces in trying to stage raids in a dense city like New York."
  },
  {
    "title": "F.D.A. Seeks More Oversight of Vaccine Trials and Approvals",
    "link": "https://www.nytimes.com/2025/11/28/health/fda-children-deaths-covid-vaccines.html",
    "summary": "The agency’s top vaccine regulator proposed broad changes, claiming that a new review linked 10 children’s deaths to the Covid vaccine. But public health experts questioned the findings, wanting to examine the data."
  },
  {
    "title": "Trump Frees Fraudster Just Days Into Seven-Year Prison Sentence",
    "link": "https://www.nytimes.com/2025/11/29/us/politics/trump-david-gentile-commutation.html",
    "summary": "David Gentile had been found guilty for his role in what prosecutors described as a $1.6 billion scheme that defrauded thousands of investors."
  },
  {
    "title": "Top Trump Aides to Meet With Ukrainians in Florida on Sunday",
    "link": "https://www.nytimes.com/2025/11/29/us/politics/trump-aides-ukraine-florida-meeting.html",
    "summary": "Secretary of State Marco Rubio, Steve Witkoff and Jared Kushner plan to discuss peace terms again after an uproar over a 28-point proposal drafted with Russian input."
  },
  {
    "title": "Inside Trump’s Push to Make the White House Ballroom as Big as Possible",
    "link": "https://www.nytimes.com/2025/11/29/us/politics/trump-white-house-ballroom.html",
    "summary": "President Trump’s ever-growing vision has caused tension with contractors. His architect has taken a step back as the president personally manages the project."
  },
  {
    "title": "Webster Springs, W.Va. United In Grief Over Death of National Guard Specialist Sarah Beckstrom",
    "link": "https://www.nytimes.com/2025/11/29/us/national-guard-shooting-beckstrom-webster-springs.html",
    "summary": "In Webster Springs, everyone knows one another. When National Guard Specialist Sarah Beckstrom was killed, that connection was even further strengthened."
  },
  {
    "title": "Afghans Who Assisted U.S. During the War Underwent Rigorous Vetting",
    "link": "https://www.nytimes.com/2025/11/29/us/politics/afghans-cia-vetting.html",
    "summary": "Former officials said the C.I.A. diligently assessed those who partnered with its forces, like the man accused of shooting two National Guard members in Washington."
  },
  {
    "title": "How Fraud Swamped Minnesota’s Social Services System on Tim Walz’s Watch",
    "link": "https://www.nytimes.com/2025/11/29/us/fraud-minnesota-somali.html",
    "summary": "Prosecutors say members of the Somali diaspora, a group with growing political power, were largely responsible. President Trump has drawn national attention to the scandal amid his crackdown on immigration."
  },
  {
    "title": "Political Confusion as Texas Awaits Supreme Court’s Ruling on Redistricting",
    "link": "https://www.nytimes.com/2025/11/29/us/politics/texas-gerrymander.html",
    "summary": "A decision on the state’s new congressional map will affect five House seats and could help determine control of the chamber next year."
  },
  {
    "title": "Republicans Flipped South Texas. Can a Moderate Tejano Singer Take It Back?",
    "link": "https://www.nytimes.com/2025/11/29/us/politics/bobby-pulido.html",
    "summary": "The star power of Latin Grammy Award-winning Bobby Pulido has Democrats dreaming of taking a U.S. House district in South Texas, even though Republicans have redrawn it in their favor."
  },
  {
    "title": "Ahead of Primary Elections, Time Is Running Out in the Fight Over Congressional Maps",
    "link": "https://www.nytimes.com/2025/11/29/us/politics/congressional-maps-voting-calendar.html",
    "summary": "As partisan battles rage and courts wrangle proposals, the relentless pace of the calendar will force states to act — or land in murky legal ground."
  },
  {
    "title": "Fed Up With the Taliban, Pakistan Expels Masses of Afghans",
    "link": "https://www.nytimes.com/2025/11/30/world/asia/pakistan-afghans-mass-expulsions.html",
    "summary": "Labeling Afghans a national security threat, Pakistan has forced out about a million this year, depriving them of a haven from Afghanistan’s turmoil."
  },
  {
    "title": "America Has Sidelined Education. You Can Help.",
    "link": "https://www.nytimes.com/2025/11/30/opinion/communities-fund-charitable-giving.html",
    "summary": "The New York Times Communities Fund has partnered with charities that invest in education at critical junctures across people’s life spans."
  },
  {
    "title": "Apocalypse Now",
    "link": "https://www.nytimes.com/2025/11/30/opinion/apocalypse-thinking-antichrist.html",
    "summary": "Apocalyptic predictions may actually serve as comforting fantasies, at which point our future freakouts become an excuse for inaction."
  },
  {
    "title": "4 Dead After Shooting at Banquet Hall in California",
    "link": "https://www.nytimes.com/2025/11/29/us/shooting-stockton-california.html",
    "summary": "The shooting in Stockton, a city in California’s Central Valley, left 11 others wounded. The authorities said they were looking for a suspect."
  },
  {
    "title": "Mourners Honor Victims of Hong Kong Apartment Fire",
    "link": "https://www.nytimes.com/2025/11/29/world/asia/mourners-hong-kong-fire.html",
    "summary": "The police said they expected the death toll of 128 to rise as the authorities began combing through the charred apartment towers."
  },
  {
    "title": "Did Pope Leo Pray in Istanbul’s Blue Mosque? Not Visibly, at Least.",
    "link": "https://www.nytimes.com/2025/11/29/world/asia/pope-leo-istanbul-blue-mosque-prayer.html",
    "summary": "Leo XIV is being closely watched on an inaugural trip to Turkey and Lebanon to spread a message of peace and outreach."
  },
  {
    "title": "Syria Tiptoes Toward Transitional Justice One Year After Assad’s Ouster",
    "link": "https://www.nytimes.com/2025/11/29/world/middleeast/syria-civil-war-assad.html",
    "summary": "Fourteen people are on trial, charged with crimes related to an outbreak of sectarian violence under the new government. The abuses of the old Assad regime still await a reckoning."
  }
]