[
  {
    "title": "Tax Cuts Now, Benefit Cuts Later: The Timeline in the Republican Megabill",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/tax-cuts-benefit-cuts.html",
    "summary": "Republicans deferred some of their most painful spending cuts until after the midterm elections."
  },
  {
    "title": "The Final Vote, and the Sean Combs Verdict",
    "link": "https://www.nytimes.com/2025/07/03/podcasts/the-headlines/house-vote-sean-combs-diddy-verdict.html",
    "summary": "Plus, Lululemon vs. Costco."
  },
  {
    "title": "Democrats Denied This City Had a Gang Problem. The Truth Is Complicated.",
    "link": "https://www.nytimes.com/2025/07/03/magazine/aurora-colorado-venezuela-gangs.html",
    "summary": "Trump’s claim that Venezuelan criminals took over Aurora, Colorado, became a rationale for his immigration crackdown. What really happened there?"
  },
  {
    "title": "Abrego Garcia Was Beaten and Tortured in El Salvador Prison, Lawyers Say",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/kilmar-abrego-garcia-el-salvador-trump-deportation.html",
    "summary": "Kilmar Armando Abrego Garcia was made to kneel overnight, denied bathroom access and confined in an overcrowded cell with bright lights and no windows, his lawyers say."
  },
  {
    "title": "Illegal Border Crossings Plunge to Lowest Level in Decades",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/border-crossings-trump.html",
    "summary": "Border Patrol agents made just over 6,000 arrests in June, according to government figures, a sign that President Trump’s hard-line immigration policies are working to keep people out."
  },
  {
    "title": "Hit by Trump’s Tariffs, French Clothing Maker Saint James Puts Shipping on Hold",
    "link": "https://www.nytimes.com/2025/07/03/business/trump-tariffs-st-james-fashion-france.html",
    "summary": "Hit by President Trump’s tariffs, the Saint James clothing factory has put its inventory of striped shirts and sweaters intended for U.S. retailers in its warehouse in France."
  },
  {
    "title": "The Site of the Jonestown Massacre Is Opening to Tourists",
    "link": "https://www.nytimes.com/2025/07/03/world/americas/jonestown-guyana-tourists.html",
    "summary": "Both American survivors of the mass suicide and murder and Guyanese have criticized the tour. But defenders say the site offers important lessons."
  },
  {
    "title": "Diogo Jota, Liverpool Soccer Star, Dies in Car Crash at 28",
    "link": "https://www.nytimes.com/2025/07/03/world/europe/diogo-jota-dead-car-crash-liverpool.html",
    "summary": "Mr. Jota and his brother André Filipe, 26, died in Spain, the authorities said. The crash came two weeks after the Portuguese player’s wedding."
  },
  {
    "title": "Chechnya’s Strongman Is Visibly Ailing. The Russian Region Is Bracing for Succession.",
    "link": "https://www.nytimes.com/2025/07/03/world/europe/chechnya-kadyrov-illness-succession.html",
    "summary": "Amid rampant speculation about his health, Ramzan Kadyrov, the Kremlin-allied strongman who rules the region, has been noticeably absent from view, while grooming his teenage son for the future."
  },
  {
    "title": "The Pope Returns to Castel Gandolfo for Summer. And There Will Be Tennis.",
    "link": "https://www.nytimes.com/2025/07/03/world/europe/pope-leo-summer-castel-gandolfo.html",
    "summary": "For 400 years, most popes escaped the Roman summer in the hilltop town of Castel Gandolfo, Italy. Then Francis stopped going, leaving the town a bit bereft."
  },
  {
    "title": "Chicago Suburb Will Buy Pope Leo XIV’s Boyhood Home",
    "link": "https://www.nytimes.com/2025/07/02/us/pope-leo-chicago-childhood-home.html",
    "summary": "Officials in Dolton, Ill., called the purchase a rare opportunity. But some residents questioned whether the village, grappling with a deficit and potholes, could afford it."
  },
  {
    "title": "After Mamdani Mania, the Next Democratic Test Comes to Tucson",
    "link": "https://www.nytimes.com/2025/07/03/us/tucson-arizona-democrats.html",
    "summary": "Adelita Grijalva remains heavily favored to win the House seat of her late father, Raúl Grijalva, but youthful challengers and tired voters are asking why change is so hard for Democrats."
  },
  {
    "title": "Mamdani’s Win Has Put Buses in the Spotlight. Should They Be Free?",
    "link": "https://www.nytimes.com/2025/07/03/nyregion/new-york-mamdani-free-bus.html",
    "summary": "The lowly New York City bus is getting new attention thanks to Zohran Mamdani’s vow to make the service free for all. But can free also mean fast?"
  },
  {
    "title": "‘There’s Just Too Much Lawlessness’: Three Legal Experts on an Embattled Supreme Court",
    "link": "https://www.nytimes.com/2025/07/03/opinion/supreme-court-trump.html",
    "summary": "Grading how the Supreme Court has done so far in Trump 2.0."
  },
  {
    "title": "What Are Republicans Thinking With Such a Reckless Bill? Maybe This.",
    "link": "https://www.nytimes.com/2025/07/03/opinion/republican-bill-trump-reagan.html",
    "summary": "A tax move from the Reagan era might explain what’s going on now."
  },
  {
    "title": "Sizing Up the Debt",
    "link": "https://www.nytimes.com/2025/07/03/briefing/sizing-up-the-debt.html",
    "summary": "We explain how economists evaluate the national debt."
  },
  {
    "title": "How Drinking Alcohol Affects You in Older Age",
    "link": "https://www.nytimes.com/2025/07/03/well/alcohol-older-age-risks.html",
    "summary": "Alcohol can present health problems for even light or occasional drinkers."
  },
  {
    "title": "Can Indonesia Afford Prabowo’s Free School Lunch Program?",
    "link": "https://www.nytimes.com/2025/07/03/world/asia/indonesia-school-lunch-economy.html",
    "summary": "Indonesia’s president promised free meals for every student in the country. But unemployment is rising, and some analysts say he’s making matters worse."
  },
  {
    "title": "Macy’s 4th of July Fireworks: Where to Watch in NYC",
    "link": "https://www.nytimes.com/2025/07/03/nyregion/nyc-fourth-of-july-fireworks-macys.html",
    "summary": "The Macy’s celebration, replete with 80,000 firework shells and 11 new pyrotechnic effects, returns to the East River after heading over to the Hudson in 2024."
  }
]