[
  {
    "title": "Trump’s Second-Term Promises: What He’s Done So Far on Immigration, Trade, DEI and More",
    "link": "https://www.nytimes.com/2025/12/27/us/politics/trump-second-term-promises-actions.html",
    "summary": "President Trump has driven illegal crossings at the border to record lows, helped bring about an uneasy cease-fire in Gaza and upended the global trading system."
  },
  {
    "title": "Kennedy Center Chief Threatens Legal Action Over Canceled Christmas Concert",
    "link": "https://www.nytimes.com/2025/12/27/us/kennedy-center-concert-lawsuit.html",
    "summary": "The musician Chuck Redd called off the annual Christmas Eve performances after the Kennedy Center board added President Trump’s name to the performing arts center."
  },
  {
    "title": "Karoline Leavitt Says She’s Expecting Her Second Child",
    "link": "https://www.nytimes.com/2025/12/26/us/karoline-leavitt-pregnant-second-child.html",
    "summary": "The White House press secretary announced on Instagram that she was pregnant with a daughter who is due in May. She and her husband have a 1-year-old son."
  },
  {
    "title": "California Drops Lawsuit Over $4 Billion Federal Cut to High-Speed Rail Project",
    "link": "https://www.nytimes.com/2025/12/27/us/california-high-speed-rail-lawsuit-transportation-department.html",
    "summary": "California sued after the Trump administration cut grants for the long-planned project. The state says it will seek private investors instead."
  },
  {
    "title": "Russia Pummels Kyiv Before Trump-Zelensky Meeting",
    "link": "https://www.nytimes.com/2025/12/27/world/europe/kyiv-ukraine-russia-trump-zelensky.html",
    "summary": "The assault began around 1:30 a.m. local time on Saturday and continued for nearly 10 hours."
  },
  {
    "title": "This Ukrainian Soldier Spent More Than a Year on the Front Line",
    "link": "https://www.nytimes.com/2025/12/27/world/europe/ukraine-russia-frontline.html",
    "summary": "Serhii Tyschenko, a Ukrainian combat medic, spent 472 days in a bunker. His case appears to be an extreme example of a problem that has long plagued Kyiv’s military."
  },
  {
    "title": "What Went Wrong Before Hong Kong’s Inferno",
    "link": "https://www.nytimes.com/2025/12/26/world/asia/hong-kong-apartment-fire-corruption.html",
    "summary": "Records show how government departments played down residents’ warnings about corrupt practices and substandard materials that fueled the deadly blaze."
  },
  {
    "title": "How One Father Created an Organ Empire",
    "link": "https://www.nytimes.com/2025/12/27/us/national-kidney-registry-paired-organ-donation.html",
    "summary": "The National Kidney Registry has matched thousands of kidney donors with recipients. It has also paid millions of dollars to a company owned by its founder."
  },
  {
    "title": "Park Chan-wook and the Funny Thing About Stomach-Churning Horror",
    "link": "https://www.nytimes.com/2025/12/27/movies/park-chan-wook-no-other-choice-korea.html",
    "summary": "When American studios wouldn’t back his film about a laid-off manager committing gruesome murders, the director returned to Korea. Now he has a hit on his hands."
  },
  {
    "title": "In Which I Try Valiantly to Cheer You Up",
    "link": "https://www.nytimes.com/2025/12/27/opinion/good-news.html",
    "summary": "OK, 2025 wasn’t the best year ever. But we’re arguably still in the best decade in the history of humanity."
  },
  {
    "title": "Good Calls",
    "link": "https://www.nytimes.com/2025/12/27/briefing/good-calls.html",
    "summary": "This week, we close out the year with your best advice of 2025."
  },
  {
    "title": "New Yorkers Wake Up to Snow, Though Not as Much as Forecast",
    "link": "https://www.nytimes.com/2025/12/27/nyregion/new-york-city-snow-storm.html",
    "summary": "Predictions were revised down on Friday. Central Park still saw more than 2 inches of snow, with higher totals outside of New York City."
  },
  {
    "title": "Annette Dionne, Last of the Celebrated Quintuplets, Dies at 91",
    "link": "https://www.nytimes.com/2025/12/26/world/canada/annette-dionne-dead.html",
    "summary": "She was the first to crawl, the first to cut a tooth, the first to recognize her name, and the last to die. And, like her sisters, she resented being exploited as part of a global sensation."
  },
  {
    "title": "In Myanmar, the Election Is Called Fake, but the Human Suffering Is Real",
    "link": "https://www.nytimes.com/2025/12/27/world/asia/myanmar-election-democracy-junta.html",
    "summary": "A coup set off a brutal civil war and made a poor country poorer. Now its military rulers are seeking a veneer of legitimacy by holding elections."
  },
  {
    "title": "A Wealth Tax Floated in California Has Billionaires Thinking of Leaving",
    "link": "https://www.nytimes.com/2025/12/26/technology/california-wealth-tax-page-thiel.html",
    "summary": "It’s uncertain whether the proposal will reach the statewide ballot in November, but some billionaires like Peter Thiel and Larry Page may be unwilling to take the risk."
  }
]