[
  {
    "title": "Judge Ends Deportation Case for Mexican Father of 3 U.S. Marines",
    "link": "https://www.nytimes.com/2026/02/12/us/deportation-case-us-mexico-marines-barranco.html",
    "summary": "The arrest of Narciso Barranco, who was detained by federal agents while landscaping outside an IHOP in Southern California last June, garnered national attention."
  },
  {
    "title": "Senators Press Officials on Agents’ Approach to Protesters",
    "link": "https://www.nytimes.com/live/2026/02/12/us/trump-news#section-156291943",
    "summary": ""
  },
  {
    "title": "Leqaa Kordia, Columbia Protester in ICE Custody for Nearly a Year, Suffers Seizure",
    "link": "https://www.nytimes.com/2026/02/12/nyregion/leqaa-kordia-columbia-ice.html",
    "summary": "Leqaa Kordia, 33, of New Jersey, was hospitalized after hitting her head at a Texas detention center, her lawyer said. She was initially arrested during a 2024 protest at Columbia University."
  },
  {
    "title": "Border Officials Are Said to Have Caused El Paso Closure by Firing Anti-Drone Laser",
    "link": "https://www.nytimes.com/2026/02/11/us/trump-administration-el-paso-airspace-closure-questions.html",
    "summary": "People familiar with the episode said the use of the technology was not coordinated with the Federal Aviation Administration. Officials targeted what they thought was a drug cartel drone, but turned out to be a party balloon, they said."
  },
  {
    "title": "What We Know About the El Paso Airspace Shutdown",
    "link": "https://www.nytimes.com/2026/02/11/us/el-paso-airspace-shutdown-what-to-know.html",
    "summary": "The Trump administration blamed the disruptive halt on a cartel drone incursion, but others have disputed that explanation."
  },
  {
    "title": "Europe Worries Trump Poses Threat to Its Financial and Tech Sovereignty",
    "link": "https://www.nytimes.com/2026/02/12/business/economy/trump-europe-sovereignty.html",
    "summary": "European leaders have been compelled to address the possibility of once-remote risks to the financial networks and technology that undergird their economies."
  },
  {
    "title": "Americans Are Paying the Bill for Tariffs, Despite Trump’s Claims",
    "link": "https://www.nytimes.com/2026/02/12/business/economy/americans-pay-tariffs-trump-fed.html",
    "summary": "Research from the New York Fed confirms that U.S. companies and consumers are bearing tariff costs, despite the president’s assertions otherwise."
  },
  {
    "title": "Judge Temporarily Blocks Hegseth From Punishing Mark Kelly Over ‘Illegal Orders’ Video",
    "link": "https://www.nytimes.com/2026/02/12/us/judge-blocks-kelly-punishment-hegseth.html",
    "summary": "Judge Richard J. Leon found that attempts to discipline Mark Kelly for a video that warned against following illegal orders would violate the senator’s First Amendment rights."
  },
  {
    "title": "Senate Questions Health Care Firm for Profiting Off Program Meant for Poor",
    "link": "https://www.nytimes.com/2026/02/12/us/health-care-apexus-340b.html",
    "summary": "The program was meant to help hospitals provide for poor patients by offering drug savings. But critics say a Texas company has turned it into a big business, driving up costs for patients and insurers."
  },
  {
    "title": "Ukrainian Olympian Is Disqualified Over Helmet Honoring War Dead",
    "link": "https://www.nytimes.com/2026/02/12/world/olympics/ukraine-skeleton-olympics-banned-helmet-heraskevych.html",
    "summary": "Olympic officials ruled that Vladyslav Heraskevych’s helmet violated a prohibition on political speech, setting off outrage at the Winter Games in Italy."
  },
  {
    "title": "To Stay in Her Home, She Let In an A.I. Robot",
    "link": "https://www.nytimes.com/2026/02/12/us/elliq-ai-robot-senior-companion.html",
    "summary": "At 85, Jan Worrell lived alone on a remote corner of the Washington coast. Could ElliQ become her companion?"
  },
  {
    "title": "Why Pennsylvania’s Two Most Powerful Democrats Don’t Speak",
    "link": "https://www.nytimes.com/2026/02/12/us/politics/john-fetterman-josh-shapiro-pennsylvania.html",
    "summary": "Senator John Fetterman and Gov. Josh Shapiro do not get along. The bad blood goes back years."
  },
  {
    "title": "Crypto Super PAC Targets Al Green, a Texas Democrat Who Voiced Concerns",
    "link": "https://www.nytimes.com/2026/02/12/us/politics/crypto-super-pac-fairshake-green-menefee-texas.html",
    "summary": "A crypto-backed super PAC plans to spend $1.5 million against Mr. Green, a member of the House Financial Services Committee who has expressed concerns about cryptocurrency."
  },
  {
    "title": "Anthropic Donates $20 Million to Super PAC Operation to Counter OpenAI",
    "link": "https://www.nytimes.com/2026/02/12/technology/anthropic-super-pac-openai.html",
    "summary": "Anthropic and OpenAI now have their own well-funded political groups that will square off in the midterm elections over artificial intelligence safety and regulation."
  },
  {
    "title": "Maybe America Needs Some New Cities",
    "link": "https://www.nytimes.com/2026/02/12/business/economy/america-new-cities-irvine.html",
    "summary": "It sounds a bit kooky to promise a whole city from scratch. But it has been done before — and might just help solve the housing crisis."
  },
  {
    "title": "Lawmakers Question Bondi Over Justice Dept. Under Her Watch",
    "link": "https://www.nytimes.com/2026/02/11/us/politics/bondi-testimony-epstein-files.html",
    "summary": "Her appearance came as the Justice Department was under scrutiny over the Epstein files, its approach toward the shootings in Minneapolis and its move to prosecute six lawmakers."
  },
  {
    "title": "Epstein Files Include Grainy Videos From Inside His Florida Home",
    "link": "https://www.nytimes.com/2026/02/11/us/epstein-files-videos.html",
    "summary": "The clips from Jeffrey Epstein’s home office appear to show him with young women."
  },
  {
    "title": "Henry McGowan Found Not Guilty By Reason of Insanity in Father’s Murder",
    "link": "https://www.nytimes.com/2026/02/12/world/europe/henry-mcgowan-murder-ireland-not-guilty-insanity.html",
    "summary": "Henry McGowan of New York City was charged in the death of his father in an Irish hotel. He had struggled with mental illness for several years."
  },
  {
    "title": "Turkish Nobel Novelist Orhan Pamuk Gets the Netflix Series He Wanted",
    "link": "https://www.nytimes.com/2026/02/12/world/europe/orhan-pamuk-istanbul-turkey-museum-of-innocence.html",
    "summary": "After publishing more than 20 books and winning a Nobel Prize, the Turkish author fought to bring a celebrated novel to the screen — on his own terms."
  },
  {
    "title": "What We Know About the Victims of the Tumbler Ridge Mass Shooting in Canada",
    "link": "https://www.nytimes.com/2026/02/12/world/canada/tumbler-ridge-shooting-victims-canada.html",
    "summary": "The attack at a secondary school and a private residence in the small, remote community in British Columbia has left families stunned and grief-stricken."
  },
  {
    "title": "Mamdani Says Little About NYCHA as He Targets Bad Landlords",
    "link": "https://www.nytimes.com/2026/02/12/nyregion/mamdani-public-housing-nycha.html",
    "summary": "Mayor Zohran Mamdani has pledged to hold private landlords accountable. But he has said less about how he will fix the crumbling public housing system he now oversees."
  },
  {
    "title": "Mamdani Reverses Campaign Promise to Expand Rental Assistance",
    "link": "https://www.nytimes.com/2026/02/12/nyregion/mamdani-rental-vouchers.html",
    "summary": "A rental voucher program costs more than $1 billion. The mayor’s decision to curtail its expansion reflects the clash between his ideology and the realities of managing the city."
  },
  {
    "title": "Satellite Pictures Show Snow And Ice Across North America",
    "link": "https://www.nytimes.com/2026/02/12/weather/ice-great-lakes-satellite-winter.html",
    "summary": "For much of North America, the last month has been an icy, frozen trudge. But from the right vantage point, it had a certain beauty."
  },
  {
    "title": "Youngstown, Ohio, Has Been Freezing Because of a Broken Utility",
    "link": "https://www.nytimes.com/2026/02/12/us/youngstown-ohio-cold-utilities.html",
    "summary": "An insolvent, broken utility left downtown buildings in Youngstown freezing in recent weeks. Gov. Mike DeWine has attributed the problems to an archaic system."
  },
  {
    "title": "The Snow Sure Was Beautiful. Now Here Comes the River of Yuck.",
    "link": "https://www.nytimes.com/2026/02/12/climate/toxic-melting-snow-dog-poop.html",
    "summary": "Melting mega-piles of grimy road snow can release weeks worth of salt, oils (and dog poop) in what one scientist called a “triple whammy.”"
  },
  {
    "title": "Alcohol’s Effects on the Body: What Does Drinking Do to Your Health?",
    "link": "https://www.nytimes.com/2026/02/12/well/alcohol-body-health-effects.html",
    "summary": "From the moment you take a sip, drinking starts to influence your biology. Here’s an inside look."
  },
  {
    "title": "‘Wuthering Heights’ Review: Margot Robbie, Amok on the Moors",
    "link": "https://www.nytimes.com/2026/02/12/movies/wuthering-heights-review-margot-robbie-amok-on-the-moors.html",
    "summary": "The actor and Jacob Elordi play the tortured lovers from the Emily Brontë classic in this florid, overstuffed version by Emerald Fennell."
  },
  {
    "title": "Mass Detention Gets a Lift From the Courts",
    "link": "https://www.nytimes.com/2026/02/12/opinion/mass-detention-immigration-court-ruling.html",
    "summary": "A very dangerous ruling in New Orleans."
  },
  {
    "title": "Trump and the Death of Shared Morality in America",
    "link": "https://www.nytimes.com/2026/02/12/opinion/trump-morality-david-brooks-farewell.html",
    "summary": "In this installment of The Conversation, David Brooks says goodbye to The Times, and offers his parting thoughts."
  },
  {
    "title": "Building Cities from Scratch",
    "link": "https://www.nytimes.com/2026/02/12/briefing/building-cities-from-scratch.html",
    "summary": "We explore one possibility for relieving the U.S. housing crisis."
  },
  {
    "title": "Laid-Off Battery Plant Workers Pin Blame on Ford, not Trump, for Lost Jobs",
    "link": "https://www.nytimes.com/2026/02/12/business/energy-environment/ford-trump-electric-vehicles-kentucky.html",
    "summary": "Ford Motor shut down a battery factory and laid off 1,600 workers after President Trump and Republicans gutted government support for electric vehicles."
  },
  {
    "title": "Bans on Many CBD Products Loom This Year",
    "link": "https://www.nytimes.com/2026/02/12/health/bans-on-many-cbd-products-loom-this-year.html",
    "summary": "A federal law taking effect in November severely limits the amount of THC, the euphoric cannabis compound, allowed in over-the-counter items. Many groups are fighting back."
  },
  {
    "title": "N.Y.C. Officials Condemn Stonewall Pride Flag Removal Ahead of Rally",
    "link": "https://www.nytimes.com/2026/02/12/nyregion/stonewall-flag-protest-nyc.html",
    "summary": "Activists and officials plan to re-raise the flag on Thursday, setting up a defiant response to the Trump administration’s assault on diversity initiatives."
  }
]