[
  {
    "title": "Bolsonaro’s Arrest Exposes Limits to Trump’s Power",
    "link": "https://www.nytimes.com/2025/11/24/world/americas/trump-bolsonaro-arrest.html",
    "summary": "President Trump tried to keep the former Brazilian president, Jair Bolsonaro, out of prison. He failed, and now he is moving on."
  },
  {
    "title": "Billionaires Have a Bigger Role in Higher Education Under President Trump",
    "link": "https://www.nytimes.com/2025/11/24/us/billionaires-influence-universities-trump.html",
    "summary": "A new set of billionaires with an interest in higher education has helped oust college presidents and even assisted the Trump administration in its effort to overhaul the industry."
  },
  {
    "title": "Trump Welcomes A.P.’s Photographers. Its Reporters? Not So Much.",
    "link": "https://www.nytimes.com/2025/11/24/business/media/associated-press-president-trump.html",
    "summary": "The White House now has conflicting approaches for Associated Press journalists as it fights the news service in court over access to presidential events."
  },
  {
    "title": "U.S. and Ukraine Hail Progress on Peace Plan to End War With Russia",
    "link": "https://www.nytimes.com/2025/11/24/world/europe/ukraine-zelensky-rubio-russia-peace-plan.html",
    "summary": "Washington and Kyiv said that “highly productive” discussions over a proposal to end the war with Russia would continue. But details remained unclear."
  },
  {
    "title": "Putin’s Win-Win: Take a Russia-Friendly Peace Deal, or Fight On",
    "link": "https://www.nytimes.com/2025/11/24/world/europe/trump-ukraine-peace-talks-russia.html",
    "summary": "The Kremlin’s leader is standing back as Ukraine and Europe scramble to negotiate changes to a U.S. proposal to end the war."
  },
  {
    "title": "Russia’s Invasion of Ukraine Prompts Debate Over Europe’s Military",
    "link": "https://www.nytimes.com/2025/11/24/business/economy/russia-ukraine-europe-military.html",
    "summary": "With Russia looming, governments race to rebuild armed forces that shrank after the Cold War, grappling with hard issues of economics, politics and military strategy."
  },
  {
    "title": "Why a Man With U.S. Ties Fought for Russia in Ukraine",
    "link": "https://www.nytimes.com/2025/11/24/us/politics/russian-soldier-war.html",
    "summary": "Col. Andrei Demurenko’s war story began at Fort Leavenworth, Kan., at a moment of hope and peace. It ended with a mortar blast in Ukraine."
  },
  {
    "title": "An Auto Holy Grail: Motors That Don’t Rely on Chinese Rare Earths",
    "link": "https://www.nytimes.com/2025/11/24/business/automakers-rare-earth-minerals-magnets.html",
    "summary": "Weary of being captive to geopolitics, car companies are looking for ways to replace powerful rare-earth magnets in electric motors."
  },
  {
    "title": "Why Crypto’s Slide Is Rattling Wall Street",
    "link": "https://www.nytimes.com/2025/11/24/business/dealbook/bitcoin-crypto-wall-street.html",
    "summary": "Bitcoin and other digital tokens have lost more than $1 trillion in value in recent weeks, raising concerns about a wider market fallout."
  },
  {
    "title": "Our Staff’s Favorite Thanksgiving Recipes | Thanksgiving Recipes 2024 | NYT Cooking",
    "link": "https://cooking.nytimes.com/article/thanksgiving-recipes-staff-picks",
    "summary": "Reporters and editors shared the holiday dishes they love. Here are their recommendations for Thanksgiving side dishes, turkey and more."
  },
  {
    "title": "Amid GPS and Ride-Hailing, the Allure of London’s Black Cab Endures",
    "link": "https://www.nytimes.com/2025/11/24/world/europe/london-black-cab-taxi-driving-test.html",
    "summary": "In a world of GPS and car-hailing apps, some Londoners still want to drive a traditional black cab. First, they must memorize thousands of city streets."
  },
  {
    "title": "Restrained, Beaten, Asphyxiated: New York Prison Guards’ Brutality Grows",
    "link": "https://www.nytimes.com/2025/11/24/nyregion/ny-prison-guards-abuse-brutality.html",
    "summary": "As frustrations among corrections officers mount, abusive treatment of inmates is rising and becoming more vicious, records and interviews show."
  },
  {
    "title": "Why Are Guards Using Force More Often in New York’s Prisons?",
    "link": "https://www.nytimes.com/2025/11/24/nyregion/ny-prison-guards-use-force.html",
    "summary": "State prison guards say they are doing so because their jobs have become more dangerous. A New York Times analysis points to a different reality."
  },
  {
    "title": "Health Issues in Middle Age Can Be Linked to Pregnancy Years Earlier",
    "link": "https://www.nytimes.com/2025/11/24/well/pregnancy-complications-heart-health.html",
    "summary": "Women with common pregnancy complications are at increased risk for cardiovascular and metabolic health problems later in life. But many patients remain unaware of the connection."
  },
  {
    "title": "These Hospitals Figured Out How to Slash C-Section Rates",
    "link": "https://www.nytimes.com/2025/11/24/health/c-section-rate-decline-solutions.html",
    "summary": "Financial and social incentives can nudge doctors away from the operating room."
  },
  {
    "title": "The Best Baseball Team Behind Bars",
    "link": "https://www.nytimes.com/2025/11/24/us/san-quentin-prison-baseball-team.html",
    "summary": "The San Quentin Giants’ opponents are impressed. But what about the parole board that decides the players’ fate?"
  },
  {
    "title": "A Stand Against Coal Could Push Oakland Toward Bankruptcy",
    "link": "https://www.nytimes.com/2025/11/24/us/oakland-coal-port-budget-bankruptcy.html",
    "summary": "After Oakland, Calif., reneged on a contract allowing coal shipments, a Kentucky company went under. Courts say the city must now pay hundreds of millions of dollars."
  },
  {
    "title": "Jimmy Cliff, Singer Who Helped Bring Reggae to Global Audience, Dies at 81",
    "link": "https://www.nytimes.com/2025/11/24/arts/music/jimmy-cliff-dead.html",
    "summary": "His Grammy-winning records as well as his starring role in the cult movie “The Harder They Come” in 1972 boosted a career spanning seven decades."
  },
  {
    "title": "Jimmy Cliff: 8 Essential Songs",
    "link": "https://www.nytimes.com/2025/11/24/arts/music/jimmy-cliff-songs.html",
    "summary": "A giant of Jamaican music, he gained international renown through the 1972 film “The Harder They Come,” and helped establish reggae’s themes of struggle, resistance and uplift."
  },
  {
    "title": "They Loved Their Family Land in South Carolina. But Who Actually Owned It?",
    "link": "https://www.nytimes.com/2025/11/18/climate/south-carolina-land-title-ownership.html",
    "summary": "Conservation can be tough when a property is passed down informally over generations. A growing effort is helping families sort it all out."
  },
  {
    "title": "5 Minutes That Will Make You Love Musicals",
    "link": "https://www.nytimes.com/2025/11/24/theater/musicals-broadway-theater-hamilton.html",
    "summary": "Andrew Lloyd Webber, Sara Bareilles, Joshua Henry, Jeanine Tesori, Jason Robert Brown and New York Times writers and editors pick 13 songs to seal the deal."
  },
  {
    "title": "America’s Caregivers Are in Crisis",
    "link": "https://www.nytimes.com/2025/11/24/opinion/caregiving-crisis.html",
    "summary": "Caregivers are at the brink of despair."
  },
  {
    "title": "James Carville: Out With Woke. In With Rage.",
    "link": "https://www.nytimes.com/2025/11/24/opinion/democrats-platform-economic-rage.html",
    "summary": "Democrats also have to shed the last vestiges of woke."
  },
  {
    "title": "Negotiating Peace in Ukraine",
    "link": "https://www.nytimes.com/2025/11/24/briefing/negotiating-peace-in-ukraine.html",
    "summary": "We explain the Trump administration’s latest push to end the war."
  },
  {
    "title": "Sleep Apnea Linked to Parkinson’s Disease, New Study Finds",
    "link": "https://www.nytimes.com/2025/11/24/well/mind/sleep-apnea-parkinsons-disease.html",
    "summary": "Those with the sleep condition were more likely to develop Parkinson’s disease. But one treatment was found to help."
  },
  {
    "title": "Rick Cotton, Head of the Port Authority, Is Stepping Down",
    "link": "https://www.nytimes.com/2025/11/24/nyregion/rick-cotton-port-authority-retiring.html",
    "summary": "Mr. Cotton oversaw the rebuilding of LaGuardia Airport and several other major infrastructure projects in the New York City region."
  },
  {
    "title": "Grisly Killings of a Married Couple Spark New Sectarian Unrest in Syria",
    "link": "https://www.nytimes.com/2025/11/24/world/europe/syria-sectarian-killings-homs.html",
    "summary": "The government acted quickly to tamp down reprisals in the central city of Homs as it tries to manage repeated waves of bloodshed involving minority groups."
  },
  {
    "title": "Study Finds Mental Health Benefit to One-Week Social Media Break",
    "link": "https://www.nytimes.com/2025/11/24/health/social-media-detox-mental-health.html",
    "summary": "Young adults who engaged in a social media “detox” reported reductions in depression, anxiety and insomnia, though it was unclear how long the effects would last."
  }
]