[
  {
    "title": "In Texas Flooding, the Most Urgent Alerts Came in the Middle of the Night",
    "link": "https://www.nytimes.com/2025/07/04/weather/weather-alerts-rivers-flooding.html",
    "summary": "The National Weather Service issued a series of upgraded warnings in quick succession as rivers across the region began to rise."
  },
  {
    "title": "Mother of 2 Rescued Campers in Texas Relays Their Story",
    "link": "https://www.nytimes.com/2025/07/04/us/the-mother-of-two-rescued-campers-relays-their-story.html",
    "summary": "Serena Hanor Aldrich said her daughters were trapped by floodwaters for a couple of hours at Camp Mystic, where as many as 25 girls are missing. She criticized camp officials."
  },
  {
    "title": "The Cost of Victory: Israel Overpowered Its Foes, but Deepened Its Isolation",
    "link": "https://www.nytimes.com/2025/07/05/world/middleeast/israel-cost-of-victory.html",
    "summary": "It is more secure from threats than at any time since its founding. But the war in Gaza, and attacks on Iran and Lebanon, have undercut Israel’s standing among the world’s democracies."
  },
  {
    "title": "Israeli Ministers to Meet on Next Steps Toward Gaza Truce",
    "link": "https://www.nytimes.com/2025/07/05/world/middleeast/israeli-ministers-hamas-gaza-ceasefire.html",
    "summary": "Israel is poised to decide whether to proceed with talks after Hamas said it had responded positively to the latest cease-fire proposal."
  },
  {
    "title": "Iran Looks to BRICS for Allies, Testing a New World Order",
    "link": "https://www.nytimes.com/2025/07/05/world/americas/iran-brics-summit-rio-de-janeiro.html",
    "summary": "The alliance of emerging economies hopes to offer a counterweight to the United States and other Western powers. But military strikes on Iran are testing its unity."
  },
  {
    "title": "U.S. Turns Eight Migrants Over to South Sudan, Ending Weeks of Legal Limbo",
    "link": "https://www.nytimes.com/2025/07/05/us/migrants-djibouti-south-sudan.html",
    "summary": "Courts blocked the handover after lawyers raised concerns of torture. Then the Supreme Court intervened to allow the Trump administration’s plan to move forward."
  },
  {
    "title": "Virginia Has Become a Hotbed for Immigration Arrests",
    "link": "https://www.nytimes.com/2025/07/05/us/virginia-immigration-arrests.html",
    "summary": "Lawyers and advocates have theories as to why immigration arrests have accelerated in Virginia at a rate more than that of almost any other state."
  },
  {
    "title": "Trump Says He Will Start Talks With China on TikTok Deal",
    "link": "https://www.nytimes.com/2025/07/05/us/politics/trump-says-he-will-start-talks-with-china-on-tiktok-deal.html",
    "summary": "President Trump has declined to enforce a statutory ban of the popular social media app while his administration negotiates a deal for an American company to acquire it."
  },
  {
    "title": "China Has Paid a High Price for Its Dominance in Rare Earths",
    "link": "https://www.nytimes.com/2025/07/05/business/china-rare-earth-environment.html",
    "summary": "Dust and groundwater contaminated with heavy metals and radioactive chemicals pose a health threat that the authorities have been trying to address for years."
  },
  {
    "title": "China’s Rare Earth Origin Story, Explained",
    "link": "https://www.nytimes.com/2025/07/05/business/china-rare-earth-history.html",
    "summary": "Low environmental standards helped China become the world’s low-cost producer of rare earths, but Beijing was also focused on helping the industry."
  },
  {
    "title": "Superhero Movies Dominated the Box Office, but Not the Top 100 List",
    "link": "https://www.nytimes.com/2025/07/04/movies/superhero-movies-best-films-list.html",
    "summary": "The notable exceptions — “The Dark Knight” and “Black Panther” — stood out among the many sequels and spinoffs."
  },
  {
    "title": "Justice Ketanji Brown Jackson Makes Herself Heard, Prompting a Rebuke",
    "link": "https://www.nytimes.com/2025/07/05/us/supreme-court-ketanji-brown-jackson.html",
    "summary": "In solo dissents this term, the justice accused the conservative majority of lawless bias. On the term’s last day, Justice Amy Coney Barrett fired back."
  },
  {
    "title": "The Royal Box: Who’s in Wimbledon’s Most Exclusive Seats?",
    "link": "https://www.nytimes.com/2025/07/05/sports/tennis/wimbledon-royal-box-who.html",
    "summary": "The event’s most coveted seats are available only through invitation, reserved for celebrities and dignitaries. Here’s a look at who’s sitting in them."
  },
  {
    "title": "Combs’s Racketeering Acquittal Was a Rare Misfire for a Powerful Law",
    "link": "https://www.nytimes.com/2025/07/05/nyregion/sean-combs-rico-act.html",
    "summary": "The Racketeer Influenced and Corrupt Organizations Act has been an effective cudgel in a variety of criminal cases. Some defense lawyers say prosecutors use it unfairly."
  },
  {
    "title": "A Napoleon From Long Island Meets His Waterloo",
    "link": "https://www.nytimes.com/2025/07/05/world/europe/waterloo-reenactment-american-napoleon.html",
    "summary": "An American war re-enactor earned the job of Napoleon for the 210th anniversary of the battle,  despite his accent."
  },
  {
    "title": "How Many Dates Should You Go On Before You Start Talking About Money?",
    "link": "https://www.nytimes.com/2025/07/05/business/dating-relationships-salary.html",
    "summary": "Couples tend to dance around discussing how much they earn or owe early in a relationship. But experts agree that talking about money sooner is better than later."
  },
  {
    "title": "Oasis Live Review: The Gallaghers Reunite, Their Songs Still Stomping and Wounds Still Healing",
    "link": "https://www.nytimes.com/2025/07/05/arts/music/oasis-reunion-tour-review.html",
    "summary": "The British band, a showcase for the intoxicating but toxic chemistry of the brothers Liam and Noel Gallagher, performed for the first time in 16 years."
  },
  {
    "title": "Oasis Starts Its World Tour With Cardiff Concert",
    "link": "https://www.nytimes.com/2025/07/04/arts/music/oasis-tour-cardiff-concert.html",
    "summary": "Liam and Noel Gallagher put aside their brotherly rivalry to play the first date of their band’s long-awaited comeback tour in Cardiff, Wales."
  },
  {
    "title": "YouTube Pirates Are Cashing In on Hollywood’s Summer Blockbusters",
    "link": "https://www.nytimes.com/2025/07/05/technology/youtube-piracy-movies-copyright.html",
    "summary": "More than a decade after the platform cracked down on copyright infringement, thousands of unlicensed movies, TV shows and live sports are available."
  },
  {
    "title": "Conservatives Are Prisoners of Their Own Tax Cuts",
    "link": "https://www.nytimes.com/2025/07/05/opinion/trump-republicans-taxes-bill.html",
    "summary": "The various ways that the G.O.P. legislation doesn’t address itself to America’s most important problems."
  },
  {
    "title": "Trump’s Politicized F.B.I. Has Made Americans Less Safe",
    "link": "https://www.nytimes.com/2025/07/05/opinion/trump-fbi-politics-safety.html",
    "summary": "The Trump administration’s political witch hunt is risking the bureau’s effectiveness and the public’s safety."
  },
  {
    "title": "Making Lists",
    "link": "https://www.nytimes.com/2025/07/05/briefing/making-lists.html",
    "summary": "What are they good for, anyway?"
  },
  {
    "title": "Canada’s Indigenous Groups Demand a Say in Carney’s Race to Build",
    "link": "https://www.nytimes.com/2025/07/05/world/canada/carney-projects-indigenous-opposition.html",
    "summary": "Prime Minister Mark Carney wants to fast-track nation-building projects to remake Canada’s economy. Indigenous groups want a seat at the table."
  },
  {
    "title": "Antarctica Faces Tense Future as U.S. Science Budget Shrinks",
    "link": "https://www.nytimes.com/2025/07/05/science/antarctica-science-trump-budget.html",
    "summary": "The continent is dedicated to research and cooperation, but proposed funding cuts in the Trump administration and actions by other world powers may alter the environment."
  },
  {
    "title": "Mamdani Once Claimed to Be Asian and African American. Should It Matter?",
    "link": "https://www.nytimes.com/2025/07/04/nyregion/mamdani-college-black-reaction.html",
    "summary": "Zohran Mamdani’s responses on a 2009 college application were criticized by his mayoral rivals. The blowback was dismissed by his supporters as a politically motivated attack."
  },
  {
    "title": "Violence at Synagogue and Restaurant Unnerves Jews in Melbourne",
    "link": "https://www.nytimes.com/2025/07/05/world/australia/jewish-synagogue-restaurant-violence.html",
    "summary": "Local leaders denounced the episodes, which both took place on Friday evening: arson at a synagogue and a disturbance at an Israeli eatery."
  }
]