[
  {
    "title": "The New Cost of Trump’s Bill, and Gen Z’s Retirement Plan",
    "link": "https://www.nytimes.com/2025/06/30/podcasts/the-headlines/trump-bill-gen-z-retirement-jello.html",
    "summary": "Plus, the tricky science behind lime green Jell-O."
  },
  {
    "title": "Trump Vowed to Dismantle MS-13. His Deal With Bukele Threatens That Effort.",
    "link": "https://www.nytimes.com/2025/06/30/us/politics/trump-bukele-ms-13-immigrants.html",
    "summary": "Top gang leaders being sent back to El Salvador were part of a lengthy federal investigation that has amassed evidence of a corrupt pact between the Bukele government and MS-13."
  },
  {
    "title": "Why Is Trump Returning MS-13 Leaders to El Salvador? Takeaways From Times Reporting.",
    "link": "https://www.nytimes.com/2025/06/30/us/politics/takeaways-trump-bukele-ms-13.html",
    "summary": "The agreement with Nayib Bukele, the president of El Salvador, is undermining a long-running federal investigation into the gang, according to people familiar with the inquiry."
  },
  {
    "title": "Canada to Scrap Tax That Led Trump to Suspend Trade Talks",
    "link": "https://www.nytimes.com/2025/06/29/world/canada/trump-digital-services-tax.html",
    "summary": "The government said on Sunday night that it would cancel its tax on American technology companies, handing a victory to the Trump administration."
  },
  {
    "title": "Trump Wants America to Make iPhones. Here’s How India Is Doing It.",
    "link": "https://www.nytimes.com/2025/06/30/business/apple-foxconn-india.html",
    "summary": "India is carving out a new space for Foxconn and other high-end manufacturers, just as President Trump demands American companies do at home."
  },
  {
    "title": "How Tariffs Are Affecting Wedding Dress Prices",
    "link": "https://www.nytimes.com/video/business/100000010192363/wedding-dress-cost-trump-tariffs.html",
    "summary": "Jordyn Holman, a New York Times business reporter, is planning a wedding. To find out how tariffs are affecting the bridal industry, she visited three different dress shops selling gowns from around the world."
  },
  {
    "title": "Trump’s Tariffs May Push This American Company to Move Jobs to China",
    "link": "https://www.nytimes.com/2025/06/30/business/trump-tariffs-textiles-china.html",
    "summary": "The experience of a company in the textile business illustrates how the trade war could force some industries to shift production out of the United States."
  },
  {
    "title": "As Trade Deadline Nears, Europe Preps for a Scant Outline of a Deal",
    "link": "https://www.nytimes.com/2025/06/30/world/europe/europe-us-trade-deal.html",
    "summary": "President Trump’s administration once promised 90 deals in 90 days. When it comes to the European Union, it may be more of a framework."
  },
  {
    "title": "2 Firefighters Killed in Idaho Sniper Ambush",
    "link": "https://www.nytimes.com/2025/06/29/us/coeur-dalene-idaho-shooting-ambush.html",
    "summary": "Firefighters were responding to a blaze in the panhandle of Idaho when the shooting happened, a sheriff said. The body of a suspect was recovered on Sunday evening."
  },
  {
    "title": "What We Know About the Idaho Shooting",
    "link": "https://www.nytimes.com/2025/06/30/us/idaho-shooting-firefighters-sniper-suspect.html",
    "summary": "The authorities said a gunman started a wildfire to lure firefighters, then ambushed them in a sniper attack."
  },
  {
    "title": "Trump’s Immigration Crackdown in L.A. Upends Everyday Life for Latinos",
    "link": "https://www.nytimes.com/2025/06/30/us/latinos-los-angeles-immigration.html",
    "summary": "Anxiety over federal immigration detentions has gripped thousands of residents in the area and led many to limit the time they spend in public."
  },
  {
    "title": "The Summer Job, a Rite of Passage for Teens, May Be Fading Away",
    "link": "https://www.nytimes.com/2025/06/30/business/summer-jobs-teens.html",
    "summary": "As businesses face economic uncertainty, seasonal work is harder to find, pushing the unemployment rate for teenagers above 13 percent."
  },
  {
    "title": "How Do You Teach Computer Science in the A.I. Era?",
    "link": "https://www.nytimes.com/2025/06/30/business/computer-science-education-ai.html",
    "summary": "Universities across the country are scrambling to understand the implications of generative A.I.’s transformation of technology."
  },
  {
    "title": "Are You Applying for Tech Jobs or Tech Internships? We Want to Hear About It.",
    "link": "https://www.nytimes.com/2025/06/30/business/computer-science-grads-tech-jobs.html",
    "summary": "Companies using A.I. tools to automate tasks like coding are changing job prospects for recent grads and college students. Tell us about your experiences."
  },
  {
    "title": "Drifting From the West’s Orbit, Russians Find a New Role Model in China",
    "link": "https://www.nytimes.com/2025/06/30/world/europe/drifting-from-the-wests-orbit-russians-find-a-new-role-model-in-china.html",
    "summary": "China has become trendy for Russians who once worshiped everything Western. Young people are learning Mandarin, and Chinese culture and goods have become ubiquitous in Moscow."
  },
  {
    "title": "Taiwan’s President Takes on China, and His Opponents, in Speaking Tour",
    "link": "https://www.nytimes.com/2025/06/30/world/asia/taiwan-china-identity.html",
    "summary": "Lai Ching-te is ramping up his warnings about China’s threat to Taiwan. Critics say he is stoking divisions, and risking blowback from Beijing."
  },
  {
    "title": "A Year After ‘Loveless Landslide,’ U.K. Leader Is Even Less Popular",
    "link": "https://www.nytimes.com/2025/06/30/world/europe/keir-starmer-uk-polls-labour.html",
    "summary": "With scores of Labour Party lawmakers in open revolt and voters signaling their distaste, some are urging Prime Minister Keir Starmer to abandon caution and pivot left."
  },
  {
    "title": "Starmer and Glastonbury Condemn Bob Vylan’s Chant Against Israel’s Military",
    "link": "https://www.nytimes.com/2025/06/29/world/europe/bob-vylan-idf-palestine-glastonbury.html",
    "summary": "The band Bob Vylan led a crowd in a chant of “Death, death to the I.D.F.” while performing at Glastonbury, Britain’s biggest music festival."
  },
  {
    "title": "What the University of Virginia Should Have Done",
    "link": "https://www.nytimes.com/2025/06/30/opinion/university-of-virginia-doj-trump.html",
    "summary": "The university should have stood up to the Justice Department."
  },
  {
    "title": "Corporate Politics",
    "link": "https://www.nytimes.com/2025/06/30/briefing/corporate-politics-pride-blm.html",
    "summary": "We take a look at why businesses are turning away from political causes."
  },
  {
    "title": "At the Sean ‘Diddy’ Combs Trial, Jurors Are Ready to Deliberate",
    "link": "https://www.nytimes.com/2025/06/30/arts/music/sean-combs-diddy-trial-jury-deliberations.html",
    "summary": "The panel of 12 will be asked to decide whether the music mogul is guilty of racketeering conspiracy and sex trafficking."
  },
  {
    "title": "2 Shot Near Stonewall Inn After New York City’s Pride March",
    "link": "https://www.nytimes.com/2025/06/29/nyregion/stonewall-inn-pride-shooting-nyc.html",
    "summary": "One of the victims was in critical condition after being shot in the head. Mayor Eric Adams said the shooting occurred as Pride celebrations were ending."
  },
  {
    "title": "From Iran-Israel Strikes to Russia’s War: How Conflicts Reshape Air Travel",
    "link": "https://www.nytimes.com/2025/06/30/world/asia/iran-israel-airlines-war.html",
    "summary": "Whether caused by a long war or brief skirmish, the closing of skies to air travel is having big effects on cost, convenience and safety."
  },
  {
    "title": "They Demanded Democracy. Years Later, They Are Still Paying the Price.",
    "link": "https://www.nytimes.com/2025/06/30/world/asia/hong-kong-protesters.html",
    "summary": "Thousands of young people lost careers, friends and dreams after taking part in mass antigovernment protests that erupted six years ago in Hong Kong."
  }
]