[
  {
    "title": "Marjorie Taylor Greene’s Resignation Hints at Divisions in Trump’s Movement",
    "link": "https://www.nytimes.com/2025/11/22/us/politics/marjorie-taylor-greene-trump-republicans.html",
    "summary": "As the president forced a onetime loyalist from Congress, her defiant departure signaled a coming debate over Republican identity in a post-Trump era."
  },
  {
    "title": "For Marjorie Taylor Greene, a Rough Education in MAGA Politics",
    "link": "https://www.nytimes.com/2025/11/22/us/politics/marjorie-taylor-greene.html",
    "summary": "The Georgia congresswoman strove to be both the ultimate Trump warrior and to be taken seriously. She wound up in political exile."
  },
  {
    "title": "Marjorie Taylor Greene’s Exit Deals a Blow to Republicans’ Majority in Congress",
    "link": "https://www.nytimes.com/2025/11/22/us/politics/marjorie-taylor-greene-republicans.html",
    "summary": "Representative Marjorie Taylor Greene’s sudden resignation underscored the fragility of the G.O.P. majority, and exposed deep discontent on the right going into the midterm elections."
  },
  {
    "title": "The Federalist Society Is Torn Between Its Legal Philosophy and Trump’s Demands",
    "link": "https://www.nytimes.com/2025/11/22/us/trump-federalist-society.html",
    "summary": "Guided by Leonard Leo, the society built a pipeline for traditional conservative judges. But that might not be enough for President Trump in his second term."
  },
  {
    "title": "In the House, Censures Proliferate, Reflecting a Poisonous Climate",
    "link": "https://www.nytimes.com/2025/11/22/us/politics/house-censures.html",
    "summary": "Formal reprimands, once rare, dominated the chamber’s agenda this week, prompting lawmakers in both parties to call for changes to the way the House handles such actions."
  },
  {
    "title": "As Democrats Look to a New Generation, John Larson Hangs On",
    "link": "https://www.nytimes.com/2025/11/22/us/politics/john-larson-connecticut-congress-election.html",
    "summary": "The 77-year-old Connecticut Democrat is facing primary challenges from people who say he’s too old and has been around too long. He says his age and experience are his strength."
  },
  {
    "title": "After Russian Strike on Apartment Buildings, Ukraine’s Hope for Survivors Fades",
    "link": "https://www.nytimes.com/2025/11/22/world/europe/russia-ukraine.html",
    "summary": "Russian missiles hit apartment buildings in Ternopil this week, far from the war’s front line. Dozens of civilians, including children, were killed."
  },
  {
    "title": "The Aftermath of a Deadly Strike in Western Ukraine",
    "link": "https://www.nytimes.com/video/world/europe/100000010538311/the-aftermath-of-a-deadly-strike-in-western-ukraine.html",
    "summary": "At the site of an apartment building in western Ukraine where a Russian strike killed dozens of people, the New York Times reporter Kim Barker heard reactions to a 28-point U.S. proposal to end the war."
  },
  {
    "title": "G20 Leaders Push Back on Trump’s Ukraine Peace Plan",
    "link": "https://www.nytimes.com/2025/11/22/world/africa/g20-south-africa-ukraine-russia-united-states.html",
    "summary": "In a joint statement, the leaders reaffirmed their commitment to Ukraine, which faces the prospect of losing American support if it rejects the latest proposal."
  },
  {
    "title": "Russian Exiles See Europe Visa Rule as Blow Against Them, Not Putin",
    "link": "https://www.nytimes.com/2025/11/22/world/europe/russia-visas-ukraine.html",
    "summary": "The European Union said the decision was prompted by sabotage attacks in Europe, but Russians living abroad say Europe is punishing ordinary people."
  },
  {
    "title": "Stopping the Greatest Threat to the Amazon, One Fire at a Time",
    "link": "https://www.nytimes.com/2025/11/22/climate/amazon-fire-paragominas-nepstad.html",
    "summary": "After four decades of research, a scientist returns to the Amazon in an effort to change the behavior that has lead to years of environmental crisis."
  },
  {
    "title": "COP30 Climate Summit Ends With Dire Warnings and Scant Plans for Action",
    "link": "https://www.nytimes.com/2025/11/22/climate/cop30-climate-summit-ends-belem.html",
    "summary": "The final agreement, with no direct mention of the fossil fuels dangerously heating Earth, was a victory for countries like Saudi Arabia and Russia, diplomats said."
  },
  {
    "title": "Tatiana Schlossberg, John F. Kennedy’s Granddaughter, Reveals Terminal Cancer Diagnosis",
    "link": "https://www.nytimes.com/2025/11/22/us/tatiana-schlossberg-kennedy-cancer.html",
    "summary": "Tatiana Schlossberg, the daughter of Caroline Kennedy, revealed a terminal cancer diagnosis in an essay published on the anniversary of her grandfather’s assassination."
  },
  {
    "title": "The Battle Between Pasadena and U.C.L.A Over the Rose Bowl",
    "link": "https://www.nytimes.com/2025/11/22/us/rose-bowl-pasadena-ucla.html",
    "summary": "The storied stadium is at the center of a battle between Pasadena and U.C.L.A. that’s about money, nostalgia, geography and so much more."
  },
  {
    "title": "Trump’s Proposed Ukraine ‘Deal’ Is a Disgrace",
    "link": "https://www.nytimes.com/2025/11/22/opinion/ukraine-russia-negotiations-trump-deal.html",
    "summary": "If Ukraine is forced to surrender to these terms by Thursday, Thanksgiving will no longer be an American holiday. It will become a Russian holiday."
  },
  {
    "title": "Trump Says the Epstein Documents Will Hurt Democrats, Too. Maybe That’s a Good Thing.",
    "link": "https://www.nytimes.com/2025/11/22/opinion/epstein-women-victims-politics.html",
    "summary": "“You need this renewal. You need new figures who are untouched, who were never part of these awful power games,” the columnist Lydia Polgreen argues."
  },
  {
    "title": "20 Killed in Israeli Strikes as Israel and Hamas Trade Blame Over Truce",
    "link": "https://www.nytimes.com/2025/11/22/world/middleeast/israeli-strikes-gaza.html",
    "summary": "Violence has repeatedly flared up in the weeks since a cease-fire was reached, killing hundreds of Palestinians and at least three Israeli soldiers."
  },
  {
    "title": "Orthodox Jewish Man Sentenced to 103 Years for Sex Abuse May Go Free",
    "link": "https://www.nytimes.com/2025/11/22/nyregion/judge-nechemya-weberman-resentence.html",
    "summary": "Nechemya Weberman, convicted of molesting a 12-year-old girl in a politically charged case, is seeking a new, shorter sentence with the Brooklyn district attorney’s support."
  },
  {
    "title": "Lemurs in Madagascar Face an Unexpected Killer",
    "link": "https://www.nytimes.com/2025/11/22/science/lemurs-madagascar-eating.html",
    "summary": "Thousands of the endangered primates end up on the dinner plates of people in the upper rung of the country’s society who have money to spare."
  },
  {
    "title": "Dorothy Vogel, Librarian With a Vast Art Collection, Dies at 90",
    "link": "https://www.nytimes.com/2025/11/22/arts/dorothy-vogel-dead.html",
    "summary": "On modest civil servants’ salaries, she and her husband amassed a trove of some 4,000 works by art-world luminaries, storing them in their one-bedroom Manhattan apartment."
  }
]