[
  {
    "title": "How the Trump Administration Rushed to Judgment in Minneapolis Shooting",
    "link": "https://www.nytimes.com/2026/01/25/us/trump-administration-minneapolis-shooting-response.html",
    "summary": "The administration was in a race to control the narrative around the killing of Alex Pretti, even as videos emerged that contradicted the government’s account."
  },
  {
    "title": "Killing Prompts Only a Defiant Response From Trump",
    "link": "https://www.nytimes.com/2026/01/25/us/politics/minneapolis-killing-trump-defiant-response.html",
    "summary": "Even as the second death of a protester in Minnesota brought demands for accountability, the president, insulated from dissenting voices, stuck to his pattern of reflexively blaming opponents."
  },
  {
    "title": "Mamdani Clears Early Hurdles as Storm Bears Down on New York",
    "link": "https://www.nytimes.com/2026/01/25/nyregion/mamdani-snowstorm-performance-new-york.html",
    "summary": "Mayor Zohran Mamdani made use of his strong communication skills, and the Sanitation Department said every road was plowed at least twice by Sunday evening."
  },
  {
    "title": "Xi’s Purge of China’s Military Brings Its Top General Down",
    "link": "https://www.nytimes.com/2026/01/24/world/asia/china-top-general-xi-military-purge.html",
    "summary": "The ouster of Gen. Zhang Youxia, who was second only to Xi Jinping in the military hierarchy, marks “the total annihilation of the high command,” one analyst said."
  },
  {
    "title": "As Europe’s Reliance on U.S. Natural Gas Grows, So Does Trump’s Leverage",
    "link": "https://www.nytimes.com/2026/01/26/business/europe-natural-gas-united-states-russia.html",
    "summary": "Tension over Greenland has prompted worries that the Trump administration could turn the U.S. oil and gas industry into a way to pressure Europe."
  },
  {
    "title": "For Greenland Tourism, Trump’s Interest Creates Uncertainty",
    "link": "https://www.nytimes.com/2026/01/23/travel/greenland-tourism-trump.html",
    "summary": "Bookings to the island increased last year, and there are plans for two new airports. Threats from President Trump may change that."
  },
  {
    "title": "The Taliban Say They’re Ready to Release U.S. Prisoners. But Which Ones?",
    "link": "https://www.nytimes.com/2026/01/26/world/asia/taliban-afghanistan-prisoners.html",
    "summary": "Top Afghan officials say they want two American detainees released “as soon as possible,” but the Trump administration says a third one should be included."
  },
  {
    "title": "Columbia Selects University of Wisconsin Chancellor as Its President",
    "link": "https://www.nytimes.com/2026/01/25/nyregion/columbia-president-wisconsin-mnookin.html",
    "summary": "Jennifer Mnookin has led the flagship campus of the state university system since 2022. She takes the helm at Columbia after a tumultuous period."
  },
  {
    "title": "In Venezuela, Families Search for Relatives Who Are Detained and Missing",
    "link": "https://www.nytimes.com/2026/01/25/world/americas/in-venezuela-families-search-for-relatives-who-are-detained-and-missing.html",
    "summary": "Even as dozens of political prisoners have been freed, at least 66 people taken by state authorities and never heard from again remain missing, relatives and rights groups say."
  },
  {
    "title": "Travel Math: When Flying Costs as Much as the Train, Who Wins?",
    "link": "https://www.nytimes.com/2026/01/24/us/politics/amtrak-dynamic-pricing-flying.html",
    "summary": "Amtrak says dynamic pricing has helped strengthen its finances, but travelers often grumble at the cost, especially for last-minute travel. Still, the train has a secret weapon: avoiding the airport."
  },
  {
    "title": "Fashion Is Exaggerating the Female Form Like Never Before. What Is Going On?",
    "link": "https://www.nytimes.com/2026/01/25/style/the-year-of-manufacturing-the-body-and-booty-and-boobs.html",
    "summary": "Fashion has begun exaggerating, or distorting, the female form like never before. What exactly is going on?"
  },
  {
    "title": "The Trump Administration Is Lying to Our Faces. Congress Must Act.",
    "link": "https://www.nytimes.com/2026/01/25/opinion/alex-pretti-minneapolis-shooting-border-patrol.html",
    "summary": "The Trump administration is once again engaged in a perversion of justice."
  },
  {
    "title": "Trump’s Foreign Policy Is Stuck in the 16th Century",
    "link": "https://www.nytimes.com/2026/01/26/opinion/trump-foreign-policy-neo-royalist.html",
    "summary": "The president’s approach is not just chaos or an updated version of 19th-century great-power competition."
  },
  {
    "title": "At Least 15 Dead After Ferry Carrying 350 Sinks in the Philippines",
    "link": "https://www.nytimes.com/2026/01/25/world/asia/philippines-ferry-sinks-basilan.html",
    "summary": "It was not immediately clear how many people were missing after the ferry sank early Monday morning in Basilan Province."
  },
  {
    "title": "Eleanor Holmes Norton Files to End Re-election Campaign",
    "link": "https://www.nytimes.com/2026/01/25/us/politics/eleanor-holmes-norton-re-election-campaign.html",
    "summary": "It was not clear whether Washington’s 88-year-old veteran delegate, who has been in declining health but has insisted she would seek re-election, was aware of the filing."
  },
  {
    "title": "In Visits to Dealerships, Pair Schemed to Steal High-End Vehicles, Police Say",
    "link": "https://www.nytimes.com/2026/01/25/nyregion/car-theft-ring.html",
    "summary": "An organized theft ring in Connecticut, New Jersey and New York swapped or quickly cloned key fobs to steal millions of dollars’ worth of vehicles, officials said."
  }
]