[
  {
    "title": "Where Democrats Will Duel Next for the Party’s Future",
    "link": "https://www.nytimes.com/2025/11/09/us/politics/democrats-midterms-senate-house.html",
    "summary": "In Michigan, Maine and many other states, primary candidates will decide the party’s direction on a host of policy issues, and ultimately whether it has a center-left or left-wing vision."
  },
  {
    "title": "Mamdani, Mofongo and Rum: Democratic Squabbles Fade Away, for Now",
    "link": "https://www.nytimes.com/2025/11/09/nyregion/mamdani-somos-puerto-rico.html",
    "summary": "At an annual gathering in Puerto Rico for New York’s political class, former foes of Zohran Mamdani put aside their differences and tried to get information about his inner circle."
  },
  {
    "title": "With a Mayor From Queens, the Borough Is Having a Moment",
    "link": "https://www.nytimes.com/2025/11/09/nyregion/mamdani-queens-mayor.html",
    "summary": "When Zohran Mamdani is sworn in as New York City’s 111th mayor, he will be the first with such an intimate connection to Queens."
  },
  {
    "title": "Gavin Newsom, Eyeing 2028, Tries to Mess With Texas",
    "link": "https://www.nytimes.com/2025/11/08/us/politics/newsom-2028-texas-rally-abbott-trump.html",
    "summary": "Celebrating his recent redistricting victory, the California governor swooped into a state led by a Republican rival and sent the latest signal about his presidential ambitions."
  },
  {
    "title": "Trump Loyalists Push ‘Grand Conspiracy’ as New Subpoenas Land",
    "link": "https://www.nytimes.com/2025/11/09/us/politics/trump-conspiracy-probe-subpoenas.html",
    "summary": "The Justice Department moved an inquiry that appeared initially focused on John O. Brennan to South Florida and is beginning to recruit line prosecutors."
  },
  {
    "title": "Airport Disruptions May Get Worse This Week",
    "link": "https://www.nytimes.com/2025/11/09/business/airport-flights-cancellations.html",
    "summary": "The fact that planes are generally less full in early November helped airlines limit the impact. That will change as Thanksgiving nears."
  },
  {
    "title": "A Timeline of the Legal Saga Surrounding SNAP Payments",
    "link": "https://www.nytimes.com/2025/11/08/us/politics/snap-payments-timeline.html",
    "summary": "Weeks of uncertainty during the longest government shutdown in American history have left some states struggling to issue payments to food stamp recipients."
  },
  {
    "title": "The Dangerous Stalemate Over Iran’s Nuclear Program",
    "link": "https://www.nytimes.com/2025/11/09/world/middleeast/iran-nuclear-program-israel.html",
    "summary": "With no negotiations, no oversight and no clarity about Iran’s stock of nuclear material, many in the region fear another war with Israel is inevitable."
  },
  {
    "title": "Israeli Academics Find Themselves Isolated Despite Gaza Cease-Fire",
    "link": "https://www.nytimes.com/2025/11/09/world/middleeast/boycotts-israel.html",
    "summary": "Boycotts of Israeli universities, largely imposed in Europe, have multiplied since the start of the war and reflect Israel’s international isolation over its conduct in Gaza."
  },
  {
    "title": "The MAHA-Fueled Rise of Natural Family Planning",
    "link": "https://www.nytimes.com/2025/11/09/us/politics/maha-natural-family-planning.html",
    "summary": "A growing coalition of conservatives are speaking out against hormonal birth control, while promoting a more “natural” alternative."
  },
  {
    "title": "The Celebrated Chef Who Robbed Banks",
    "link": "https://www.nytimes.com/2025/11/09/us/chef-bank-robber.html",
    "summary": "Valentino Luchin, 62, once owned an acclaimed Italian restaurant. Now he sits in a Bay Area jail."
  },
  {
    "title": "Josh Shapiro Believes the Center Can Hold",
    "link": "https://www.nytimes.com/2025/11/09/opinion/josh-shapiro-democratic-party.html",
    "summary": "The Democratic Party will not return to the White House, nor reclaim Congress, until it learns to embrace centrist politicians like Pennsylvania’s governor."
  },
  {
    "title": "Exercising Is the Worst",
    "link": "https://www.nytimes.com/2025/11/08/opinion/excercise-fitness-optimization.html",
    "summary": "Exercise has never been fun, but our expectations for physical performance, what it means to be healthy, and what it means to age have gotten too high."
  },
  {
    "title": "With Mortgage Rates Declining, Should You Refinance?",
    "link": "https://www.nytimes.com/2025/11/09/business/mortgage-refinance.html",
    "summary": "More than four million borrowers could potentially benefit from locking in a lower rate. Here’s what to consider."
  },
  {
    "title": "A Quebec Writer Confronts His ‘Little Darkness’ as a Class Defector",
    "link": "https://www.nytimes.com/2025/11/09/world/americas/a-quebec-writer-confronts-his-little-darkness-as-a-class-defector.html",
    "summary": "Jean-Philippe Pleau’s book and play about moving up socially became a cultural reckoning in Quebec, but created a gulf with his family."
  },
  {
    "title": "A.I. Isn’t the Only Thing Pushing Up Electricity Bills. (But It’s Mostly A.I.)",
    "link": "https://www.nytimes.com/2025/11/08/business/exelon-calvin-butler-ai-data-centers.html",
    "summary": "Calvin Butler, the chief executive of Exelon, one of the nation’s largest utility companies, is trying to keep the lights on."
  }
]