[
  {
    "title": "Trump Escalates Pressure on Venezuela, but Endgame Is Unclear",
    "link": "https://www.nytimes.com/2025/11/14/us/politics/trump-pressure-venezuela.html",
    "summary": "President Trump’s aides have provided conflicting accounts of what, exactly, they are seeking to achieve, as America’s largest aircraft carrier heads toward the Caribbean region."
  },
  {
    "title": "Justice Department to Investigate Epstein Ties, but Not to Trump",
    "link": "https://www.nytimes.com/2025/11/14/us/politics/trump-epstein-inquiry-democrats.html",
    "summary": "President Trump ordered the Justice Department to investigate the dealings of Democrats with Jeffrey Epstein, after a week in which his own relationship with the convicted sex offender was in the spotlight."
  },
  {
    "title": "US Attorney Jay Clayton Under Pressure After Order to Investigate Democrats",
    "link": "https://www.nytimes.com/2025/11/15/nyregion/sdny-jay-clayton-epstein.html",
    "summary": "Jay Clayton, who heads the Southern District of New York, has so far managed to keep clear of President Trump’s most politically charged directives. Now, come the hard choices."
  },
  {
    "title": "Trump Cuts Ties With Marjorie Taylor Greene, Calling Her ‘Wacky’",
    "link": "https://www.nytimes.com/2025/11/14/us/politics/trump-marjorie-taylor-greene-split.html",
    "summary": "The rupture exposed the divides within President Trump’s MAGA base over the Epstein files and more."
  },
  {
    "title": "Seven Days of Paralysis: Inside the BBC Crisis Over a Trump Documentary",
    "link": "https://www.nytimes.com/2025/11/15/world/europe/uk-bbc-crisis.html",
    "summary": "With board members and executives deadlocked over how to respond, the news organization kept silent for days, allowing a controversy to snowball."
  },
  {
    "title": "Once He Was ‘Just Asking Questions.’ Now Tucker Carlson Is the Question.",
    "link": "https://www.nytimes.com/2025/11/15/us/politics/tucker-carlson-fuentes.html",
    "summary": "The conservative commentator has further fractured the right with his anti-Israel rhetoric and sympathy for a white nationalist. He’s not in the mood to apologize."
  },
  {
    "title": "Maps Show How Latinos Who Shifted Right in 2024 Snapped Back Left in 2025",
    "link": "https://www.nytimes.com/2025/11/15/us/politics/latino-voters-new-jersey.html",
    "summary": "The New Jersey governor’s race was the first significant sign that President Trump’s success with Hispanic voters in 2024 may have been only a temporary shift."
  },
  {
    "title": "Russia Tried to Cut Ukraine’s Lights. Now It’s Aiming for the Heat.",
    "link": "https://www.nytimes.com/2025/11/15/world/europe/ukraine-russia-energy-winter-cold-gas.html",
    "summary": "Moscow’s attacks on gas supplies, the main source of warmth for most Ukrainian households, could plunge millions into the cold."
  },
  {
    "title": "Waymo Was on a Roll in San Francisco. Then One of Its Driverless Cars Killed a Cat.",
    "link": "https://www.nytimes.com/2025/11/15/us/waymo-san-francisco-kit-kat.html",
    "summary": "The self-driving taxis have become ubiquitous in the city, but an uproar ensued when one ran over a beloved feline."
  },
  {
    "title": "Is Your College Football Team Short of Cash? Sports Betting Can Help.",
    "link": "https://www.nytimes.com/2025/11/15/business/is-your-college-football-team-short-of-cash-sports-betting-can-help.html",
    "summary": "Louisiana lawmakers tried a novel strategy for raising revenue, a model that proponents say might work more broadly."
  },
  {
    "title": "Trump Is Wrong About Fentanyl in Almost Every Way",
    "link": "https://www.nytimes.com/2025/11/15/opinion/fentanyl-trump-drug-war.html",
    "summary": "Everything the Trump administration is doing to stop the flow of drugs is just making the problem worse."
  },
  {
    "title": "Epstein, Fuentes and Trump’s Political Erosion",
    "link": "https://www.nytimes.com/2025/11/15/opinion/epstein-trump-gop-fuentes.html",
    "summary": "Is this the beginning of the end for Trump and his MAGA base?"
  },
  {
    "title": "Tuning In",
    "link": "https://www.nytimes.com/2025/11/15/briefing/tuning-in.html",
    "summary": "Sometimes we assume the people and things around us are neutral or hostile to our existence. What if the opposite could be true?"
  },
  {
    "title": "Southern California Storm Forecast to Bring Heavy Rain and Flood Risk",
    "link": "https://www.nytimes.com/2025/11/14/weather/california-rain-flood-storm-los-angeles-forecast.html",
    "summary": "An unusually powerful storm prompted some evacuation orders before heavy rain on Saturday."
  },
  {
    "title": "What Happened to Gabriel Boric’s Leftist Promises for Chile?",
    "link": "https://www.nytimes.com/2025/11/15/world/americas/gabriel-boric-chile-president.html",
    "summary": "When he was elected four years ago, President Gabriel Boric of Chile carried ambitious promises and new energy. Then reality kicked in."
  },
  {
    "title": "Landlord to Military Families: No Christmas Decorations Until After Thanksgiving",
    "link": "https://www.nytimes.com/2025/11/14/us/christmas-decorations-tyndall-air-force-base-florida.html",
    "summary": "A routine reminder about holiday lights touched off a spirited debate about rules, joy and what it means to make a home when life is always in motion. The company ultimately backtracked."
  },
  {
    "title": "Disney and YouTube TV End Blackout",
    "link": "https://www.nytimes.com/2025/11/14/business/disney-youtube-tv-deal.html",
    "summary": "After a 15-day standoff, a deal cleared the way for YouTube TV to resume carrying ESPN, ABC and other Disney-owned channels."
  }
]