[
  {
    "title": "Behind the Vote to Release the Epstein Files",
    "link": "https://www.nytimes.com/video/us/politics/100000010528490/behind-the-house-vote-to-release-the-epstein-files.html",
    "summary": "The House approved a bill directing the Justice Department to release all files related to its investigation into Jeffrey Epstein, in a near-unanimous vote. Hours later, Senator Chuck Schumer won unanimous agreement for the Senate to pass the measure as soon as it arrived in the chamber."
  },
  {
    "title": "For Trump, Epstein Is the Story That Won’t Go Away",
    "link": "https://www.nytimes.com/2025/11/18/us/politics/trump-epstein-files.html",
    "summary": "President Trump is being held captive to a news cycle he can’t avoid or defeat when it comes to the convicted sex offender Jeffrey Epstein."
  },
  {
    "title": "Trump Administration Announces Steps to Dismantle Education Department",
    "link": "https://www.nytimes.com/2025/11/18/us/politics/trump-education-department.html",
    "summary": "Responsibilities for K-12 and college programs, among others, will be moved to other federal agencies."
  },
  {
    "title": "‘Things Happen’: Trump Brushes Off the Murder of Khashoggi",
    "link": "https://www.nytimes.com/2025/11/18/us/politics/khashoggi-trump-saudi-crown-prince.html",
    "summary": "A reporter asked Crown Prince Mohammed bin Salman about the murder of the Washington Post columnist Jamal Khashoggi. President Trump interjected."
  },
  {
    "title": "Here’s Who’s Attending Trump’s Dinner for the Saudi Crown Prince: Elon Musk, Cristiano Ronaldo and more.",
    "link": "https://www.nytimes.com/2025/11/18/us/politics/trump-saudi-dinner-guests.html",
    "summary": "The New York Times identified some of the guests invited to President Trump’s dinner for Crown Prince Mohammed bin Salman of Saudi Arabia."
  },
  {
    "title": "Trump Said to Authorize C.I.A. Plans for Covert Action in Venezuela",
    "link": "https://www.nytimes.com/2025/11/18/us/politics/trump-covert-action-venezuela.html",
    "summary": "The president has signed off on possible operations inside Venezuela but has also reopened back-channel communications with the government of President Nicolás Maduro."
  },
  {
    "title": "Ecuador Votes ‘No’ to Hosting U.S. Military Base",
    "link": "https://www.nytimes.com/2025/11/18/world/americas/ecuador-us-military-base-vote-trump.html",
    "summary": "A vote on Sunday rejected the expansion of a foreign military presence. It came as the U.S. military’s campaign in waters near Latin America has been roiling the region."
  },
  {
    "title": "Federal Court Blocks Texas’ Republican-Friendly Congressional Map",
    "link": "https://www.nytimes.com/2025/11/18/us/politics/texas-map-ruling-redistricting.html",
    "summary": "The move dealt a blow to efforts by Texas Republicans and President Trump to flip Democratic seats in the state. Texas quickly filed a notice of appeal to the Supreme Court."
  },
  {
    "title": "Texas Governor Declares Muslim Civil Rights Group a ‘Terrorist Organization’",
    "link": "https://www.nytimes.com/2025/11/18/us/texas-abbott-cair-terrorist-group-muslim.html",
    "summary": "Gov. Greg Abbott said the state could now take steps to shut down the Council on American-Islamic Relations. The group said the declaration had no basis in fact or law."
  },
  {
    "title": "With Trump in Office, a Transgender Trailblazer and American Diplomat Seeks Refuge Abroad",
    "link": "https://www.nytimes.com/2025/11/18/us/robyn-mccutcheon-diplomat-transgender-refuge-trump.html",
    "summary": "Robyn McCutcheon, the first American diplomat to come out as transgender, helped to shape personnel and foreign policy at the State Department. The country she served doesn’t feel like home anymore."
  },
  {
    "title": "Meta’s Victory Opens the Way for Silicon Valley to Go Deal Shopping",
    "link": "https://www.nytimes.com/2025/11/18/technology/meta-ruling-silicon-valley-start-ups.html",
    "summary": "To avoid regulatory scrutiny, big tech companies had steered clear of buying start-ups outright. Meta’s antitrust win may change that thinking."
  },
  {
    "title": "Meta Did Not Violate the Law When It Bought Instagram and WhatsApp, a Judge Rules",
    "link": "https://www.nytimes.com/2025/11/18/technology/meta-antitrust-monopoly-ruling.html",
    "summary": "Meta’s acquisitions of Instagram and WhatsApp did not illegally stifle competition in social networking, a judge found, a major win for the tech giant."
  },
  {
    "title": "ICE Frees Blind Migrant Who Was Detained for Days in Isolation",
    "link": "https://www.nytimes.com/2025/11/18/nyregion/blind-immigrant-ice-detention-judge-orders-release.html",
    "summary": "Carlos Anibal Chalco Chango, 40, was released on Monday from an upstate New York jail where he had been held without his cane. It was a surprising move by an agency that rarely frees detainees."
  },
  {
    "title": "How to Make Sense of Law Enforcement in the Streets",
    "link": "https://www.nytimes.com/video/us/politics/100000010484295/how-to-make-sense-of-law-enforcement-in-the-streets.html",
    "summary": "The variety of federal forces deployed to support President Trump’s mass deportation campaign and anticrime efforts continues to expand. Often, it can be difficult for the public to tell them apart, or to understand what powers each agency has."
  },
  {
    "title": "Trump’s Border Czar Threatens More Immigrant Arrests in New York City",
    "link": "https://www.nytimes.com/2025/11/18/nyregion/border-czar-more-immigrant-arrests-nyc.html",
    "summary": "Thomas Homan said that additional federal agents would descend on the city if it did not help with President Trump’s deportation campaign."
  },
  {
    "title": "How Trump Has Used ICE, the National Guard and Other Federal Forces Across the U.S.",
    "link": "https://www.nytimes.com/2025/11/18/us/trump-immigration-raids.html",
    "summary": "Charlotte and Raleigh in North Carolina became the latest cities to see federal forces move in. Here’s a rundown of what’s going on in each place."
  },
  {
    "title": "Elon Musk Puts Trump Feud Behind Him and Tiptoes Back Into Politics",
    "link": "https://www.nytimes.com/2025/11/18/us/politics/elon-musk-politics-trump-doge.html",
    "summary": "Having struck an uneasy truce with the president, Elon Musk is starting to make political appearances again, and his allies are planning a DOGE reunion party."
  },
  {
    "title": "Kamala Harris Hits Campaign Trail in Tennessee Special Election",
    "link": "https://www.nytimes.com/2025/11/18/us/politics/kamala-harris-tennessee-house-election.html",
    "summary": "On Tuesday, the former vice president made her first campaign appearance for another Democrat since leaving office."
  },
  {
    "title": "A.I. Video Is Threatening Our Ability to Trust Documentaries",
    "link": "https://www.nytimes.com/2025/11/18/movies/documentary-filmmaking-ai-trust.html",
    "summary": "A combination of technological developments and market forces is undermining the trust between viewer and filmmaker. What’s at stake is history itself."
  },
  {
    "title": "Eric Adams, Still the Mayor, Is Increasingly Out of Office",
    "link": "https://www.nytimes.com/2025/11/18/nyregion/eric-adams-trips-travel-uzbekistan-israel.html",
    "summary": "In the waning days of his term, Mayor Eric Adams is spending a significant portion of his time far from New York City."
  },
  {
    "title": "At $236.4 Million, Portrait by Klimt is Second Most Expensive Painting Sold at Auction",
    "link": "https://www.nytimes.com/2025/11/18/arts/design/portrait-auction-record-klimt-sothebys.html",
    "summary": "The portrait of Elisabeth Lederer, looted by the Nazis and spared from a blaze, was a highlight of the Sotheby’s inaugural sale in its new home."
  },
  {
    "title": "A City Is Broke. Can Billionaires’ Urbanist Dream Offer It a Last Chance?",
    "link": "https://www.nytimes.com/2025/11/18/business/economy/suisun-city-makes-an-offer-to-california-forever.html",
    "summary": "Suisun City has tried to revive its fortunes for years. The latest idea: Annex land owned by California Forever, a tech-billionaire-funded plan for a new city north of San Francisco."
  },
  {
    "title": "New York City’s Scaffolding Gets a Long Overdue Makeover",
    "link": "https://www.nytimes.com/2025/11/18/nyregion/nyc-scaffolding-sidewalk-sheds.html",
    "summary": "Officials have unveiled six new designs, in the biggest reimagining of the city’s ubiquitous sidewalk sheds in decades."
  },
  {
    "title": "The Three Republican Women Who Defied Trump on Epstein",
    "link": "https://www.nytimes.com/2025/11/18/opinion/trump-epstein-greene-boebert-mace.html",
    "summary": "Lauren Boebert, Marjorie Taylor Greene and Nancy Mace resisted pressure from the president and made the vote to release the Epstein files possible."
  },
  {
    "title": "On Republican Neo-Nazism, Hamas and Israel: An Epidemic of Moral Cowardice",
    "link": "https://www.nytimes.com/2025/11/18/opinion/israel-hamas-antisemitism-republicans.html",
    "summary": "People with extreme ideology don’t care anymore about hiding their excesses or their agendas. It’s all out there online or on YouTube."
  },
  {
    "title": "Congress Demands Release of Epstein Files",
    "link": "https://www.nytimes.com/2025/11/18/briefing/congress-demands-release-of-epstein-files.html",
    "summary": "Also, Trump jumped to the defense of Saudi Arabia’s crown prince. Here’s the latest at the end of Tuesday."
  },
  {
    "title": "Israeli Airstrike on Refugee Camp in Lebanon Kills at Least 13, Officials Say",
    "link": "https://www.nytimes.com/2025/11/18/world/middleeast/israel-strike-lebanon-camp.html",
    "summary": "It was one of the deadliest Israeli strikes on Lebanon since a cease-fire with Hezbollah went into effect about a year ago."
  },
  {
    "title": "Scientists Call for Global Shift Away From Ultraprocessed Foods",
    "link": "https://www.nytimes.com/2025/11/18/well/eat/ultraprocessed-foods-health.html",
    "summary": "In a sweeping series of papers, scientists have proposed policy reforms, such as taxes on sugary drinks, to improve the food supply."
  },
  {
    "title": "House Condemns García’s Election Scheme Amid Democratic Split",
    "link": "https://www.nytimes.com/2025/11/18/us/politics/house-condemns-garcia-election-scheme.html",
    "summary": "The measure rebuked the retiring Democratic representative Jesús García of Illinois for maneuvering to ensure his top aide would be the only one running to succeed him."
  },
  {
    "title": "N.Y. Doctor Accused of Desecration Can Be Sent to Japan, Court Rules",
    "link": "https://www.nytimes.com/2025/11/18/nyregion/new-york-doctor-japan-extradition.html",
    "summary": "A federal appeals court ruled that Masahide Kanayama, an obstetrician and fervent Christian, may be extradited to face charges of vandalism."
  }
]