[
  {
    "title": "Regime Change in Cuba Appeals to Trump but Carries Risks",
    "link": "https://www.nytimes.com/2026/02/26/us/politics/trump-cuba-regime-change.html",
    "summary": "The Trump administration is signaling a different approach, after demanding an end to Cuba’s communist leadership."
  },
  {
    "title": "After a Speedboat Shootout in Cuba, There are More Questions Than Answers",
    "link": "https://www.nytimes.com/2026/02/26/world/americas/cuba-gunfight-boat-miami.html",
    "summary": "The Cuban government’s account of a supposed armed raid into its territory was called into question after one of the men identified as being on the boat turned up in Miami."
  },
  {
    "title": "Netflix Backs Out of Bid for Warner Bros., Paving Way for Paramount Takeover",
    "link": "https://www.nytimes.com/2026/02/26/business/warner-bros-discovery-paramount-deal-netflix.html",
    "summary": "The move was a stunning development in the long-running corporate battle for the storied media giant."
  },
  {
    "title": "Hillary Clinton Denies Knowing Epstein or His Crimes in a Tense Deposition",
    "link": "https://www.nytimes.com/2026/02/26/us/politics/hillary-clinton-epstein-deposition-lauren-boebert.html",
    "summary": "After resisting testifying for months, the former secretary of state entered the session defiant, and grew irate after a Republican leaked a photo from inside the room."
  },
  {
    "title": "Justice Department Exposed Cooperating Witnesses in Epstein Files",
    "link": "https://www.nytimes.com/2026/02/26/nyregion/epstein-cooperating-witnesses-redaction-error.html",
    "summary": "The disclosure is the latest example of how the urgent push to release the files led to the government publicizing information it would normally keep under wraps."
  },
  {
    "title": "How a Close Associate of Epstein’s Found Career Redemption in Japan",
    "link": "https://www.nytimes.com/2026/02/26/business/jeffrey-epstein-joichi-ito-japan.html",
    "summary": "Top Japanese officials are backing a tech and entrepreneurship initiative led by Joichi Ito, whose involvement with Jeffrey Epstein may endanger efforts to get the project off the ground."
  },
  {
    "title": "World Economic Forum Chief Resigns Over Epstein Ties",
    "link": "https://www.nytimes.com/2026/02/26/business/world-economic-forum-davos-epstein-brende.html",
    "summary": "Borge Brende, a former foreign minister of Norway, had maintained contact with the convicted sex offender."
  },
  {
    "title": "Trump Declared Victory in Minneapolis. But What Did He Accomplish?",
    "link": "https://www.nytimes.com/2026/02/26/us/politics/trump-minneapolis-ice-immigration.html",
    "summary": "The Trump administration came under fire for an operation that turned lethal and politically toxic. But the show of force may also have had a bigger purpose: to serve as a warning."
  },
  {
    "title": "Federal Judge Accuses Trump Administration of Repeatedly Disobeying Orders",
    "link": "https://www.nytimes.com/2026/02/26/us/minnesota-judge-ice-immigration.html",
    "summary": "The federal judge identified 210 orders issued in 143 cases in Minnesota in which he said Immigration and Customs Enforcement officials had not complied with court orders."
  },
  {
    "title": "Trump Ally Expands Inquiry of Former Officials Who Investigated the President",
    "link": "https://www.nytimes.com/2026/02/26/us/trump-investigations-miami-prosecutor.html",
    "summary": "The office of a prosecutor based in Miami has issued new subpoenas in a wide-ranging inquiry aimed at President Trump’s perceived foes."
  },
  {
    "title": "What Your DNA Reveals About the Sex Life of Neanderthals",
    "link": "https://www.nytimes.com/2026/02/26/science/human-evolution-neanderthal-sex.html",
    "summary": "Most people alive today carry fragments of Neanderthal DNA in their genome. Now scientists are gaining a more intimate understanding of the ancient encounters that put it there."
  },
  {
    "title": "Columbia Student Is Released From ICE After Mamdani-Trump Meeting",
    "link": "https://www.nytimes.com/2026/02/26/nyregion/columbia-university-ice-student.html",
    "summary": "Federal officials had misrepresented themselves to gain access, according to the university. Mayor Zohran Mamdani said President Trump had told him the student would be let go."
  },
  {
    "title": "Mamdani Meets Again With Trump, Emerging With Two Unexpected Victories",
    "link": "https://www.nytimes.com/2026/02/26/nyregion/mamdani-trump-meeting.html",
    "summary": "Mayor Zohran Mamdani said he and President Trump discussed building housing in New York City, and he appeared to secure the release of a Columbia student detained by ICE on Thursday."
  },
  {
    "title": "Mamdani’s Gift for Trump: A Front Page Celebrating the President",
    "link": "https://www.nytimes.com/2026/02/26/nyregion/mamdani-trump-photo-newspapers.html",
    "summary": "What do you bring the president when you visit the White House? Mayor Zohran Mamdani made a choice that seemed to please Donald Trump."
  },
  {
    "title": "Pakistan Strikes Afghanistan in ‘Open War’ Against Taliban Regime",
    "link": "https://www.nytimes.com/2026/02/26/world/asia/pakistan-afghanistan-taliban.html",
    "summary": "The airstrikes came hours after Afghan troops had attacked Pakistani border positions and follow months of worsening relations between the neighboring countries."
  },
  {
    "title": "Iranians Cite Progress in Talks, but a Marathon Session Produces No Deal",
    "link": "https://www.nytimes.com/2026/02/26/world/middleeast/iran-us-talks.html",
    "summary": "Representatives of the countries were in Geneva this week to discuss the fate of Iran’s nuclear program."
  },
  {
    "title": "Fact-check: In Trump’s Case for an Attack on Iran, False or Unproven Claims",
    "link": "https://www.nytimes.com/2026/02/26/us/politics/trump-iran-claims-nuclear-weapons.html",
    "summary": "Key elements of the Trump administration’s arguments this week for another military campaign against Iran do not hold up."
  },
  {
    "title": "Anthropic Says It Cannot ‘Accede’ to Pentagon in Talks Over A.I.",
    "link": "https://www.nytimes.com/2026/02/26/technology/anthropic-pentagon-talks-ai.html",
    "summary": "Anthropic said it was standing firm on not having its A.I. used in certain scenarios by the Pentagon, which has imposed a Friday deadline on the company to give unfettered access to its technology."
  },
  {
    "title": "Google Workers Seek ‘Red Lines’ on Military A.I., Echoing Anthropic",
    "link": "https://www.nytimes.com/2026/02/26/technology/google-deepmind-letter-pentagon.html",
    "summary": "More than 100 Google A.I. employees sent a letter to Jeff Dean, a chief scientist, opposing Gemini’s use for U.S. surveillance and some autonomous weapons."
  },
  {
    "title": "After F.B.I. Raid, Los Angeles School Board Discusses Superintendent’s Future",
    "link": "https://www.nytimes.com/2026/02/26/us/los-angeles-school-board-meeting-superintendent-fbi-raid.html",
    "summary": "Board members held an emergency meeting a day after agents raided the home and office of Alberto Carvalho, the Los Angeles Unified School District superintendent. They did not reach a resolution and agreed to reconvene Friday."
  },
  {
    "title": "Why Are So Many Teen Girls Still Tearing Their A.C.L.s?",
    "link": "https://www.nytimes.com/2026/02/26/magazine/acl-tear-women-girl-sports.html",
    "summary": "For years, ligament tears have been a crisis among young athletes — even though a few simple exercises can prevent them."
  },
  {
    "title": "Jesse Jackson Memorials Begin in Chicago",
    "link": "https://www.nytimes.com/2026/02/26/us/jesse-jackson-chicago-repose-rainbow-push.html",
    "summary": "Mourners lined up outside Rainbow PUSH, the organization Mr. Jackson founded decades ago. He died last week at 84."
  },
  {
    "title": "Germany’s Oil and Gas Output Is Dwindling as Prices Rise",
    "link": "https://www.nytimes.com/2026/02/27/business/germanys-oil-and-gas-output-is-dwindling-as-prices-rise.html",
    "summary": "Natural gas production in Germany has fallen about 80 percent in the past two decades even as the country seeks to replace flows from Russia."
  },
  {
    "title": "Bird Losses Are Accelerating, New Study Finds",
    "link": "https://www.nytimes.com/2026/02/26/climate/bird-declines.html",
    "summary": "Scientists studying data collected over more than three decades found accelerating losses. Their research offers clues about the causes."
  },
  {
    "title": "‘We’re Going to the Moon and Mars’",
    "link": "https://www.nytimes.com/2026/02/26/opinion/space-nasa-elon-musk.html",
    "summary": "The new head of NASA predicts a manned mission to Mars in 10 years."
  },
  {
    "title": "Trump’s Shields Are Down",
    "link": "https://www.nytimes.com/2026/02/27/opinion/trump-cabinet-noem-bondi-hegseth-lutnick.html",
    "summary": "Personnel once meant policy; now it means flattery."
  },
  {
    "title": "Green Party Defeats Labour in U.K. Special Election, in Blow to Starmer",
    "link": "https://www.nytimes.com/2026/02/26/world/europe/gorton-denton-result-green-party-labour.html",
    "summary": "The result marks the first time the Greens have won a British parliamentary by-election and signals the frustration of left-leaning voters with Prime Minister Keir Starmer."
  },
  {
    "title": "Supreme Court Lawyer Who Moonlighted in High-Stakes Poker Is Convicted of Tax Fraud",
    "link": "https://www.nytimes.com/2026/02/26/us/thomas-goldstein-supreme-court-poker-tax-evasion.html",
    "summary": "The lawyer Thomas C. Goldstein, who co-founded the SCOTUSblog website, hid millions in gambling income from the government, federal prosecutors said."
  },
  {
    "title": "N.Y. Man With China Ties Charged With Marijuana Trafficking in Oklahoma",
    "link": "https://www.nytimes.com/2026/02/26/nyregion/nyc-china-hometown-oklahoma-marijuana.html",
    "summary": "Sin Tung Chan was a member of a prominent hometown association in the city, one of hundreds of social clubs that often maintain close ties with the Chinese government."
  }
]