[
  {
    "title": "An Accuser’s Story Suggests How Trump Might Appear in the Epstein Files",
    "link": "https://www.nytimes.com/2025/07/20/us/politics/epstein-employee-trump-investigation.html",
    "summary": "A former Jeffrey Epstein employee said that she told the F.B.I. in 1996 and 2006 about what she considered a troubling encounter with Donald J. Trump."
  },
  {
    "title": "Republicans and Democrats Call for More Information on Epstein Case",
    "link": "https://www.nytimes.com/2025/07/20/us/politics/trump-epstein-files.html",
    "summary": "Members of Congress from both parties said they wanted to see more files released, while President Trump has encouraged his base to move on."
  },
  {
    "title": "What to Know About the Fallout Around the Epstein Files and the Trump Administration",
    "link": "https://www.nytimes.com/article/jeffrey-epstein-files-trump.html",
    "summary": "Here’s what to know about the disturbing facts and unsubstantiated suspicions that make Jeffrey Epstein, a registered sex offender, a politically potent obsession."
  },
  {
    "title": "Dozens Are Killed at Aid Site Near Border, Gaza Health Officials Say",
    "link": "https://www.nytimes.com/2025/07/20/world/middleeast/israel-gaza-military-evacuation.html",
    "summary": "The shootings took place after thousands of Palestinians gathered in the hope of getting humanitarian aid from U.N. trucks entering the Gaza Strip."
  },
  {
    "title": "What to Know About the Deadly Shootings Near a Gaza Aid Site",
    "link": "https://www.nytimes.com/article/israel-gaza-aid-ground-offensive.html",
    "summary": "At least 32 people were reported killed on Saturday, and more than 60 a day later, adding to the mounting death toll of Gazans who have lost their lives trying to get food."
  },
  {
    "title": "How Trump’s Tariffs and Foreign Policies Have Bolstered Support for the E.U.",
    "link": "https://www.nytimes.com/2025/07/21/world/europe/trump-europe-unity-eu-tariffs.html",
    "summary": "The European Union has its problems, but the bloc is gaining public trust and making new friends. President Trump’s attacks are one reason why."
  },
  {
    "title": "China’s Hardball Tactics Set Tone for Difficult Summit with Europe",
    "link": "https://www.nytimes.com/2025/07/21/world/asia/china-europe-trade-war.html",
    "summary": "Beijing is betting that economic pressure and diplomatic defiance will force concessions, but its stance could put more strain on its ties with Europe at a crucial time."
  },
  {
    "title": "After a Chaotic Start, a U.S. Attorney’s Time May Be Running Out",
    "link": "https://www.nytimes.com/2025/07/20/nyregion/alina-habba-us-attorney-new-jersey.html",
    "summary": "Alina Habba, President Trump’s choice to run the U.S. attorney’s office in New Jersey, has pursued investigations against Democrats. Her tenure has damaged morale inside the office."
  },
  {
    "title": "Trump Urges Washington and Cleveland Sports Teams to Revert to Native American Names",
    "link": "https://www.nytimes.com/2025/07/20/us/politics/trump-urges-washington-and-cleveland-sports-teams-to-revert-to-native-american-names.html",
    "summary": "The president threatened to block a deal for the Washington Commanders’ new stadium if the team did not bow to his demand."
  },
  {
    "title": "Should ICE Agents Be Allowed to Wear Masks? It Depends Whom You Ask.",
    "link": "https://www.nytimes.com/2025/07/20/us/politics/ice-agents-masks.html",
    "summary": "Los Angeles’s mayor said Sunday that masked immigration agents helped create a “reign of terror.” ICE’s director said agents could wear masks to “keep them and their families safe.”"
  },
  {
    "title": "Justin Fulcher, a Top Aide to Pete Hegseth, Leaves the Pentagon",
    "link": "https://www.nytimes.com/2025/07/20/us/politics/hegseth-aide-resigns-pentagon-justin-fulcher.html",
    "summary": "Justin Fulcher, an adviser to Defense Secretary Pete Hegseth, said in a statement that he had planned to work in the federal government for only six months."
  },
  {
    "title": "Canceling ‘The Late Show’ Is Bad News for Late-Night TV, not Stephen Colbert",
    "link": "https://www.nytimes.com/2025/07/20/arts/television/stephen-colbert-the-late-show-canceled-comedy.html",
    "summary": "The art form was already in decline; this may hasten its demise. But don’t fret about the host. His talents are better showcased elsewhere."
  },
  {
    "title": "Faint Signs of Life Appear in Effort to Halt Ukraine War",
    "link": "https://www.nytimes.com/2025/07/20/world/europe/russia-ukraine-war-trump-peace-talks.html",
    "summary": "Ukraine’s president proposed reviving talks brokered by the Trump administration, which seemed stalled a month ago."
  },
  {
    "title": "How Did the Number of People Missing After Texas Floods Drop So Drastically?",
    "link": "https://www.nytimes.com/2025/07/20/us/texas-floods-missing.html",
    "summary": "Last week, officials said 97 people were missing in Kerr County. Now, it’s down to three. The drop is substantial, but such wild fluctuations can happen after disasters."
  },
  {
    "title": "Alaska Airlines Grounds Entire Fleet After IT Outage",
    "link": "https://www.nytimes.com/2025/07/20/business/alaska-airlines-grounds-plane-fleet.html",
    "summary": "Alaska Airlines said the outage would lead to “residual impacts” to its operations overnight to its mainline fleet and the planes that fly under the Horizon Air brand."
  },
  {
    "title": "Maddie, a Coonhound Who Awed Instagram by Balancing on Things, Dies at 14",
    "link": "https://www.nytimes.com/2025/07/20/style/maddie-on-things-dog-dead.html",
    "summary": "In thousands of photos, Maddie stood tall and seemingly unbothered atop fences, cars, road signs and tires, garnering 1.2 million Instagram followers along the way."
  },
  {
    "title": "Trump’s Perversion of Justice Has Reached a New Phase",
    "link": "https://www.nytimes.com/2025/07/20/opinion/dillon-taylor-justice-trump.html",
    "summary": "The president is determined to transform America’s legal system into his personal political weapon."
  },
  {
    "title": "The Political Legacy of Jerry Garcia",
    "link": "https://www.nytimes.com/2025/07/20/opinion/jerry-garcia-politics.html",
    "summary": "Garcia and the music he wrote aimed for something beyond politics, something deeper."
  },
  {
    "title": "Edwin Feulner, ‘Heritage Foundation’s George Washington,’ Dies at 83",
    "link": "https://www.nytimes.com/2025/07/20/obituaries/edwin-feulner-dead.html",
    "summary": "As co-founder and longtime head of the conservative Washington think tank, he picked policies and staffers for G.O.P. presidents from Reagan to Trump."
  },
  {
    "title": "Mamdani Travels to Uganda in Break From Mayoral Campaign",
    "link": "https://www.nytimes.com/2025/07/20/nyregion/zohran-mamdani-uganda-trip.html",
    "summary": "Zohran Mamdani, the Democratic nominee for mayor of New York, said that he and his wife were going to the African country where he was born to celebrate their recent marriage."
  },
  {
    "title": "Driver Crashes Into San Jose Post Office, Igniting Fire",
    "link": "https://www.nytimes.com/2025/07/20/us/san-jose-post-office-crash.html",
    "summary": "A man was arrested in connection with the crash on suspicion of arson, officials said. No injuries were reported."
  }
]