[
  {
    "title": "China’s Control of Rare Earths Has U.S. Scrambling to Find Alternatives",
    "link": "https://www.nytimes.com/2025/10/22/us/politics/china-trump-rare-earths.html",
    "summary": "The Trump administration is trying an array of unconventional measures to shore up U.S. rare earths supplies. It remains uncertain whether the strategy will work."
  },
  {
    "title": "Trump Empowers Election Deniers, Still Fixated on 2020 Grievances",
    "link": "https://www.nytimes.com/2025/10/22/us/politics/trump-election-deniers-voting-security.html",
    "summary": "The president has placed proponents of his false claims into government jobs while dismantling systems built to secure voting, raising fears that he aims to seize authority over elections ahead of next year’s midterms."
  },
  {
    "title": "In First Six Months, Cost of Weather Catastrophes Escalated at a Record Pace",
    "link": "https://www.nytimes.com/2025/10/22/climate/trump-noaa-weather-tracking.html",
    "summary": "The Trump administration stopped updating a database tracking the costs of the country’s worst disasters. A group of scientists has revived it."
  },
  {
    "title": "Deforestation Is Imperiling Coffee Cultivation, Report Finds",
    "link": "https://www.nytimes.com/2025/10/22/world/americas/brazil-coffee-production-rainfall.html",
    "summary": "A new report by an industry watchdog adds to growing scientific consensus that as forests are felled to make way for coffee farms, rainfall decreases and crops are more likely to fail."
  },
  {
    "title": "Colleges Face a Reckoning: Is a Degree Really Necessary?",
    "link": "https://www.nytimes.com/2025/10/22/us/value-of-higher-education-attainment-rates-graduation.html",
    "summary": "Wyoming is one of many states that embraced a campaign to encourage more people to enroll in higher education. Some leaders and students wonder if they reached a limit."
  },
  {
    "title": "Oil Prices Dropped 19%, Helping Drivers, but Squeezing the Industry",
    "link": "https://www.nytimes.com/2025/10/22/business/energy-environment/oil-gasoline-prices-change.html",
    "summary": "Oil prices have fallen sharply this year as global supply remains strong and demand has been slow to grow."
  },
  {
    "title": "Testosterone Is Giving Women Back Their Sex Drive but Risks Side Effects",
    "link": "https://www.nytimes.com/2025/10/22/magazine/testosterone-women-health-sex-libido-menopause.html",
    "summary": "There is no F.D.A.-approved testosterone product for women. Insurance won’t cover it. Many doctors won’t prescribe it. It’s become a cultural phenomenon."
  },
  {
    "title": "Civilian Massacres Follow Syrian Leaders’ Promises of Peace",
    "link": "https://www.nytimes.com/2025/10/22/world/middleeast/syria-massacre-druse.html",
    "summary": "Ten months after rebels toppled the long-entrenched Assad regime, little-checked bloodshed has led many Syrians to abandon hope that the years of brutality may be over."
  },
  {
    "title": "G.M. Previews Talking Cars, Cheaper Batteries and Other New Tech",
    "link": "https://www.nytimes.com/2025/10/22/business/general-motors-ai-self-driving.html",
    "summary": "Drivers will be able to converse with an artificial intelligence assistant while cars largely drive themselves in certain situations, the company said."
  },
  {
    "title": "Google’s Quantum Computer Makes a Big Technical Leap",
    "link": "https://www.nytimes.com/2025/10/22/technology/googles-quantum-computer-leap.html",
    "summary": "Designed to accelerate advances in medicine and other fields, the tech giant’s quantum algorithm runs 13,000 times as fast as software written for a traditional supercomputer."
  },
  {
    "title": "Meta Cuts 600 Jobs at A.I. Superintelligence Labs",
    "link": "https://www.nytimes.com/2025/10/22/technology/meta-plans-to-cut-600-jobs-at-ai-superintelligence-labs.html",
    "summary": "The layoffs do not affect Meta’s newest A.I. hires, who are in some cases being paid up to hundreds of millions of dollars. The cuts were focused on correcting an earlier hiring spree."
  },
  {
    "title": "Zelensky Says Russian Strike on School Shows Putin Isn’t Serious About Ukraine Talks",
    "link": "https://www.nytimes.com/2025/10/22/world/europe/russia-ukraine-putin-trump.html",
    "summary": "President Volodymyr Zelensky of Ukraine said an assault by Russia, hours after President Trump put off a meeting with President Vladimir Putin, showed more pressure was needed."
  },
  {
    "title": "This Might Be Andrew Cuomo’s Last Debate. What Can New Yorkers Expect?",
    "link": "https://www.nytimes.com/2025/10/22/nyregion/cuomo-debate-mayor.html",
    "summary": "Even as Mr. Cuomo has ramped up attacks against the front-runner, Zohran Mamdani, and repeated calls for Curtis Sliwa to drop out, he plans to retain last week’s debate strategy."
  },
  {
    "title": "Management of Guardian Angels Raises Questions About Sliwa’s Leadership",
    "link": "https://www.nytimes.com/2025/10/22/nyregion/mayor-sliwa-guardian-angels.html",
    "summary": "The Republican nominee to lead New York City is projecting a more serious outlook, but his longtime organization shows signs of a flawed stewardship."
  },
  {
    "title": "How to Watch the Final NYC Mayoral Debate",
    "link": "https://www.nytimes.com/2025/10/22/nyregion/how-to-watch-nyc-mayor-debate.html",
    "summary": "Zohran Mamdani, Andrew Cuomo and Curtis Sliwa will meet onstage Wednesday night for the last time before the general election on Nov 4."
  },
  {
    "title": "‘Medicaid Cut Me Off’: A Rural Health Center Faces New Pressures",
    "link": "https://www.nytimes.com/2025/10/22/health/medicaid-health-care-mississippi.html",
    "summary": "As cuts to federal health care take hold, local clinics like Delta Health Center in Mississippi will be stretched more thinly than ever."
  },
  {
    "title": "What Happens if Obamacare Subsidies Expire?",
    "link": "https://www.nytimes.com/video/health/100000010459745/what-happens-if-obamacare-subsidies-expire.html",
    "summary": "Consumers are facing greater costs for their 2026 A.C.A. health coverage as Congress continues to debate whether to extend subsidies that help people afford their premiums. Margot Sanger-Katz, a health care policy reporter for The New York Times, explains why."
  },
  {
    "title": "Obamacare Is Expensive. But So Is All Health Insurance.",
    "link": "https://www.nytimes.com/2025/10/22/upshot/obamacare-health-prices-shutdown.html",
    "summary": "The main difference is that most Americans don’t confront the full cost of their coverage."
  },
  {
    "title": "Prior Authorization Is Confusing. This Memo Can Help Patients Understand.",
    "link": "https://www.nytimes.com/2025/10/22/your-money/prior-authorization-health-insurance.html",
    "summary": "Recently, we put together a template to help medical professionals explain a confusing process. Readers gave us very pointed feedback, so we updated it."
  },
  {
    "title": "Workers and Employers Face Higher Health Insurance Costs",
    "link": "https://www.nytimes.com/2025/10/22/health/health-insurance-costs-2025.html",
    "summary": "A new employer survey shows premiums for a family climbed in 2025 as companies and their workers pay more for coverage."
  },
  {
    "title": "Halloween Movie Watch Party: Let’s All ‘Scream’",
    "link": "https://www.nytimes.com/2025/10/22/movies/halloween-movie-watch-party-lets-all-scream.html",
    "summary": "Revisit Wes Craven’s 1996 classic this weekend and join us in the chat."
  },
  {
    "title": "An Alaska Solar Farm Produces Food, Too",
    "link": "https://www.nytimes.com/2025/10/21/climate/alaska-solar-farm-food.html",
    "summary": "Produce and power are both costly in the state. So researchers are testing ways to address both issues using the same land."
  },
  {
    "title": "There’s a Reason Trump Fears No Kings",
    "link": "https://www.nytimes.com/2025/10/22/opinion/no-kings-trump-declaration-independence.html",
    "summary": "Who’s the patriot now?"
  },
  {
    "title": "Women Are Losing in Trump’s Economy",
    "link": "https://www.nytimes.com/2025/10/22/opinion/women-trump-economy.html",
    "summary": "Massive cuts to health, education and immigration are disproportionately taking a toll."
  },
  {
    "title": "How President Trump Uses A.I.",
    "link": "https://www.nytimes.com/2025/10/22/briefing/how-president-trump-uses-ai.html",
    "summary": "The era of A.I. propaganda is here — and Trump is an enthusiastic participant."
  },
  {
    "title": "Maine U.S. Senate Candidate Says He Covered Up Tattoo That Had Nazi Imagery",
    "link": "https://www.nytimes.com/2025/10/22/us/politics/graham-platner-nazi-tattoo-maine.html",
    "summary": "Graham Platner, a Democrat, had acknowledged the tattoo this week on a podcast. He also sought to distance himself from old Reddit posts that drew criticism."
  },
  {
    "title": "Louvre’s Lack of Enough Cameras Let Thieves Arrive Unnoticed, Director Says",
    "link": "https://www.nytimes.com/2025/10/22/world/europe/louvre-museum-robbery-open-paris.html",
    "summary": "Laurence des Cars told a Senate hearing that she had offered to resign after the stunning theft of royal jewels at the Paris museum."
  },
  {
    "title": "Nancy Pelosi Hasn’t Announced Her 2026 Plans. Scott Wiener Is Running Anyway.",
    "link": "https://www.nytimes.com/2025/10/22/us/pelosi-congress-scott-wiener.html",
    "summary": "Scott Wiener, a Democratic state legislator, says he can’t afford to keep deferring to Representative Nancy Pelosi."
  },
  {
    "title": "Former Biden and Senate Counsel to Lead Progressive Legal Group",
    "link": "https://www.nytimes.com/2025/10/22/us/politics/phil-brest-american-constitution-society.html",
    "summary": "Phil Brest, a veteran of the judicial confirmation wars, will head the American Constitution Society at a time of legal turmoil."
  }
]