[
  {
    "title": "How Trump Could Overhaul the Fed",
    "link": "https://www.nytimes.com/2025/08/31/business/how-trump-could-overhaul-the-fed.html",
    "summary": "The president wants to pack the central bank’s Board of Governors with loyalists, which would grant him greater sway over an institution that is supposed to be independent from the White House."
  },
  {
    "title": "Historians See Autocratic Playbook in Trump’s Attacks on Science",
    "link": "https://www.nytimes.com/2025/08/31/science/trump-science-autocrats.html",
    "summary": "Authoritarians have long feared and suppressed science as a rival for social influence. Experts see President Trump as borrowing some of their tactics."
  },
  {
    "title": "Xi Uses Summit, Parade and History to Flaunt China’s Global Pull",
    "link": "https://www.nytimes.com/2025/08/30/world/asia/xi-putin-modi-china-summit.html",
    "summary": "With the leaders of Russia and India visiting, China’s president will show how he can use statecraft, military might and history to push for global influence."
  },
  {
    "title": "America Closed Malls, but China Kept Building Them. Now It Has Too Many.",
    "link": "https://www.nytimes.com/2025/08/31/business/china-shopping-malls.html",
    "summary": "The first closing of an Apple Store in mainland China hints at broader troubles facing the country’s shopping malls as developers open more of them despite a glut."
  },
  {
    "title": "In Austria, Government Health Care Can Look a Bit Like a Spa",
    "link": "https://www.nytimes.com/2025/08/30/well/austria-heart-health.html",
    "summary": "A few weeks of hikes and saunas in wine country? Sometimes, that’s literally just what the doctor ordered."
  },
  {
    "title": "‘There Was a Death’: A Mother Fights for Justice in the Age of Fentanyl",
    "link": "https://www.nytimes.com/2025/08/31/us/fentanyl-mother-dealer-conviction.html",
    "summary": "After she lost her son to an overdose, Serena Fallon went on a quest to hold someone accountable for his death."
  },
  {
    "title": "Russian Strikes on Western Assets in Ukraine Send an Ominous Message",
    "link": "https://www.nytimes.com/2025/08/31/world/europe/russia-ukraine-western-targets.html",
    "summary": "Hitting an American-run factory and European diplomatic offices, the Kremlin appeared to signal that it would resist Western efforts to make peace and protect Ukraine, analysts and officials said."
  },
  {
    "title": "Redistricting Push Creates Chaos for Incumbents in Both Parties",
    "link": "https://www.nytimes.com/2025/08/31/us/politics/redistricting-demcorats-republicans-texas-california.html",
    "summary": "Republicans and Democrats in Congress are wary of the potential consequences of President Trump’s drive to redraw districts."
  },
  {
    "title": "If Redistricting Goes as Expected, Which Party Will Come Out Ahead?",
    "link": "https://www.nytimes.com/2025/08/31/upshot/redistricting-analysis-2026-midterms.html",
    "summary": "Democrats would probably need to win the national popular vote by two or three percentage points to retake the House next year."
  },
  {
    "title": "Trump Crime Strategy May Work for Now, but Not for Long, Experts Say",
    "link": "https://www.nytimes.com/2025/08/31/us/trump-crime-strategy-solutions.html",
    "summary": "The president is looking to add  troops to city streets while cutting funds for programs that work, experts and local officials say. But one idea, beautifying neighborhoods, has buy-in."
  },
  {
    "title": "A City Reinvented: Paris Is Now Greater Paris",
    "link": "https://www.nytimes.com/2025/08/31/world/europe/a-city-reinvented-paris-is-now-greater-paris.html",
    "summary": "The periphery of the French capital is more vital than ever, and its creativity and dynamism have blurred old boundaries."
  },
  {
    "title": "In Syria, a City Shattered by War Asks for Its Sacrifice to Be Repaid",
    "link": "https://www.nytimes.com/2025/08/31/world/middleeast/syria-damascus-war-daraya.html",
    "summary": "Millions of Syrians from destroyed places like Daraya feel they did everything possible to overthrow the Assad government, but they still await reconstruction aid."
  },
  {
    "title": "‘A Future Filled With Hope’: Minneapolis Community Unites to Process the Tragedy",
    "link": "https://www.nytimes.com/2025/08/30/us/minneapolis-catholic-church-shooting.html",
    "summary": "In the first Mass since an assailant attacked Annunciation Catholic Church, parishioners gathered to grieve and support one another."
  },
  {
    "title": "What Motivated the Minneapolis Church Shooter? We May Never Know.",
    "link": "https://www.nytimes.com/2025/08/31/us/minneapolis-school-shooter-motive.html",
    "summary": "Investigators combing through piles of evidence from an attack on a Minneapolis church cautioned that these kinds of shooters often leave more questions than answers."
  },
  {
    "title": "Before Minnesota Shooting, a Program Aimed at Preventing Attacks Lost Federal Funding",
    "link": "https://www.nytimes.com/2025/08/30/us/minnesota-church-shooting-funding-cut.html",
    "summary": "The cut by the Trump administration does not appear to have affected the handling of the church shooting this week, but state leaders say it weakens efforts to identify future threats."
  },
  {
    "title": "How Builder.ai Collapsed Amid Silicon Valley’s Biggest Boom",
    "link": "https://www.nytimes.com/2025/08/31/technology/builder-ai-collapse.html",
    "summary": "Builder.ai went from a value of $1.5 billion to zero in a few months, amid questions over the sales of an A.I. product. Its downfall hints at a broader downturn."
  },
  {
    "title": "How ‘Clanker’ Became an Anti-A.I. Rallying Cry",
    "link": "https://www.nytimes.com/2025/08/31/technology/clanker-anti-ai.html",
    "summary": "The term, which was popularized by a “Star Wars” show and is rooted in real frustrations with technology, has become a go-to slur against artificial intelligence and robots."
  },
  {
    "title": "Israel Must Let the Media Into Gaza",
    "link": "https://www.nytimes.com/2025/08/31/opinion/israel-gaza-media-journalists-ban.html",
    "summary": "The ban indicates that Israel’s leaders are deliberately trying to conceal the war’s full horror."
  },
  {
    "title": "Disney World Is the Happiest Place on Earth, if You Can Afford It",
    "link": "https://www.nytimes.com/2025/08/28/opinion/disney-world-economy-middle-class-rich.html",
    "summary": "The theme-park operator, like so many other companies, is abandoning America’s middle class."
  },
  {
    "title": "Protesters in Indonesia Focus Rage on Politicians, Ransacking Their Homes",
    "link": "https://www.nytimes.com/2025/08/31/world/asia/indonesia-protest-politicians-ransack-loot.html",
    "summary": "After a week of demonstrations, protesters on Sunday directly targeted the people they blamed for economic challenges and police brutality."
  },
  {
    "title": "Beaten and Choked at a U.N. Mission, Then Arrested by the N.Y.P.D.",
    "link": "https://www.nytimes.com/2025/08/31/nyregion/nypd-egyptian-mission-brothers-arrested.html",
    "summary": "Two brothers went to the Egyptian Mission in Manhattan to protest Egypt’s role in keeping aid from reaching Gaza. Video of the violence, which involved mission security guards, has incited rage."
  },
  {
    "title": "Chevron’s Boss Says the World Will Need Oil for a ‘Long, Long Time’",
    "link": "https://www.nytimes.com/2025/08/31/business/chevron-oil-mike-wirth.html",
    "summary": "Mike Wirth, who has seen many booms and busts over the more than 40 years he has been with the energy giant, said that “when the world stops using oil and gas, we’ll stop looking for it.”"
  },
  {
    "title": "Jeremy Lin Retires After 15 Years That Included ‘Linsanity’ With the Knicks",
    "link": "https://www.nytimes.com/2025/08/31/sports/basketball/jeremy-lin-retires-linsanity-knicks.html",
    "summary": "The journeyman played for eight N.B.A. teams and won one championship. But he is best known for a brief stretch on the Knicks where he electrified fans and the nation."
  }
]