[
  {
    "title": "Mamdani Vows to Govern ‘Audaciously’ and Protect New York’s Vulnerable",
    "link": "https://www.nytimes.com/2026/01/01/nyregion/mamdani-inauguration-mayor.html",
    "summary": "Zohran Mamdani gave his first public speech as mayor of New York City, after a public inauguration that drew tens of thousands of people."
  },
  {
    "title": "Mamdani Pays Tribute to the Foods That Define and Sustain New York",
    "link": "https://www.nytimes.com/2026/01/01/nyregion/nyc-food-mamdani.html",
    "summary": "In his inaugural address, Mayor Zohran Mamdani invoked the cuisines of New York as metaphors for the city’s diversity, ambitions and promise."
  },
  {
    "title": "7 Takeaways From the Inauguration of Mayor Zohran Mamdani",
    "link": "https://www.nytimes.com/2026/01/01/nyregion/mamdani-inauguration-takeaways.html",
    "summary": "Mr. Mamdani reaffirmed that he would govern New York City as a democratic socialist and assured even those who had not voted for him: “I am your mayor.”"
  },
  {
    "title": "Fire in Swiss Alps Leaves Dozens of New Year’s Revelers Dead",
    "link": "https://www.nytimes.com/2026/01/01/world/europe/switzerland-fire-crans-montana-ski-resort.html",
    "summary": "About 40 people celebrating at a ski resort bar were killed, and 115 were injured, many of them young, the authorities said."
  },
  {
    "title": "Witnesses Recount Fire That Killed 40 in Switzerland",
    "link": "https://www.nytimes.com/2026/01/01/world/europe/switzerland-fire-scene.html",
    "summary": "It was a haven for the young, where they could find hot chocolate when they wanted quiet and affordable drinks when they did not. Then it turned into a place of death."
  },
  {
    "title": "Switzerland’s burn centers are so overwhelmed that fire victims are being sent to other countries.",
    "link": "https://www.nytimes.com/live/2026/01/01/world/switzerland-ski-resort-fire/switzerlands-burn-centers-are-so-overwhelmed-that-fire-victims-are-being-sent-to-other-countries",
    "summary": ""
  },
  {
    "title": "Swiss Alps Ski Resort Fire: What We Know",
    "link": "https://www.nytimes.com/2026/01/01/world/europe/what-happened-fire-switzerland-ski-resort.html",
    "summary": "The fire at a bar in a popular ski resort killed around 40 people and injured more than 100, officials said. The cause was still unknown."
  },
  {
    "title": "Toby Morton, a Comedy Writer, Owns the Trump Kennedy Center URL",
    "link": "https://www.nytimes.com/2026/01/01/us/politics/trump-kennedy-center-website-toby-morton.html",
    "summary": "A comedy writer bought the web domain TrumpKennedyCenter.org and the satirical site he created is drawing attention amid the backlash over the institution’s renaming."
  },
  {
    "title": "Russia Asks United States to Stop Pursuit of Fleeing Oil Tanker",
    "link": "https://www.nytimes.com/2026/01/01/us/politics/russia-oil-tanker-venezuela-us-pursuit.html",
    "summary": "The tanker, which had been sailing to Venezuela to pick up oil, has claimed Russian protection, although the U.S. authorities say it is a stateless vessel."
  },
  {
    "title": "Venezuela Frees Dozens of Political Prisoners",
    "link": "https://www.nytimes.com/2026/01/01/world/americas/venezuela-prisoner-release.html",
    "summary": "At least 80 people were released, including one with U.S. ties, though more than 800 remain detained in Venezuela for opposing President Nicolás Maduro’s rule, rights groups say."
  },
  {
    "title": "For Some Nazi Loot, Value Is Measured on a Different Scale",
    "link": "https://www.nytimes.com/2026/01/01/arts/design/nazi-loot-restitution-holocaust.html",
    "summary": "Heirs of families that suffered in the Holocaust have gotten back precious items: not treasured art, but the keepsakes of dead relatives."
  },
  {
    "title": "90 Minutes to Give Baby Luna a New Heart",
    "link": "https://www.nytimes.com/2026/01/01/well/90-minutes-to-give-baby-luna-a-new-heart.html",
    "summary": "After eight years of training, Dr. Maureen McKiernan made her debut as the lead surgeon on an infant heart transplant — an operation on the edge of what’s possible."
  },
  {
    "title": "Iran Protests Turn Deadly as Violence and Anger Spread",
    "link": "https://www.nytimes.com/2026/01/01/world/middleeast/iran-protests-deaths.html",
    "summary": "Financial pressures have fueled a fifth day of demonstrations around Iran, with at least one person killed in the protests so far, according to the authorities."
  },
  {
    "title": "He’s Chevy Chase, and He’s Still Like That",
    "link": "https://www.nytimes.com/2026/01/01/arts/television/hes-chevy-chase-and-hes-still-like-that.html",
    "summary": "The famously prickly comedian found a sympathetic adversary in the director of a CNN documentary about him. Their conversation with a reporter was … spirited."
  },
  {
    "title": "Janet Fish, Painter of Luminous Still Lifes, Dies at 87",
    "link": "https://www.nytimes.com/2026/01/01/arts/design/janet-fish-dead.html",
    "summary": "From her student days, she stubbornly refused to follow popular artistic trends. Instead, she spent decades exploring the effects of light on glass."
  },
  {
    "title": "This Diminutive Reptile Plays Rock-Paper-Scissors",
    "link": "https://www.nytimes.com/2026/01/01/science/this-diminutive-reptile-plays-rock-paper-scissors.html",
    "summary": "Side-blotched lizards probably don’t call the game that, but they play a version of it anyway. A new study explains the hidden biology that makes this possible."
  },
  {
    "title": "‘Visible Mending’: The Healing Powers of Knitting",
    "link": "https://www.nytimes.com/2023/12/26/opinion/knitting-healing.html",
    "summary": "Crafters across Britain speak to how knitting can help us heal, even at our most broken."
  },
  {
    "title": "Why New York City Needs Someone Like Mamdani",
    "link": "https://www.nytimes.com/2026/01/01/opinion/zohran-mamdani-mayor-new-york.html",
    "summary": "The new mayor is an entirely familiar type of New York politician."
  },
  {
    "title": "How Japanese Scallops Became a Pawn in Diplomatic Tensions With China",
    "link": "https://www.nytimes.com/2026/01/01/business/japan-china-scallops.html",
    "summary": "Beijing is using a ban on the humble mollusk to punish Japan over its apparent willingness to defend Taiwan."
  },
  {
    "title": "Space Events 2026: NASA’s Artemis II Moon Mission, Summer Eclipse and More",
    "link": "https://www.nytimes.com/2025/12/30/science/space-nasa-spacex-blue-origin-astronomy.html",
    "summary": "In 2026, there will be journeys to the moon and Mars, new visions of the cosmos and a solar eclipse that might be worth traveling for."
  },
  {
    "title": "Guinea’s Coup Leader Wins Election After Barring Leading Opponents",
    "link": "https://www.nytimes.com/2026/01/01/world/africa/guinea-election-mamady-doumbouya.html",
    "summary": "Gen. Mamady Doumbouya, who seized power more than four years ago, took over 80 percent of the vote, according to a government-controlled agency that he set up."
  }
]