[
  {
    "title": "Trump’s Threat of More Tariffs Slows Trade Deals",
    "link": "https://www.nytimes.com/2025/06/30/business/economy/trump-tariffs-trade-deals.html",
    "summary": "As America’s largest trading partners race toward deals, they are increasingly worried about being hit with future tariffs on their critical industries."
  },
  {
    "title": "Here Are the Republican Senators Who May Revolt on Trump’s Bill",
    "link": "https://www.nytimes.com/2025/06/30/us/politics/republican-senators-against-trump-big-bill.html",
    "summary": "Senate Republicans can afford to lose no more than three of their own votes on the bill, but two already are opposed and others remained undecided."
  },
  {
    "title": "Trump Vowed to Dismantle MS-13. His Deal With Bukele Threatens That Effort.",
    "link": "https://www.nytimes.com/2025/06/30/us/politics/trump-bukele-ms-13-immigrants.html",
    "summary": "Top gang leaders being sent back to El Salvador were part of a lengthy federal investigation that has amassed evidence of a corrupt pact between the Bukele government and MS-13."
  },
  {
    "title": "Trump Administration Finds Harvard Failed to Address Harassment of Jewish Students on Campus",
    "link": "https://www.nytimes.com/2025/06/30/us/politics/trump-harvard-civil-rights-law.html",
    "summary": "The university had recently restarted talks with the White House regarding a potential deal after months of fighting in court."
  },
  {
    "title": "Supreme Court Agrees to Hear Major Campaign Finance Challenge",
    "link": "https://www.nytimes.com/2025/06/30/us/politics/supreme-court-campaign-finance.html",
    "summary": "The case involves a challenge to federal limits on how much political parties can spend in coordination with candidates."
  },
  {
    "title": "Judge Amir Ali Has One of the Hardest Jobs In Washington",
    "link": "https://www.nytimes.com/2025/06/30/magazine/federal-judge-amir-ali-trump-usaid.html",
    "summary": "Amir Ali joined D.C.’s court of appeals just weeks before Trump took office. It’s been tumultuous ever since."
  },
  {
    "title": "‘The Bomb Lady’ and the Forerunner of the ‘Bunker Buster’ Used in Iran",
    "link": "https://www.nytimes.com/2025/06/30/us/politics/bomb-iran.html",
    "summary": "While a child in wartime Vietnam, Anh Duong vowed to one day help the soldiers who saved her. She and her Navy team helped revolutionize American munitions."
  },
  {
    "title": "Idaho Sniper Shooting Leaves 2 Firefighters Dead",
    "link": "https://www.nytimes.com/2025/06/29/us/coeur-dalene-idaho-shooting-ambush.html",
    "summary": "Firefighters were responding to a blaze in the panhandle of Idaho when the shooting happened, a sheriff said. The body of a suspect was recovered on Sunday evening."
  },
  {
    "title": "Suspected Gunman Found Dead After Shooting 2 Firefighters in Idaho: What We Know",
    "link": "https://www.nytimes.com/2025/06/30/us/idaho-shooting-firefighters-sniper-suspect.html",
    "summary": "The authorities said a gunman started a wildfire to lure firefighters, then ambushed them in a sniper attack."
  },
  {
    "title": "8 Key Text Exchanges at the Sean ‘Diddy’ Combs Trial",
    "link": "https://www.nytimes.com/2025/06/30/arts/music/sean-combs-diddy-trial-jury-text-messages.html",
    "summary": "The words sent between the mogul and his girlfriends have been cited as crucial evidence by both sides in a case that turns on whether sex marathons he directed were coercive."
  },
  {
    "title": "Jury in Sean ‘Diddy’ Combs Trial Begins Deliberations",
    "link": "https://www.nytimes.com/2025/06/30/arts/music/sean-combs-diddy-trial-jury-deliberations.html",
    "summary": "The panel of 12 must decide whether the music mogul is guilty of racketeering conspiracy and sex trafficking."
  },
  {
    "title": "A Common Assumption About Aging May Be Wrong, Study Suggests",
    "link": "https://www.nytimes.com/2025/06/30/well/live/aging-inflammation-lifespan-environment.html",
    "summary": "Experts have long pointed to inflammation as a natural part of getting older. But a new paper suggests it might be more a product of our environment."
  },
  {
    "title": "Democrats Lay Groundwork for a ‘Project 2029’",
    "link": "https://www.nytimes.com/2025/06/30/us/politics/democrats-project-2029.html",
    "summary": "The plan to write a policy agenda for the next Democratic president is at the center of a raging debate within the party: whether its biggest problem is its ideas or its difficulty in selling them."
  },
  {
    "title": "Europe Is Making a Big Mistake",
    "link": "https://www.nytimes.com/2025/06/30/opinion/europe-nato-military-spending.html",
    "summary": "Breakneck rearmament risks taking the European Union not forward but backward."
  },
  {
    "title": "Corporate Politics",
    "link": "https://www.nytimes.com/2025/06/30/briefing/corporate-politics-pride-blm.html",
    "summary": "We take a look at why businesses are turning away from political causes."
  },
  {
    "title": "Inside the Roosevelt, a Migrant Shelter No More, Echoes of a Crisis",
    "link": "https://www.nytimes.com/2025/06/30/nyregion/roosevelt-hotel-migrant-shelter-closed.html",
    "summary": "The Midtown Manhattan hotel opened as a shelter in 2023. That mission has ended as border crossings plummet, slowing the flow of migrants."
  },
  {
    "title": "Violence Erupts Between Israeli Settlers and Military in West Bank",
    "link": "https://www.nytimes.com/2025/06/30/world/middleeast/violence-israeli-settlers-west-bank.html",
    "summary": "Hard-right activists clashed with troops and set fire to a security site following a growing wave of attacks on Palestinians in the occupied territory."
  },
  {
    "title": "NYC Legal Aid Society Lawyers Threaten to Strike for Higher Pay",
    "link": "https://www.nytimes.com/2025/06/30/nyregion/new-york-legal-aid-society-strike.html",
    "summary": "The lawyers who represent the city’s poorest defendants want to be paid on par with their federal counterparts. They last walked out in 1994."
  }
]