[
  {
    "title": "In Munich, Europe Says It Is ‘De-risking’ From the U.S. Amid Trump’s Unpredictability",
    "link": "https://www.nytimes.com/2026/02/14/world/europe/europe-munich-rubio-russia.html",
    "summary": "In Munich, European leaders were also talking about “de-risking” from the United States, citing President Trump’s unpredictability."
  },
  {
    "title": "Thousands Rally for Iran Regime Change in Cities Around the World",
    "link": "https://www.nytimes.com/2026/02/14/world/europe/iran-regime-rallies-munich.html",
    "summary": "People protesting the Iranian government gathered near the security conference in Munich, as well as in other cities. More U.S.-Iran talks are expected Tuesday."
  },
  {
    "title": "Navalny Was Poisoned With Frog Toxin, European Governments Say",
    "link": "https://www.nytimes.com/2026/02/14/world/europe/russia-navalny-poison.html",
    "summary": "The toxin was found in the body of the Russian dissident Aleksei A. Navalny, who died in prison two years ago, five governments said, challenging Russia’s official account."
  },
  {
    "title": "Inside the Debacle That Led to the Closure of El Paso’s Airspace",
    "link": "https://www.nytimes.com/2026/02/14/us/politics/el-paso-airspace-closure-faa-pentagon.html",
    "summary": "The F.A.A., citing “a grave risk of fatalities” from a new technology being used on the Mexican border, got caught in a stalemate with the Pentagon, which deemed the weapon “necessary.”"
  },
  {
    "title": "U.S. Deports Nine Migrants in Secret, Ignoring Legal Protections",
    "link": "https://www.nytimes.com/2026/02/14/world/africa/us-secret-deportation-cameroon.html",
    "summary": "Most had court orders protecting them from removal to their home countries, so they were sent to detention in Cameroon."
  },
  {
    "title": "New U.S. Boat Strike Kills 3 in the Caribbean",
    "link": "https://www.nytimes.com/2026/02/14/us/politics/boat-strike-kills-3.html",
    "summary": "The attacks since early November had specifically targeted suspected drug smuggling boats in the Pacific Ocean."
  },
  {
    "title": "What We Know About the Kidnapping of Nancy Guthrie, Savannah Guthrie’s Mother",
    "link": "https://www.nytimes.com/article/savannah-guthrie-mom-missing.html",
    "summary": "Nancy Guthrie, 84, the “Today” show anchor’s mother, vanished from her Arizona home on Feb. 1. In the time since, very little new information has come to light."
  },
  {
    "title": "Their Secret to a Happy Marriage? A Translation App",
    "link": "https://www.nytimes.com/2026/02/14/technology/they-are-in-love-but-dont-speak-the-same-language.html",
    "summary": "He speaks English. She speaks Mandarin. The secret to their happy marriage: Microsoft Translator."
  },
  {
    "title": "There’s a Reason American Kids Are Such Picky Eaters",
    "link": "https://www.nytimes.com/2026/02/15/opinion/junk-food-picky-eaters.html",
    "summary": "Blame junk food."
  },
  {
    "title": "The War in Ukraine Has Become a Way of Life",
    "link": "https://www.nytimes.com/2026/02/15/opinion/ukraine-war-drones.html",
    "summary": "The war in Ukraine can look like the future and the past at once. But it’s just our present, the only one we know."
  },
  {
    "title": "French Prosecutors to Investigate Diplomat as Part of Epstein Probe",
    "link": "https://www.nytimes.com/2026/02/14/world/europe/france-epstein-files.html",
    "summary": "The Paris prosecutor’s office said it was looking into three new complaints with links to the files and revisiting an earlier investigation into an Epstein associate who died in 2022."
  },
  {
    "title": "Ring Ends Deal to Link Neighborhood Cameras After Backlash to Super Bowl Ad",
    "link": "https://www.nytimes.com/2026/02/14/business/amazon-ring-flock-partnership-super-bowl.html",
    "summary": "A commercial about a lost dog being reunited with his family ignited concerns that a “Search Party” feature posed privacy risks. Ring parted ways with the tech company Flock Safety."
  },
  {
    "title": "The Sea Took Her Prosthetic Leg. Months Later, It Gave It Back.",
    "link": "https://www.nytimes.com/2026/02/14/world/europe/sea-prosthetic-leg-limb.html",
    "summary": "Brenda Ogden lost her waterproof prosthetic leg 10 months ago, and with it, her zest for swimming. Then a local fossil hunter stumbled upon it."
  }
]