[
  {
    "title": "Johnson Faces G.O.P. Resistance to Quick Final Vote on Trump Policy Bill",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/trump-bill-johnson-house-vote.html",
    "summary": "Several conservative House Republicans expressed grave reservations about changes the Senate made to the party’s major policy bill, leaving its fate and the timing of any final vote uncertain."
  },
  {
    "title": "Planned Parenthood Must Choose Between Abortion or Millions in Federal Funding",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/planned-parenthood-abortions-senate-medicaid-funding.html",
    "summary": "The nation’s largest abortion provider must stop offering it in some states or risk losing millions in Medicaid funding to provide basic health care for low-income Americans."
  },
  {
    "title": "Trump’s Finances Were Shaky. Then He Began to Capitalize on His Comeback.",
    "link": "https://www.nytimes.com/2025/07/02/us/trump-finances-crypto.html",
    "summary": "Contrary to the president’s assertions, records filed in a fraud case against him suggest that his riches were not the product of a steady and strong empire."
  },
  {
    "title": "Former Criminology Student Admits Killing 4 Idaho Students",
    "link": "https://www.nytimes.com/2025/07/02/us/idaho-murders-kohberger-plea.html",
    "summary": "Bryan Kohberger pleaded guilty to the 2022 murders that shook the University of Idaho campus. Under a plea agreement, he avoids the death penalty."
  },
  {
    "title": "Inside the Surprise Idaho Murders Plea Deal That Left Some Families Fuming",
    "link": "https://www.nytimes.com/2025/07/02/us/idaho-murders-kohberger-plea-deal.html",
    "summary": "After two and a half years of legal wrangling, prosecutors and lawyers for the defendant, Bryan Kohberger, reached a deal just weeks before his trial was set to begin."
  },
  {
    "title": "The Serial Killer Expert Who Taught Bryan Kohberger",
    "link": "https://www.nytimes.com/2025/07/02/us/kohberger-serial-killer-teacher-ramsland.html",
    "summary": "Dr. Katherine Ramsland was Bryan Kohberger’s professor before he moved to the Pacific Northwest, where he is expected to plead guilty to killing four University of Idaho students."
  },
  {
    "title": "Justice Dept. Weighs Seeking Criminal Charges as It Presses States for Election Data",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/justice-department-election-data.html",
    "summary": "Such a path could drastically raise the stakes for federal investigations of state or county officials, bringing the department and the threat of criminalization into the election system."
  },
  {
    "title": "Top F.D.A. Official Overrode Scientists on Covid Shots",
    "link": "https://www.nytimes.com/2025/07/02/health/fda-covid-vaccines.html",
    "summary": "Records show that a top U.S. regulator rejected the recommendations of agency experts and limited the use of Covid vaccines."
  },
  {
    "title": "Israel Wants to Resume Truce Talks With Hamas Soon",
    "link": "https://www.nytimes.com/2025/07/02/world/middleeast/israel-gaza-cease-fire-trump.html",
    "summary": "Gideon Saar, the Israeli foreign minister, cited “positive signs” in the long-moribund cease-fire talks to end the war in Gaza and free the hostages held there."
  },
  {
    "title": "Will the Bombing Stop Iran From Going Nuclear?",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/trump-nuclear-weapons-programs.html",
    "summary": "Iran just ended its cooperation with international inspectors, suggesting no post-bombing deal is imminent. That may point to a long game of hide-and-seek, punctuated by military action."
  },
  {
    "title": "He’s Ringo. And Nobody Else Is.",
    "link": "https://www.nytimes.com/2025/07/02/arts/music/ringo-starr-interview.html",
    "summary": "As he turns 85, one of the last surviving Beatles is still musically curious, dispensing his signature wisdom, and preaching the gospel of peace and love."
  },
  {
    "title": "Wisconsin Supreme Court Strikes Down 1849 Abortion Ban",
    "link": "https://www.nytimes.com/2025/07/02/us/wisconsin-abortion-1849-supreme-court.html",
    "summary": "After the U.S. Supreme Court overturned Roe v. Wade in 2022, Republican prosecutors in Wisconsin said they intended to enforce the old law."
  },
  {
    "title": "Pause in U.S. Weapons Deepens Ukrainian Concerns as Russian Attacks Grow",
    "link": "https://www.nytimes.com/2025/07/02/world/europe/ukraine-russia-war-trump-weapons.html",
    "summary": "The suspension includes air defense interceptors, and it will directly affect Ukraine’s ability to fend off escalating Russian air assaults."
  },
  {
    "title": "Kim Jong-un Appears to Mourn His Troops Killed Fighting for Russia",
    "link": "https://www.nytimes.com/2025/07/02/world/asia/north-korea-troops-kim-jong-un.html",
    "summary": "Through an event shown on North Korean state television, Mr. Kim also highlighted the sacrifices made for Moscow and the rewards he seeks."
  },
  {
    "title": "Russia-Azerbaijan Tensions Soar, Threatening Moscow’s Influence",
    "link": "https://www.nytimes.com/2025/07/02/world/europe/russia-azerbaijan-tensions-safarov.html",
    "summary": "The rift, provoked by the deaths of two ethnic Azerbaijanis in Russian custody, was the latest in a series of spats that revealed a deeper diplomatic rift between the former allies."
  },
  {
    "title": "Trump Says U.S. Has Reached Trade Deal With Vietnam",
    "link": "https://www.nytimes.com/2025/07/02/business/economy/trump-vietnam-trade-deal.html",
    "summary": "The president said he had agreed to initial trade terms with Vietnam, the second country to strike a limited deal after Mr. Trump threatened steep tariffs."
  },
  {
    "title": "How U.S.-Japan Tariff Talks Got Stuck on Cars and Rice",
    "link": "https://www.nytimes.com/2025/07/02/business/trump-tariffs-japan-rice-cars.html",
    "summary": "Negotiations have stalled ahead of next week’s deadline, with some suggesting Japan misjudged the depth of President Trump’s frustration over Tokyo’s policies."
  },
  {
    "title": "The First Income Tax in the Persian Gulf Signals a Changing Economic Reality",
    "link": "https://www.nytimes.com/2025/07/02/world/middleeast/oman-income-tax-persian-gulf.html",
    "summary": "A plan by Oman is being closely watched by other governments in the region that are preparing for a future beyond oil."
  },
  {
    "title": "Grand Theft A.T.M.: A Bodega Crime Wave Hits New York",
    "link": "https://www.nytimes.com/2025/07/02/nyregion/nyc-atm-thefts.html",
    "summary": "Common tools and a little muscle have fueled a crime wave that may have netted one burglary crew hundreds of thousands of dollars in a matter of months."
  },
  {
    "title": "L.A. Legal Groups Sue to Stop ‘Unconstitutional’ Immigration Actions",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/immigration-lawsuit-los-angeles.html",
    "summary": "A suit filed in Los Angeles highlights Trump administration enforcement tactics and accuses officers of racial profiling, brutality and holding detainees in “dungeonlike” facilities."
  },
  {
    "title": "What the Supreme Court’s Birthright Ruling Means for Trump’s Power",
    "link": "https://www.nytimes.com/video/us/politics/100000010259478/what-the-supreme-courts-birthright-ruling-means-for-trumps-power.html",
    "summary": "A recent Supreme Court ruling could allow President Trump’s order ending birthright citizenship to go into effect in some states. Abbie VanSickle, a reporter covering the United States Supreme Court for The New York Times, explains how the decision also upends the power of federal judges to freeze policies for the entire country."
  },
  {
    "title": "How Immigration Could Muddy the Jobs Numbers",
    "link": "https://www.nytimes.com/2025/07/02/business/jobs-numbers-immigration-fed.html",
    "summary": "Job growth is expected to fall this year, adding to pressure on the Federal Reserve to cut interest rates. But the slowdown might reflect a smaller labor force, not declining demand from employers."
  },
  {
    "title": "As Heat Grips Europe, a Struggle to Keep Workers and Customers Cool",
    "link": "https://www.nytimes.com/2025/07/02/business/heat-wave-europe-workers-customers.html",
    "summary": "Companies are reporting a drop in business, reflecting the economic toll of the heat wave, which is lowering productivity and keeping shoppers at bay."
  },
  {
    "title": "What to Know About the Heat Wave in Europe",
    "link": "https://www.nytimes.com/2025/06/30/world/europe/heat-wave-europe-what-to-know.html",
    "summary": "Weather agencies have warned of a third day of high temperatures that in some places have climbed well above 100 degrees Fahrenheit, or more than 40 degrees Celsius."
  },
  {
    "title": "Squashing Spotted Lanternflies Will Get Us Only So Far. We Need Wasps.",
    "link": "https://www.nytimes.com/2025/07/02/opinion/lanternflies-biocontrol-invasive-species.html",
    "summary": "Is it wise to use one organism to combat another invasive one?"
  },
  {
    "title": "What I Heard on a Suicide Hotline for Trans Kids",
    "link": "https://www.nytimes.com/2025/07/02/opinion/suicide-hotline-trans-kids.html",
    "summary": "What the Trump administration fails to understand is that callers are desperately searching for just one trusted adult."
  },
  {
    "title": "The Senate and the Supreme Court",
    "link": "https://www.nytimes.com/2025/07/02/briefing/the-senate-and-the-supreme-court.html",
    "summary": "President Trump’s agenda passed in the Senate. It now goes to the House. Plus, we take a close look at this Supreme Court term."
  },
  {
    "title": "Microsoft to Lay Off About 9,000 Employees",
    "link": "https://www.nytimes.com/2025/07/02/technology/microsoft-layoffs-ai.html",
    "summary": "The reductions followed cuts of about 6,000 positions last quarter, and were indicative of a tightening job market at big technology companies."
  },
  {
    "title": "Tesla Sales Fall as Elon Musk Focuses on Self-Driving Cars",
    "link": "https://www.nytimes.com/2025/07/02/business/tesla-sales-elon-musk.html",
    "summary": "The company has devoted resources to autonomous driving rather than developing new models to attract car buyers."
  },
  {
    "title": "A Potential Mamdani Mayorship Strikes Fear in the Real Estate Industry",
    "link": "https://www.nytimes.com/2025/07/02/realestate/mamdani-rent-freeze-real-estate.html",
    "summary": "The Democratic nominee has called for freezing the rent on a million apartments."
  }
]