[
  {
    "title": "After Venezuela, Trump Offers Hints About What Could Be Next",
    "link": "https://www.nytimes.com/2026/01/05/us/politics/trump-venezuela-monroe-doctrine.html",
    "summary": "President Trump’s comments about Greenland, Colombia and Cuba offered a glimpse of how emboldened he feels after the quick capture of Nicolás Maduro."
  },
  {
    "title": "Trump’s Goals for Reviving Venezuela’s Oil Industry Will Not Come Easily or Cheaply",
    "link": "https://www.nytimes.com/2026/01/05/business/energy-environment/venezuela-oil-us-chevron.html",
    "summary": "It will take years and billions in investment to revitalize Venezuela’s oil industry, and energy producers will likely be cautious before stepping in."
  },
  {
    "title": "Trump Says U.S. Is ‘In Charge’ of Venezuela, While Rubio Stresses Coercing It",
    "link": "https://www.nytimes.com/2026/01/04/us/politics/rubio-military-quarantine-venezuela-oil.html",
    "summary": "The secretary of state said that a military “quarantine” on some oil exports would stay in place to put pressure on the country’s acting leadership."
  },
  {
    "title": "Maduro to Be Arraigned, and Trump Threatens Venezuela’s New Leadership",
    "link": "https://www.nytimes.com/2026/01/05/podcasts/the-headlines/maduro-arraigned-trump-threatens-venezuela.html",
    "summary": "Plus, data centers in space?"
  },
  {
    "title": "Hochul to Press for New Safeguards to Protect Children Online",
    "link": "https://www.nytimes.com/2026/01/05/nyregion/hocul-social-media-children-protections.html",
    "summary": "In her upcoming State of the State address, Gov. Kathy Hochul will propose that the default setting for online platforms should ban viewing or messaging minors."
  },
  {
    "title": "In Ukraine, an Arsenal of Killer A.I. Drones Is Being Born in War Against Russia",
    "link": "https://www.nytimes.com/2025/12/31/magazine/ukraine-ai-drones-war-russia.html",
    "summary": "As the war grinds on, sophisticated Russian defenses have pushed Ukraine to develop a frightening new weapon: semiautonomous killing machines."
  },
  {
    "title": "After Christmas Day Strikes, Fear Grips Muslims in Rural Nigeria",
    "link": "https://www.nytimes.com/2026/01/05/world/africa/nigeria-us-strikes-muslims.html",
    "summary": "A small town set amid a smattering of baobab trees is grappling with the aftermath of a bombing ordered by President Trump."
  },
  {
    "title": "Days After U.S. Strikes in Nigeria, Gunmen Kill Dozens of Villagers",
    "link": "https://www.nytimes.com/2026/01/04/world/africa/nigeria-killings-niger-state.html",
    "summary": "The attackers also abducted an unspecified number of people, including students from a Catholic school where over 300 people were kidnapped in November."
  },
  {
    "title": "Supreme Court Increasingly Favors the Rich, Economists Say",
    "link": "https://www.nytimes.com/2026/01/05/us/politics/supreme-court-study-rich-poor.html",
    "summary": "A new study found that the court’s Republican appointees voted for the wealthier side in cases 70 percent of the time in 2022, up from 45 percent in 1953."
  },
  {
    "title": "Trial Begins for Former Officer Over Uvalde School Shooting Response",
    "link": "https://www.nytimes.com/2026/01/05/us/politics/uvalde-school-shooting-trial-robb.html",
    "summary": "Families of the victims and survivors of the 2022 elementary school shooting in Texas are expected to testify."
  },
  {
    "title": "Dimon’s $770 Million Windfall Shows How Banking Is Great Again",
    "link": "https://www.nytimes.com/2026/01/05/business/banking-deregulation-jamie-dimon.html",
    "summary": "The Trump administration is lifting regulations, and deal making is heating up. For Jamie Dimon, being JPMorgan Chase’s chief executive was more lucrative in 2025 than ever."
  },
  {
    "title": "How Pete Wells, Former New York Times Restaurant Critic, Changed His Eating Habits",
    "link": "https://cooking.nytimes.com/article/our-former-restaurant-critic-changed-his-eating-habits-you-can-too",
    "summary": "Pete Wells tells how he recovered from an out-of-control diet. And each week in January, he and experts will suggest ways to reset your own appetite."
  },
  {
    "title": "Gunboat Diplomacy Is Back. What Could Go Wrong?",
    "link": "https://www.nytimes.com/2026/01/05/opinion/trump-venezuela-maduro-clausewitz-aquinas.html",
    "summary": "The high cost of forgetting what world war is really like."
  },
  {
    "title": "Which City Burns Next?",
    "link": "https://www.nytimes.com/2026/01/05/opinion/los-angeles-fires-lessons.html",
    "summary": "One year later, we haven’t really begun to reckon with the real meaning of the Los Angeles fires."
  },
  {
    "title": "The Key Senate Races to Watch in 2026",
    "link": "https://www.nytimes.com/2026/01/05/us/politics/the-key-senate-races-to-watch-in-2026.html",
    "summary": "Democrats want to regain control of the chamber, and they have recruited some top candidates. But they are facing a tough map."
  },
  {
    "title": "How Chevron Aims to Tap More Oil Below Kazakhstan’s Grassy Plains",
    "link": "https://www.nytimes.com/2026/01/03/business/chevron-kazakhstan-oil.html",
    "summary": "After spending nearly $50 billion to expand the country’s Tengiz oil field, the American oil giant and its partners encounter more uncertainty."
  },
  {
    "title": "Critics Choice Awards 2026: The Complete Winners List",
    "link": "https://www.nytimes.com/2026/01/04/movies/critics-choice-awards-winners-complete-list.html",
    "summary": "“One Battle After Another” won best picture, while the top acting honors went to Timothée Chalamet (“Marty Supreme”) and Jessie Buckley (“Hamnet”)."
  }
]