[
  {
    "title": "Clashes in Gaza Reveal Cease-Fire’s Fragility, With Rougher Road Ahead",
    "link": "https://www.nytimes.com/2025/10/20/world/middleeast/gaza-israel-hamas-cease-fire.html",
    "summary": "A round of violence on Sunday was short-lived, but analysts expect more tensions between Israel and Palestinian militants that will put the truce under strain."
  },
  {
    "title": "Israel Strikes Gaza and Temporarily Halts Aid, Saying Hamas Broke Truce",
    "link": "https://www.nytimes.com/2025/10/19/world/middleeast/israel-gaza-ceasefire.html",
    "summary": "Israel launched a wave of attacks on Gaza after accusing Palestinian militants of attacking its forces across cease-fire lines. Both sides say they are still committed to the truce."
  },
  {
    "title": "Where Does the Israel-Hamas Cease-Fire Stand?",
    "link": "https://www.nytimes.com/2025/10/16/world/middleeast/israel-hamas-gaza-cease-fire.html",
    "summary": "Unresolved issues and flare-ups of violence threaten to destabilize the fragile agreement."
  },
  {
    "title": "Violence Flares in Gaza, and White House Responds to Protests: ‘Who Cares?’",
    "link": "https://www.nytimes.com/2025/10/20/podcasts/the-headlines/violence-gaza-white-house-louvre.html",
    "summary": "Plus, a brazen heist at the Louvre."
  },
  {
    "title": "To Fight ICE, Portland’s Leaders Turn to What They Know Best: Zoning",
    "link": "https://www.nytimes.com/2025/10/20/us/politics/portland-ice.html",
    "summary": "Portland, Ore., is well known for its dense laws on land use. Now, under pressure from its liberal residents, the city is using those restrictions against immigrant detention."
  },
  {
    "title": "Judge Demands Answers on Trump Immigration Crackdown in Chicago",
    "link": "https://www.nytimes.com/2025/10/20/us/chicago-hearing-tear-gas-trump.html",
    "summary": "A federal judge has ordered operational leaders of the crackdown to appear before her on Monday to be questioned about their tactics and their use of tear gas."
  },
  {
    "title": "Amazon’s AWS Disruption Creates Outages for Hundreds of Websites for Hours",
    "link": "https://www.nytimes.com/2025/10/20/business/aws-down-internet-outage.html",
    "summary": "Amazon Web Services, a major provider of cloud services, said most services were back up. Hulu, Snapchat, McDonald’s and the British government’s official site were among those that reported outages."
  },
  {
    "title": "Colombia’s Leader Accuses U.S. of Murder, Prompting Trump to Halt Aid",
    "link": "https://www.nytimes.com/2025/10/19/world/americas/trump-colombia-petro-aid.html",
    "summary": "President Gustavo Petro said a U.S. strike in the Caribbean had killed a fisherman. President Trump said he would cut aid and impose new tariffs on Colombian imports."
  },
  {
    "title": "Australia Could Be a Rare Earths Alternative to China for the U.S.",
    "link": "https://www.nytimes.com/2025/10/20/world/australia/australia-rare-earths-china-trump.html",
    "summary": "China’s escalating curbs on the critical minerals has given Australia, a longstanding U.S. ally, the opportunity to reposition itself to a transactional president."
  },
  {
    "title": "Santos Thanks Trump During TV Appearances After His Release From Prison",
    "link": "https://www.nytimes.com/2025/10/19/nyregion/santos-cnn-fox-prison-release.html",
    "summary": "Mr. Santos, the disgraced congressman from Long Island, lashed out at the warden of the prison where he had been held and suggested he was now free to get Botox."
  },
  {
    "title": "Are You Resigned to a World of Bad News? Or Do You Need Some ‘Cope’?",
    "link": "https://www.nytimes.com/2025/10/20/magazine/cope.html",
    "summary": "There are new words for how we process bad news. They’re cynical, hopeful or maybe delusional."
  },
  {
    "title": "In China, a Forbidden Question Looms: Who Leads After Xi?",
    "link": "https://www.nytimes.com/2025/10/20/world/asia/china-communist-succession-plenum.html",
    "summary": "Xi Jinping seems to believe that only his continued rule can secure China’s rise. But as he ages, choosing a successor will become riskier and more difficult."
  },
  {
    "title": "China’s Economy Held Steady in the Third Quarter, but Consumers Were More Cautious",
    "link": "https://www.nytimes.com/2025/10/19/business/china-economy-gdp-q3.html",
    "summary": "A further increase in China’s trade surplus failed to fully offset the effects of a worsening housing market, which has left consumers wary."
  },
  {
    "title": "Louvre Robbers Take ‘Priceless’ French Jewels",
    "link": "https://www.nytimes.com/2025/10/19/world/europe/louvre-paris-robbery.html",
    "summary": "The robbers employed a portable electric ladder to break into a second-floor wing of the Paris museum that holds the French crown jewels."
  },
  {
    "title": "Louvre Robbery: What Was Stolen",
    "link": "https://www.nytimes.com/2025/10/19/world/europe/louvre-heist-items.html",
    "summary": "The stolen items include glittering royal tiaras, necklaces and earrings."
  },
  {
    "title": "Louvre Museum Remains Closed After Jewelry Robbery: What to Know",
    "link": "https://www.nytimes.com/2025/10/20/world/europe/france-louvre-jewel-heist.html",
    "summary": "A stunning heist has raised uncomfortable questions about security at the famed Paris museum."
  },
  {
    "title": "AI Data Centers Create Fury From Mexico to Ireland",
    "link": "https://www.nytimes.com/2025/10/20/technology/ai-data-center-backlash-mexico-ireland.html",
    "summary": "As tech companies build data centers worldwide to advance artificial intelligence, vulnerable communities have been hit by blackouts and water shortages."
  },
  {
    "title": "How Chile Embodies A.I.’s No-Win Politics",
    "link": "https://www.nytimes.com/2025/10/20/technology/chile-ai-politics.html",
    "summary": "Political debates have flared across Chile over artificial intelligence. Should the nation pour billions into A.I. and risk public backlash, or risk being left behind?"
  },
  {
    "title": "Senior German General Says Europe Must Do All It Can to Help Ukraine",
    "link": "https://www.nytimes.com/2025/10/20/world/europe/ukraine-russia-war-europe.html",
    "summary": "European democracy and rule of law are at risk, the general says, so Europe must give Ukraine whatever it can to pressure Moscow, even if Trump does not."
  },
  {
    "title": "Peanut Allergies Have Plummeted in Children, Study Shows",
    "link": "https://www.nytimes.com/2025/10/20/well/peanut-allergy-drop.html",
    "summary": "Doctors have long recommended that infants avoid peanuts. But in 2017, experts officially reversed that guidance, and food allergies decreased sharply."
  },
  {
    "title": "154,000 New York City Students Were Homeless Last Year, a Record Number",
    "link": "https://www.nytimes.com/2025/10/20/nyregion/homeless-students-new-york-record-number.html",
    "summary": "If these pupils made up their own school system, it would be one of the 20 largest districts in the United States. The number includes those who are doubled up in crowded apartments."
  },
  {
    "title": "Some N.F.L. Players Are Finding Second Careers as Nurses",
    "link": "https://www.nytimes.com/2025/10/19/well/nfl-players-nurses.html",
    "summary": "A handful of pro players are choosing scrubs after leaving the football field."
  },
  {
    "title": "For the Ghosts in a Berkshires Mansion, the Gilded Age Never Ended",
    "link": "https://www.nytimes.com/2025/10/20/realestate/ventfort-hall-gilded-age-berkshires.html",
    "summary": "Ventfort Hall, an 1893 mansion built for J.P. Morgan’s sister, was in disrepair. The living and the dead teamed up to save it."
  },
  {
    "title": "America Still Has a Political Center, and It’s the Key to Winning",
    "link": "https://www.nytimes.com/2025/10/20/opinion/moderation-strategy-democrat-republican-center.html",
    "summary": "The antidote to our polarized politics is a creative, re-energized political center."
  },
  {
    "title": "Senator Ruben Gallego Has Three Words For Democrats",
    "link": "https://www.nytimes.com/2025/10/20/opinion/ruben-gallego-interview-democrats-border-security-affordability.html",
    "summary": "Lessons from a Democrat who won in a Republican state."
  },
  {
    "title": "For Alaskan Evacuees, Home Is Gone, With No Return in Sight",
    "link": "https://www.nytimes.com/2025/10/19/us/alaska-storm-flooding-evacuations.html",
    "summary": "Their communities devastated from last weekend’s storm, many are in shelters in Anchorage and facing life in a completely different world."
  },
  {
    "title": "‘Don’t Touch My Retirement!’ Wins the Day in France",
    "link": "https://www.nytimes.com/2025/10/19/world/europe/dont-touch-my-retirement-wins-the-day-in-france.html",
    "summary": "The country’s attachment to an early pension, seen as a fundamental right, forced a major concession by the government, allowing it to survive, for now."
  },
  {
    "title": "Can a University From Tennessee Help Accelerate Growth in West Palm Beach?",
    "link": "https://www.nytimes.com/2025/10/19/business/vanderbilt-university-expansion.html",
    "summary": "At a time of financial and enrollment uncertainty in higher education, Vanderbilt University, along with other schools, has forged ahead with expansion."
  },
  {
    "title": "Mamdani and Cuomo Make Their Cases in Last Weekend Before Early Voting",
    "link": "https://www.nytimes.com/2025/10/19/nyregion/mamdani-cuomo-campaign-new-york.html",
    "summary": "As the New York City mayoral campaign enters its final weeks, the candidates appeared at a forum at Queens College and at a soccer tournament in Coney Island."
  }
]