[
  {
    "title": "Trump Leans Into Showmanship on Day 1 of His Asia Trip",
    "link": "https://www.nytimes.com/2025/10/25/world/asia/trump-asean-malaysia-asia.html",
    "summary": "President Trump presided over several deals during his first day of a nearly weeklong trip. Buried in the details are Washington’s plans to contain China."
  },
  {
    "title": "The ‘Sleeper Issue’ at the Heart of Trump’s Trade War on China",
    "link": "https://www.nytimes.com/2025/10/25/business/trump-tariffs-southeast-asia-transshipment.html",
    "summary": "Concern is increasing throughout Southeast Asia as U.S. officials, intent on slowing China, have yet to say how they will define the origin country of imports."
  },
  {
    "title": "Trump and Xi Could ‘Consummate’ TikTok Deal This Week, Bessent Says",
    "link": "https://www.nytimes.com/2025/10/26/us/politics/trump-xi-tiktok-deal-bessent.html",
    "summary": "Treasury Secretary Scott Bessent said on “Face the Nation” on Sunday that China and the United States had reached “a final deal on TikTok,” but offered few details."
  },
  {
    "title": "Suspects in Louvre Jewelry Heist Arrested, French Authorities Say",
    "link": "https://www.nytimes.com/2025/10/26/world/europe/louvre-heist-arrests.html",
    "summary": "Thieves stole over $100 million in jewelry from the Paris museum. It is unclear how many people were arrested, but one man was caught while trying to leave France."
  },
  {
    "title": "A Break-In That Shook France",
    "link": "https://www.nytimes.com/2025/10/26/world/europe/louvre-break-in-shook-france.html",
    "summary": "The robbery at the Louvre left behind more than broken glass. It battered the pride of a nation that is increasingly glum about itself and its direction."
  },
  {
    "title": "German Company Launches Ad After Its Lift Is Used in Louvre Heist",
    "link": "https://www.nytimes.com/2025/10/24/world/europe/louvre-robbery-german-campaign-bocker.html",
    "summary": "The brazen daylight robbery of the Louvre has turned into a marketing opportunity for Böcker, a German maker of cranes and elevators whose product was used in the heist."
  },
  {
    "title": "‘No Idea How Long People Can Hold Out’: Federal Workers Feel Brunt of Shutdown",
    "link": "https://www.nytimes.com/2025/10/26/us/politics/federal-workers-shutdown-pay.html",
    "summary": "As more than one million government employees go without pay, many are turning to side jobs and food banks to make ends meet."
  },
  {
    "title": "In Trump-Friendly Iowa, the President’s Policies Have Hit Hard",
    "link": "https://www.nytimes.com/2025/10/26/us/politics/iowa-trump-economy.html",
    "summary": "The state has become a stronghold for President Trump. Now, his efforts on trade, energy and immigration are squeezing farmers, disrupting labor and threatening industries."
  },
  {
    "title": "Under Trump, Voice of America Is Down but Not Out",
    "link": "https://www.nytimes.com/2025/10/26/us/politics/under-trump-voice-of-america-is-down-but-not-out.html",
    "summary": "Buttressed by courts and support from some Republican lawmakers, federally funded newsrooms that President Trump has tried to eliminate have yet to be rendered obsolete."
  },
  {
    "title": "Newsom Says He Will Consider a 2028 Presidential Run After the Midterms",
    "link": "https://www.nytimes.com/2025/10/26/us/politics/gavin-newsom-2028-race.html",
    "summary": "The California governor acknowledged in an interview Sunday on CBS that he would give the question serious thought after the 2026 elections."
  },
  {
    "title": "As the Left’s Biggest Stars Unite Behind Mamdani, a Bigger Test Awaits",
    "link": "https://www.nytimes.com/2025/10/26/nyregion/mamdani-sanders-aoc-rally.html",
    "summary": "Senator Bernie Sanders and Representative Alexandria Ocasio-Cortez will join Zohran Mamdani on Sunday to help push his bid to win the Nov. 4 election for mayor of New York City."
  },
  {
    "title": "Can Cuomo Sway Trump Voters Away From Sliwa in the NYC Mayor’s Race?",
    "link": "https://www.nytimes.com/2025/10/26/nyregion/cuomo-republican-voters-mayor.html",
    "summary": "Former Gov. Andrew M. Cuomo, a Democrat running on a third-party line, has appeared repeatedly on Staten Island and shifted his messaging in ways that seem designed to court Republican voters."
  },
  {
    "title": "Is That Pumpkin Seaworthy? No Promises.",
    "link": "https://www.nytimes.com/2025/10/25/style/damariscotta-pumpkinfest-regatta.html",
    "summary": "In Maine, a pumpkin regatta is fighting dry summers and rising costs. (Its boats are mostly fighting to stay afloat.)"
  },
  {
    "title": "The Thread Tying Together Everything Trump Does",
    "link": "https://www.nytimes.com/2025/10/26/opinion/trump-foreign-policy.html",
    "summary": "Whether he is negotiating a deal in the Middle East, bombing boats off the coast of Venezuela or deploying troops to American cities, it’s always about power."
  },
  {
    "title": "Labubus Ate My Daughter",
    "link": "https://www.nytimes.com/2025/10/26/opinion/labubu-parenting-consumerism.html",
    "summary": "I thought our frenzied quest to find the trendy doll would teach my daughter a lesson. It did, just not the one I expected."
  },
  {
    "title": "Halloween Season Is Here. Bring on the Horror.",
    "link": "https://www.nytimes.com/2025/10/26/us/halloween-season-is-here-bring-on-the-horror.html",
    "summary": "Why are scary movies doing so well right now?"
  },
  {
    "title": "How Maduro Is Responding to Trump’s Pressure on Venezuela’s Economy",
    "link": "https://www.nytimes.com/2025/10/26/world/americas/trump-maduro-venezuela-economy.html",
    "summary": "President Nicolás Maduro’s opponents hope a new period of economic pain will finally topple his government. He is using cryptocurrency to hold on."
  },
  {
    "title": "Alvin Bragg, Seeking Re-election, Is Not Mentioning His Best-Known Case",
    "link": "https://www.nytimes.com/2025/10/26/nyregion/bragg-trump-campaign.html",
    "summary": "He is the only prosecutor to convict a president. But mentioning Donald Trump to him on the campaign trail is a conversation stopper."
  }
]