[
  {
    "title": "With His Pivot on Ukraine, Trump May Be Washing His Hands of the War",
    "link": "https://www.nytimes.com/2025/09/24/us/politics/trump-ukraine.html",
    "summary": "President Trump has shown dwindling interest in mediating a peace accord, joining European “security guarantees” for Ukraine or providing aid and intelligence to the Ukrainians."
  },
  {
    "title": "At U.N. Climate Summit, U.S. Stands Alone",
    "link": "https://www.nytimes.com/2025/09/24/climate/united-nations-climate-summit-emissions-targets.html",
    "summary": "On Wednesday in New York, countries lined up to say they would accelerate their efforts to cut greenhouse-gas emissions. In staying away, the U.S. was all but alone."
  },
  {
    "title": "At the UN, Trump Strikes Radically Different Tones in Public and Private",
    "link": "https://www.nytimes.com/2025/09/24/us/politics/trump-united-nations-tones.html",
    "summary": "At the United Nations, world leaders got to see both sides of President Trump: bellicose in public and far more conciliatory in private."
  },
  {
    "title": "Dallas ICE Facility Shooting Leaves One Detainee Dead and Two Injured",
    "link": "https://www.nytimes.com/2025/09/24/us/dallas-ice-shooting.html",
    "summary": "The shooter, who killed himself, also wounded two detainees in an attack that raised new fears about political violence in the United States."
  },
  {
    "title": "JD Vance Spars With Jon Favreau Over Dallas Shooting Information",
    "link": "https://www.nytimes.com/2025/09/24/style/jd-vance-jon-favreau-dallas-shooting.html",
    "summary": "In the aftermath of a violent episode, political figures quickly engaged with one another on social media."
  },
  {
    "title": "Dallas Shooting Suspect Had Extensive Online Footprint but Little on Politics",
    "link": "https://www.nytimes.com/2025/09/24/us/dallas-ice-shooting-suspect.html",
    "summary": "On social media accounts, the suspect, Joshua Jahn, talked about video games, cars, “South Park” and marijuana — but not so much about politics."
  },
  {
    "title": "Immigrant Rights Groups Condemn Violent Rhetoric Against ICE and  Immigrants",
    "link": "https://www.nytimes.com/2025/09/24/us/ice-dallas-shooting-reaction-response.html",
    "summary": "In a tense national debate, inflammatory language is being singled out."
  },
  {
    "title": "U.S. Attorney Races to Present Case Against James Comey",
    "link": "https://www.nytimes.com/2025/09/24/us/politics/james-comey-indictment.html",
    "summary": "It remains to be seen whether a career prosecutor would be willing to present a case to a grand jury or whether jurors would bring an indictment."
  },
  {
    "title": "Inquiry Into Ex-C.I.A. Chief Stalls After Purge by Gabbard",
    "link": "https://www.nytimes.com/2025/09/24/us/politics/john-brennan-tulsi-gabbard-cia-trump.html",
    "summary": "The lack of an indictment so far against Mr. Brennan, in the Eastern District of Pennsylvania, is the most recent setback for such prosecutions."
  },
  {
    "title": "Trump Administration Eyes More Mass Layoffs if Government Shuts Down",
    "link": "https://www.nytimes.com/2025/09/24/us/politics/trump-shutdown-layoffs.html",
    "summary": "The president’s top aides told agencies to prepare for potential firings if Congress cannot extend funding before the end of Sept. 30."
  },
  {
    "title": "Jimmy Kimmel’s Return Draws 6.2 Million Viewers, Ratings Show",
    "link": "https://www.nytimes.com/2025/09/24/business/media/jimmy-kimmel-ratings.html",
    "summary": "The first episode of “Jimmy Kimmel Live!” since it was suspended last week by Disney attracted nearly four times its average viewership."
  },
  {
    "title": "How Did Maria Branyas Morera, Who Was the World’s Oldest Person, Live So Long?",
    "link": "https://www.nytimes.com/2025/09/24/health/maria-branyas-longevity-genes-microbiome.html",
    "summary": "Spanish researchers say Maria Branyas Morera, who lived to 117, won a genetic lottery. But experts caution that healthy genes and microbiomes don’t explain longevity on their own."
  },
  {
    "title": "At a Times Event, Opposing Views on Climate Change Collide",
    "link": "https://www.nytimes.com/2025/09/24/climate/climate-forward-gavin-newsom-chris-wright.html",
    "summary": "In a day of live journalism, California’s governor assailed President Trump, and the U.S. energy secretary called for countries to quit the Paris Agreement on global warming."
  },
  {
    "title": "With Sobs and Doubts, Greenlandic Women Receive Apology for Forced Contraception",
    "link": "https://www.nytimes.com/2025/09/24/world/europe/denmark-greenland-apology-birth-control.html",
    "summary": "Some Greenlanders asked why an apology had not come decades earlier, and chalked up the timing to tensions over President Trump’s aim of annexing the island."
  },
  {
    "title": "Kashmir’s Apple Harvest Rots After Landslide Blocks Road",
    "link": "https://www.nytimes.com/2025/09/25/world/asia/apples-are-vital-to-kashmirs-economy-a-landslide-left-them-to-rot.html",
    "summary": "The Himalayan region supplies most of India’s apples. But when heavy rains left a major highway blocked for weeks, farmers couldn’t get them to markets."
  },
  {
    "title": "A Curator Flees Bangkok After China Deems His Art Show Too Provocative",
    "link": "https://www.nytimes.com/2025/09/24/world/asia/bangkok-museum-censorship-china.html",
    "summary": "A museum’s directors said Chinese and Thai officials pressured them to remove the names of artists whose works criticized China. The curator flew to London, fearing arrest."
  },
  {
    "title": "Mel Taub, Creator of a Pun-Loving Puzzle, Is Dead at 97",
    "link": "https://www.nytimes.com/2025/09/24/crosswords/mel-taub-dead.html",
    "summary": "He was the main whiz behind a crossword  variation for The Times, whose readers delighted in his anagrams and sometimes groan-inducing wordplay. (Try one yourself.)"
  },
  {
    "title": "President Trump, Your Aid Cuts Are Costing Lives and Money",
    "link": "https://www.nytimes.com/2025/09/24/opinion/trump-aid-cuts.html",
    "summary": "The dismantling of U.S.A.I.D. is leading to the squandering of taxpayer dollars, as well as of large numbers of lives."
  },
  {
    "title": "Trump Is Building the Blue Scare",
    "link": "https://www.nytimes.com/2025/09/24/opinion/ezra-klein-podcast-corey-robin.html",
    "summary": "The political theorist Corey Robin walks through the history of the Red Scare and the “fractured mirror” it is to Trump’s attack on the “radical left.”"
  },
  {
    "title": "A Shooter Opened Fire on a Dallas ICE Facility",
    "link": "https://www.nytimes.com/2025/09/24/briefing/ice-shooting-vaccine-questions-answered.html",
    "summary": "Also, we answer your vaccine questions. Here’s the latest at the end of Wednesday."
  },
  {
    "title": "A Flash of Anger on India’s Delicate Border With China",
    "link": "https://www.nytimes.com/2025/09/24/world/asia/ladakh-protests-india.html",
    "summary": "Protesters demanding statehood for Ladakh, a strategically important Himalayan region, clashed with the police."
  },
  {
    "title": "Woman, 50, Killed by Midtown Manhattan Driver in Hit-and-Run Crash",
    "link": "https://www.nytimes.com/2025/09/24/nyregion/midtown-hit-run-woman-killed.html",
    "summary": "A driver hit the woman and her husband, tourists from Germany, near Bryant Park on Wednesday afternoon. Her husband, 55, was injured, the police said."
  },
  {
    "title": "Akiko Tsuruga, Inventive Jazz Organist, Dies at 58",
    "link": "https://www.nytimes.com/2025/09/24/arts/music/akiko-tsuruga-dead.html",
    "summary": "Known for her vast sonic palette, she made her mark playing with the saxophone master Lou Donaldson and also had a prolific solo career."
  },
  {
    "title": "Want to Bring a Dog to This Italian City? That Will Be $1.75.",
    "link": "https://www.nytimes.com/2025/09/24/world/europe/bolzano-italy-dog-tax.html",
    "summary": "Bolzano, in northern Italy, is considering taxing tourists’ dogs, and charging resident dog owners an annual fee as well."
  }
]