[
  {
    "title": "Trump Administration Tells Court It Has Money It Can’t Spend to Prevent Food Stamp Cuts",
    "link": "https://www.nytimes.com/2025/10/30/us/politics/food-stamps-shutdown.html",
    "summary": "States have sued the federal government to force the release of aid during the shutdown, with a key hearing set for Thursday."
  },
  {
    "title": "How States Are Preparing for a Freeze in Federal Food Assistance",
    "link": "https://www.nytimes.com/2025/10/30/us/politics/snap-states.html",
    "summary": "The Supplemental Nutritional Assistance Program will run out of money on Saturday. Some governors are shifting state money to cover part of the shortfall, bolster food pantries or both."
  },
  {
    "title": "How Xi Walked Away From Trump Trade Talks Looking Stronger",
    "link": "https://www.nytimes.com/2025/10/30/world/asia/china-trump-xi-trade.html",
    "summary": "By withholding soybean purchases and rare-earth exports, China extracted relief from U.S. tariffs and delayed export controls, without conceding much in return."
  },
  {
    "title": "Trump and Xi Ease Off the Trade War, but New Nuclear Threat Brings a Chill",
    "link": "https://www.nytimes.com/2025/10/30/us/politics/trump-xi-trade-meeting.html",
    "summary": "The two leaders reached an agreement on fentanyl, some tariffs and rare earths, at least for a year. But even as the global trade picture cleared a little, Mr. Trump spurred new worries about nuclear proliferation."
  },
  {
    "title": "Can New York City Buses Be Both Fast and Free?",
    "link": "https://www.nytimes.com/video/upshot/100000010473160/can-new-york-city-buses-be-both-fast-and-free.html",
    "summary": "Our reporter Larry Buchanan collects data on the B41 bus in Brooklyn to find out why New York City buses are the slowest in the nation and whether Zohran Mamdani’s campaign pledge to make buses free would speed them up."
  },
  {
    "title": "Andrew Cuomo, Scraping and Scrambling, Is Still Running as Andrew Cuomo",
    "link": "https://www.nytimes.com/2025/10/30/nyregion/andrew-cuomo-campaign.html",
    "summary": "The former governor, a distant second in most polls of the New York City mayor’s race, is working harder to attract voters and remind them who he is."
  },
  {
    "title": "Where Mamdani Found the Blueprints to Run for Mayor",
    "link": "https://www.nytimes.com/2025/10/30/nyregion/zohran-mamdani-howeowners.html",
    "summary": "Before Zohran Mamdani became a state legislator, he helped South Asian New Yorkers who were in danger of losing their homes because of tax liens and job losses."
  },
  {
    "title": "How a Former Trump Golf Club Worker Was Mistakenly Deported to Mexico",
    "link": "https://www.nytimes.com/2025/10/30/nyregion/immigrant-wrongly-deported-mexico.html",
    "summary": "When Alejandro Juarez was returned to his homeland, federal agents told him that they were just following orders. Those orders were wrong."
  },
  {
    "title": "As ICE Raids Upend L.A., Mexican Immigrants Vent, and a Diplomat Listens",
    "link": "https://www.nytimes.com/2025/10/30/us/immigration-raids-los-angeles-mexican-diplomat.html",
    "summary": "Weekly public meetings at the Mexican consulate in Los Angeles have become a place where immigrants ask for help with a host of problems, big and small."
  },
  {
    "title": "He Survived the Invasion. What He Really Wanted Was a Friend.",
    "link": "https://www.nytimes.com/2025/10/30/world/europe/ukraine-russia-war-mountain-camp.html",
    "summary": "During the war, a Ukrainian boy lost his home, his father and his friends. Could he find new buddies at a camp in the mountains?"
  },
  {
    "title": "Wilders’s Far-Right Party Faces Rebuke in the Netherlands",
    "link": "https://www.nytimes.com/2025/10/30/world/europe/netherlands-election-parliament-wilders.html",
    "summary": "Geert Wilders suffered a loss of support as a center-left party staged major gains, an election result that could offer lessons for Europe’s far right."
  },
  {
    "title": "Inside the Louvre Jewel Heist That Shocked the World",
    "link": "https://www.nytimes.com/2025/10/30/world/europe/inside-louvre-jewel-heist.html",
    "summary": "More than a week after thieves made off with treasures from the Louvre, a picture is emerging of a seemingly well-planned burglary that exploited security lapses at the museum and outpaced the police."
  },
  {
    "title": "French Police Arrest 5 More in Louvre Jewel Heist Investigation",
    "link": "https://www.nytimes.com/2025/10/30/world/europe/louvre-heist-arrests-paris.html",
    "summary": "The authorities have detained seven suspects in total but have not recovered the stolen jewels."
  },
  {
    "title": "Why the Price of Electricity Is Spiking Around the Country",
    "link": "https://www.nytimes.com/2025/10/30/climate/electricity-prices.html",
    "summary": "Not all states have gotten hit equally hard. The reasons are complex."
  },
  {
    "title": "A Month Without Data Muddles the Economic Picture",
    "link": "https://www.nytimes.com/2025/10/30/business/a-month-without-data-muddles-the-economic-picture.html",
    "summary": "Tariffs and uncertainty were already making the economy hard to read. The loss of government data during the shutdown has made the situation much worse."
  },
  {
    "title": "Volkswagen, Hit by Tariffs, Reports $1.5 Billion Loss and Warns of Chip Shortage",
    "link": "https://www.nytimes.com/2025/10/30/business/volkswagen-tariffs-chip-shortages.html",
    "summary": "Europe’s largest automaker said that a shortage of semiconductors could further hurt productivity."
  },
  {
    "title": "For These Women, the American Dream Is in Mexico City",
    "link": "https://www.nytimes.com/2025/10/30/world/americas/mexico-city-american-expat-women.html",
    "summary": "Thousands of foreign women have moved to the Mexican capital for a “life reset,” creating successful businesses and drawing more expats like them. Not all Mexicans are pleased."
  },
  {
    "title": "New York Survived Its 1975 Crisis. Will Trump Push It Back to the Brink?",
    "link": "https://www.nytimes.com/2025/10/30/nyregion/ford-nyc-financial-crisis-trump.html",
    "summary": "The Daily News headline “Ford to City: Drop Dead” stunned the city at a time of budgetary peril. New York’s finances are far stronger today, but antagonism from Washington poses a fresh risk."
  },
  {
    "title": "50 Years Ago, My Father Wrote the Headline ‘Ford to City: Drop Dead’",
    "link": "https://www.nytimes.com/2025/10/30/nyregion/william-brink-gerald-ford-headline.html",
    "summary": "It’s rare that a headline outlasts the person who wrote it. But long after my father’s death, “Ford to City: Drop Dead” still reverberates."
  },
  {
    "title": "From Gaza to New York’s Mayoral Race, Jewish Identity Splits Over Israel’s Future",
    "link": "https://www.nytimes.com/2025/10/30/style/israel-gaza-war-jewish-left-zionism.html",
    "summary": "Left-wing Jews are wrestling with thorny questions: What will American Jewish communities look like now? And how will they think about Israel?"
  },
  {
    "title": "Have Halloween Decorations Become Too Scary?",
    "link": "https://www.nytimes.com/2025/10/29/style/halloween-decorations-scary.html",
    "summary": "The skeletons are taller, the witches seem to be more lifelike and the blood and gore is more plentiful."
  },
  {
    "title": "Candy Companies Are Quietly Cutting Down on Cocoa to Save Money",
    "link": "https://www.nytimes.com/2025/10/30/climate/candy-chocolate-cocoa-prices-climate-change.html",
    "summary": "As climate change has helped push cocoa prices higher, companies are changing candy recipes in subtle ways."
  },
  {
    "title": "Good Luck Finding a ‘KPop Demon Hunters’ Costume This Halloween",
    "link": "https://www.nytimes.com/2025/10/30/business/kpop-demon-hunters-halloween-costume.html",
    "summary": "Characters from the hit Netflix film are among the most coveted outfits this year, and scarcity has forced some to improvise."
  },
  {
    "title": "There Are So Many Ways to Shut Down a Country",
    "link": "https://www.nytimes.com/2025/10/30/opinion/election-day-government-shutdown.html",
    "summary": "The moderate vs. progressive debate will not be solved on Tuesday."
  },
  {
    "title": "The World Has Again Failed to Prevent Atrocities in Darfur",
    "link": "https://www.nytimes.com/2025/10/30/opinion/rsf-el-fasher-darfur.html",
    "summary": "Reports are emerging of atrocities in Darfur. The Trump and Biden administrations could have tried harder to prevent them."
  },
  {
    "title": "Trump and Xi Agree to a Yearlong Trade Truce",
    "link": "https://www.nytimes.com/2025/10/30/us/trump-and-xi-agree-to-a-yearlong-trade-truce.html",
    "summary": "The leaders struck a deal this morning in their first meeting since Trump opened a trade war against China"
  },
  {
    "title": "U.S. Charges 19 With Flooding Washington Square Park With Drugs",
    "link": "https://www.nytimes.com/2025/10/30/nyregion/washington-square-park-drugs.html",
    "summary": "Prosecutors said dealers had sold millions of doses of heroin and fentanyl. The police in New York have responded to dozens of overdoses in the park and surrounding area in recent years."
  },
  {
    "title": "The Case of the Tiny Tyrannosaurus Might Have Been Cracked",
    "link": "https://www.nytimes.com/2025/10/30/science/nanotyrannus-tyrannosaurus-rex-fossil.html",
    "summary": "Did certain small tyrannosaur fossils belong to “teen rex” or another species? New analysis of a recent fossil appears to have settled the debate."
  },
  {
    "title": "Israel’s Ultra-Orthodox Stage ‘March of the Million’ Against Military Draft",
    "link": "https://www.nytimes.com/2025/10/30/world/middleeast/israel-ultra-orthodox-demonstration-military-draft.html",
    "summary": "Hundreds of thousands took to the streets of Jerusalem on Thursday to protest against efforts to end an exemption from military service for Israel’s Haredi religious students."
  },
  {
    "title": "Why a Cloud-Seeding Experiment to Fight Air Pollution in India Failed",
    "link": "https://www.nytimes.com/2025/10/30/world/asia/india-rain-pollution-cloud-seeding.html",
    "summary": "Officials experimented with cloud seeding to try and reduce environmental pollutants as residents choke on filthy air."
  }
]