[
  {
    "title": "Trump Takes Reins on U.S. Economy With Policy Bill and Tariffs Renewal",
    "link": "https://www.nytimes.com/2025/07/09/us/politics/trump-bill-tariffs-economy.html",
    "summary": "President Trump has achieved much of his agenda, leaving the fate of the economy squarely in his hands."
  },
  {
    "title": "Bessent Steps Up Criticism of Fed as Auditions for Chair Intensify",
    "link": "https://www.nytimes.com/2025/07/09/us/politics/bessent-federal-reserve-chair.html",
    "summary": "The Treasury secretary is breaking with tradition in publicly assailing the central bank’s policies as President Trump looks for its next leader."
  },
  {
    "title": "Trump Didn’t Always Tout Tariffs. Now He Sees Them as a Way to Flex Power.",
    "link": "https://www.nytimes.com/2025/07/09/us/politics/trump-tariffs-trade-policy.html",
    "summary": "Instead of treating tariffs as part of a broader trade policy, President Trump views them as a valuable weapon he can wield on the world stage."
  },
  {
    "title": "What Is a Trade Deal? Trump Takes an Expansive View.",
    "link": "https://www.nytimes.com/2025/07/08/us/politics/trump-trade-deal.html",
    "summary": "The president is deploying the word “deal” liberally, using the term to describe all kinds of trade arrangements, some very limited or one-sided."
  },
  {
    "title": "A Green Light to Fire Federal Workers, and Trump’s Problem With Putin",
    "link": "https://www.nytimes.com/2025/07/09/podcasts/the-headlines/trump-mass-layoffs-putin.html",
    "summary": "Plus, the big business of youth sports."
  },
  {
    "title": "Rivers Are the Soul of the Texas Hill Country, and a Source of Heartache",
    "link": "https://www.nytimes.com/2025/07/09/us/rivers-are-the-soul-of-the-texas-hill-country-and-a-source-of-heartache.html",
    "summary": "The rivers etching the terrain are a beloved feature of the rapidly growing region. But last week’s flooding was an agonizing reminder of the dangers they pose."
  },
  {
    "title": "After Texas Flooding, Questions About FEMA’s Role and Fate Under Trump",
    "link": "https://www.nytimes.com/2025/07/08/climate/texas-flood-fema-trump.html",
    "summary": "President Trump wants to shutter the agency and shift responsibility and costs of emergency management to the states. In Texas, that process appears to already be underway."
  },
  {
    "title": "How Crypto Lobbying Won Over Trump",
    "link": "https://www.nytimes.com/2025/07/09/us/politics/trump-crypto-lobbying.html",
    "summary": "The industry’s courtship of Donald J. Trump resulted in one of the great lobbying free-for-alls in recent Washington history."
  },
  {
    "title": "As Truth Social Business Struggles, Trump Media Goes Big on Crypto",
    "link": "https://www.nytimes.com/2025/07/09/business/truth-social-trump-media-crypto.html",
    "summary": "The pivot to crypto highlights the reality of Truth Social, one of President Trump’s highest-profile business interests: It doesn’t generate much revenue."
  },
  {
    "title": "Trump Got the Green Light to Fire Federal Workers. Now, They Wait.",
    "link": "https://www.nytimes.com/2025/07/08/us/politics/trump-federal-workers-firings.html",
    "summary": "A court-ordered pause in May covered nearly two dozen federal agencies at different stages of executing President Trump’s directive for mass layoffs. The Supreme Court said the administration could proceed."
  },
  {
    "title": "U.S. Botched a Deal to Swap Venezuelans in El Salvador for American Prisoners",
    "link": "https://www.nytimes.com/2025/07/08/world/americas/trump-venezuelan-migrants-us-prisoner-swap.html",
    "summary": "Secretary of State Marco Rubio and the U.S. envoy to Venezuela were both working on different deals and ended up at cross purposes."
  },
  {
    "title": "Trump Uses Cabinet Meeting to Vent About Epstein, Putin and Powell",
    "link": "https://www.nytimes.com/2025/07/08/us/politics/trump-cabinet-meeting-decor.html",
    "summary": "The president held forth in public for 104 minutes, using a cabinet meeting to express much that is on his mind."
  },
  {
    "title": "Trump and Bondi, Confronted Over Epstein Files, Tell Supporters to Move On",
    "link": "https://www.nytimes.com/2025/07/08/us/politics/trump-epstein.html",
    "summary": "A small but influential cohort of the president’s far-right political coalition spared him their ire but turned with a vengeance on the attorney general and the top officials at the F.B.I."
  },
  {
    "title": "Gary Shteyngart Believes in Living the Good Life",
    "link": "https://www.nytimes.com/2025/07/08/style/gary-shteyngart-book-vera-or-faith.html",
    "summary": "Mr. Shteyngart was once told he might be. With his sixth novel, “Vera, or Faith,” out now, he’s spent the last few years spending it well."
  },
  {
    "title": "Book Review: ‘Vera, or Faith,’ by Gary Shteyngart",
    "link": "https://www.nytimes.com/2025/07/07/books/review/gary-shteyngart-vera-or-faith.html",
    "summary": "“Vera, or Faith” follows a 10-year-old girl navigating family drama and a dystopian America."
  },
  {
    "title": "After Decades of Hostility, Israeli-Syrian Relations Begin to Thaw",
    "link": "https://www.nytimes.com/2025/07/09/world/middleeast/syria-israel-talks.html",
    "summary": "The longtime enemies have opened contacts, reflecting a power shift across a Middle East in which they have newfound common ground: antipathy for Iran."
  },
  {
    "title": "Wildfires Scar Syria Anew",
    "link": "https://www.nytimes.com/2025/07/09/world/middleeast/syria-wildfires-photos-videos.html",
    "summary": "The country is experiencing its worst drought in decades, which has set the conditions for the blazes to scorch an area the size of Washington, D.C."
  },
  {
    "title": "Trump’s Frustration With Putin Preceded Resumption of U.S. Weapons to Ukraine",
    "link": "https://www.nytimes.com/2025/07/08/us/politics/trump-putin-ukraine.html",
    "summary": "President Trump lashed out at the Russian leader on Tuesday, signaling a change in his posture toward the conflict."
  },
  {
    "title": "The Royal Box: Who’s in Wimbledon’s Most Exclusive Seats?",
    "link": "https://www.nytimes.com/2025/07/05/sports/tennis/wimbledon-royal-box-who.html",
    "summary": "The event’s most coveted seats are available only through invitation, reserved for celebrities and dignitaries. Here’s a look at who’s sitting in them."
  },
  {
    "title": "Just How Harmful Is Vaping? More Evidence Is Emerging.",
    "link": "https://www.nytimes.com/2025/07/09/well/vaping-health-risks.html",
    "summary": "A new study that found high levels of heavy metals in popular nicotine vapes adds to concerns about the products."
  },
  {
    "title": "How the Women of ‘Too Much’ Made Lena Dunham’s Rom-Com Just Right",
    "link": "https://www.nytimes.com/2025/07/09/arts/television/too-much-lena-dunham-emily-ratajkowski-megan-stalter.html",
    "summary": "Lena Dunham wanted to open up the world of romantic comedies with her new Netflix series. In interviews, she and the stars Megan Stalter, Janicza Bravo and Emily Ratajkowski discuss how they did it."
  },
  {
    "title": "These Americans Went Looking the Britain Found Onscreen. They Found a Different Story.",
    "link": "https://www.nytimes.com/2025/07/09/style/americans-england-romance-tv-movies.html",
    "summary": "Like the lead character of “Too Much,” they moved across the Atlantic with visions of Jane Austen and Merchant Ivory. The reality was a little less dreamy."
  },
  {
    "title": "Wildfire on Edge of Marseille Injures More Than 100, Officials Say",
    "link": "https://www.nytimes.com/2025/07/09/world/europe/marseille-wildfires-france.html",
    "summary": "Firefighters worked through the night to prevent the blaze from entering France’s second-biggest city, and brought the wildfire under control on Wednesday morning."
  },
  {
    "title": "Research Suggests Climate Change Added Excess Deaths in European Heat Wave",
    "link": "https://www.nytimes.com/2025/07/09/climate/europe-heat-waves-deaths.html",
    "summary": "The rapid analysis by World Weather Attribution calculated that climate change might have tripled the death toll from the event."
  },
  {
    "title": "If Zohran Mamdani Wins, Then What?",
    "link": "https://www.nytimes.com/2025/07/09/opinion/zohran-mamdani-mayor-power.html",
    "summary": "He would become the leftist others look to, either as a savior or as a villain."
  },
  {
    "title": "The World’s Best and Brightest Are Moving, but Not to America",
    "link": "https://www.nytimes.com/2025/07/09/opinion/united-states-migration.html",
    "summary": "Immigration isn’t a crisis. It’s the future."
  },
  {
    "title": "A Classroom Experiment",
    "link": "https://www.nytimes.com/2025/07/09/briefing/artificial-intelligence-education-students.html",
    "summary": "We explain how schools are using artificial intelligence."
  },
  {
    "title": "Ronny Chieng on Trump’s Nobel Nomination: Consider the Source",
    "link": "https://www.nytimes.com/2025/07/09/arts/television/ronny-chieng-trump-nobel-netanyahu.html",
    "summary": "An endorsement from Benjamin Netanyahu for the Nobel Peace Prize is like “a Husband of the Year nomination from O.J. Simpson,” the “Daily Show” host said."
  },
  {
    "title": "Flash Flooding in Ruidoso, New Mexico, Sweeps Homes Away and Forces Rescues",
    "link": "https://www.nytimes.com/2025/07/08/us/flooding-ruidoso-new-mexico.html",
    "summary": "Gov. Michelle Lujan Grisham declared a state of emergency for the village of Ruidoso, in an area that was scarred by wildfires last year."
  },
  {
    "title": "Britain’s Economic Bind: Face Public Disapproval or Investor Wrath",
    "link": "https://www.nytimes.com/2025/07/09/business/uk-economy-reeves-starmer.html",
    "summary": "The Labour Party is starting its second year in control of the government with difficult choices over whether to curb spending or raise taxes."
  },
  {
    "title": "Philadelphia Public Workers Reach Deal to End Strike",
    "link": "https://www.nytimes.com/2025/07/09/world/americas/philadelphia-strike-trash.html",
    "summary": "The city’s largest public sector union and the mayor reached a tentative deal, ending a work stoppage that led to piles of trash on the streets."
  },
  {
    "title": "Jailed Kurdish Leader Declares the End to PKK’s Armed Struggle In Turkey",
    "link": "https://www.nytimes.com/2025/07/09/world/middleeast/turkey-pkk-kurdish-leader-ocalan-armed-struggle.html",
    "summary": "In the first footage of him to be released publicly in 25 years, Abdullah Ocalan said the P.K.K. insurgency against Turkey would be replaced by politics."
  }
]