[
  {
    "title": "For Israel, Hamas and Trump’s Peace Plan, Now Comes the Hard Part",
    "link": "https://www.nytimes.com/2025/10/14/world/middleeast/gaza-talks-phase-two.html",
    "summary": "Hamas released hostages and agreed to abide by a cease-fire, but persuading it to lay down its arms is another matter."
  },
  {
    "title": "Israel Identifies 2 Bodies Handed Over by Hamas",
    "link": "https://www.nytimes.com/2025/10/14/world/middleeast/israeli-hostages-bodies-hamas.html",
    "summary": "The return of the remains of four former captives has spurred anger that more were not retrieved. The devastation to Gaza is likely to make the task especially hard."
  },
  {
    "title": "Trump Takes a Victory Lap, but Avoids Questions About What’s Next",
    "link": "https://www.nytimes.com/2025/10/13/world/middleeast/trump-victory-lap-whats-next.html",
    "summary": "Except for brief references, President Trump did not talk about what it would take to rebuild Gaza or about the future of the Palestinian people."
  },
  {
    "title": "Cheering Crowds Greet Palestinian Prisoners Freed by Israel",
    "link": "https://www.nytimes.com/2025/10/13/nyregion/prisoners-freed-gaza-palestinian-west-bank.html",
    "summary": "“We were happy for our prisoners — and for the Israelis, too,” one Gaza resident said. “We love peace and the truce.”"
  },
  {
    "title": "What’s Next for Gaza, and an Ultimatum for Pentagon Reporters",
    "link": "https://www.nytimes.com/2025/10/14/podcasts/the-headlines/gaza-pentagon-reporters-shein-paris.html",
    "summary": "Plus, France versus fast fashion."
  },
  {
    "title": "Trump Enacts Tariffs on Imported Lumber and Furniture",
    "link": "https://www.nytimes.com/2025/10/14/business/economy/trump-tariffs-lumber-furniture-china.html",
    "summary": "The new taxes went into effect on Tuesday as President Trump also threatened to widen his trade war with China."
  },
  {
    "title": "Trump’s Two Minds on China Sow a Chaotic Few Days",
    "link": "https://www.nytimes.com/2025/10/13/us/politics/trump-china-tariffs.html",
    "summary": "The president’s bellicose vow of steep new tariffs, followed quickly by a more conciliatory message, pointed to an internal tug of war over his approach."
  },
  {
    "title": "U.S. Starts Charging Chinese Ships to Dock at Its Ports",
    "link": "https://www.nytimes.com/2025/10/14/business/china-shipping-us-ports.html",
    "summary": "The measure is aimed at countering China’s dominance of commercial shipbuilding and helping to revitalize the American industry."
  },
  {
    "title": "Slowing Electric Vehicle Sales Will Cost G.M. $1.6 Billion",
    "link": "https://www.nytimes.com/2025/10/14/business/general-motors-electric-vehicles-loss.html",
    "summary": "General Motors said it would lower its earnings by that amount to mainly reflect the drop in the value of equipment, factories and other assets."
  },
  {
    "title": "Inside the Improbable, Audacious and (So Far) Unstoppable Rise of Zohran Mamdani",
    "link": "https://www.nytimes.com/2025/10/14/magazine/zohran-mamdani-mayor-new-york.html",
    "summary": "The story of the man most likely to be the next mayor of New York City — and the promise and peril his ascent poses for the Democratic Party."
  },
  {
    "title": "Five Takeaways From the Magazine’s Profile of Zohran Mamdani",
    "link": "https://www.nytimes.com/2025/10/14/magazine/zohran-mamdani-mayor-race-takeaways.html",
    "summary": "How the Democratic nominee for mayor who has stunned the New York establishment is working to shore up support and sustain his momentum."
  },
  {
    "title": "Letitia James and Zohran Mamdani Unite to Fight Trump",
    "link": "https://www.nytimes.com/2025/10/13/nyregion/letitia-james-rally-zohran-mamdani.html",
    "summary": "Ms. James, in her first public appearance since her federal indictment, said that she and Mr. Mamdani knew what it was like to be threatened and harassed."
  },
  {
    "title": "Will the Supreme Court Use a Louisiana Case to Gut the Voting Rights Act?",
    "link": "https://www.nytimes.com/2025/10/14/us/politics/supreme-court-voting-rights-act.html",
    "summary": "The justices have shown a willingness to chip away at the landmark civil rights legislation. A Louisiana case could unravel much of its remaining power."
  },
  {
    "title": "Gov. Janet Mills of Maine to Run for Senate, Aiming at Senator Susan Collins",
    "link": "https://www.nytimes.com/2025/10/14/us/politics/janet-mills-senate-race-maine-susan-collins.html",
    "summary": "A two-term Democratic governor, Ms. Mills called herself “battle tested” in an interview. But she faces a Democratic primary before she can challenge the Republican incumbent."
  },
  {
    "title": "North Carolina Republicans Plan to Redraw Congressional Map to Add a Seat",
    "link": "https://www.nytimes.com/2025/10/13/us/north-carolina-republicans-redistricting.html",
    "summary": "The Trump administration has pushed Republican leaders to redraw House district maps before the midterm elections next year. His party already holds 10 of North Carolina’s 14 congressional seats."
  },
  {
    "title": "This Buzzy New Restaurant Is No Four Horsemen — but It Could Be",
    "link": "https://www.nytimes.com/2025/10/14/dining/restaurant-review-i-cavallini-brooklyn.html",
    "summary": "I Cavallini is as hard to get into as its Williamsburg precursor, but its Italian cooking is a tad more tentative."
  },
  {
    "title": "Ukraine’s Formula for Peace: Fewer Talks, More Weapons",
    "link": "https://www.nytimes.com/2025/10/14/world/europe/zelensky-trump-tomahawk-missiles.html",
    "summary": "As Russia rebuffs President Trump’s diplomatic push, President Volodymyr Zelensky of Ukraine plans to head again to the White House, this time seeking missiles."
  },
  {
    "title": "Instagram Will Limit Content for Teenagers Based on PG-13 Ratings",
    "link": "https://www.nytimes.com/2025/10/14/technology/instagram-teenagers-pg-13-ratings.html",
    "summary": "The restrictions also apply to conversations between teenage users and artificial intelligence chatbots."
  },
  {
    "title": "Diane Keaton Defied Beauty Standards",
    "link": "https://www.nytimes.com/2025/10/13/style/why-diane-keatons-death-hits-harder.html",
    "summary": "For many of her fans, she was like a rare bird soaring from bygone days when progress and growing freedoms for women seemed inevitable."
  },
  {
    "title": "Opioid Deaths Suddenly Dominate a Governor’s Race. Here’s What We Know.",
    "link": "https://www.nytimes.com/2025/10/13/nyregion/opioids-nj-governor-race.html",
    "summary": "Representative Mikie Sherrill, a New Jersey Democrat, said a firm once owned by her Republican opponent, Jack Ciattarelli, spread misinformation about opioids. His campaign has threatened to sue her for defamation."
  },
  {
    "title": "For Uniqlo’s Founder, Conquering America Is Personal",
    "link": "https://www.nytimes.com/2025/10/14/business/uniqlo-tadashi-yanai.html",
    "summary": "Tadashi Yanai champions the U.S. market as vital for Uniqlo’s growth, but remains deeply concerned about rising American protectionism."
  },
  {
    "title": "Pete Buttigieg on Rebuilding America After Trump",
    "link": "https://www.nytimes.com/2025/10/14/opinion/next-american-story-pete-buttigieg.html",
    "summary": "The former transportation secretary argues Americans need a new sense of belonging."
  },
  {
    "title": "She Struggled With Addiction, Then Tried a Weight Loss Drug",
    "link": "https://www.nytimes.com/2025/10/14/opinion/ozempic-addiction.html",
    "summary": "Is a powerful addiction treatment already invented?"
  },
  {
    "title": "Meet Zohran Mamdani, the Favorite to Lead New York City",
    "link": "https://www.nytimes.com/2025/10/14/us/meet-zohran-mamdani-the-favorite-to-lead-new-york-city.html",
    "summary": "Our reporters explore his skyrocket, his life and his appeal."
  },
  {
    "title": "Late Night Tips the Hat to Trump for Middle East Cease-fire",
    "link": "https://www.nytimes.com/2025/10/14/arts/television/late-night-trump-gaza-peace.html",
    "summary": "Jimmy Kimmel celebrated that President Trump “finally did something positive” with his role in the deal between Israel and Hamas."
  },
  {
    "title": "California Forecast: Early-Season Storm Brings a Deluge of Rain",
    "link": "https://www.nytimes.com/2025/10/13/weather/california-storms-rain-forecast.html",
    "summary": "The rare October storm could cause mudslides and debris flow, forecasters said. Some residents in Los Angeles County have been told to evacuate."
  },
  {
    "title": "As U.S. Warships Patrol Caribbean, Drug Smugglers Shift Tactics",
    "link": "https://www.nytimes.com/2025/10/14/us/us-drug-trafficking-boats-caribbean.html",
    "summary": "With the United States surging its military presence in the region and bombing boats, countries in the Caribbean are seeing more flights carrying illegal drugs."
  },
  {
    "title": "Alfa-Betty Olsen, Behind-the-Scenes ‘Comic Conspirator,’ Dies at 88",
    "link": "https://www.nytimes.com/2025/10/13/arts/television/alfa-betty-olsen-dead.html",
    "summary": "After quietly helping Mel Brooks set the irreverent tone on “Get Smart” and “The Producers,” she had a long collaboration as a writer with the actor and humorist Marshall Efron."
  }
]