[
  {
    "title": "Trump Heckles Europe Before Heading to Davos",
    "link": "https://www.nytimes.com/2026/01/20/world/europe/davos-trump-europe.html",
    "summary": "As European leaders try to engage with the American president over Greenland and the future of Ukraine, he is mocking them as weak."
  },
  {
    "title": "With Threats to Greenland, Trump Sets America on the Road to Conquest",
    "link": "https://www.nytimes.com/2026/01/20/us/politics/trump-greenland-america-conquest.html",
    "summary": "After a century of defending other countries against foreign aggression, the United States is now positioned as an imperial power trying to seize another nation’s land."
  },
  {
    "title": "A.I., Big Tech and Trump Shine Most Brightly at the Davos Spectacle",
    "link": "https://www.nytimes.com/2026/01/20/business/davos-trump.html",
    "summary": "The World Economic Forum is now dominated by global technology companies whose interests shunt aside most others."
  },
  {
    "title": "Trump’s First Year Could Have Lasting Economic Consequences",
    "link": "https://www.nytimes.com/2026/01/20/business/trump-first-year-economy.html",
    "summary": "President Trump’s policies have so far done little to change the overall state of the American economy, but economists warn they will ultimately weaken the United States."
  },
  {
    "title": "How Trump Flexes Power in White House Meetings With Zelensky and Others",
    "link": "https://www.nytimes.com/2026/01/20/us/politics/trump-oval-office-world-leaders.html",
    "summary": "With cameras rolling, President Trump met with more than 40 international leaders in his first year back in office."
  },
  {
    "title": "Fact-Checking Trump’s Misleading Claims After One Year Back in Office",
    "link": "https://www.nytimes.com/2026/01/20/us/politics/trump-falsehoods-fact-check-first-year.html",
    "summary": "The president has justified many significant moves of his second term with inaccurate claims and overstated boasts."
  },
  {
    "title": "One Year In, Searching for a Strategy Behind Trump’s Unpredictability",
    "link": "https://www.nytimes.com/2026/01/20/us/politics/trump-one-year-unpredicatability.html",
    "summary": "One great truth of Trump II so far is that nobody has any idea what tomorrow holds."
  },
  {
    "title": "Bessent Attended a Supreme Court Argument. Now He’s Telling Powell Not to.",
    "link": "https://www.nytimes.com/2026/01/20/us/politics/bessent-powell-supreme-court-fed.html",
    "summary": "Treasury Secretary Scott Bessent said it was a mistake for Jerome Powell to attend arguments in a case on Fed independence. But Mr. Bessent attended a tariff case."
  },
  {
    "title": "In U.S. Attorney Standoff, Judges in Virginia Seek to Fill Top Prosecutor Job",
    "link": "https://www.nytimes.com/2026/01/20/us/politics/virginia-us-attorney-halligan.html",
    "summary": "Some judges have expressed frustration that Lindsey Halligan continues to claim she is the U.S. attorney for the Eastern District of Virginia, despite a ruling in November declaring her appointment invalid."
  },
  {
    "title": "Majority of Supreme Court Appears Skeptical of Hawaii Gun Law",
    "link": "https://www.nytimes.com/2026/01/20/us/politics/supreme-court-hawaii-gun-law.html",
    "summary": "The court grappled with a Hawaii law restricting carrying concealed weapons onto private property, setting up a potential clash between gun and property rights."
  },
  {
    "title": "Netflix Revamps Its Warner Bros. Bid, Seeking to Thwart Paramount",
    "link": "https://www.nytimes.com/2026/01/20/business/netflix-warner-bros-discovery-paramount-takeover.html",
    "summary": "Netflix will pay all cash for the $83 billion deal to acquire major parts of Warner Bros. Discovery, instead of a mix of cash and stock."
  },
  {
    "title": "We’re Still Talking About Bernie Goetz After All These Years",
    "link": "https://www.nytimes.com/2026/01/20/books/review/bernie-goetz-subway-heather-ann-thompson-elliot-williams.html",
    "summary": "Two new books return to the ’80s-era saga of Bernie Goetz to consider the 21st-century intersections of race, crime and sensationalism."
  },
  {
    "title": "Volunteers in Minnesota Deliver Groceries So Immigrants Can Hide at Home",
    "link": "https://www.nytimes.com/2026/01/20/us/minnesota-groceries-church-volunteer-ice-trump.html",
    "summary": "Thousands of Minneapolis residents have joined a church-run effort to deliver donated groceries to immigrant families who fear being caught in public by federal agents."
  },
  {
    "title": "As Spain Mourns Train Crash Victims, Investigators Focus on Track",
    "link": "https://www.nytimes.com/2026/01/20/world/europe/spain-train-crash-track-investigation.html",
    "summary": "Officials on Tuesday were struggling to identify bodies from the crash near the southern city of Córdoba, which killed at least 41 people."
  },
  {
    "title": "Mississippi Temple Says There Is More to Its Story Than Facing Hate",
    "link": "https://www.nytimes.com/2026/01/20/us/mississippi-beth-israel-temple-judaism.html",
    "summary": "An arson attack at a synagogue in Mississippi was a reminder of the threat Jews face, but also of the strength of a small community forged over generations."
  },
  {
    "title": "The Chinese Island Where Dreams of Real Estate Glory Never Die",
    "link": "https://www.nytimes.com/2026/01/20/world/asia/china-ocean-flower-island-real-estate.html",
    "summary": "Intended as China’s version of Dubai’s palm-shaped artificial island, Ocean Flower Island is a $12 billion monument to debt-fueled economic excess."
  },
  {
    "title": "Suicides Were Frequent at the Golden Gate Bridge. Not Anymore.",
    "link": "https://www.nytimes.com/2026/01/20/us/golden-gate-bridge-suicides.html",
    "summary": "For decades, there had been an average of 30 each year. With a new deterrent in place, there were none in the second half of 2025."
  },
  {
    "title": "In the World of Weight Loss, the Calorie No Longer Counts",
    "link": "https://www.nytimes.com/2026/01/20/dining/calorie-counting-weight-loss-nutrition.html",
    "summary": "Long held up as the big benchmark of nutrition, the calorie is losing its clout in the age of GLP-1s and a sharper focus on nutrients."
  },
  {
    "title": "As Mamdani Focuses on Child Care, Plan to Tax the Rich Is Put Aside",
    "link": "https://www.nytimes.com/2026/01/20/nyregion/mamdani-hochul-taxes-child-care.html",
    "summary": "Mayor Zohran Mamdani campaigned on a proposal to increase taxes on those earning more than $1 million. For now, at least, he isn’t pushing."
  },
  {
    "title": "What to Know About California’s Proposed Wealth Tax on Billionaires",
    "link": "https://www.nytimes.com/2026/01/20/us/california-billionaires-wealth-tax.html",
    "summary": "The wealth tax ballot proposal has set off a feverish debate in California, as well as plenty of confusion."
  },
  {
    "title": "Mikie Sherrill Is Sworn In as Governor of New Jersey",
    "link": "https://www.nytimes.com/2026/01/20/nyregion/mikie-sherrill-nj-governor.html",
    "summary": "Ms. Sherrill beat a Republican endorsed by President Trump and did what no politician in New Jersey has done since 1961: win her party a third consecutive term in the governor’s office."
  },
  {
    "title": "2026 Oscar Nomination Predictions",
    "link": "https://www.nytimes.com/2026/01/20/movies/oscar-nominations-predictions.html",
    "summary": "“Sinners” and “One Battle After Another” could set a record. Expect them to be up for best picture with “Hamnet,” “Frankenstein” and “Marty Supreme.”"
  },
  {
    "title": "‘This Is Trump’s Goon Squad, for Christ’s Sake’",
    "link": "https://www.nytimes.com/2026/01/20/opinion/trump-vance-miller-ice.html",
    "summary": "Who will watch the watchmen?"
  },
  {
    "title": "Our Man in Caracas",
    "link": "https://www.nytimes.com/2026/01/20/briefing/our-man-in-caracas.html",
    "summary": "We have a conversation with a Times correspondent who is reporting from Venezuela."
  },
  {
    "title": "Will ‘Psychiatry’s Bible’ Add a Postpartum Psychosis Diagnosis?",
    "link": "https://www.nytimes.com/2026/01/20/health/postpartum-psychosis-dsm-diagnosis.html",
    "summary": "Leaders of the D.S.M., the world’s most influential psychiatric manual, have been split for more than five years over whether to recognize postpartum psychosis as a distinct disorder."
  },
  {
    "title": "An A.I. Start-Up Says It Wants to Empower Workers, Not Replace Them",
    "link": "https://www.nytimes.com/2026/01/20/technology/humans-ai-anthropic-xai.html",
    "summary": "Founded by researchers from Anthropic, Google and xAI, the new company, Humans&, is already valued at $4.48 billion."
  },
  {
    "title": "Now Boarding the Freedom Plane: Precious Founding-Era Documents",
    "link": "https://www.nytimes.com/2026/01/20/arts/design/plane-america-250-archives.html",
    "summary": "The plane, organized by the National Archives, will take rare 18th-century documents around the country in a tour loosely inspired by the Bicentennial’s Freedom Train."
  },
  {
    "title": "U.S. Shifts Away From Kurdish-Led Forces in Fight Against ISIS",
    "link": "https://www.nytimes.com/2026/01/20/world/middleeast/syria-isis-camp-al-hol-kurds.html",
    "summary": "The U.S. envoy to Syria said Washington was confident the Syrian government could take over the country’s fight against the Islamic State terrorist group."
  }
]