[
  {
    "title": "Sean ‘Diddy’ Combs’s Nine Lives",
    "link": "https://www.nytimes.com/2025/07/02/arts/music/sean-combs-diddy.html",
    "summary": "For decades, he occupied a special stripe of the celebrity stratosphere. Now the man who helped turn rap into a global concern has escaped a sex-trafficking conviction."
  },
  {
    "title": "After Sean ‘Diddy’ Combs Verdict, the Testimony of Cassie and ‘Jane’ Lingers",
    "link": "https://www.nytimes.com/2025/07/02/arts/music/sean-combs-verdict-cassie-jane-testimony.html",
    "summary": "Two of Mr. Combs’s former girlfriends gave days of harrowing testimony of abuse, but jurors weren’t convinced those experiences with escorts were sex trafficking."
  },
  {
    "title": "Will House Conservatives Cave Again on Trump’s Big Bill?",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/trump-conservatives-bill.html",
    "summary": "Fiscal hawks have repeatedly threatened to bring down their party’s agenda out of debt fears, only to back down after pressure from party leaders and President Trump."
  },
  {
    "title": "Inside Trump’s Charm Offensive as He Woos Holdout Republicans",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/trump-bill-holdout-republicans.html",
    "summary": "President Trump worked the phones and welcomed Republicans to the White House to cajole them into supporting his megabill. They left with signed merchandise and photos of the Oval Office."
  },
  {
    "title": "Bryan Kohberger Pleads Guilty to Killing 4 Idaho Students",
    "link": "https://www.nytimes.com/2025/07/02/us/idaho-murders-kohberger-plea.html",
    "summary": "Bryan Kohberger pleaded guilty to the 2022 murders that shook the University of Idaho campus. Under a plea agreement, he avoids the death penalty."
  },
  {
    "title": "The Serial Killer Expert Who Taught Bryan Kohberger",
    "link": "https://www.nytimes.com/2025/07/02/us/kohberger-serial-killer-teacher-ramsland.html",
    "summary": "Dr. Katherine Ramsland was Bryan Kohberger’s professor before he moved to the Pacific Northwest, where he is expected to plead guilty to killing four University of Idaho students."
  },
  {
    "title": "Justice Dept. Explores Using Criminal Charges Against Election Officials",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/justice-department-election-data.html",
    "summary": "Such a path could drastically raise the stakes for federal investigations of state or county officials, bringing the department and the threat of criminalization into the election system."
  },
  {
    "title": "Top F.D.A. Official Overrode Scientists on Covid Shots",
    "link": "https://www.nytimes.com/2025/07/02/health/fda-covid-vaccines.html",
    "summary": "Records show that a top U.S. regulator rejected the recommendations of agency experts and limited the use of Covid vaccines."
  },
  {
    "title": "C.I.A. Says Its Leaders Rushed Report on Russia Interference in 2016 Vote",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/russia-trump-2016-election.html",
    "summary": "But the new review of the earlier assessment does not dispute the conclusion that Russia favored the election of Donald J. Trump."
  },
  {
    "title": "Somebody Explain Why Everybody Loves Phil Rosenthal",
    "link": "https://www.nytimes.com/2025/07/02/dining/somebody-feed-phil-rosenthal.html",
    "summary": "The host of “Somebody Feed Phil” and creator of “Everybody Loves Raymond” has become a global star with little more than fun-guy charm. That’s enough."
  },
  {
    "title": "Abrego Garcia Was Beaten and Tortured in El Salvador Prison, Lawyers Say",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/kilmar-abrego-garcia-el-salvador-trump-deportation.html",
    "summary": "Kilmar Armando Abrego Garcia was made to kneel overnight, denied bathroom access and confined in an overcrowded cell with bright lights and no windows, his lawyers say."
  },
  {
    "title": "Illegal Border Crossings Plunge to Lowest Level in Decades",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/border-crossings-trump.html",
    "summary": "Border Patrol agents made just over 6,000 arrests in June, according to government figures, a sign that President Trump’s hard-line immigration policies are working to keep people out."
  },
  {
    "title": "What the Supreme Court’s Birthright Ruling Means for Trump’s Power",
    "link": "https://www.nytimes.com/video/us/politics/100000010259478/what-the-supreme-courts-birthright-ruling-means-for-trumps-power.html",
    "summary": "A recent Supreme Court ruling could allow President Trump’s order ending birthright citizenship to go into effect in some states. Abbie VanSickle, a reporter covering the United States Supreme Court for The New York Times, explains how the decision also upends the power of federal judges to freeze policies for the entire country."
  },
  {
    "title": "Judge Rejects Trump’s Attempt to Stop Migrant Asylum Claims",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/asylum-trump.html",
    "summary": "The judge wrote that neither the Constitution nor federal immigration law gave the president the authority to “adopt an alternative immigration system.”"
  },
  {
    "title": "Trump Floats Ideas to Help Farmers and Hotel Owners Who Employ Undocumented Workers",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/trump-undocumented-immigrants-farmers-hotels.html",
    "summary": "President Trump has floated ideas about helping certain industries that rely on immigrant labor, but the White House has yet to release a concrete plan about what’s in store."
  },
  {
    "title": "Amid Warnings of Iranian Sleeper Cells, a History of Failed Plots",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/iran-threat-sleeper-cells.html",
    "summary": "For high-stakes plots like an effort to kill President Trump, Iran has turned to common criminals, raising questions about its capabilities inside the U.S."
  },
  {
    "title": "Pentagon Again Shifts Assessment of Damage to Iran’s Nuclear Program",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/iran-nuclear-us-strike-trump.html",
    "summary": "The appraisal that Iran’s nuclear hopes had been set back 1 to 2 years by U.S. and Israeli bombings was the latest in a shifting series of pronouncements."
  },
  {
    "title": "Paramount’s Settlement With Trump Is a Humbling Moment for ’60 Minutes’",
    "link": "https://www.nytimes.com/2025/07/02/business/media/trump-paramount-cbs-60-minutes-lawsuit.html",
    "summary": "After an astonishing concession to a sitting president, the country’s most popular television news program faces the prospect of new ownership and a chilled environment for the First Amendment."
  },
  {
    "title": "He’s Ringo. And Nobody Else Is.",
    "link": "https://www.nytimes.com/2025/07/02/arts/music/ringo-starr-interview.html",
    "summary": "As he turns 85, one of the last surviving Beatles is still musically curious, dispensing his signature wisdom, and preaching the gospel of peace and love."
  },
  {
    "title": "Pentagon Is Reviewing Which Countries Receive U.S. Weapons",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/pentagon-weapons-review.html",
    "summary": "President Trump’s decision to pause the delivery of some air defense interceptors and precision-guided munitions to Ukraine is part of a broader effort."
  },
  {
    "title": "Mamdani Says Trump Is Attacking Him to Divert Focus From G.O.P. Agenda",
    "link": "https://www.nytimes.com/2025/07/02/nyregion/mamdani-trump.html",
    "summary": "Zohran Mamdani, the Democratic nominee for mayor of New York City, has been targeted by the president and other Republicans since his success in the primary."
  },
  {
    "title": "A Potential Mamdani Mayorship Strikes Fear in the Real Estate Industry",
    "link": "https://www.nytimes.com/2025/07/02/realestate/mamdani-rent-freeze-real-estate.html",
    "summary": "The Democratic nominee has called for freezing the rent on a million apartments."
  },
  {
    "title": "The Real Impact of the Supreme Court’s Planned Parenthood Decision",
    "link": "https://www.nytimes.com/2025/07/02/opinion/planned-parenthood-supreme-court-decision.html",
    "summary": "The case was about much more than abortion."
  },
  {
    "title": "10 Ways of Making Sense of Zohran Mamdani’s Win",
    "link": "https://www.nytimes.com/2025/07/02/opinion/zohran-mamdani-democrats-trump.html",
    "summary": "New York City’s surprising primary result has ramifications for the whole country."
  },
  {
    "title": "Combs Was Acquitted of the Most Serious Charges Against Him",
    "link": "https://www.nytimes.com/2025/07/02/briefing/sean-combs-verdict-trump-bill-house.html",
    "summary": "Also, House Republicans were divided over the party’s big policy bill. Here’s the latest at the end of Wednesday."
  },
  {
    "title": "Skydiving Plane With 15 Aboard Crashes on Takeoff in New Jersey",
    "link": "https://www.nytimes.com/2025/07/02/nyregion/plane-crash-new-jersey-cross-keys.html",
    "summary": "The plane, a Cessna 208B, went off the end of a runway as it was taking off from a small airport in Gloucester County, according to the F.A.A. Victims were being treated at the scene, officials said."
  },
  {
    "title": "454 Hints That a Chatbot Wrote Part of a Biomedical Researcher’s Paper",
    "link": "https://www.nytimes.com/2025/07/02/health/ai-chatgpt-research-papers.html",
    "summary": "Scientists show that the frequency of a set of words seems to have increased in published study abstracts since ChatGPT was released into the world."
  },
  {
    "title": "Chicago Suburb Will Buy Pope Leo XIV’s Boyhood Home",
    "link": "https://www.nytimes.com/2025/07/02/us/pope-leo-chicago-childhood-home.html",
    "summary": "Officials in Dolton, Ill., called the purchase a rare opportunity. But some residents questioned whether the village, grappling with a deficit and potholes, could afford it."
  },
  {
    "title": "7 Missing After Fireworks Warehouse Explodes in Northern California",
    "link": "https://www.nytimes.com/2025/07/02/us/fireworks-warehouse-explosion-esparto-california.html",
    "summary": "The cause of the explosion in Esparto, Calif., remained unclear. Two people were injured, and a one-mile evacuation order was still in effect on Wednesday afternoon, officials said."
  }
]