[
  {
    "title": "Hundreds of Minnesota Businesses on Strike in Protest Against ICE",
    "link": "https://www.nytimes.com/2026/01/23/us/minnesota-businesses-protest-ice.html",
    "summary": "Thousands of protesters shut down streets throughout Minneapolis-St. Paul to demand that federal immigration agents end their weekslong crackdown. Businesses closed in solidarity."
  },
  {
    "title": "FBI Agent Resigns After Trying to Investigate ICE Officer in Renee Good Shooting",
    "link": "https://www.nytimes.com/2026/01/23/us/fbi-agent-ice-shooting-renee-good.html",
    "summary": "The resignation of the agent, Tracee Mergen, was only the latest shock wave to have emerged from the Justice Department’s handling of the shooting of Renee Good."
  },
  {
    "title": "Are Republicans Growing a Little Uneasy About the ICE Raids?",
    "link": "https://www.nytimes.com/2026/01/23/us/politics/ice-immigration-republicans-voters.html",
    "summary": "Polls, careful remarks from JD Vance and chats with voters all point to some wariness."
  },
  {
    "title": "Winter Storm Forecast: Where the Ice Could Hit Worst",
    "link": "https://www.nytimes.com/2026/01/23/weather/winter-storm-ice-tennessee-carolina-mississippi.html",
    "summary": "Even a little ice can be far more dangerous than snow in some places."
  },
  {
    "title": "Trump’s Turnabout on Greenland Shows the Limits of His Coercive Powers",
    "link": "https://www.nytimes.com/2026/01/23/us/politics/trumps-greenland-power.html",
    "summary": "President Trump’s faith in his ability to wring concessions by taking maximalist positions was on full display this week. So were the costs, as he splintered NATO and then undercut his credibility by climbing down from his threats."
  },
  {
    "title": "Prime Minister Mette Frederiksen of Denmark Visits Greenland",
    "link": "https://www.nytimes.com/2026/01/23/world/europe/denmark-greenland-prime-minister-trump.html",
    "summary": "The trip by Prime Minister Mette Frederiksen to the Danish territory came amid pressure from President Trump and appeared to have been meant as reassurance to Greenlanders."
  },
  {
    "title": "Trump’s Push to Take Greenland Holds Promise and Peril for Putin",
    "link": "https://www.nytimes.com/2026/01/23/world/europe/trump-putin-russia-us-greenland.html",
    "summary": "If the United States under President Trump starts acting as if it’s Russia, where does that leave President Vladimir V. Putin?"
  },
  {
    "title": "Trump Wants to Build More U.S. Military Bases in Greenland. How Many Are There Now?",
    "link": "https://www.nytimes.com/2026/01/23/world/europe/trump-greenland-military-bases.html",
    "summary": "The U.S. once maintained more than a dozen. Now it has one. President Trump wants more."
  },
  {
    "title": "At March for Life, Some Abortion Opponents Want More From Trump",
    "link": "https://www.nytimes.com/2026/01/23/us/march-for-life-trump-vance.html",
    "summary": "At the March for Life, Vice President JD Vance acknowledged “a fear that some of you have that not enough progress has been made.”"
  },
  {
    "title": "Renée Fleming Won’t Perform at Kennedy Center Concerts",
    "link": "https://www.nytimes.com/2026/01/23/arts/music/renee-fleming-kennedy-center.html",
    "summary": "The soprano, who previously resigned as an artistic adviser, was scheduled to sing with the National Symphony Orchestra in May."
  },
  {
    "title": "U.S. Says First Boat Strike Since Maduro’s Capture Killed 2 in Eastern Pacific",
    "link": "https://www.nytimes.com/2026/01/23/us/politics/boat-strike-pacific.html",
    "summary": "The U.S. Southern Command said it had asked the Coast Guard to search for one survivor."
  },
  {
    "title": "An Unlikely Source of Crypto Innovation: Afghanistan",
    "link": "https://www.nytimes.com/2026/01/24/world/asia/crypto-innovation-afghanistan.html",
    "summary": "The repressive Taliban government is suspicious of the internet. But a start-up in the country is building blockchain-based tools to transform humanitarian aid."
  },
  {
    "title": "Colorado Authorities Confirm Suicide by Hunter S. Thompson",
    "link": "https://www.nytimes.com/2026/01/23/us/hunter-s-thompson-suicide.html",
    "summary": "After a monthslong review, investigators have concluded that “all speculative theories could not be substantiated.”"
  },
  {
    "title": "TikTok Updates Its Terms and Conditions in the U.S.",
    "link": "https://www.nytimes.com/2026/01/23/business/media/tiktok-us-terms-conditions.html",
    "summary": "The changes came after the app’s Chinese parent company spun out an American entity to run TikTok in the United States."
  },
  {
    "title": "Ryan Wedding, Canadian Ex-Snowboarder Accused of Running Drug Ring, Is Arrested",
    "link": "https://www.nytimes.com/2026/01/23/world/canada/ryan-wedding-arrest.html",
    "summary": "Ryan Wedding, 44, who competed in snowboarding in the 2002 Winter Olympics, has been charged with murder and smuggling cocaine into the United States."
  },
  {
    "title": "5 Arrested in Shooting of Indiana Judge Steven Meyer and His Wife",
    "link": "https://www.nytimes.com/2026/01/23/us/indiana-judge-steven-meyer-shooting-arrests.html",
    "summary": "The police said the attack was part of a plot to kill Judge Steven Meyer to halt a trial he was to conduct. He and his wife were injured but are recovering."
  },
  {
    "title": "John Brodie, Former Star Quarterback for the 49ers, Dies at 90",
    "link": "https://www.nytimes.com/2026/01/24/obituaries/john-brodie-dead.html",
    "summary": "The longtime San Francisco star endured years of frustration before emerging as the N.F.L.’s most valuable player."
  },
  {
    "title": "Towering Snowdrifts Bury City on Remote Russian Peninsula",
    "link": "https://www.nytimes.com/2026/01/23/weather/russia-city-snow-buried-kamchatka-petropavlovsk.html",
    "summary": "It’s the biggest snowfall the Kamchatka Peninsula has experienced in nearly 60 years."
  },
  {
    "title": "Is This Who Trump Meant by the ‘Worst of the Worst’?",
    "link": "https://www.nytimes.com/video/opinion/100000010664980/is-this-who-trump-meant-by-the-worst-of-the-worst.html",
    "summary": "The columnist Jamelle Bouie argues that the Trump administration’s immigration policy has more in common with ethnic cleansing than actual immigration enforcement."
  },
  {
    "title": "The Trump Crackup",
    "link": "https://www.nytimes.com/2026/01/23/opinion/trump-authoritarian-power.html",
    "summary": "Events are being propelled by one man’s damaged psyche."
  },
  {
    "title": "For His Next Act, Darren Walker Is Heading to Hollywood",
    "link": "https://www.nytimes.com/2026/01/23/arts/design/darren-walker-anonymous-content.html",
    "summary": "Anonymous Content, a production company whose top investor is Laurene Powell Jobs’s Emerson Collective, has named Darren Walker as president and chief executive."
  },
  {
    "title": "Couple Receive $200,000 Settlement After ‘Pungent’ Indian Food Complaint",
    "link": "https://www.nytimes.com/2026/01/23/us/palak-paneer-indian-food-racism-settlement.html",
    "summary": "The University of Colorado, Boulder, denied liability in the civil rights lawsuit, which the couple filed after a comment about a dish that one of them was heating in an office microwave."
  },
  {
    "title": "What Happened At the Funeral For Fashion Designer Valentino",
    "link": "https://www.nytimes.com/2026/01/23/world/europe/valentino-funeral.html",
    "summary": "The designer Valentino Garavani, who died on Monday at 93, was celebrated in Rome, a city that he “embodied,” according to its mayor."
  }
]