[
  {
    "title": "Judge Questions Gregory Bovino Over Immigration Crackdown Tactics",
    "link": "https://www.nytimes.com/2025/10/28/us/chicago-bovino-tear-gas.html",
    "summary": "Gregory Bovino, a Border Patrol official who has become a public face of President Trump’s crackdown, was ordered to give the federal judge a daily report on the actions of his team from now on."
  },
  {
    "title": "Federal Union’s Demand to End Shutdown Fails to Sway Democrats",
    "link": "https://www.nytimes.com/2025/10/28/us/politics/afge-federal-workers-union-shutdown.html",
    "summary": "Senate Republicans cited a call by the American Federation of Government Employees to pass a funding extension in an attempt to pressure Democrats to relent. The effort fell flat."
  },
  {
    "title": "Trump Says He Is Prepared to Send ‘More Than the National Guard’ Into U.S. Cities",
    "link": "https://www.nytimes.com/2025/10/28/us/politics/trump-japan-national-guard-us-cities.html",
    "summary": "In a speech to American troops assembled in Japan on Tuesday, President Trump said he would escalate his orders to active-duty branches of the military if he decides it is appropriate."
  },
  {
    "title": "Mike Johnson Dismisses Trump Third Term Talk — But Applauds the ‘Trolling’",
    "link": "https://www.nytimes.com/2025/10/28/us/politics/johnson-trump-2028-constitution.html",
    "summary": "The speaker said he did not see a path to amending the Constitution to allow the president to seek a third term, but that it was fun to pretend he could to inflame Democrats."
  },
  {
    "title": "Scenes From the Caribbean as Hurricane Melissa Hits",
    "link": "https://www.nytimes.com/2025/10/28/weather/hurricane-melissa-caribbean-photos-video.html",
    "summary": "The system made landfall in Jamaica on Tuesday afternoon, causing widespread flooding and destruction."
  },
  {
    "title": "Cuba Is No Stranger to Hurricanes",
    "link": "https://www.nytimes.com/2025/10/28/weather/hurricane-melissa-landfall-cuba.html",
    "summary": "In the last 25 years, a total of 10 major hurricanes have lashed the island. “Cuba is right in the center of things,” a weather historian said."
  },
  {
    "title": "Official’s Access to F.B.I. Files in Charlie Kirk Case Drew Pushback",
    "link": "https://www.nytimes.com/2025/10/28/us/politics/fbi-files-charlie-kirk-case.html",
    "summary": "An inquiry by Joe Kent, who leads the National Counterterrorism Center, is said to have alarmed Kash Patel, the F.B.I. director."
  },
  {
    "title": "After Charlie Kirk’s Death, Brilyn Hollyhand Steps Into the Ring",
    "link": "https://www.nytimes.com/2025/10/28/style/brilyn-hollyhand-charlie-kirk-young-republicans.html",
    "summary": "In a crowded field of would-be successors, Brilyn Hollyhand hopes to capture the minds of young conservatives across America."
  },
  {
    "title": "Netanyahu Orders Strikes in Gaza, as Israel Says Hamas Violated Cease-Fire",
    "link": "https://www.nytimes.com/2025/10/28/world/middleeast/israel-gaza-netanyahu-strikes.html",
    "summary": "The office of the Israeli prime minister said Tuesday evening that he had ordered “forceful strikes,” accusing Hamas of firing on Israeli troops and failing to return hostages’ bodies."
  },
  {
    "title": "A Twist in the Candy Cane Park Murder Investigation in Oregon",
    "link": "https://www.nytimes.com/2025/10/28/us/trump-cuts-candy-cane-park-killing-oregon.html",
    "summary": "An unlikely twist in the investigation of a killing in 1983 that still haunts a small town in Oregon."
  },
  {
    "title": "What Zohran Mamdani Learned as an Africana Studies Major at Bowdoin",
    "link": "https://www.nytimes.com/2025/10/28/us/politics/zohran-mamdani-bowdoin-college-new-york-mayor-election.html",
    "summary": "The mayoral candidate has said his education was formative. But critics say that his degree exemplifies how colleges steep students in leftist dogma."
  },
  {
    "title": "‘The Beginning of a Movement’: Snapshots From a Mamdani Rally",
    "link": "https://www.nytimes.com/2025/10/28/nyregion/photos-mamdani-aoc-bernie-rally.html",
    "summary": "Zohran Mamdani’s rally on Sunday nearly filled Forest Hills Stadium in Queens, which holds 13,000 attendees. Here’s why some of them went, in their own words."
  },
  {
    "title": "Is the Mayor’s Race Tightening?",
    "link": "https://www.nytimes.com/2025/10/28/nyregion/nyc-mayor-election-mamdani-cuomo-polls.html",
    "summary": "The candidates make their last push for undecided New Yorkers with early voting underway."
  },
  {
    "title": "North Korea Conducts Missile Test Ahead of Trump Visit to South",
    "link": "https://www.nytimes.com/2025/10/28/world/asia/north-korea-kim-missile-trump.html",
    "summary": "The country has yet to respond to President Trump’s overtures to meet again with Kim Jong-un, its leader."
  },
  {
    "title": "South Korea’s Gyeongju Scrambles to Host Trump, Xi and More Leaders at APEC",
    "link": "https://www.nytimes.com/2025/10/28/world/asia/south-korea-gyeongju-apec-hosting.html",
    "summary": "The authorities have been scrambling to accommodate this year’s Asia-Pacific Economic Cooperation forum in Gyeongju, which is known for tombs, temples and pagodas."
  },
  {
    "title": "48 Hours Without A.I.",
    "link": "https://www.nytimes.com/2025/10/28/style/48-hours-without-ai.html",
    "summary": "It’s everywhere, as the author learned the hard way while making as little contact as possible with machine learning and generative artificial intelligence."
  },
  {
    "title": "OpenAI Restructures as For-Profit Company",
    "link": "https://www.nytimes.com/2025/10/28/technology/openai-restructure-for-profit-company.html",
    "summary": "The artificial intelligence company said the nonprofit that controlled the organization would receive a $130 billion stake in the new company."
  },
  {
    "title": "Can a Start-Up Make Computer Chips Cheaper Than the Industry’s Giants?",
    "link": "https://www.nytimes.com/2025/10/28/business/can-a-start-up-make-computer-chips-cheaper-than-the-industrys-giants.html",
    "summary": "Substrate, a San Francisco company, is trying to take on powerhouses like the Dutch company ASML."
  },
  {
    "title": "At Least 64 Dead in Rio de Janeiro as Brazilian Police Crack Down on Drug Gangs",
    "link": "https://www.nytimes.com/2025/10/28/world/brazil-rio-de-janeiro-police-drug-raids-deaths.html",
    "summary": "The authorities said the deadliest operation in Rio’s history had killed four police officers and at least 60 other people. It was an attack on “narco-terrorists,” the state governor said."
  },
  {
    "title": "Jewish Heirs Sue the Met, Saying a van Gogh It Sold Was Nazi Loot",
    "link": "https://www.nytimes.com/2025/10/28/arts/design/jewish-heirs-sue-met-van-gogh-nazi-loot.html",
    "summary": "The museum says it had no idea at the time, but the heirs say the Met curator who bought and sold the work, a former U.S. Army specialist on looting, should have known better."
  },
  {
    "title": "It’s Easier Than Ever to Turn Your Dial to a Live Event",
    "link": "https://www.nytimes.com/2025/10/28/business/media/broadcast-tv-live-events.html",
    "summary": "Broadcast TV continues to draw big audiences. And they are increasingly getting special events, award shows and sports — lots of sports."
  },
  {
    "title": "Josh Hawley: We Cannot Let 42 Million Americans Go Hungry",
    "link": "https://www.nytimes.com/2025/10/28/opinion/josh-hawley-snap.html",
    "summary": "Congress must prevent Americans from losing food assistance."
  },
  {
    "title": "Adelita Grijalva Just Wants to Get to Work. The House Speaker Won’t Let Her.",
    "link": "https://www.nytimes.com/2025/10/28/opinion/grijalva-congress-mike-johnson.html",
    "summary": "Mike Johnson, the speaker, won’t swear in the Democratic representative-elect from Arizona."
  },
  {
    "title": "Hurricane Melissa Hit Jamaica With Devastating Force",
    "link": "https://www.nytimes.com/2025/10/28/briefing/hurricane-melissa-jamaica-misty-copeland.html",
    "summary": "Also, the U.S. attacked four more boats. Here’s the latest at the end of Tuesday."
  },
  {
    "title": "F.C.C. Changes Course on the Price of Prisoners’ Phone Calls",
    "link": "https://www.nytimes.com/2025/10/28/upshot/prisoners-phone-calls-prices.html",
    "summary": "Brendan Carr, the F.C.C. chairman, cited security concerns in rolling back most of the lower costs he voted for last year."
  },
  {
    "title": "Midair Fork Attack Forces International Flight to Divert to Boston",
    "link": "https://www.nytimes.com/2025/10/28/us/plane-fork-attack-boston.html",
    "summary": "A 28-year-old man stabbed two teenagers during a flight from Chicago to Frankfurt, according to federal prosecutors."
  },
  {
    "title": "UPS Has Already Cut 48,000 Workers This Year",
    "link": "https://www.nytimes.com/2025/10/28/business/ups-layoffs-48000-workers-this-year.html",
    "summary": "About 70 percent of the layoffs affected drivers and warehouse workers, the delivery company said."
  },
  {
    "title": "A 17th-Century Crypt Shines a Light on Milan’s Most Impoverished",
    "link": "https://www.nytimes.com/2025/10/28/science/archaeology-milan-crypt.html",
    "summary": "In Milan, bones that piled under a hospital over a half-century shed light on the health and habits of some of the Renaissance era’s most impoverished people."
  }
]