[
  {
    "title": "Murky Pledges of Investment Cast Shadow on Trump’s Trade Deals",
    "link": "https://www.nytimes.com/2025/07/31/business/trump-japan-south-korea-investment.html",
    "summary": "Recent global trade deals with the United States were secured with huge, often vaguely defined investment pledges from partners like Japan."
  },
  {
    "title": "How India Became One of the Biggest Buyers of Russian Oil",
    "link": "https://www.nytimes.com/2025/07/31/business/india-russia-oil-trump.html",
    "summary": "President Trump upended trade negotiations with India by making the purchase of crude oil a sticking point."
  },
  {
    "title": "Appeals Court Hears Legal Challenge to Trump Tariffs as Trade War Widens",
    "link": "https://www.nytimes.com/2025/07/31/business/trump-tariffs-lawsuit-court-appeal.html",
    "summary": "The arguments underscored the financial stakes for U.S. importers as the Trump administration prepares to impose higher rates without the explicit approval of Congress."
  },
  {
    "title": "Anger Over Starvation in Gaza Leaves Israel Increasingly Isolated",
    "link": "https://www.nytimes.com/2025/07/31/world/middleeast/gaza-starvation-aid-israel-netanyahu.html",
    "summary": "Global outrage at the Netanyahu government’s actions has grown since the war began, and the suffering of children in the enclave has accelerated the disdain."
  },
  {
    "title": "Amid Scramble for Food, Prices in Gaza Reach Extraordinary Heights",
    "link": "https://www.nytimes.com/2025/07/31/world/middleeast/gaza-market-prices-flour.html",
    "summary": "Obtaining humanitarian aid can be difficult and dangerous, and though some essentials are available at markets, they are prohibitively expensive for many Gazans."
  },
  {
    "title": "Witkoff Plans Visit to Gaza to See Hunger Crisis",
    "link": "https://www.nytimes.com/2025/07/31/world/middleeast/witkoff-israel-gaza-trump.html",
    "summary": "Steve Witkoff met with Prime Minister Benjamin Netanyahu and was expected to visit an aid distribution site in Gaza, as desperation there widens."
  },
  {
    "title": "What Countries Recognize a Palestinian State: A Map",
    "link": "https://www.nytimes.com/2025/07/30/world/middleeast/palestinian-state-recognition-maps.html",
    "summary": "In the past week alone, three new countries have said they are ready to bestow recognition on a Palestinian state."
  },
  {
    "title": "Virginia Giuffre’s Family Responds to Trump’s Claim That Epstein ‘Stole’ Her",
    "link": "https://www.nytimes.com/2025/07/31/us/politics/virginia-giuffre-family-trump-epstein.html",
    "summary": "President Trump’s remarks raised questions about his knowledge of the crimes committed by Jeffrey Epstein and his associate Ghislaine Maxwell, the family said in a statement."
  },
  {
    "title": "Trump Taps Climate Skeptics to Attack Science on Global Warming",
    "link": "https://www.nytimes.com/2025/07/31/climate/trump-climate-skeptics-science-report.html",
    "summary": "The agency asked five climate skeptics to write a report criticizing the consensus on global warming. Scientists are pointing out its errors."
  },
  {
    "title": "Legal Watchdog Files Bar Complaints Against Justice Dept. Lawyers",
    "link": "https://www.nytimes.com/2025/07/31/us/politics/justice-department-lawyers-complaint.html",
    "summary": "The move represented a rare attempt to seek accountability for rank-and-file lawyers who have represented the Trump administration in court."
  },
  {
    "title": "Key Inflation Measure Rose in June, Adding to Pressure on Fed",
    "link": "https://www.nytimes.com/2025/07/31/business/pce-inflation-fed.html",
    "summary": "The price index was the latest indication that President Trump’s tariffs are beginning to show up in consumer prices."
  },
  {
    "title": "County Emergency Official Says He Was Ill and Sleeping as Texas Floods Hit",
    "link": "https://www.nytimes.com/2025/07/31/us/politics/texas-floods-hearing.html",
    "summary": "At a hearing in hard-hit Kerr County, an emergency management coordinator for the first time explained his whereabouts when the Guadalupe River burst its banks."
  },
  {
    "title": "Trisomy 18 Was Once Seen as Too Lethal to Treat. Some Kids Are Now Surviving.",
    "link": "https://www.nytimes.com/2025/07/31/magazine/trisomy-18-edwards-syndrome-baby-treatment-care.html",
    "summary": "Trisomy 18 is normally fatal within weeks of birth. But some parents are getting more time — with surgeries, luck and an incredible amount of effort."
  },
  {
    "title": "She Came Face to Face With the Park Avenue Gunman and Survived",
    "link": "https://www.nytimes.com/2025/07/31/nyregion/park-avenue-shooting-sebije-nelovic.html",
    "summary": "Sebije Nelovic, who has cleaned the Manhattan office building that was the site of the shooting for 27 years, was dusting a table that Monday evening. Then she heard gunfire."
  },
  {
    "title": "Trump Tells Russian Official to ‘Watch His Words,’ but He Bites Back Instead",
    "link": "https://www.nytimes.com/2025/07/31/world/europe/trump-medvedev-russia.html",
    "summary": "The former Russian president Dmitri Medvedev offers President Trump a useful foil to criticize without rebuking Vladimir Putin, one analyst said."
  },
  {
    "title": "The California Governor’s Race Was in Limbo. Now It’s Wide Open.",
    "link": "https://www.nytimes.com/2025/07/31/us/harris-california-governors-race.html",
    "summary": "Until she decided not to run, former Vice President Kamala Harris had loomed over the race as a likely favorite. Now, a host of hopefuls are jockeying for advantage."
  },
  {
    "title": "Kamala Harris Sells a Memoir About the 2024 Campaign",
    "link": "https://www.nytimes.com/2025/07/31/books/kamala-harris-campaign-memoir-107-days.html",
    "summary": "The former vice president has written a book about her run for president in 2024. It will come out next month."
  },
  {
    "title": "A.I. Researchers Are Negotiating $250 Million Pay Packages. Just Like NBA Stars.",
    "link": "https://www.nytimes.com/2025/07/31/technology/ai-researchers-nba-stars.html",
    "summary": "A.I. technologists are approaching the job market as if they were Steph Curry or LeBron James, seeking advice from their entourages and playing hardball with the highest bidders."
  },
  {
    "title": "Nvidia Chips Are Front and Center in China at Crucial Moment in the A.I. Race",
    "link": "https://www.nytimes.com/2025/07/31/technology/china-ai-nvidia-chips.html",
    "summary": "Chinese companies showcased A.I. gains in Shanghai this week. More chips will only help them improve faster, industry insiders say."
  },
  {
    "title": "A Trump Ally Pressed for a Mexican Citizen’s Release from ICE Custody",
    "link": "https://www.nytimes.com/2025/07/31/us/politics/ice-marine-wife-senator-kennedy.html",
    "summary": "The office of Senator John Kennedy of Louisiana asked the Department of Homeland Security to release the detainee, who is married to a U.S. Marine Corps veteran."
  },
  {
    "title": "New Implant Offers Hope for Easing Rheumatoid Arthritis",
    "link": "https://www.nytimes.com/2025/07/31/health/arthritis-implant-vagus-setpoint.html",
    "summary": "The device stimulates the vagus nerve, signaling the body to tamp down the inflammation that contributes to the disease."
  },
  {
    "title": "Trump Is Trying to Rewrite Reality",
    "link": "https://www.nytimes.com/2025/07/31/opinion/trump-gabbard-russia-hoax.html",
    "summary": "Alternative facts have become alternative realities."
  },
  {
    "title": "The Tariffs Kicked In. The Sky Didn’t Fall. Were the Economists Wrong?",
    "link": "https://www.nytimes.com/2025/07/31/opinion/tariffs-economy-inflation-recession.html",
    "summary": "Well, it’s complicated."
  },
  {
    "title": "East Coast Forecast: New York, Washington and Philadelphia Could See Heavy Rain",
    "link": "https://www.nytimes.com/2025/07/31/weather/rain-flash-flooding-warning-northeast-mid-atlantic.html",
    "summary": "Washington, D.C., Baltimore, Philadelphia and New York City could see excessive amounts of rain through Friday, forecasters warned."
  },
  {
    "title": "Man Dies After Apparent Fall From Whitney Museum",
    "link": "https://www.nytimes.com/2025/07/31/nyregion/man-dies-whitney-museum-nyc.html",
    "summary": "The 34-year-old was pronounced dead at the scene on Wednesday afternoon, the police said. The museum said it would be closed on Thursday."
  },
  {
    "title": "Dwight Muhammad Qawi, 72, Dies; Boxing Champ Got His Start in Prison",
    "link": "https://www.nytimes.com/2025/07/29/obituaries/dwight-muhammad-qawi-dead.html",
    "summary": "After joining a boxing program while incarcerated, he emerged a contender in the pro ranks, winning titles in two weight classes in the 1980s."
  }
]