[
  {
    "title": "Venezuela Oil Tanker Seized by U.S. Was Part of Effort to Finance Cuba",
    "link": "https://www.nytimes.com/2025/12/12/world/americas/venezuela-cuba-oil-tanker.html",
    "summary": "Firms with ties to Cuba are getting a larger share of Venezuelan oil exports, as the island’s security agents boost President Nicolás Maduro’s defenses."
  },
  {
    "title": "Behind the Venezuelan Opposition Leader’s Daring Escape to Oslo",
    "link": "https://www.nytimes.com/2025/12/12/us/politics/machado-venezuela-escape-oslo.html",
    "summary": "An American firm with experience in special operations spirited María Corina Machado, the recipient of the Nobel Peace Prize, out of the country in a secretive land, sea and air operation."
  },
  {
    "title": "For Rubio the Cuba Hawk, the Road to Havana Runs Through Venezuela",
    "link": "https://www.nytimes.com/2025/12/12/us/politics/rubio-cuba-venezuela.html",
    "summary": "President Trump’s secretary of state and national security adviser has long sought to cripple or topple Cuba’s government, which has close security and economic ties to Venezuela."
  },
  {
    "title": "In Trump’s Justice Dept., Failing in Court Might Be Better Than Bucking the Boss",
    "link": "https://www.nytimes.com/2025/12/12/us/politics/trump-justice-dept.html",
    "summary": "Thursday demonstrated an emerging reality for President Trump: Commanding the Justice Department is not the same as controlling the justice system."
  },
  {
    "title": "Judge’s Order Complicates Justice Dept. Plans to Again Charge Comey",
    "link": "https://www.nytimes.com/2025/12/12/us/politics/judge-comey-richman-files.html",
    "summary": "Justice Department officials have been considering whether to bring new charges against James B. Comey, the former F.B.I. director, after a different judge dismissed the original case against him."
  },
  {
    "title": "Amid Fractures on the Right, Tucker Carlson Continues His Attacks",
    "link": "https://www.nytimes.com/2025/12/12/style/tucker-carlson-theo-von-show.html",
    "summary": "On Theo Von’s show this week, Mr. Carlson lashed out at a major supporter of the president, the F.B.I. and “unimpressive, dumb, totally noncreative people” leading the nation."
  },
  {
    "title": "Colorado Officials Reject Trump’s ‘Pardon’ of a Convicted Election Denier",
    "link": "https://www.nytimes.com/2025/12/13/us/politics/trump-tina-peters.html",
    "summary": "The president’s stated intention to pardon Tina Peters, jailed for tampering with election machines in 2020, has set off a legal fight over the extent of Mr. Trump’s pardon powers."
  },
  {
    "title": "Biden Has Raised Little of What He Needs to Build a Presidential Library",
    "link": "https://www.nytimes.com/2025/12/13/us/politics/biden-presidential-library-delaware.html",
    "summary": "His library foundation has told the I.R.S. that by the end of 2027 it expects to bring in just $11.3 million — not nearly enough for a traditional presidential library."
  },
  {
    "title": "Eric Adams Swaggered Into City Hall, and Now He’s Swaggering Out",
    "link": "https://www.nytimes.com/2025/12/13/nyregion/eric-adams-interview.html",
    "summary": "Interviewed as he prepares to leave office, Mayor Eric Adams said that he hadn’t gotten the credit he deserved and that certain forces had always been arrayed against him."
  },
  {
    "title": "Clean, Limitless Energy Exists. China Is Going Big in the Race to Harness It.",
    "link": "https://www.nytimes.com/2025/12/13/climate/china-us-fusion-energy.html",
    "summary": "Beijing is pouring vast resources into fusion research, while the U.S. wants private industry to lead the way. The winner could reshape civilization."
  },
  {
    "title": "The Reasonable Majority Is No Longer Silent",
    "link": "https://www.nytimes.com/2025/12/13/opinion/trump-swing-voters-approval-rating.html",
    "summary": "Donald Trump is confronting a backlash of the reasonable."
  },
  {
    "title": "Elon Musk’s SpaceX Valued at $800 Billion, as It Prepares to Go Public",
    "link": "https://www.nytimes.com/2025/12/12/technology/elon-musk-spacex-ipo.html",
    "summary": "A sale of insider shares at $421 a share would make Mr. Musk’s rocket company the most valuable private company in the world, as it readies for a possible initial public offering next year."
  },
  {
    "title": "Can Trump’s Grand Plans for Gaza Get Off the Drawing Board?",
    "link": "https://www.nytimes.com/2025/12/13/world/middleeast/trump-gaza-plans-postwar.html",
    "summary": "The next steps for the president’s 20-point Gaza peace plan have been mired in uncertainty and a lack of detail, but that may be set to change. Here’s what to know."
  },
  {
    "title": "A Measles Outbreak Brings With It Echoes of the Pandemic",
    "link": "https://www.nytimes.com/2025/12/13/us/a-measles-outbreak-brings-with-it-echoes-of-the-pandemic.html",
    "summary": "In South Carolina, parents struggle to deal with infections that have brought quarantines and remote learning. Health care workers are bracing for an increase in cases."
  },
  {
    "title": "Record Flooding Swamps Western Washington",
    "link": "https://www.nytimes.com/2025/12/12/us/washington-flooding-rain-atmospheric-river.html",
    "summary": "Gov. Bob Ferguson and other state officials cautioned that more rainfall was expected after rivers hit record flood levels across the region, while residents worried about the long-term future."
  }
]