[
  {
    "title": "Trump and Hegseth Recount Familiar Partisan Complaints to Top Military Leaders",
    "link": "https://www.nytimes.com/2025/09/30/us/politics/trump-hegseth-military-officers.html",
    "summary": "The U.S. generals and admirals summoned from around the world had been given little information about the planned event."
  },
  {
    "title": "5 Takeaways From Trump’s Address to Top Military Leaders",
    "link": "https://www.nytimes.com/2025/09/30/us/politics/trump-speech-military-takeaways.html",
    "summary": "The president leveraged the meeting as his chance to trumpet his domestic and foreign policy moves."
  },
  {
    "title": "Trump Gave the Military’s Brass a Rehashed Speech. Until Minute 44.",
    "link": "https://www.nytimes.com/2025/09/30/us/politics/trump-military-brass-speech.html",
    "summary": "On an almost daily basis, thousands of words pour forth from the president’s mouth. Sometimes, he tucks in a wildly revealing insight about the direction he is taking the country."
  },
  {
    "title": "Hegseth Lectures Military Brass on ‘Woke’ Leaders, Fitness and Grooming",
    "link": "https://www.nytimes.com/2025/09/30/us/politics/hegseth-military-officers.html",
    "summary": "Senior officers, summoned from around the world, are entrusted to manage complex military operations. They got a lecture on fitness and grooming standards."
  },
  {
    "title": "Judge Rules Trump Unlawfully Targeted Noncitizens Over Pro-Palestinian Speech",
    "link": "https://www.nytimes.com/2025/09/30/us/politics/student-speech-palestinians-ruling.html",
    "summary": "In a blistering opinion, a federal judge in Boston said the Trump administration used the threat of deportations to systematically intimidate certain campus demonstrators into silence."
  },
  {
    "title": "In Unusual Move, Prosecutors Secure Federal Charges From Local Grand Jury",
    "link": "https://www.nytimes.com/2025/09/30/us/politics/federal-charges-grand-jury-dc.html",
    "summary": "A judge, Zia M. Faruqui, said that what appeared to be a kind of grand jury forum shopping seemed to have broken “decades-long norms and the rule of law.”"
  },
  {
    "title": "Trump Says a Deal With Harvard Is Close",
    "link": "https://www.nytimes.com/2025/09/30/us/trump-harvard-deal.html",
    "summary": "The agreement, if finalized, would follow months of grappling over federal dollars as the Trump administration pressured the university in its broader push to reshape higher education."
  },
  {
    "title": "Harvard Blasts Administration Over ‘Distorted’ Civil Rights Investigation",
    "link": "https://www.nytimes.com/2025/09/30/us/politics/harvard-response-trump.html",
    "summary": "The Sept. 19 letter came days before the Department of Health and Human Services started the process of cutting off federal funds to the university."
  },
  {
    "title": "Judge Disqualifies Nevada’s Acting U.S. Attorney From Handling Cases",
    "link": "https://www.nytimes.com/2025/09/30/us/nevada-acting-us-attorney-chattah-disqualified.html",
    "summary": "A federal judge said Sigal Chattah was not “validly serving as acting U.S. attorney.” The Trump administration had appointed her to the post in a way that circumvented federal procedures."
  },
  {
    "title": "Trump Announces Pfizer Deal to Lower Some Drug Prices and Unveils TrumpRx Website",
    "link": "https://www.nytimes.com/2025/09/30/health/trump-pfizer-trumprx-medications.html",
    "summary": "The administration also announced it will create a website, TrumpRx, that will help consumers buy drugs directly from manufacturers."
  },
  {
    "title": "Trump Administration Moves to Relax Rules on Hydrofluorocarbons",
    "link": "https://www.nytimes.com/2025/09/30/climate/trump-hydrofluorocarbons-hfcs.html",
    "summary": "The E.P.A. plan would allow grocery stores, air-conditioning manufacturers and others to phase out hydrofluorocarbons in cooling equipment more slowly."
  },
  {
    "title": "Trump Cuts to Counterterrorism Funds for New York Reach $187 Million",
    "link": "https://www.nytimes.com/2025/09/30/nyregion/terrorism-funds-hochul-noem.html",
    "summary": "Gov. Kathy Hochul of New York asked that the funding be restored, accusing the Trump administration of “walking away from the fight against terrorism.”"
  },
  {
    "title": "Release of Democrat’s Naval Record Scrambles a Tight Governor’s Race",
    "link": "https://www.nytimes.com/2025/09/30/nyregion/nj-governors-race-naval-academy-cheating-scandal.html",
    "summary": "In the New Jersey governor’s race, Mikie Sherrill, the Democrat, is locked in a bitter battle with Jack Ciattarelli, the Republican, over the release of records tied to her military service."
  },
  {
    "title": "The Artist Who Lived in a Cage For a Year",
    "link": "https://www.nytimes.com/2025/09/30/arts/design/artist-cage-dia.html",
    "summary": "At Dia Beacon, a retrospective looks at the career of Tehching Hsieh, whose yearlong performance art pieces were some of the most grueling the medium has ever seen."
  },
  {
    "title": "Scores Accused of Immigration Fraud in Federal Sweep in Minnesota",
    "link": "https://www.nytimes.com/2025/09/30/us/politics/immigration-fraud-minnesota.html",
    "summary": "The investigation is the “first of many” targeted at U.S. cities, said Joseph B. Edlow, the director of U.S.C.I.S."
  },
  {
    "title": "Full Federal Appeals Court to Hear Alien Enemies Act Case",
    "link": "https://www.nytimes.com/2025/09/30/us/politics/appeals-court-alien-enemies-act.html",
    "summary": "The decision vacated a finding by a panel of the court’s judges regarding President Trump’s use of the Alien Enemies Act to deport immigrants, but did not clear the way for such expulsions to resume."
  },
  {
    "title": "Earthquake in Philippines Kills at Least 20, Officials Say",
    "link": "https://www.nytimes.com/2025/09/30/world/asia/philippines-earthquake-cebu.html",
    "summary": "The magnitude 6.9 earthquake shook the province of Cebu, home to 3.2 million people, just before 10 p.m. local time."
  },
  {
    "title": "A.I. Fighter Jets and Cockroach Spies: Inside the Changing Business of War",
    "link": "https://www.nytimes.com/2025/09/30/business/economy/defense-spending-startups.html",
    "summary": "Russia’s war on Ukraine changed the course of a generation of start-ups and investors that have applied a new business model to Europe’s military buildup."
  },
  {
    "title": "Russia’s Military Budget Shrinks as War Costs Hit Kremlin’s Economic Limits",
    "link": "https://www.nytimes.com/2025/09/30/world/europe/russia-budget-military.html",
    "summary": "The budget indicates that Russia will continue to fight largely as it has, locking it in a grinding war of attrition."
  },
  {
    "title": "The Looming Shutdown Is About Obamacare",
    "link": "https://www.nytimes.com/2025/09/30/opinion/government-shutdown-republican-obamacare.html",
    "summary": "What the looming shutdown is really about: Republicans trying to repeal Obamacare."
  },
  {
    "title": "Trump’s Generals Speech Was Political Theater",
    "link": "https://www.nytimes.com/2025/09/30/opinion/trump-hegseth-generals-speech.html",
    "summary": "The military was again used as a backdrop for Trump’s clashes in America’s culture wars, testing the armed services’ nonpartisan, apolitical nature."
  },
  {
    "title": "The Government Nears a Shutdown",
    "link": "https://www.nytimes.com/2025/09/30/briefing/the-government-nears-a-shutdown.html",
    "summary": "Also, the military’s top brass gathered for an unusual meeting. Here’s the latest at the end of Tuesday."
  },
  {
    "title": "The Activists and the Anime",
    "link": "https://www.nytimes.com/2025/09/30/world/anime-protests-flag-moldova-nepal-indonesia-gaza.html",
    "summary": "We take a closer look at Gen Z protests raging against the political establishment, from Nepal to Madagascar."
  },
  {
    "title": "Long Covid Risk for Children Doubles After a Second Infection, Study Finds",
    "link": "https://www.nytimes.com/2025/09/30/health/long-covid-children.html",
    "summary": "The new research provides evidence that Covid reinfections can increase the risk of long-term health consequences."
  },
  {
    "title": "Nicole Kidman Files for Divorce From Keith Urban After Nearly 20 Years",
    "link": "https://www.nytimes.com/2025/09/30/arts/nicole-kidman-keith-urban-divorce.html",
    "summary": "The couple married in Australia in 2006. Their breakup surprised many fans."
  },
  {
    "title": "How Zohran Mamdani Built a Campaign Around Food",
    "link": "https://www.nytimes.com/2025/09/30/dining/zohran-mamdani-nyc-mayor-food.html",
    "summary": "The front-runner for New York mayor is leveraging his lifelong love of eating to inform his policy plans and spread his message."
  },
  {
    "title": "Thomas Perry Dies at 78; Writer of Popular, Unconventional Thrillers",
    "link": "https://www.nytimes.com/2025/09/30/books/thomas-perry-dead.html",
    "summary": "His many novels, including the prizewinning “The Butcher’s Boy” and the Jane Whitefield series, can have readers rooting for both protagonist and antagonist."
  }
]