[
  {
    "title": "Winter Storm Forecast: Where the Ice Could Hit Worst",
    "link": "https://www.nytimes.com/2026/01/23/weather/winter-storm-ice-tennessee-carolina-mississippi.html",
    "summary": "Even a little ice can be far more dangerous than snow in some places."
  },
  {
    "title": "Pepper-Sprayed While Pinned Down: A Searing Scene Provokes Outrage",
    "link": "https://www.nytimes.com/2026/01/23/us/minneapolis-man-pepper-sprayed-pinned-video.html",
    "summary": "Images of a man getting pepper-sprayed at close range while being held down by Border Patrol agents fueled more tension in Minneapolis."
  },
  {
    "title": "ICE Agent Charged With Misdemeanor Following Scuffle With an Activist",
    "link": "https://www.nytimes.com/2026/01/23/us/ice-agent-charged-illinois.html",
    "summary": "The police in Brookfield, Ill., filed a battery charge against a federal agent, who was off duty when he scuffled with an immigrant rights activist."
  },
  {
    "title": "FBI Agent Resigns After Trying to Investigate ICE Officer in Renee Good Shooting",
    "link": "https://www.nytimes.com/2026/01/23/us/fbi-agent-ice-shooting-renee-good.html",
    "summary": "The resignation of the agent, Tracee Mergen, was only the latest shock wave to have emerged from the Justice Department’s handling of the shooting of Renee Good."
  },
  {
    "title": "Despite Trump’s Words, China and Russia Are Not Threatening Greenland",
    "link": "https://www.nytimes.com/2026/01/24/us/politics/trump-china-russia-greenland.html",
    "summary": "U.S. and European officials say they are unaware of any intelligence that shows China and Russia are endangering the island, which is protected by the NATO security umbrella."
  },
  {
    "title": "What Europe Learned From the Greenland Crisis",
    "link": "https://www.nytimes.com/2026/01/24/world/europe/sovereignty-european-union-nato.html",
    "summary": "Territorial integrity is a core tenet of Europe that is at risk from Russian and American imperialism. Brussels has fought back."
  },
  {
    "title": "How a Year of Trump Changed Britain",
    "link": "https://www.nytimes.com/2026/01/24/world/europe/trump-uk-changes.html",
    "summary": "Prime Minister Keir Starmer stood firm over Greenland. But his center-left government and the country as a whole have been buffeted by President Trump."
  },
  {
    "title": "As Trump Focuses Abroad, G.O.P. Toils to Hone Election Message",
    "link": "https://www.nytimes.com/2026/01/24/us/gop-election-message-trump.html",
    "summary": "A new poll shows that voters who will decide control of Congress see a lack of presidential emphasis on critical domestic issues."
  },
  {
    "title": "U.S. Says First Boat Strike Since Maduro’s Capture Killed 2 in Eastern Pacific",
    "link": "https://www.nytimes.com/2026/01/23/us/politics/boat-strike-pacific.html",
    "summary": "The U.S. Southern Command said it had asked the Coast Guard to search for one survivor."
  },
  {
    "title": "Genetic Data From Over 20,000 U.S. Children Misused for ‘Race Science’",
    "link": "https://www.nytimes.com/2026/01/24/us/children-genetics-race-science.html",
    "summary": "The National Institutes of Health failed to protect brain scans that an international group of fringe researchers used to argue for the intellectual superiority of white people."
  },
  {
    "title": "We Don’t Need Greenland. We Need Allies.",
    "link": "https://www.nytimes.com/2026/01/24/opinion/trump-nato-greenland.html",
    "summary": "It is time for Americans to step up and defend NATO and our country’s vital interests in its survival."
  },
  {
    "title": "ICE Is Splitting America in Two",
    "link": "https://www.nytimes.com/2026/01/24/opinion/trump-executive-power.html",
    "summary": "The Conversation convenes with Emily Bazelon, David French and Aaron Retica discussing the questions reshaping American politics right now, from immigration enforcement to whether the country can still claim to be “one nation, indivisible.”"
  },
  {
    "title": "Cold Comfort",
    "link": "https://www.nytimes.com/2026/01/24/briefing/cold-comfort.html",
    "summary": "How can the perpetually shivering warm up to winter?"
  },
  {
    "title": "An Antarctic Mission to Recover a Robot’s Data",
    "link": "https://www.nytimes.com/2026/01/23/climate/antarctica-robot-glider.html",
    "summary": "In the unforgiving polar wilderness, scientists go to great lengths to safeguard the devices that gather precious data."
  },
  {
    "title": "Setting Foot on the Melting Thwaites Glacier",
    "link": "https://www.nytimes.com/video/climate/100000010658848/setting-foot-on-the-melting-thwaites-glacier.html",
    "summary": "Bad weather ​delayed expedition scientists’​ ​efforts to set up camp on Thwaites Glacier ​in Antarctica ​and take measurements ​to determine how quickly it is melting. After the skies cleared, our journalists​, Raymond Zhong and Chang W. Lee​, took us along for their first steps on Thwaites."
  },
  {
    "title": "China’s Highest-Ranking General Removed as Xi’s Military Purge Reaches the Top",
    "link": "https://www.nytimes.com/2026/01/24/world/asia/china-top-general-xi-military-purge.html",
    "summary": "General Zhang Youxia had appeared to be President Xi Jinping’s trusted second-in-command. He has now joined the long list of generals and admirals under investigation."
  },
  {
    "title": "How a Water Balloon Fight in Venezuela Ended in Charges of Treason",
    "link": "https://www.nytimes.com/2026/01/24/world/americas/venezuela-arrests-repression.html",
    "summary": "Venezuela’s interim government has been praised by President Trump. It has also maintained its state security apparatus to stamp out any perceived dissent."
  },
  {
    "title": "Mamdani Joined Nurses on the Picket Lines. That’s Unusual for Mayors.",
    "link": "https://www.nytimes.com/2026/01/24/nyregion/nyc-mayors-labor-strikes.html",
    "summary": "The current mayor of New York City has diverged from his predecessors by joining the striking nurses. Past labor disputes have often involved scolding."
  }
]