[
  {
    "title": "Presidential Power Gets Tested Before Supreme Court After Long Conservative Project to Shrink Agencies",
    "link": "https://www.nytimes.com/2025/12/07/us/politics/supreme-court-trump-independent-agencies.html",
    "summary": "President Trump has repeatedly ousted leaders of independent agencies despite federal laws meant to shield those regulators from politics."
  },
  {
    "title": "For Landmark Test of Executive Power, Echoes of a 1930s Supreme Court Battle",
    "link": "https://www.nytimes.com/2025/12/07/us/politics/supreme-court-humphrey-roosevelt.html",
    "summary": "Franklin D. Roosevelt’s efforts to oust a Federal Trade Commission leader offer parallels to the current fight over President Trump’s actions."
  },
  {
    "title": "Superpower Competition: The Missing Chapter in Trump’s Security Strategy",
    "link": "https://www.nytimes.com/2025/12/07/us/politics/trump-security-strategy-superpowers.html",
    "summary": "President Trump is shifting from discussion of the long-lasting competition among the world’s biggest economies and nuclear powers."
  },
  {
    "title": "Judge Stalls Justice Dept. Effort to Seek New Comey Indictment",
    "link": "https://www.nytimes.com/2025/12/06/us/politics/judge-comey-indictment-richman.html",
    "summary": "The judge’s decision prevented the government until at least next Friday from having access to much of the evidence it used to secure its original indictment against Mr. Comey."
  },
  {
    "title": "This Nebraska Prison Rehabilitated Inmates. Until ICE Paid to Fill It With Immigrants.",
    "link": "https://www.nytimes.com/2025/12/07/us/nebraska-prison-mccook-ice-immigrants-detention-trump.html",
    "summary": "Over two decades, a minimum-security prison aimed at helping inmates prepare to leave prison was a point of civic pride. Now, state officials have converted it to ICE detention."
  },
  {
    "title": "How Stablecoins Can Help Criminals Launder Money and Evade Sanctions",
    "link": "https://www.nytimes.com/2025/12/07/technology/how-a-cryptocurrency-helps-criminals-launder-money-and-evade-sanctions.html",
    "summary": "Through layers of intermediaries, stablecoins can be moved, swapped and mixed into pools of other funds in ways that are difficult to trace, experts say."
  },
  {
    "title": "How Biden Ignored Warnings and Lost Americans’ Faith in Immigration",
    "link": "https://www.nytimes.com/2025/12/07/us/politics/biden-immigration-trump.html",
    "summary": "The Democratic president and his top advisers rejected recommendations that could have eased the border crisis that helped return Donald Trump to the White House."
  },
  {
    "title": "4 Takeaways From The Times’s Reporting on Biden’s Immigration Record",
    "link": "https://www.nytimes.com/2025/12/07/us/politics/biden-immigration-policy-takeaways.html",
    "summary": "A New York Times review of President Joseph R. Biden Jr.’s actions on immigration showed that they created an opening for a more aggressive Trump administration agenda."
  },
  {
    "title": "A Small Illinois City at the Center of a Seismic Shift in Abortion Access",
    "link": "https://www.nytimes.com/2025/12/07/us/politics/abortion-carbondale.html",
    "summary": "Carbondale, Ill., a liberal enclave within driving distance of 10 states with abortion bans, has become a hub for the procedure. Last year there were nearly 11,000 abortions in this city of 21,000."
  },
  {
    "title": "The Married Scientists Torn Apart by a Covid Bioweapon Theory",
    "link": "https://www.nytimes.com/2025/12/07/us/china-virologist-li-meng-yan-coronavirus.html",
    "summary": "In 2020, a Chinese virologist fled to the United States, aided by allies of President Trump who sought to promote her unproven theories about the origins of Covid-19. Her husband still can’t find her."
  },
  {
    "title": "What Do Republicans Have to Fear? Ask Tennessee.",
    "link": "https://www.nytimes.com/2025/12/07/opinion/tennessee-trump-special-election.html",
    "summary": "What a special House election just told us."
  },
  {
    "title": "The Crucial Lesson of a Forgotten Nixon-Era Episode",
    "link": "https://www.nytimes.com/2025/12/07/opinion/daniel-ellsberg-nixon-plumbers.html",
    "summary": "After my father-in-law died, we found something interesting in his files."
  },
  {
    "title": "Your Gift Dilemmas, Solved",
    "link": "https://www.nytimes.com/2025/12/07/briefing/your-gift-dilemmas-solved.html",
    "summary": "An expert from Wirecutter helps Morning readers with their trickiest holiday gift searches."
  },
  {
    "title": "Hong Kong Holds Vote as Officials Move Against ‘Anti-China’ Elements",
    "link": "https://www.nytimes.com/2025/12/07/world/asia/hong-kong-fire-election-campaign.html",
    "summary": "The government is pushing hard to raise turnout in an election overshadowed by a deadly fire and public anger over safety lapses and official accountability."
  },
  {
    "title": "Benin Coup Attempt to Oust Talon Has Been Foiled, Interior Minister Says",
    "link": "https://www.nytimes.com/2025/12/07/world/africa/benin-coup-shots-military-africa.html",
    "summary": "The country’s interior minister said the situation was under control after a “small group of soldiers launched a mutiny,” but the president had yet to make a public statement."
  },
  {
    "title": "In Brazil’s Answer to Hollywood, Dreams and Drought Share the Stage",
    "link": "https://www.nytimes.com/2025/12/07/world/americas/brazil-cabaceiras-film-tv-hollywood.html",
    "summary": "A dusty town in the parched northeast has become the nation’s show business destination. But climate change and technology are posing new challenges there."
  }
]