[
  {
    "title": "No Meals, Fainting Nurses, Dwindling Baby Formula: Starvation Haunts Gaza Hospitals",
    "link": "https://www.nytimes.com/2025/07/27/world/middleeast/gaza-hunger-doctors-nurses.html",
    "summary": "After Israeli restrictions on aid, hunger has risen across Gaza. Doctors and nurses, struggling to find food themselves, lack the resources to stem the surge."
  },
  {
    "title": "Israel Says It Has Paused Some Military Activity in Gaza as Anger Grows Over Hunger",
    "link": "https://www.nytimes.com/2025/07/27/world/middleeast/israel-gaza-aid-hunger.html",
    "summary": "Operations in three parts of the enclave were temporarily halted on Sunday to allow more aid to enter the territory, the Israeli military said. It was unclear if the decision would relieve the hunger crisis in Gaza."
  },
  {
    "title": "Israel Intercepts Gaza-Bound Ship of Activists and Aid",
    "link": "https://www.nytimes.com/2025/07/27/world/middleeast/israel-gaza-ship.html",
    "summary": "It was at least the third vessel blocked this year while challenging Israel’s naval blockade and seeking to deliver supplies by sea to a population facing rising starvation."
  },
  {
    "title": "What Will It Cost to Renovate Trump’s ‘Free’ Air Force One? Don’t Ask.",
    "link": "https://www.nytimes.com/2025/07/27/us/politics/air-force-one-trump-cost.html",
    "summary": "To hide the cost of renovating the plane Qatar donated to President Trump, the Air Force appears to have tucked it inside an over-budget, behind-schedule nuclear modernization program."
  },
  {
    "title": "Right-Wing Influencers Say Ghislaine Maxwell Is Key to Unlocking Epstein Case",
    "link": "https://www.nytimes.com/2025/07/26/us/ghislaine-maxwell-trump-epstein.html",
    "summary": "Some conservative influencers have celebrated the move to approach the longtime associate of Jeffrey Epstein, but it comes with risks."
  },
  {
    "title": "The Ripple Effects of an ICE Raid on a Nebraska Meatpacking Company",
    "link": "https://www.nytimes.com/2025/07/27/us/ice-glenn-valley-foods.html",
    "summary": "Glenn Valley Foods tried to verify every hire through a federal system. After a raid, the company is wondering how it can keep going."
  },
  {
    "title": "In Smithsonian Role, John Roberts Encounters History, Pandas and Trump",
    "link": "https://www.nytimes.com/2025/07/27/arts/smithsonian-john-roberts-trump-supreme-court.html",
    "summary": "Chief Justice John G. Roberts Jr., who serves as the institution’s chancellor, has always emphasized procedure and avoided politics. This moment could make that more difficult."
  },
  {
    "title": "Alpha School, AI-Driven Education Founded in Austin, Is Coming to More Cities",
    "link": "https://www.nytimes.com/2025/07/27/us/politics/ai-alpha-school-austin-texas.html",
    "summary": "At Austin’s Alpha School, students spend just two hours a day on academics, led by artificial intelligence tools. New Alpha schools are set to open in about a dozen cities this fall."
  },
  {
    "title": "Inside a Gathering of America’s Growing Home-School Movement",
    "link": "https://www.nytimes.com/2025/07/27/home-schooling-movement.html",
    "summary": "The pandemic supercharged interest. Now, a cultural and political emphasis on women staying at home is continuing to fuel growth."
  },
  {
    "title": "David Bars Have Had Breakout Success. Can the Protein Craze Last?",
    "link": "https://www.nytimes.com/2025/07/27/business/david-protein-bars.html",
    "summary": "The David bar’s breakout success is proof that, in our culture of optimization, one macronutrient is king. But can the protein craze last?"
  },
  {
    "title": "Can Mamdani’s Message Play Outside New York? It Already Has.",
    "link": "https://www.nytimes.com/2025/07/27/nyregion/mamdani-wu-progressive-democrats.html",
    "summary": "Zohran Mamdani’s mayoral primary victory in New York follows wins by other big-city progressives. Are voters more open to backing progressive stances?"
  },
  {
    "title": "The Far Right in Germany Wants to Soften Its Image, Not Its Policies",
    "link": "https://www.nytimes.com/2025/07/27/world/europe/afd-germany-far-right.html",
    "summary": "The Alternative for Germany, or AfD, has adopted a code of conduct for its members, without changing its positions on immigration and other issues."
  },
  {
    "title": "Germany’s Far-Right Party May Be Banned. Its Voters Fear Being Left Voiceless.",
    "link": "https://www.nytimes.com/2025/07/27/world/europe/alternative-for-germany-ban-voters.html",
    "summary": "Supporters of the Alternative for Germany say they might quit voting if the party is outlawed. Some opponents are against such a move, too."
  },
  {
    "title": "Smoke From Canadian Wildfires Wafts Over New York City",
    "link": "https://www.nytimes.com/2025/07/27/nyregion/new-york-air-quality-canada-wildfires.html",
    "summary": "Officials warned young children and those with respiratory illnesses to take precautions. For weeks, smoke from Canadian wildfires has been drifting across the border."
  },
  {
    "title": "A Boston Suburb Removed Italian Flag Colors From a Street. Residents Rebelled.",
    "link": "https://www.nytimes.com/2025/07/27/us/italy-street-newton-massachusetts.html",
    "summary": "Newton, Mass., replaced a street’s red, white and green centerline with standard yellow stripes, citing traffic safety concerns, weeks before an annual Italian American festival."
  },
  {
    "title": "Dance Poles and Leopard-Print Walls: Love Motels Ready Rooms for Climate Summit",
    "link": "https://www.nytimes.com/2025/07/27/world/americas/love-motels-brazil-belem-cop30-climate.html",
    "summary": "The Brazilian city of Belém, host to the 30th U.N. Climate Change Conference, is short on hotel rooms. Love motels are offering a solution."
  },
  {
    "title": "Zillow Is Growing When the Housing Market Is Frozen",
    "link": "https://www.nytimes.com/2025/07/27/business/zillow-house-prices-sales.html",
    "summary": "Through boom and bust, Jeremy Wacksman says people keep coming to the listings site to “gawk” and “dream.”"
  },
  {
    "title": "José Andrés: People of Good Conscience Must Stop the Starvation in Gaza",
    "link": "https://www.nytimes.com/2025/07/27/opinion/gaza-starvation-famine-israel.html",
    "summary": "Israel is responsible for the basic survival of civilians in Gaza."
  },
  {
    "title": "The Elite Panic at the Heart of Liberal Attacks on Mamdani",
    "link": "https://www.nytimes.com/2025/07/27/opinion/mamdani-race-college-admissions.html",
    "summary": "Mamdani’s detractors don’t care about his race; they care about clawing back a century of civil rights."
  },
  {
    "title": "The Protein Boom",
    "link": "https://www.nytimes.com/2025/07/27/briefing/the-protein-boom.html",
    "summary": "Protein is remaking the food economy. How much do you really need?"
  },
  {
    "title": "11 People Injured in Stabbing at a Michigan Walmart, Officials Say",
    "link": "https://www.nytimes.com/2025/07/26/us/stabbing-traverse-city-walmart.html",
    "summary": "One person was in custody after what the authorities said was a random attack at a store near Traverse City, Mich."
  },
  {
    "title": "Thailand and Cambodia Trade Fire Despite Cease-Fire Promises",
    "link": "https://www.nytimes.com/2025/07/26/world/asia/thailand-cambodia-conflict.html",
    "summary": "President Trump said on Saturday that both countries had agreed to a halt in the fighting. But on Sunday morning, skirmishes erupted once more."
  }
]