[
  {
    "title": "‘I Hate My Opponent’: Trump’s Remarks at Kirk Memorial Distill His Politics",
    "link": "https://www.nytimes.com/2025/09/22/us/politics/trump-kirk-memorial-hate.html",
    "summary": "President Trump has been fueled by grievance and animosity over the course of his political and public life."
  },
  {
    "title": "Defense Department Delays Cleanup of ‘Forever Chemicals’ Nationwide",
    "link": "https://www.nytimes.com/2025/09/23/climate/military-defense-pfas-forever-chemicals-cleanup-delay.html",
    "summary": "The new timeline could slow cleanup in some communities by nearly a decade. The chemicals, widely used in the military, are linked to cancers and other health risks."
  },
  {
    "title": "Supreme Court Allows Trump to Fire F.T.C. Commissioner",
    "link": "https://www.nytimes.com/2025/09/22/us/politics/supreme-court-ftc-commissioner-firing.html",
    "summary": "The justices said they will consider whether to overrule a landmark Supreme Court precedent that has limited the president’s ability to fire top officials at the agency."
  },
  {
    "title": "Trump Signs Order Targeting Antifa Movement",
    "link": "https://www.nytimes.com/2025/09/22/us/politics/trump-antifa-order-terrorism.html",
    "summary": "President Trump’s executive order threatened to prosecute donors who support antifascist philosophy and issued a domestic terrorism designation that doesn’t exist under U.S. law."
  },
  {
    "title": "Trump Targets Tylenol and Vaccines, and ABC Brings Kimmel Back",
    "link": "https://www.nytimes.com/2025/09/23/podcasts/the-headlines/trump-tylenol-vaccines-kimmel.html",
    "summary": "Plus, America’s new astronauts."
  },
  {
    "title": "The Many Faces of Syria’s President, Ahmed al-Shara",
    "link": "https://www.nytimes.com/2025/09/23/world/middleeast/syria-president-ahmed-al-shara.html",
    "summary": "Ahmed al-Shara has shifted shapes many times during his ascent from rebel commander to national leader. This week, he is expected to be the first Syrian president to address the U.N. General Assembly in 58 years."
  },
  {
    "title": "Trump to Address U.N. as He Jettisons Aid and Recasts U.S. Role",
    "link": "https://www.nytimes.com/2025/09/23/us/politics/trump-un-aid-israel-gaza.html",
    "summary": "President Trump plans to address the U.N. General Assembly with a rebuke of global institutions, at a moment when he is increasingly isolated in his approach to crises around the world."
  },
  {
    "title": "Cache of Devices Capable of Crashing Cell Network Is Found Near U.N.",
    "link": "https://www.nytimes.com/2025/09/23/us/politics/secret-service-sim-cards-servers-un.html",
    "summary": "The Secret Service discovered more than 100,000 SIM cards and 300 servers, which could disable cellular towers or be used to conduct surveillance."
  },
  {
    "title": "In Israel, Government Backlash Brews Over Palestinian State Recognition",
    "link": "https://www.nytimes.com/2025/09/23/world/middleeast/palestinian-statehood-response-israel.html",
    "summary": "As more countries moved to formally recognize a Palestinian state, a far-right member of Israel’s government called for “countermeasures” including the annexation of the West Bank."
  },
  {
    "title": "Elon Musk’s Father, Errol Musk, Accused of Child Sexual Abuse",
    "link": "https://www.nytimes.com/2025/09/23/world/africa/elon-musk-father-errol-child-abuse.html",
    "summary": "Errol Musk has been accused of sexually abusing five of his children and stepchildren since 1993, a Times investigation found. Family members have appealed to Elon Musk for help."
  },
  {
    "title": "Trump Issues Warning Based on Unproven Link Between Tylenol and Autism",
    "link": "https://www.nytimes.com/2025/09/22/health/kennedy-autism-tylenol-trump.html",
    "summary": "Top U.S. health officials urged pregnant women not to use acetaminophen, the active ingredient in Tylenol, claiming it could cause autism, though studies have been inconclusive."
  },
  {
    "title": "For Trump, Who Has ‘Strong Feelings’ About Autism, the Issue Is Personal",
    "link": "https://www.nytimes.com/2025/09/22/us/politics/autism-vaccines-trump-personal.html",
    "summary": "The president delivered impassioned — if scientifically dubious — remarks about what he described as one of “the most alarming public health developments in history.”"
  },
  {
    "title": "What to Know About Tylenol, Pregnancy and Babies",
    "link": "https://www.nytimes.com/2025/09/22/well/tylenol-autism-pregnancy-babies.html",
    "summary": "President Trump said on Monday that Tylenol use during pregnancy could lead to autism, a claim that is unproven."
  },
  {
    "title": "F.D.A. to Relabel Leucovorin for Autism Treatment",
    "link": "https://www.nytimes.com/2025/09/22/well/leucovorin-autism-fda.html",
    "summary": "The F.D.A. announced Monday that it would change the drug’s label to reflect potential benefits in reducing autism symptoms."
  },
  {
    "title": "Sushi Is Bigger Than Ever in America. Here’s Why.",
    "link": "https://www.nytimes.com/2025/09/22/dining/america-sushi.html",
    "summary": "Once considered rarefied and exotic in the United States, the Japanese favorite is now a staple in many places across the country."
  },
  {
    "title": "Jimmy Kimmel’s Show to Return to ABC on Tuesday Night",
    "link": "https://www.nytimes.com/2025/09/22/business/media/jimmy-kimmel-returns-abc.html",
    "summary": "The network’s removal of Mr. Kimmel’s show last week almost immediately morphed into a flashpoint for free speech in America."
  },
  {
    "title": "Politicians and Celebrities Weigh In on Jimmy Kimmel’s Return to Late Night",
    "link": "https://www.nytimes.com/2025/09/22/us/jimmy-kimmel-show-return-reactions.html",
    "summary": "Some celebrated ABC’s decision to rescind the show’s suspension, while others criticized it."
  },
  {
    "title": "Why African Countries Keep Making Deals to Accept U.S. Deportees",
    "link": "https://www.nytimes.com/2025/09/23/world/africa/african-countries-us-deportees.html",
    "summary": "As the Trump administration exerts pressure on countries to aid in its mass deportation efforts, some nations in Africa have agreed, prompting legal battles."
  },
  {
    "title": "Trump’s $100,000 Visa Fee Puts Many Tech Start-Ups in a Bind",
    "link": "https://www.nytimes.com/2025/09/23/technology/trump-h1b-visa-tech-start-ups.html",
    "summary": "Silicon Valley start-ups said they were concerned they would be disproportionately hurt by the new visa fee for skilled foreign workers, given their limited resources."
  },
  {
    "title": "For a Glimpse Into Ukraine’s War, Stop at a Gas Station",
    "link": "https://www.nytimes.com/2025/09/23/world/europe/ukraine-gas-stations.html",
    "summary": "Filling stations have become must-stop spots for soldiers traveling to and from the front, helping them win a place in Ukrainians’ hearts."
  },
  {
    "title": "Zelensky to Meet With Trump on Sidelines of U.N. General Assembly",
    "link": "https://www.nytimes.com/2025/09/23/world/europe/zelensky-trump-meeting-un-ukraine-us.html",
    "summary": "The leaders of Ukraine and the United States will hold talks weeks after President Trump agreed to participate in postwar security guarantees for Ukraine."
  },
  {
    "title": "High Holiday Reflections on the State of American Jews",
    "link": "https://www.nytimes.com/2025/09/22/us/rosh-hashanah-high-holidays.html",
    "summary": "“I never would have imagined the splinters inside of the Jewish community,” said Rabbi Elan Babchuck, whose work includes research on polarization."
  },
  {
    "title": "Halligan, Trump’s Chosen Prosecutor, Takes Over Comey and James Cases",
    "link": "https://www.nytimes.com/2025/09/22/us/politics/trump-lindsey-halligan-james-comey.html",
    "summary": "The president is pushing up against the statute of limitations in his pursuit of charges against a former F.B.I. director, and also wants the attorney general of New York and a California senator prosecuted."
  },
  {
    "title": "TikTok Deal Could Make Oracle Founder Larry Ellison a New Kind of Media Mogul",
    "link": "https://www.nytimes.com/2025/09/23/technology/larry-ellison-oracle-tiktok.html",
    "summary": "The database billionaire and his son, David, are Trump favorites. The family could soon control an empire that includes CBS, Paramount, Warner, CNN and a piece of TikTok."
  },
  {
    "title": "10 Questions With Curtis Sliwa",
    "link": "https://www.nytimes.com/2025/09/23/nyregion/curtis-sliwa-interview.html",
    "summary": "Curtis Sliwa, the Republican nominee for mayor of New York City, visited The New York Times for an interview."
  },
  {
    "title": "How the N.Y.C. Mayoral Candidates Plan to Tackle Homelessness",
    "link": "https://www.nytimes.com/2025/09/23/nyregion/nyc-mayor-homelessness.html",
    "summary": "The candidates’ views on addressing homelessness in New York City differ vastly, with calls to expand mental health services, overhaul the shelter system and change policing."
  },
  {
    "title": "N.Y.P.D. Misconduct Complaints Surged Under Adams, Report Says",
    "link": "https://www.nytimes.com/2025/09/23/nyregion/nypd-misconduct-complaints-surge.html",
    "summary": "The number of misconduct reports to a watchdog agency increased 60 percent under Mayor Eric Adams and last year were the highest in a decade, according to a city report."
  },
  {
    "title": "Mamdani Lands Endorsement From Kamala Harris, His Biggest Yet",
    "link": "https://www.nytimes.com/2025/09/22/us/politics/kamala-harris-endorsement-zohran-mamdani.html",
    "summary": "“I support the Democrat in the race,” Ms. Harris said during an interview with Rachel Maddow. She added of the Democratic Party, “we’ve got a big tent and we’ve got a lot of stars.”"
  },
  {
    "title": "‘They’re Small but They’re Mighty.’ Meet the Wisconsin Sisters Healing the Land.",
    "link": "https://www.nytimes.com/2025/09/22/climate/wisconsin-nuns-prairie-restoration.html",
    "summary": "The women of Holy Wisdom Monastery have restored 170 acres of native prairie and oak savanna. “Humans need creation to find ourselves,” one said."
  },
  {
    "title": "‘That Was Shocking’: Four Experts React to Trump’s Autism Announcement",
    "link": "https://www.nytimes.com/2025/09/23/opinion/experts-autism-trump-kennedy.html",
    "summary": "This is not what autistic people need, experts say."
  },
  {
    "title": "Trump’s Malice Is Not an Instrument of God’s Plan",
    "link": "https://www.nytimes.com/2025/09/23/opinion/erika-kirk-charlie-trump-miller.html",
    "summary": "If MAGA evangelicals cheer the president’s hatred, if they welcome it, if they adopt it, and if they vote for it, then they are responsible for it."
  },
  {
    "title": "A Fact-Check on Trump’s Claims About Tylenol, Vaccines and Autism",
    "link": "https://www.nytimes.com/2025/09/23/us/a-fact-check-on-trumps-claims-about-tylenol-vaccines-and-autism.html",
    "summary": "How President Trump ignored science about vaccines in his news conference."
  },
  {
    "title": "For Late Night, Jimmy Kimmel’s Plight Is Personal",
    "link": "https://www.nytimes.com/2025/09/23/arts/television/late-night-jimmy-kimmel.html",
    "summary": "“Once more, I am the only martyr in late night,” Stephen Colbert said, joking about his own canceled show while sharing news of Kimmel’s return to air."
  },
  {
    "title": "U.S. News Rankings Are Out After a Tumultuous Year for Colleges",
    "link": "https://www.nytimes.com/2025/09/23/us/us-news-rankings.html",
    "summary": "But despite it all, very little changed on the lists many parents and prospective students turn to as admissions season kicks off."
  },
  {
    "title": "Egypt’s Most Famous Political Prisoner Is Freed and Reunited With Family",
    "link": "https://www.nytimes.com/2025/09/23/world/europe/egypt-activist-alaa.html",
    "summary": "The dissident Alaa Abd El Fattah, a British-Egyptian dual citizen, was imprisoned for most of the past 12 years. His family waged an international campaign for his release."
  },
  {
    "title": "How Norway Adopted New Tech in Its Hunt for ‘Missing’ Oil",
    "link": "https://www.nytimes.com/2025/09/23/business/norway-oil-exploration.html",
    "summary": "Going against conventional wisdom, explorers at a Norwegian energy company drilled horizontally to find oil in an abandoned natural gas field."
  },
  {
    "title": "Woman Is Convicted of Killing Her Children and Leaving Them in Suitcases",
    "link": "https://www.nytimes.com/2025/09/23/world/asia/korea-zealand-suitcase-murders.html",
    "summary": "Years after Hakyung Lee left New Zealand for her native South Korea, the bodies of her children were found in Auckland. She faces life in prison."
  }
]