[
  {
    "title": "In an Era of Deep Polarization, Unity Is Not Trump’s Mission",
    "link": "https://www.nytimes.com/2025/09/14/us/politics/trump-kirk-polarization-unity.html",
    "summary": "President Trump does not subscribe to the traditional notion of being president for all Americans."
  },
  {
    "title": "After Charlie Kirk Killing, Suspect Joked That His ‘Doppelganger’ Did It",
    "link": "https://www.nytimes.com/2025/09/13/us/kirk-killing-suspect-online-chat.html",
    "summary": "Before he was arrested on suspicion of carrying out the assassination, 22-year-old Tyler Robinson sent friends messages showing that he was closely following news about the killing."
  },
  {
    "title": "Erika Kirk, Charlie Kirk’s Widow, Grieves Publicly, Melding Personal and Political",
    "link": "https://www.nytimes.com/2025/09/13/style/erika-kirk-charlie-kirk-marriage.html",
    "summary": "Ms. Kirk has played a key role in her husband’s movement. Speaking at Turning Point USA headquarters and on social media, she pledged his work would continue."
  },
  {
    "title": "Russia Made Drone Production a Supreme Priority. Now It Swarms the Skies.",
    "link": "https://www.nytimes.com/2025/09/14/world/europe/russia-ukraine-drone-attacks-production.html",
    "summary": "Ukraine is struggling to defend itself against the growing number of attack drones that Moscow has started using in its onslaughts."
  },
  {
    "title": "Ukrainian Drones Strike Major Russian Oil Refinery",
    "link": "https://www.nytimes.com/2025/09/14/world/europe/romania-drone-russia-ukraine.html",
    "summary": "The strike came hours after Romania said a Russian drone had flown through its airspace. The incidents further underscored how drones were making the war in Ukraine felt outside the country’s borders."
  },
  {
    "title": "Trump’s Reversals on Immigration Mount Over Economic Concerns",
    "link": "https://www.nytimes.com/2025/09/14/us/politics/trump-immigration-policy-reversals.html",
    "summary": "President Trump has walked back some significant immigration policies that collide with his economic agenda, angering his far-right allies."
  },
  {
    "title": "In Some Records, Fed Governor Lisa Cook Listed Atlanta Home as Secondary",
    "link": "https://www.nytimes.com/2025/09/13/business/lisa-cook-mortgage-fed-trump.html",
    "summary": "In a court filing, lawyers for Lisa Cook cited a news story about the records and urged a federal court to rule against President Trump’s efforts to block her from an upcoming Fed meeting."
  },
  {
    "title": "U.S. and China to Resume Talks on Tariffs, TikTok in Madrid",
    "link": "https://www.nytimes.com/2025/09/14/business/us-china-trade-tiktok-negotiations.html",
    "summary": "Economic officials meeting in Madrid will seek to head off a November tariff deadline."
  },
  {
    "title": "Federal Judge Questions Deportations to Ghana",
    "link": "https://www.nytimes.com/2025/09/13/us/politics/federal-judge-migrants-ghana.html",
    "summary": "A hearing in the case of five migrants deported to Ghana last week showed how earlier Supreme Court rulings have paved the way for President Trump’s mass deportation campaign."
  },
  {
    "title": "Arab Ministers Gather to Decide Response to Israeli Attack in Qatar",
    "link": "https://www.nytimes.com/2025/09/14/world/middleeast/arab-ministers-qatar-israel.html",
    "summary": "Arab foreign ministers were expected to meet on Sunday in the Qatari capital, Doha, to lay the groundwork for a summit there on Monday."
  },
  {
    "title": "Finding God in the App Store",
    "link": "https://www.nytimes.com/2025/09/14/us/chatbot-god.html",
    "summary": "Millions of people are turning to chatbots to confess their darkest secrets and seek guidance from on high. “Is this actually God I am talking to?”"
  },
  {
    "title": "Robert Munsch, the Beloved Children’s Author Whose Stories Are Slipping Away",
    "link": "https://www.nytimes.com/2025/09/14/magazine/robert-munsch-author-children-books-dementia.html",
    "summary": "Robert Munsch wrote “The Paper Bag Princess,” “Love You Forever” and other classics by performing them over and over for kids. But dementia is now stealing his imagination."
  },
  {
    "title": "Inside a ‘Hell on Earth’ in Oklahoma",
    "link": "https://www.nytimes.com/2025/09/14/us/liberty-greer-center-abuse-oklahoma.html",
    "summary": "The Greer Center was supposed to be a refuge for people with developmental disabilities. But accounts from inside the secretive facility paint a starkly different picture, depicting a place where helpless patients faced beatings, waterboarding and constant fear."
  },
  {
    "title": "How Nancy Pelosi Quietly Shaped California’s Redistricting Fight",
    "link": "https://www.nytimes.com/2025/09/14/us/politics/nancy-pelosi-california-redistricting.html",
    "summary": "Private meetings and longtime loyalties helped push what began as a something of a Democratic bluff into a full-fledged counteroffensive against President Trump."
  },
  {
    "title": "Lina Khan Revamped Antitrust. Now She’s Pushing the Democratic Party.",
    "link": "https://www.nytimes.com/2025/09/14/technology/lina-khan-democratic-party.html",
    "summary": "The youngest chair in the history of the Federal Trade Commission is campaigning for Zohran Mamdani and defending her brand of populism."
  },
  {
    "title": "Van Hollen Criticizes Democratic Leaders for Delay in Endorsing Mamdani",
    "link": "https://www.nytimes.com/2025/09/13/us/politics/van-hollen-zohran-mamdani.html",
    "summary": "At an annual fund-raiser in Iowa, the Maryland Democrat said he supported Zohran Mamdani for mayor of New York City and said people were sick of “spineless politics.”"
  },
  {
    "title": "On the Supreme Court’s Emergency Docket, Sharp Partisan Divides",
    "link": "https://www.nytimes.com/2025/09/14/us/politics/supreme-court-emergency-docket-partisan.html",
    "summary": "The second Trump administration has filed roughly the same number of applications so far as the Biden administration did over four years. But they have fared quite differently."
  },
  {
    "title": "What to Expect at the 2025 Emmy Awards",
    "link": "https://www.nytimes.com/2025/09/14/arts/television/what-to-expect-at-the-2025-emmy-awards.html",
    "summary": "The Apple TV+ series “Severance” and the HBO Max medical show “The Pitt” are in a tight race for best drama, television’s most coveted prize."
  },
  {
    "title": "Emmys 2025: How to Watch, Time and Streaming",
    "link": "https://www.nytimes.com/2025/09/13/arts/television/emmy-awards-watch-time-stream.html",
    "summary": "The show, airing on CBS, is being hosted by the comedian Nate Bargatze."
  },
  {
    "title": "After Bolsonaro’s Conviction, Brazil Already Considers His Amnesty",
    "link": "https://www.nytimes.com/2025/09/14/world/americas/bolsonaro-convicted-coup-amnesty.html",
    "summary": "Brazil’s top court sentenced former President Jair Bolsonaro to 27 years in prison. The nation’s Congress is already debating how to free him."
  },
  {
    "title": "Tyler Robinson and Our Poisonous Internet",
    "link": "https://www.nytimes.com/2025/09/14/opinion/charlie-kirk-shooting-internet.html",
    "summary": "We’ve fully stepped into a different historical moment: the age of brain-poisoning meme politics."
  },
  {
    "title": "Democrats Cannot Just Buy Back the Working Class",
    "link": "https://www.nytimes.com/2025/09/14/opinion/democrats-working-class-hardhat-riot.html",
    "summary": "Why did the working class switch sides?"
  },
  {
    "title": "The Capital of Electric Cars Is Turning to Electric Planes",
    "link": "https://www.nytimes.com/2025/09/14/business/energy-environment/norway-electric-plane-green-energy.html",
    "summary": "There are dozens of short daily flights to Norway’s islands, and the oil-producing Scandinavian country wants electricity to power them."
  },
  {
    "title": "Funicular Crash Has Jarred Lisbon’s Sense of Itself",
    "link": "https://www.nytimes.com/2025/09/14/world/europe/lisbon-funicular-crash.html",
    "summary": "Lisbon has transformed itself in recent years into a destination for international investors. A funicular crash that killed 16 people has prompted soul-searching about the changes in the city."
  },
  {
    "title": "The German Elections That Are Set to Test the Attraction of the Far Right",
    "link": "https://www.nytimes.com/2025/09/14/world/europe/the-german-state-elections.html",
    "summary": "A municipal vote in the state of North Rhine-Westphalia will be a gauge of the national mood since Chancellor Friedrich Merz took office."
  }
]