[
  {
    "title": "Behind Powell’s Big Gamble in Final Jackson Hole Speech",
    "link": "https://www.nytimes.com/2025/08/21/business/jerome-powell-fed-jackson-hole.html",
    "summary": "Jerome Powell, the Federal Reserve chair, is managing a high-stakes balancing act as he grapples with a cooling labor market, rising inflation and White House pressure to cut interest rates."
  },
  {
    "title": "Investors Expect Nvidia’s Earnings to Move the S&P More Than Powell’s Speech",
    "link": "https://www.nytimes.com/2025/08/21/business/stocks-nvidia-federal-reserve.html",
    "summary": "When Nvidia, the chip producer, reports earnings next week, investors expect the S&amp;P 500 to have a bigger reaction than when the Fed chair delivers a big speech on Friday."
  },
  {
    "title": "Walmart Sees Sales ‘Momentum’ Despite Tariffs",
    "link": "https://www.nytimes.com/2025/08/21/business/walmart-sales-retail-tariffs.html",
    "summary": "After mixed reports from retail rivals, Walmart reported better-than-expected quarterly results and raised its sales forecast for the year."
  },
  {
    "title": "Israel’s Looming Plans for Gaza City, and a Surge in Stalking in Women’s Sports",
    "link": "https://www.nytimes.com/2025/08/21/podcasts/the-headlines/israel-gaza-war-stalking-womens-sports.html",
    "summary": "Plus, why steamy fan fiction is topping the best-seller list."
  },
  {
    "title": "In Trump’s Ideal Picture of America, Diversity Is Taboo",
    "link": "https://www.nytimes.com/2025/08/21/us/politics/trump-diversity-black-americans.html",
    "summary": "Using the full power of the federal government, President Trump has promoted a vision of America that challenges the legitimacy of the Black experience."
  },
  {
    "title": "How Tiffany Trump’s Husband Benefited From Proximity to Power",
    "link": "https://www.nytimes.com/2025/08/21/world/europe/michael-boulos-tiffany-trump-business-deals.html",
    "summary": "A Times investigation found that Michael Boulos and his family benefited financially from proximity to his in-laws for years."
  },
  {
    "title": "As Trump Weighs I.V.F., Republicans Back New ‘Natural’ Approach to Infertility",
    "link": "https://www.nytimes.com/2025/08/21/us/politics/trump-ivf-restorative-reproductive-medicine.html",
    "summary": "Long confined to the medical fringe, “restorative reproductive medicine” has unified Christian conservatives and proponents of the Make America Healthy Again movement on the political right."
  },
  {
    "title": "A Giant Wyeth Mural Comes Out of the Vault, Bearing Family Stories",
    "link": "https://www.nytimes.com/2025/08/21/arts/design/nc-wyeth-mural-wilmington-delaware.html",
    "summary": "N.C. Wyeth’s colossal 1932 mural, “Apotheosis of the Family,” re-emerges in a gleaming new round barn after years in storage."
  },
  {
    "title": "Texas and California Race Forward With Rival Redistricting Efforts",
    "link": "https://www.nytimes.com/2025/08/21/us/politics/redistricting-california-texas.html",
    "summary": "Lawmakers in the nation’s two most populous states were planning to vote Thursday on competing proposals as the battle over U.S. House maps intensified."
  },
  {
    "title": "Texas House Approves Redistricting Maps, Just as Trump Wanted",
    "link": "https://www.nytimes.com/2025/08/20/us/politics/texas-republicans-redistricting-maps.html",
    "summary": "The State Senate will vote Thursday on maps intended to help the G.O.P. win five more U.S. House seats in the midterm elections. California Democrats will counter on the same day."
  },
  {
    "title": "Obama Endorses Newsom’s Redistricting Proposal as a ‘Responsible Approach’",
    "link": "https://www.nytimes.com/2025/08/20/us/politics/california-redistricting-newsom-obama.html",
    "summary": "The former president suggested that Democrats opposing G.O.P. efforts in Texas and elsewhere should advance their own gerrymandering plans."
  },
  {
    "title": "Adams Adviser Suspended From Campaign After Giving Cash to Reporter",
    "link": "https://www.nytimes.com/2025/08/20/nyregion/eric-adams-winnie-greco-cash-reporter.html",
    "summary": "A campaign volunteer for Mayor Eric Adams of New York was suspended after giving a journalist cash in a potato chip bag."
  },
  {
    "title": "What to Know About the Charges and Investigations Surrounding Eric Adams",
    "link": "https://www.nytimes.com/2025/08/20/nyregion/eric-adams-corruption-charges-investigations.html",
    "summary": "Months after a federal corruption indictment against Mayor Eric Adams of New York was dropped, some of his allies remain under investigation or have been charged with crimes."
  },
  {
    "title": "Mamdani, Skeptical of Casinos, Won’t Try to Block Them in New York City",
    "link": "https://www.nytimes.com/2025/08/20/nyregion/mamdani-casinos-nyc-mayor.html",
    "summary": "Zohran Mamdani, the Democratic mayoral nominee, said that while he still had doubts about city casinos, he respected the views of voters who supported them."
  },
  {
    "title": "Ukraine Works to Identify 6,000 Bodies Sent From Russia in Makeshift Rail Platform Lab",
    "link": "https://www.nytimes.com/2025/08/21/world/europe/ukraine-russia-war-exchange-soldier-bodies.html",
    "summary": "The mass return of fallen soldiers is one of the few concrete results of U.S.-orchestrated truce negotiations."
  },
  {
    "title": "Zelensky, Back From Washington, Projects More Confidence in Peace Talks",
    "link": "https://www.nytimes.com/2025/08/21/world/europe/zelensky-ukraine-russia-trump-peace-talks.html",
    "summary": "The Ukrainian leader returned with a U.S. commitment to participate in security guarantees for Kyiv in a postwar settlement."
  },
  {
    "title": "Rubio Takes on Tricky Task of Drafting Security Guarantees for Ukraine",
    "link": "https://www.nytimes.com/2025/08/20/us/politics/marco-rubio-ukraine.html",
    "summary": "The secretary of state and national security adviser will meet with European counterparts on Thursday in an effort to advance a peace process that so far has gotten little traction."
  },
  {
    "title": "Gazans Fear Looming Israeli Operation",
    "link": "https://www.nytimes.com/2025/08/20/world/middleeast/gaza-city-israeli-operation.html",
    "summary": "Israel’s plan to invade Gaza City, the most populous city in the northern Gaza Strip, has forced many families to consider uprooting themselves."
  },
  {
    "title": "With Moves on West Bank and Gaza City, Israel Defies Global Outcry",
    "link": "https://www.nytimes.com/2025/08/20/world/middleeast/israel-hamas-gaza-city.html",
    "summary": "Israel approved new settlements in the occupied West Bank, while its troops have reached the outskirts of Gaza City. The developments raise questions about the viability of a cease-fire proposal."
  },
  {
    "title": "Israel Approves Settlements, a Blow to Faded Hopes for a Palestinian State",
    "link": "https://www.nytimes.com/2025/08/20/world/middleeast/israel-e1-settlement-west-bank.html",
    "summary": "The long-stalled project near Jerusalem, known as E1, further fragments West Bank lands envisioned as part of a Palestinian state, advancing a goal of Israeli hard-liners."
  },
  {
    "title": "Brazil-U.S. Talks on Mining Rare Earth Minerals Are Complicated by Trump’s Tariffs",
    "link": "https://www.nytimes.com/2025/08/21/world/americas/brazil-us-rare-earth-minerals-tariffs.html",
    "summary": "Tensions between President Trump and Brazil’s leader could derail a promising alliance to unlock the world’s second largest reserve of the minerals."
  },
  {
    "title": "‘A Soundtrack of Skating’ Let the Tony Hawk Games Soar",
    "link": "https://www.nytimes.com/2025/08/18/arts/tony-hawk-pro-skater-music-soundtrack.html",
    "summary": "The hip-hop, punk and nu-metal tracks on Tony Hawk’s Pro Skater 2 helped imprint memories like nosegrinding a helicopter."
  },
  {
    "title": "The Menendez Brothers Make Their Case for Parole",
    "link": "https://www.nytimes.com/2025/08/21/us/menendez-brothers-parole.html",
    "summary": "The two will have separate hearings, and it is not at all certain that the outcome will be the same for each man."
  },
  {
    "title": "As Menendez Brothers Seek Parole, a New Tour Visits the Crime Scene",
    "link": "https://www.nytimes.com/2025/08/21/style/menendez-brothers-oj-simpson-crime-tour.html",
    "summary": "As Erik and Lyle Menendez wait for a ruling on their parole, a new tour is retelling their story, in detail, from the back of a limousine."
  },
  {
    "title": "Why Shop? In Maine, the Library of Things Has It All (Almost)",
    "link": "https://www.nytimes.com/2025/08/20/climate/maine-library-of-things.html",
    "summary": "One town’s effort to make pricey items accessible and encourage people to buy less stuff seems to be catching on."
  },
  {
    "title": "One Sentence in the Constitution Is Causing America Huge Problems",
    "link": "https://www.nytimes.com/2025/08/21/opinion/trump-constitution-unitary-executive.html",
    "summary": "An amendment that can help save our democracy."
  },
  {
    "title": "I’m a Proud Conservative. My Disabled Son Needs Medicaid to Live.",
    "link": "https://www.nytimes.com/2025/08/21/opinion/medicaid-conservative.html",
    "summary": "The uncertainty around the future of Medicaid is paralyzing for families like mine."
  },
  {
    "title": "Your Questions About Psychedelics",
    "link": "https://www.nytimes.com/2025/08/21/briefing/your-questions-about-psychedelics.html",
    "summary": "Our readers wondered about the ailments they can treat, the dangers of using them and where you can get some."
  },
  {
    "title": "Wisconsin Woman Who Flew to UK to Try to Kill a Man Gets 30-Year Sentence",
    "link": "https://www.nytimes.com/2025/08/21/world/europe/aimee-betro-assassination-attempt-sentence.html",
    "summary": "Aimee Betro, 45, was convicted this month of attempting to shoot a man near Birmingham, England, in 2019."
  },
  {
    "title": "Gavin Newsom’s Latest Role: Social Media Troll",
    "link": "https://www.nytimes.com/2025/08/20/us/newsom-trump-social-media.html",
    "summary": "The California governor’s press office is mimicking President Trump’s distinctive Truth Social style on X. Liberals love it. The White House says it’s “just getting weird at this point.”"
  }
]