[
  {
    "title": "FDA Approves Generic Version of Abortion Pill Mifepristone",
    "link": "https://www.nytimes.com/2025/10/02/health/abortion-pill-generic-fda.html",
    "summary": "The decision enraged opponents of abortion, who have been pressuring the Trump administration to restrict access to abortion medication."
  },
  {
    "title": "What Is Mifepristone and How Is It Used?",
    "link": "https://www.nytimes.com/2024/06/13/us/politics/what-is-mifepristone.html",
    "summary": "More than half of people who get legal abortions in the United States — and three-quarters in Europe — use medication abortion."
  },
  {
    "title": "Trump Asked Universities to Sign a Compact. Some See a Trap.",
    "link": "https://www.nytimes.com/2025/10/02/us/trump-universities-compact-funding.html",
    "summary": "Trump officials want universities to sign on to conservative priorities to get special treatment. Some in higher education say agreeing would end academic freedom."
  },
  {
    "title": "Trump ‘Determined’ the U.S. Is Now in a War With Drug Cartels, Congress Is Told",
    "link": "https://www.nytimes.com/2025/10/02/us/politics/trump-drug-cartels-war.html",
    "summary": "A notice calls the people the U.S. military recently killed on suspicion of drug smuggling in the Caribbean Sea “unlawful combatants.”"
  },
  {
    "title": "Kennedy Fires N.I.H. Scientist Who Filed Whistle-Blower Complaint",
    "link": "https://www.nytimes.com/2025/10/02/health/kennedy-marrazzo-nih.html",
    "summary": "Dr. Jeanne Marrazzo, who was on administrative leave, alleged that the Trump administration had defied court orders and undermined vaccine research."
  },
  {
    "title": "After Trump Pulls Funding, Work Continues on N.Y. Area Transit Projects",
    "link": "https://www.nytimes.com/2025/10/02/nyregion/trump-infrastructure-hudson-river-tunnel.html",
    "summary": "Two of the largest infrastructure initiatives in the United States were still moving forward this week despite the battles over a government shutdown surrounding them."
  },
  {
    "title": "Partisan Language Inserted Into Education Dept. Workers’ Automated Emails",
    "link": "https://www.nytimes.com/2025/10/02/us/politics/education-dept-shutdown-emails.html",
    "summary": "The out-of-office responses from the accounts of employees on furlough cast blame for the shutdown on Democrats."
  },
  {
    "title": "A Government Shutdown Silver Lining: Federal Workers Eat and Drink at a Discount",
    "link": "https://www.nytimes.com/2025/10/02/dining/government-shutdown-restaurants-discounts.html",
    "summary": "Washington watering holes and restaurants are showing solidarity and seizing an opportunity to draw in out-of-work government employees."
  },
  {
    "title": "Deadly Car Ramming and Stabbing Outside UK Synagogue Is Declared Terrorist Attack",
    "link": "https://www.nytimes.com/2025/10/02/world/europe/terrorist-attack-uk-synagogue-manchester.html",
    "summary": "The police identified the attacker as Jihad al-Shamie, 35, a British citizen of Syrian descent. He was shot dead, the police said, after killing two people in Manchester, England."
  },
  {
    "title": "Manchester Synagogue Attack Fuels Fears of Antisemitism in Britain",
    "link": "https://www.nytimes.com/2025/10/02/world/europe/britain-antisemitism-manchester.html",
    "summary": "In the hours after an attack, a blanket of fear and grief fell over synagogues and Jewish community centers across the country."
  },
  {
    "title": "‘A Crazy Moment’: Shock and Terror Spreads in Manchester Synagogue’s Community",
    "link": "https://www.nytimes.com/2025/10/02/world/europe/manchester-synagogue-neighborhood.html",
    "summary": "Many Orthodox Jews who live in the area reacted with horror to an attack that killed two people and seriously injured three on Yom Kippur, Judaism’s holiest day."
  },
  {
    "title": "Ophelia Disappeared: A Wall Street Analyst and a Deadly Shootout",
    "link": "https://www.nytimes.com/2025/10/02/us/zizians-group-disappearance.html",
    "summary": "The group was passionately vegan, mostly transgender and highly educated. Seven of them are now in jail. This is the story of one who did not survive."
  },
  {
    "title": "Sean ‘Diddy’ Combs Asks Judge for Mercy: ‘I Lost My Way’",
    "link": "https://www.nytimes.com/2025/10/02/arts/music/sean-combs-diddy-sentencing-letter-judge.html",
    "summary": "The music mogul submitted a letter to the court ahead of his sentencing on Friday for his conviction on two prostitution-related counts."
  },
  {
    "title": "After Declining to Give Trump a Sword for King Charles, a Museum Leader Is Out",
    "link": "https://www.nytimes.com/2025/10/02/arts/design/trump-eisenhower-king-charles-sword.html",
    "summary": "The departure of Todd Arrington, who led the Dwight D. Eisenhower Presidential Library and Museum, came after the administration sought a sword from its collection as a gift for King Charles."
  },
  {
    "title": "What Women Heard in Hegseth’s Remarks About Physical Standards",
    "link": "https://www.nytimes.com/2025/10/02/us/politics/women-military-hegseth-physical-standards.html",
    "summary": "The defense secretary raised the issue suggesting women were getting into combat not because they met high standards, but because they were given a pass."
  },
  {
    "title": "Veterans See Costs and Risks in Hegseth’s Military Rewind to 1990",
    "link": "https://www.nytimes.com/2025/10/02/us/hegseth-military-veterans-standards.html",
    "summary": "Defense Secretary Pete Hegseth has identified real problems, veteran officers say, but by looking back 35 years for policy cues, he risks hurting, not helping, military readiness."
  },
  {
    "title": "As Russian Drones Menace Europe, Putin Says Moscow Has No Plans to Invade",
    "link": "https://www.nytimes.com/2025/10/02/world/europe/putin-russia-drones.html",
    "summary": "President Vladimir V. Putin lashed out at “European elites” for “whipping up the hysteria” about the “Russian threat.”"
  },
  {
    "title": "OpenAI’s Sora Video App Is Jaw-Dropping (for Better and Worse)",
    "link": "https://www.nytimes.com/2025/10/02/technology/openai-sora-video-app.html",
    "summary": "Sora, OpenAI’s new video-generating app, is really a social network in disguise that can bring creative A.I. to the masses — and its problems, too."
  },
  {
    "title": "OpenAI Completes Deal That Values It at $500 Billion",
    "link": "https://www.nytimes.com/2025/10/02/technology/openai-deal-500-billion.html",
    "summary": "With the agreement, OpenAI becomes the world’s most valuable privately held company, surpassing the rocket maker SpaceX."
  },
  {
    "title": "Madagascar’s President Rajoelina Dissolved His Government, but Calls for His Resignation Continue",
    "link": "https://www.nytimes.com/2025/10/02/world/africa/madagascar-protests-president.html",
    "summary": "A growing protest movement on the African island, despite deadly clashes with security forces, vows to keep fighting until Andry Rajoelina is ousted."
  },
  {
    "title": "This City Was Forced to Overhaul Its Police Department. Crime Plummeted.",
    "link": "https://www.nytimes.com/2025/10/02/nyregion/newark-police-federal-oversight.html",
    "summary": "A federal judge said she was prepared to release Newark from a 2016 consent decree imposed after investigators found the city’s police routinely used excessive force and conducted unconstitutional stops and searches."
  },
  {
    "title": "Taylor Swift’s ‘Life of a Showgirl’ Is Her Eras Tour Victory Lap",
    "link": "https://www.nytimes.com/2025/10/02/arts/music/taylor-swift-life-of-a-showgirl-eras-tour.html",
    "summary": "The star’s power and reach has grown with each of her releases. Now she’s following her record-breaking live show with her 12th original studio LP, “The Life of a Showgirl.”"
  },
  {
    "title": "Trump’s ‘Compact’ With Universities Is Just Extortion",
    "link": "https://www.nytimes.com/2025/10/02/opinion/trump-compact-universities-constitution.html",
    "summary": "There seems to be no limit to the president’s odious attempts to control higher education."
  },
  {
    "title": "How to Beat an Autocrat at the Ballot Box",
    "link": "https://www.nytimes.com/2025/10/02/opinion/poland-election-autocrat-russia-hungary.html",
    "summary": "Authoritarians have lost elections before, and they will again."
  },
  {
    "title": "Trump Decided the U.S. Is in a War With Drug Cartels",
    "link": "https://www.nytimes.com/2025/10/02/briefing/trump-drug-cartels-taylor-swift-album.html",
    "summary": "Also, the president promised cuts to “Democrat agencies.” Here’s the latest at the end of Thursday."
  },
  {
    "title": "American Soldiers in American Cities",
    "link": "https://www.nytimes.com/2025/10/02/world/american-military-trump-manchester-synagogue-taylor-swift.html",
    "summary": "Our Pentagon reporter explains how President Trump has tapped into a fear that resonates in many places around the world."
  },
  {
    "title": "Tesla Is Sued by Family Who Says Faulty Cybertruck Doors Led to Woman’s Death",
    "link": "https://www.nytimes.com/2025/10/02/business/tesla-cybertruck-doors-lawsuit-california.html",
    "summary": "A college student was trapped in a burning Cybertruck because electronic doors made it difficult for her to get out or be rescued, a lawsuit claims."
  },
  {
    "title": "The Big Bad Wolf Is Afraid of You",
    "link": "https://www.nytimes.com/2025/10/02/science/wolves-humans-fear-study.html",
    "summary": "Researchers found that the predatory canines were far more likely to flee recordings of human voices than they were to run away from other sounds."
  },
  {
    "title": "Democrats Pull Away From AIPAC, Reflecting a Broader Shift",
    "link": "https://www.nytimes.com/2025/10/02/us/politics/democrats-aipac.html",
    "summary": "A quiet retreat by Democrats from the pre-eminent pro-Israel lobbying group is the latest evidence of a realignment underway in Congress on Israel."
  },
  {
    "title": "A Candidate Vanished at Sea. His Opponents Insist He Stay on the Ballot.",
    "link": "https://www.nytimes.com/2025/10/02/nyregion/nassau-candidate-missing.html",
    "summary": "Petros Krommidas, a Democrat, was running for county legislature on Long Island when he disappeared on a swim. A judge sided with Republicans and refused to allow a replacement candidate."
  }
]