[
  {
    "title": "Lashing Out Over Russia and Jobs Data, Trump Displays His Volatile Side",
    "link": "https://www.nytimes.com/2025/08/02/us/politics/trump-russia-jobs.html",
    "summary": "The president had been on something of a winning streak. But when faced with facts and foes that wouldn’t bend to his will, he responded with impatience and disproportionate intensity."
  },
  {
    "title": "Trump Fires BLS Commissioner, Claiming Weak Jobs Numbers Were ‘Rigged’",
    "link": "https://www.nytimes.com/2025/08/01/business/economy/trump-bls-firing-jobs-report.html",
    "summary": "Economists said ousting the head of the Bureau of Labor Statistics could undermine confidence in government economic data."
  },
  {
    "title": "Donor List Suggests Scale of Trump’s Pay-for-Access Operation",
    "link": "https://www.nytimes.com/2025/08/02/us/politics/donor-list-suggests-scale-of-trumps-pay-for-access-operation.html",
    "summary": "A new disclosure shows how corporations and individuals, including many in the crypto business, wrote big checks while seeking favor from the president."
  },
  {
    "title": "After a Lag, Consumers Begin to Feel the Pinch of Tariffs",
    "link": "https://www.nytimes.com/2025/08/02/business/trump-tariffs-consumer-prices.html",
    "summary": "There are growing signs that President Trump’s levies are filtering through to consumer prices, as companies exhaust options for keeping them stable."
  },
  {
    "title": "Will Trump’s Tariffs Close Income Gaps and Bring Factory Jobs Back to the U.S.? Probably Not.",
    "link": "https://www.nytimes.com/2025/08/02/business/economy/trump-tariffs-income-inequality.html",
    "summary": "The president has pitched his trade policies at workers who feel left behind by globalization. But that doesn’t mean trade barriers will revive factories and close income gaps."
  },
  {
    "title": "The Stock Market Is Good, Bad and Ugly, Often in Quick Succession",
    "link": "https://www.nytimes.com/2025/08/01/business/stock-market-best-worst-days-investing.html",
    "summary": "The market’s best days frequently occur in the midst of misery, our columnist says, so don’t bother trying to figure out where stocks are heading."
  },
  {
    "title": "Mike Huckabee, Israel’s Passionate Defender as Gaza War Drives Allies Away",
    "link": "https://www.nytimes.com/2025/08/02/world/middleeast/israel-huckabee.html",
    "summary": "Mr. Huckabee, a Baptist minister, is the first evangelical to serve as American ambassador to Israel. Christian conservatives and the Netanyahu government are pleased."
  },
  {
    "title": "Iran Is Holding at Least 4 US Citizens, Rights Groups and Families Say",
    "link": "https://www.nytimes.com/2025/08/02/world/middleeast/iran-american-citizens-detainees.html",
    "summary": "Two were seized after Israel and the United States attacked Iranian targets in June, and two others have been held since 2024."
  },
  {
    "title": "New Hostage Videos Sow Fear and Horror in Israel",
    "link": "https://www.nytimes.com/2025/08/02/world/europe/new-hostage-videos-sow-fear-and-horror-in-israel.html",
    "summary": "A “living skeleton, buried alive” in Gaza’s tunnels, was how the family of one hostage described him after seeing a video circulated by Hamas this week."
  },
  {
    "title": "Texas Pushes Redistricting Into an Era of ‘Maximum Warfare’",
    "link": "https://www.nytimes.com/2025/08/02/us/politics/texas-redistricting-democrats-republicans-midterms.html",
    "summary": "Republicans are pursuing every possible advantage, essentially trying to win elections long before people vote. In response, even some once-squeamish Democrats are talking about fighting ‘fire with fire.’"
  },
  {
    "title": "Texas State House Panel Advances Gerrymandered Congressional Map",
    "link": "https://www.nytimes.com/2025/08/02/us/politics/texas-redistricting.html",
    "summary": "The full Texas House will now vote next week on a map drawn to flip five House districts to the G.O.P., but Democrats might walk out to deny Republicans a quorum."
  },
  {
    "title": "Eric Holder on Why He Reversed Course on Gerrymandering",
    "link": "https://www.nytimes.com/2025/08/02/us/politics/eric-holder-democrats-gerrymandering.html",
    "summary": "Mr. Holder, the attorney general in the Obama administration, has long fought to end gerrymandered legislative maps. But a Republican effort in Texas threatens democracy, he said in an interview."
  },
  {
    "title": "How the New Texas Map Changes the Outlook for Control of the House",
    "link": "https://www.nytimes.com/2025/08/02/upshot/texas-map-redistricting-republicans-house.html",
    "summary": "Democrats’ chances would be hurt if the map were approved, but they would still be favored."
  },
  {
    "title": "What J.M.W. Turner Saw, and What We Still Can See",
    "link": "https://www.nytimes.com/2025/08/01/arts/design/jmw-turner-anniversary-uk.html",
    "summary": "In the 250 years since the artist was born, the natural world he loved so much has changed. But he still reminds us to look with truth, clarity, and feeling."
  },
  {
    "title": "Judges Keep Restrictions on Los Angeles Immigration Arrests",
    "link": "https://www.nytimes.com/2025/08/02/us/los-angeles-immigration-raids-ruling.html",
    "summary": "An appellate panel upheld a finding that federal agents appeared to rely exclusively on race and other factors, such as speaking Spanish, in making arrests."
  },
  {
    "title": "A Day at Two San Francisco Malls, One That Died and One That Thrived",
    "link": "https://www.nytimes.com/2025/08/02/us/san-francisco-malls-downtown.html",
    "summary": "The downtown mall was long considered a thriving retail anchor, while the suburban-style one was an afterthought. They had a surprising role reversal."
  },
  {
    "title": "An American Team Went to Combat Haiti’s Gangs, Then Lost Two of Its Own",
    "link": "https://www.nytimes.com/2025/08/02/us/americans-kidnapped-haiti-gangs-studebaker.html",
    "summary": "A Haitian American Navy veteran and his police officer cousin who were working in Haiti with Studebaker, an American military contractor, are missing and presumed dead."
  },
  {
    "title": "No Pets Left Behind: How a Dog’s Hurricane Rescue Changed Florida Law",
    "link": "https://www.nytimes.com/2025/08/02/us/trooper-dog-florida-law-hurricane-milton.html",
    "summary": "A state trooper went to the aid of a bull terrier who had been abandoned as Hurricane Milton approached. Now the dog, named Trooper, is thriving, and his story inspired stricter animal protections."
  },
  {
    "title": "With a Joyous Festival, the Vatican Aims to Draw In the Digital Generation",
    "link": "https://www.nytimes.com/2025/08/02/world/europe/rome-youth-catholics-pope.html",
    "summary": "In a mass gathering that has been called the “Catholic Woodstock,” the church has embraced influencers on social media as a way to engage young people."
  },
  {
    "title": "Before D.C. Crash, Fates of 2 Pilots and Air Traffic Controller Entwined",
    "link": "https://www.nytimes.com/2025/08/01/us/politics/dc-plane-helicopter-crash.html",
    "summary": "Documents released in the inquiry into the deadly midair collision over the Potomac River on Jan. 29 reveal new details about three people whose decisions shaped the outcome of the disaster."
  },
  {
    "title": "Army Pilots Might Have Struggled to See Passenger Jet Before D.C. Crash",
    "link": "https://www.nytimes.com/2025/08/01/us/politics/army-pilots-jet-crash.html",
    "summary": "Light pollution from Washington and the passenger jet’s dim lights might have contributed to difficulties spotting American Airlines Flight 5342 before the collision on Jan. 29, Army experts said."
  },
  {
    "title": "Leaving the City for the Farm Is a Hard Row to Hoe. But They Did It.",
    "link": "https://www.nytimes.com/2025/08/02/realestate/how-to-become-a-farmer.html",
    "summary": "We spoke with several Sullivan County farmers about the urban lives they left behind, and what it means to tend the land in the 21st century."
  },
  {
    "title": "Attention, Men: Books Are Sexy!",
    "link": "https://www.nytimes.com/2025/08/02/opinion/reading-men-fiction-sexy.html",
    "summary": "Nobody likes a dumb guy."
  },
  {
    "title": "Gwyneth Paltrow Sells Astronomer Like She Sells Goop",
    "link": "https://www.nytimes.com/2025/08/02/opinion/gwyneth-paltrow-astronomer-goop.html",
    "summary": "Why do we buy whatever it is that she is selling?"
  },
  {
    "title": "A Letter to the Future",
    "link": "https://www.nytimes.com/2025/08/02/briefing/a-letter-to-the-future.html",
    "summary": "Writing yourself a letter is a good way to identify the things in your life that matter — as well as those things that you can let go."
  },
  {
    "title": "Search in Montana Continues for Suspect in Fatal Anaconda Bar Shooting",
    "link": "https://www.nytimes.com/2025/08/02/us/montana-search-suspect-anaconda-bar-shooting.html",
    "summary": "Authorities were focusing on brushy terrain near the town of Anaconda, where they said the suspect killed four people."
  },
  {
    "title": "A Fish Falls From the Sky and Sparks a Brush Fire in British Columbia",
    "link": "https://www.nytimes.com/2025/08/02/world/canada/brush-fire-bc-interior-fish-power-lines.html",
    "summary": "Officials say a flying osprey dropped its catch, which then struck power lines, causing sparks that ignited dry grass."
  },
  {
    "title": "Triangles, Crescents, Slivers: Can Odd-Shaped Lots Help Ease the Housing Crisis?",
    "link": "https://www.nytimes.com/2025/08/02/business/housing-crisis-odd-lots.html",
    "summary": "As needs escalate, more U.S. cities and states are making it easier to build on irregular and long-overlooked lots."
  },
  {
    "title": "Why Even Basic Airline Seats Keep Getting More ‘Premium’",
    "link": "https://www.nytimes.com/2025/08/02/business/dealbook/premium-airfare.html",
    "summary": "As travel demand sinks, both legacy airlines and budget brands have turned to a strategy of ever-expanding upgrades."
  }
]