[
  {
    "title": "‘Dangerous Cities,’ the Military, Trump and the Founding Fathers",
    "link": "https://www.nytimes.com/2025/10/01/us/politics/trump-military-founding-fathers.html",
    "summary": "The U.S. armed services have long sought to preserve the tradition of a nonpartisan military."
  },
  {
    "title": "Fed’s Independence in Jeopardy Despite Latest Lisa Cook Victory",
    "link": "https://www.nytimes.com/2025/10/02/business/federal-reserve-independence-lisa-cook.html",
    "summary": "A Supreme Court order keeping Lisa Cook on the Federal Reserve Board for now is “a time to exhale but not breathe easy,” one expert said."
  },
  {
    "title": "Trump Administration Asks Colleges to Sign ‘Compact’ to Get Funding Preference",
    "link": "https://www.nytimes.com/2025/10/02/us/politics/trump-college-funding.html",
    "summary": "Demands sent to nine top schools included pledging to freeze tuition for five years and to commit to strict definitions of gender."
  },
  {
    "title": "Drones, Helicopters, Hundreds of Arrests: Trump’s Immigration Crackdown in Chicago So Far",
    "link": "https://www.nytimes.com/2025/10/01/us/trump-chicago-immigration-national-guard.html",
    "summary": "The administration announced a federal operation in the Chicago area more than three weeks ago. Agents have appeared along downtown streets, and National Guard troops are expected."
  },
  {
    "title": "Trump’s Shutdown Agenda, and a Wave of Mysterious Drones in Scandinavia",
    "link": "https://www.nytimes.com/2025/10/02/podcasts/the-headlines/trump-shutdown-agenda-drones-scandinavia-denmark.html",
    "summary": "Plus, what Jane Goodall learned among the chimps."
  },
  {
    "title": "For Workers, Mixed Signals. For the Public, Limited Impact on Shutdown’s First Day.",
    "link": "https://www.nytimes.com/2025/10/01/us/politics/shutdown-federal-workers-agencies.html",
    "summary": "Federal agencies gave shifting and mixed guidance to their work forces about who should come to work and who shouldn’t, but the initial effect on services appeared scattered and limited."
  },
  {
    "title": "Trump Uses Shutdown to Maximize Pain for Democrats and Move Forward With Layoffs",
    "link": "https://www.nytimes.com/2025/10/01/us/politics/white-house-shutdown-punishment.html",
    "summary": "The Trump administration forged ahead with plans to conduct mass layoffs, as the fiscal standoff appeared to intensify."
  },
  {
    "title": "White House Seeks to Blunt Democrats’ Shutdown Strategy on Health Care",
    "link": "https://www.nytimes.com/2025/10/01/us/politics/trump-democrats-health-care.html",
    "summary": "President Trump has made lowering health care costs a key priority, even as Democrats warn that costs will skyrocket."
  },
  {
    "title": "The Be-Careful-What-You-Wish-For Shutdown",
    "link": "https://www.nytimes.com/2025/10/01/us/politics/politics-shutdown-democrats-trump.html",
    "summary": "Unlike in shutdowns past, President Trump is the wild card."
  },
  {
    "title": "Synagogue Attack on Yom Kippur in Manchester, UK: What We Know",
    "link": "https://www.nytimes.com/2025/10/02/world/europe/uk-manchester-synagogue-attack.html",
    "summary": "Two people were killed and at least three others were in serious condition after the vehicle ramming and stabbing attack on Yom Kippur."
  },
  {
    "title": "Times/Siena Survey: Americans Worry Divisions Cannot Be Overcome",
    "link": "https://www.nytimes.com/2025/10/02/us/politics/times-siena-poll-political-polarization.html",
    "summary": "A new Times/Siena survey shows a significant shift among voters, as their concerns about the health of the political system overtake other issues."
  },
  {
    "title": "In ‘Roofman,’ Channing Tatum Finally Feels He Can Hold His Own",
    "link": "https://www.nytimes.com/2025/10/02/movies/channing-tatum-roofman.html",
    "summary": "For years, he battled impostor syndrome: “I felt like I was just barely hanging on.” Finally, with “Roofman,” he says he can hold his own against any actor."
  },
  {
    "title": "After Michigan Church Shooting, One Man Raised $200,000 for the Suspect’s Family",
    "link": "https://www.nytimes.com/2025/10/02/us/lds-church-michigan-grand-blanc-township.html",
    "summary": "A member of the Latter-day Saints church was worried about the road to recovery that the family of the Michigan gunman faced. So he started a donation page for them."
  },
  {
    "title": "‘There Will Always Only Be One Jane Goodall’",
    "link": "https://www.nytimes.com/2025/10/01/science/jane-goodall-chimpanzees-career.html",
    "summary": "Scientists reflect on the life and work of a researcher whose discoveries made them rethink what it means to be human."
  },
  {
    "title": "Jane Goodall’s Thoughts for a Reporter: ‘Hope Isn’t Just Wishful Thinking’",
    "link": "https://www.nytimes.com/2025/10/01/climate/jane-goodall-interviews.html",
    "summary": "A Times correspondent who interviewed Dr. Goodall recalled their conversations about the state of the planet."
  },
  {
    "title": "Many Palestinians Say Hamas Must Accept U.S. Cease-Fire Plan",
    "link": "https://www.nytimes.com/2025/10/02/world/middleeast/palestinian-voices-hamas-cease-fire.html",
    "summary": "Interviews in Gaza suggest wide support for a proposal that calls for an immediate end to a war that has brought immense civilian suffering."
  },
  {
    "title": "A Family’s Global Efforts to Free the Only Nepali Kidnapped by Hamas",
    "link": "https://www.nytimes.com/2025/10/02/world/middleeast/nepal-gaza-hostage.html",
    "summary": "A family’s campaign to free a student abducted from a rural Israeli town two years ago may be imperiled by an uprising in Nepal and stalled attempts at a cease-fire."
  },
  {
    "title": "The Global Sumud Flotilla Is Approaching Gaza. Here’s What to Know.",
    "link": "https://www.nytimes.com/2025/10/01/world/middleeast/gaza-flotilla-aid-global-sumud-israel.html",
    "summary": "The Israeli government said it had detained activists onboard boats trying to take humanitarian goods to the enclave."
  },
  {
    "title": "Mamdani Says He Would Phase Out N.Y.C. Gifted Program for Early Grades",
    "link": "https://www.nytimes.com/2025/10/02/nyregion/mamdani-schools-gifted-and-talented-program.html",
    "summary": "Zohran Mamdani, the Democratic front-runner in the mayor’s race, plans if elected to replace the selective program, which became a symbol of segregation in public schools."
  },
  {
    "title": "New Tariffs Could Worsen America’s Housing Crisis",
    "link": "https://www.nytimes.com/2025/10/02/business/tariffs-lumber-furniture-housing-crisis.html",
    "summary": "President Trump’s tariffs on timber, wood, furniture and kitchen cabinets could raise the cost of building and buying a home."
  },
  {
    "title": "A Run on Canned Mackerel and Emergency Radios. The Reason? Drones.",
    "link": "https://www.nytimes.com/2025/10/02/world/europe/denmark-drones-prepping.html",
    "summary": "The Danish public has been unsettled by a wave of mysterious drone incursions, which has underscored the country’s vulnerability."
  },
  {
    "title": "We Finally Have Free Anti-Robocall Tools That Work",
    "link": "https://www.nytimes.com/2025/10/02/technology/personaltech/iphone-robocalls-screener-android.html",
    "summary": "A new feature for iPhones screens calls, similar to a technology available for Android users. Here’s how to activate it."
  },
  {
    "title": "Does Hayley Williams Want to Escape Paramore’s Shadow? It Depends.",
    "link": "https://www.nytimes.com/2025/10/01/arts/music/hayley-williams-paramore-popcast-interview.html",
    "summary": "The frontwoman and songwriter on how the evolution of her long-running band has shaped her third solo release, and what might come next."
  },
  {
    "title": "Peace in Northern Ireland Was Impossible, Until They Put Hate Aside",
    "link": "https://www.nytimes.com/2025/10/02/opinion/northern-ireland-war-gaza-resolution.html",
    "summary": "Middle East peace may seem hopeless, but Northern Ireland shows that even the most intractable conflict can be resolved."
  },
  {
    "title": "How Radical Is Hasan Piker? The Twitch Star’s Flirtation With Violence.",
    "link": "https://www.nytimes.com/2025/10/02/opinion/hasan-piker-interesting-times-ross-douthat.html",
    "summary": "Meet the online star who likes to play with fire."
  },
  {
    "title": "Colbert: Try Unplugging the Government Then Turning It on Again",
    "link": "https://www.nytimes.com/2025/10/02/arts/television/colbert-government-shutdown.html",
    "summary": "“If that doesn’t work, maybe toss it in a bag of rice,” the “Late Show” host Stephen Colbert said a day after the U.S. government shut down."
  },
  {
    "title": "No More Signs of Life From Rubble of Collapsed School in Indonesia",
    "link": "https://www.nytimes.com/2025/10/02/world/asia/indonesia-school-collapse.html",
    "summary": "Rescuers saved five more students from under the building on Thursday but said they would end the search three days after the deadly accident."
  },
  {
    "title": "Two Planes Collide on LaGuardia Airport Taxiway",
    "link": "https://www.nytimes.com/2025/10/02/nyregion/delta-plane-collision-laguardia.html",
    "summary": "A plane that was preparing to take off struck a plane that had landed, the authorities said. One passenger was injured."
  },
  {
    "title": "Does Your Backyard Need a Stegosaurus?",
    "link": "https://www.nytimes.com/2025/10/01/nyregion/new-jersey-dinosaur-sale.html",
    "summary": "A popular theme park is closing. That’s good news for dinosaur fans who want their own life-size animatronic attraction."
  },
  {
    "title": "She Loved Eric Adams. She Kept It a Secret. Now She’s Talking.",
    "link": "https://www.nytimes.com/2025/10/01/nyregion/jasmine-ray-memoir-eric-adams.html",
    "summary": "Jasmine Ray, who served at City Hall in a $160,000-a-year job, had an undisclosed romance with Eric Adams years before he became mayor. In her memoir, she describes their relationship."
  }
]