[
  {
    "title": "Six Takeaways From the Senate Deal to End the Shutdown",
    "link": "https://www.nytimes.com/2025/11/10/us/politics/takeaways-senate-democrats-shutdown.html",
    "summary": "For 40 days, Senator Chuck Schumer kept his caucus unified. But an end approached without Democrats achieving an extension of expiring health insurance subsidies."
  },
  {
    "title": "Trump Officials Push States to ‘Undo’ Work to Send Full SNAP Benefits",
    "link": "https://www.nytimes.com/2025/11/09/business/trump-administration-states-undo-full-snap-food-stamps.html",
    "summary": "An appeals court made a late-night ruling against Trump officials as they dug in on cutting payments to states."
  },
  {
    "title": "BBC Director Tim Davie and CEO Deborah Turness Quit Following Trump Documentary Turmoil",
    "link": "https://www.nytimes.com/2025/11/09/world/europe/bbc-resignations.html",
    "summary": "The abrupt moves followed furor over claims that a documentary had misleadingly edited footage of President Trump’s speech before the Jan. 6 Capitol riot."
  },
  {
    "title": "Federal Judge, Warning of ‘Existential Threat’ to Democracy, Resigns",
    "link": "https://www.nytimes.com/2025/11/09/us/politics/mark-wolf-federal-judge-resigns.html",
    "summary": "Judge Mark L. Wolf, writing in The Atlantic, said he was stepping down to speak out against the “assault on the rule of law” by President Trump, whom he accused of “targeting his adversaries.”"
  },
  {
    "title": "Trump Loyalists Push ‘Grand Conspiracy’ as New Subpoenas Land",
    "link": "https://www.nytimes.com/2025/11/09/us/politics/trump-conspiracy-probe-subpoenas.html",
    "summary": "The Justice Department moved an inquiry that appeared initially focused on the former C.I.A. director John O. Brennan to South Florida and is beginning to recruit line prosecutors."
  },
  {
    "title": "Hochul Raises Doubts About Mamdani’s Free Bus Proposal",
    "link": "https://www.nytimes.com/2025/11/09/nyregion/hochul-mamdani-free-buses.html",
    "summary": "Gov. Kathy Hochul of New York said she had concerns about Mayor-elect Zohran Mamdani’s plan to make New York City buses free. She supports his proposal for universal child care."
  },
  {
    "title": "Emmanuel Clase and Luis Ortiz, Two MLB Pitchers, Charged in Gambling Investigation",
    "link": "https://www.nytimes.com/2025/11/09/nyregion/mlb-pitchers-gambling.html",
    "summary": "Emmanuel Clase and Luis Ortiz, pitchers for the Cleveland Guardians, were charged with sharing inside information about their pitches with bettors. Mr. Ortiz was arrested Sunday."
  },
  {
    "title": "As Trump Recasts History, a Civil Rights Museum Sticks to a Messy Past",
    "link": "https://www.nytimes.com/2025/11/08/arts/design/trump-national-center-civil-human-rights.html",
    "summary": "The National Center for Civil and Human Rights is expanding its exploration of the country’s racial dynamics despite a surge of government resistance."
  },
  {
    "title": "Is This Artist the Joe Rogan of the Art World?",
    "link": "https://www.nytimes.com/2025/11/08/arts/design/is-this-artist-the-joe-rogan-of-the-art-world.html",
    "summary": "Joshua Citarella, the artist behind the podcast “Doomscroll” and the digital project Do Not Research, explains how online subcultures influence today’s politics."
  },
  {
    "title": "Lenny Wilkens, N.B.A. Hall of Famer as Both Player and Coach, Dies at 88",
    "link": "https://www.nytimes.com/2025/11/09/sports/lenny-wilkens-dead.html",
    "summary": "A perennial All Star, he was cited as one of the league’s 50 greatest players and one of its top 10 coaches, winning 1,332 games and leading Seattle to a championship."
  },
  {
    "title": "Glass Skin and Snail Mucin: South Korea’s Journey to Global Beauty Power",
    "link": "https://www.nytimes.com/2025/11/10/business/south-korea-k-beauty-amorepacific.html",
    "summary": "Propelled by interest in all things South Korea, Amorepacific, the cosmetics giant, is expanding its reach into the United States. But so are many of its competitors."
  },
  {
    "title": "Second Migrant Child Dies on ‘Reverse Migration’ Boat Route",
    "link": "https://www.nytimes.com/2025/11/09/world/americas/migrant-child-drowns-panama.html",
    "summary": "A 3-year-old from Colombia died when a boat carrying migrants back to South America capsized off Panama’s Caribbean Coast, an official said. Another child drowned on the same migrant route in February."
  },
  {
    "title": "Hundreds of Migrants Missing Off Malaysia’s Coast",
    "link": "https://www.nytimes.com/2025/11/09/world/asia/malaysia-thailand-migrants-boat.html",
    "summary": "A boat said to be carrying people from the Rohingya ethnic minority capsized, and another was missing. At least seven bodies were recovered."
  },
  {
    "title": "Cruelty, Bigotry and Rage. What’s Not to Like?",
    "link": "https://www.nytimes.com/2025/11/09/opinion/right-wing-america-politics-culture.html",
    "summary": "This is what happens when the fringe becomes the mainstream (and vice versa)."
  },
  {
    "title": "Mamdani Isn’t the Future of the Democrats. This Guy Is.",
    "link": "https://www.nytimes.com/2025/11/09/opinion/josh-shapiro-democratic-party.html",
    "summary": "The Democratic Party will not return to the White House, nor reclaim Congress, until it learns to embrace centrist politicians like Pennsylvania’s governor."
  },
  {
    "title": "After Hurricane Melissa, Solar Power Kept the Electricity on for Some Jamaicans",
    "link": "https://www.nytimes.com/2025/11/08/climate/jamaica-hurricane-solar-power.html",
    "summary": "People with rooftop solar panels got their power back almost immediately. The ‘entire neighborhood benefits,’ one resident said."
  },
  {
    "title": "Medical Marijuana Grower in New Zealand Faces Criminal Charges",
    "link": "https://www.nytimes.com/2025/11/10/world/asia/medical-marijuana-new-zealand-gandalf.html",
    "summary": "A police raid and criminal case against a longtime cultivator of cannabis in New Zealand’s Northland region has stirred up debates about medicinal marijuana."
  },
  {
    "title": "Paul Tagliabue, Who Led the N.F.L. for 17 Prosperous Years, Dies at 84",
    "link": "https://www.nytimes.com/2025/11/09/obituaries/paul-tagliabue-dead.html",
    "summary": "He helped achieve labor peace, pushed for minority hiring and oversaw the league’s expansion. But he minimized the risks of concussions."
  },
  {
    "title": "Arctic Blast Is Sweeping East, Bringing First Snow of the Season",
    "link": "https://www.nytimes.com/2025/11/09/weather/cold-snow-weather-forecast.html",
    "summary": "Temperatures 10 to 20 degrees below normal are expected to reach as deep as the South, forecasters said. Snow is likely in the Great Lakes, parts of the Northeast and the Appalachians."
  }
]