[
  {
    "title": "For Trump, the Truth in Minneapolis Is What He Says It Is",
    "link": "https://www.nytimes.com/2026/01/25/us/politics/trump-truth-minneapolis-shootings.html",
    "summary": "The Trump team has advanced one-sided narratives to justify each of the killings, even when bystander video shows something else entirely."
  },
  {
    "title": "Alex Jeffrey Pretti Knew He Wanted to Help Others",
    "link": "https://www.nytimes.com/2026/01/24/us/alex-jeffrey-pretti-icu-nurse-minneapolis-shooting.html",
    "summary": "Shot and killed by immigration agents on a Minneapolis street, he wanted to be a ‘force of good in the world.’"
  },
  {
    "title": "Winter Storm Drives U.S. Flight Cancellations to Pandemic-Level Numbers",
    "link": "https://www.nytimes.com/2026/01/25/weather/winter-storm-flight-delays-cancellations.html",
    "summary": "Nearly 9,000 departures were canceled on Sunday, more than on any other day since the beginning of the Covid-19 pandemic."
  },
  {
    "title": "Another East Coast Storm? Don’t Buy the Hype Just Yet.",
    "link": "https://www.nytimes.com/2026/01/25/weather/another-storm-forecast-noreaster.html",
    "summary": "After a computer model began hinting that another storm could be on the way, meteorologists sought to tamp down speculation."
  },
  {
    "title": "A Sunday Snowstorm Blankets New York",
    "link": "https://www.nytimes.com/2026/01/25/nyregion/snow-storm-new-york.html",
    "summary": "The city got about nine inches of snow and at least one person died from exposure to the cold as Mayor Zohran Mamdani faced his first big test in nuts-and-bolts governing."
  },
  {
    "title": "Xi’s Purge of China’s Military Brings Its Top General Down",
    "link": "https://www.nytimes.com/2026/01/24/world/asia/china-top-general-xi-military-purge.html",
    "summary": "The ouster of Gen. Zhang Youxia, who was second only to Xi Jinping in the military hierarchy, marks “the total annihilation of the high command,” one analyst said."
  },
  {
    "title": "Columbia Selects University of Wisconsin Chancellor as Its President",
    "link": "https://www.nytimes.com/2026/01/25/nyregion/columbia-president-wisconsin-mnookin.html",
    "summary": "Jennifer Mnookin has led the flagship campus of the state university system since 2022."
  },
  {
    "title": "Fashion Is Exaggerating the Female Form Like Never Before. What Is Going On?",
    "link": "https://www.nytimes.com/2026/01/25/style/the-year-of-manufacturing-the-body-and-booty-and-boobs.html",
    "summary": "Fashion has begun exaggerating, or distorting, the female form like never before. What exactly is going on?"
  },
  {
    "title": "How Iran Crushed a Citizen Uprising With Lethal Force",
    "link": "https://www.nytimes.com/2026/01/25/world/middleeast/iran-how-crackdown-was-done.html",
    "summary": "Protests erupted amid a communications blackout. But as video and witness accounts trickle out, the brutality of the regime’s crackdown is becoming clear."
  },
  {
    "title": "Amid Two-Week Internet Blackout, Some Iranians Are Getting Back Online",
    "link": "https://www.nytimes.com/2026/01/25/world/middleeast/iran-internet.html",
    "summary": "Many in Iran are gaining brief and unexplained windows of online connectivity, offering a widening glimpse of the extent of the government crackdown."
  },
  {
    "title": "In Venezuela, Families Search for Relatives Who Are Detained and Missing",
    "link": "https://www.nytimes.com/2026/01/25/world/americas/in-venezuela-families-search-for-relatives-who-are-detained-and-missing.html",
    "summary": "Even as dozens of political prisoners have been freed, at least 66 people taken by state authorities and never heard from again remain missing, relatives and rights groups say."
  },
  {
    "title": "Frank Carone, a Brooklyn Power Broker, Is Under Federal Investigation",
    "link": "https://www.nytimes.com/2026/01/24/nyregion/nyc-frank-carone-corruption-investigation.html",
    "summary": "Federal prosecutors and the F.B.I. are scrutinizing Mr. Carone, who served as chief of staff during Eric Adams’s first year as mayor of New York."
  },
  {
    "title": "Hard Times in the Mississippi Delta as Farmers Consider Letting Crops Rot",
    "link": "https://www.nytimes.com/2026/01/25/business/mississippi-delta-farmers-rice-prices.html",
    "summary": "Prices for nearly every major U.S. crop are below what it costs to grow them. But a drop in rice prices means another blow to farmers in Mississippi’s agricultural belt."
  },
  {
    "title": "Travel Math: When Flying Costs as Much as the Train, Who Wins?",
    "link": "https://www.nytimes.com/2026/01/24/us/politics/amtrak-dynamic-pricing-flying.html",
    "summary": "Amtrak says dynamic pricing has helped strengthen its finances, but travelers often grumble at the cost, especially for last-minute travel. Still, the train has a secret weapon: avoiding the airport."
  },
  {
    "title": "The Trump Administration Is Lying to Our Faces. Congress Must Act.",
    "link": "https://www.nytimes.com/2026/01/25/opinion/alex-pretti-minneapolis-shooting-border-patrol.html",
    "summary": "The Trump administration is once again engaged in a perversion of justice."
  },
  {
    "title": "Minneapolis and Gaza Now Share the Same Violent Language",
    "link": "https://www.nytimes.com/2026/01/25/opinion/minneapolis-gaza-masked-violence.html",
    "summary": "When ICE and Hamas start looking the same, we are all in trouble."
  },
  {
    "title": "Pro-Israel Group Targets a Former Ally in an Early Congressional Race",
    "link": "https://www.nytimes.com/2026/01/25/nyregion/new-jersey-malinowski-israel-aipac.html",
    "summary": "A super PAC affiliated with the American Israel Public Affairs Committee is running ads against Tom Malinowski, who is hoping to replace Gov. Mikie Sherrill of New Jersey in the House."
  },
  {
    "title": "Eleanor Holmes Norton Files to End Re-election Campaign",
    "link": "https://www.nytimes.com/2026/01/25/us/politics/eleanor-holmes-norton-re-election-campaign.html",
    "summary": "It was not clear whether Washington’s 88-year-old veteran delegate, who has been in declining health but has insisted she would seek re-election, was aware of the filing."
  },
  {
    "title": "George Cabot Lodge, Last of His Family to Battle a Kennedy, Dies at 98",
    "link": "https://www.nytimes.com/2026/01/25/obituaries/george-cabot-lodge-dead.html",
    "summary": "The two Massachusetts clans faced off in elections for decades, until a final 1962 Senate race. Despite his loss, Mr. Lodge praised his opponent, Ted Kennedy."
  },
  {
    "title": "In Visits to Dealerships, Pair Schemed to Steal High-End Vehicles, Police Say",
    "link": "https://www.nytimes.com/2026/01/25/nyregion/car-theft-ring.html",
    "summary": "An organized theft ring in Connecticut, New Jersey and New York swapped or quickly cloned key fobs to steal millions of dollars’ worth of vehicles, officials said."
  }
]