[
  {
    "title": "Jobs Report Withheld by Shutdown Leaves Economists Guessing",
    "link": "https://www.nytimes.com/2025/10/03/business/economy/jobs-report-unemployment-shutdown.html",
    "summary": "Policymakers will enter uncharted territory without employment data that the government is expected to withhold because of its shutdown."
  },
  {
    "title": "Trump Escalates Attacks on Democrats in a Government Shutdown Like No Other",
    "link": "https://www.nytimes.com/2025/10/02/us/politics/shutdown-trump-clinton-gingrich.html",
    "summary": "Shutdowns are always unpleasant affairs. But President Trump has used his power in aggressive and strikingly personal ways."
  },
  {
    "title": "Government Shutdown Leaves Wall Street Without Jobs Data",
    "link": "https://www.nytimes.com/2025/10/03/business/dealbook/shutdown-wall-street-data.html",
    "summary": "Investors are grappling with a blackout of official government economic data that’s forcing them to rely more heavily on reports that usually get far less attention."
  },
  {
    "title": "Partisan Language Inserted Into Education Dept. Workers’ Automated Emails",
    "link": "https://www.nytimes.com/2025/10/02/us/politics/education-dept-shutdown-emails.html",
    "summary": "The out-of-office responses from the accounts of employees on furlough cast blame for the shutdown on Democrats."
  },
  {
    "title": "Trump’s ‘Armed Conflict’ Against Cartels, and the Rise of Hyperrealistic A.I. Videos",
    "link": "https://www.nytimes.com/2025/10/03/podcasts/the-headlines/trump-cartels-hyperrealistic-ai-videos.html",
    "summary": "Plus, your Friday news quiz."
  },
  {
    "title": "Trump Asked Universities to Sign a Compact. Some See a Trap.",
    "link": "https://www.nytimes.com/2025/10/02/us/trump-universities-compact-funding.html",
    "summary": "Trump officials want universities to sign on to conservative priorities to get special treatment. Some in higher education say agreeing would end academic freedom."
  },
  {
    "title": "Duke Was Paring Back Diversity Programs. Trump Targeted It Anyway.",
    "link": "https://www.nytimes.com/2025/10/03/us/duke-university-dei-diversity-trump.html",
    "summary": "Duke University kept a low profile. But it is the alma mater of Stephen Miller, a top Trump official who often criticized the school while he was a student."
  },
  {
    "title": "Police Accidentally Shot and Killed a Victim During Manchester Terrorist Attack",
    "link": "https://www.nytimes.com/2025/10/03/world/europe/uk-manchester-synagogue-attack.html",
    "summary": "Officials said that one of the men killed at the Heaton Park Congregation synagogue in northwestern England had been hit by police gunfire."
  },
  {
    "title": "Synagogue Attack on Yom Kippur in Manchester, UK: What We Know",
    "link": "https://www.nytimes.com/2025/10/02/world/europe/uk-manchester-synagogue-attack.html",
    "summary": "Two people were killed on Yom Kippur after a driver rammed a vehicle into people in Manchester and stabbed others. One man who died was accidentally shot by police, who also killed the attacker."
  },
  {
    "title": "Sarah Mullally Is Named as First Female Archbishop of Canterbury",
    "link": "https://www.nytimes.com/2025/10/03/world/europe/uk-archbishop-canterbury-woman-church-sarah-mullally.html",
    "summary": "Sarah Mullally, the bishop of London, will lead the Church of England. She has been a vocal supporter of the rights of women in the church."
  },
  {
    "title": "On ‘The Life of a Showgirl,’ Taylor Swift Has a Lust for Love (and Her Foes)",
    "link": "https://www.nytimes.com/2025/10/03/arts/music/taylor-swift-the-life-of-a-showgirl-review.html",
    "summary": "On her 12th original album, the pop superstar sounds hungry to embrace her future — but not until she attends to some unfinished business."
  },
  {
    "title": "Taylor Swift Wears Bob Mackie’s Bejeweled Designs for ‘Life of a Showgirl’",
    "link": "https://www.nytimes.com/2025/10/03/style/taylor-swift-bob-mackie-showgirl-costumes.html",
    "summary": "Bob Mackie, whose bejeweled designs have appeared on a list of performers that now includes the singer, reflects on a role he has dressed many for."
  },
  {
    "title": "What Women Heard in Hegseth’s Remarks About Physical Standards",
    "link": "https://www.nytimes.com/2025/10/02/us/politics/women-military-hegseth-physical-standards.html",
    "summary": "The defense secretary raised the issue suggesting women were getting into combat not because they met high standards, but because they were given a pass."
  },
  {
    "title": "Veterans See Costs and Risks in Hegseth’s Military Rewind to 1990",
    "link": "https://www.nytimes.com/2025/10/02/us/hegseth-military-veterans-standards.html",
    "summary": "Defense Secretary Pete Hegseth has identified real problems, veteran officers say, but by looking back 35 years for policy cues, he risks hurting, not helping, military readiness."
  },
  {
    "title": "FDA Approves Generic Version of Abortion Pill Mifepristone",
    "link": "https://www.nytimes.com/2025/10/02/health/abortion-pill-generic-fda.html",
    "summary": "The decision enraged opponents of abortion, who have been pressuring the Trump administration to restrict access to abortion medication."
  },
  {
    "title": "Kennedy Fires N.I.H. Scientist Who Filed Whistle-Blower Complaint",
    "link": "https://www.nytimes.com/2025/10/02/health/kennedy-marrazzo-nih.html",
    "summary": "Dr. Jeanne Marrazzo, who was on administrative leave, alleged that the Trump administration had defied court orders and undermined vaccine research."
  },
  {
    "title": "Video Games Have Become the Main Way Boys Socialize. Is That Bad?",
    "link": "https://www.nytimes.com/2025/10/03/upshot/video-games-boys-young-men.html",
    "summary": "They’ve become an important way to spend time with peers. But they’ve also become more addictive."
  },
  {
    "title": "Pete Hegseth, Trump and an Era of Military Impunity",
    "link": "https://www.nytimes.com/2025/09/30/magazine/trump-hegseth-pardon-power-military-warrior.html",
    "summary": "Pete Hegseth’s advocacy for service members accused of war crimes, and Trump’s pardons of them, have helped usher in an era of military aggression and disregard for the rule of law."
  },
  {
    "title": "Inside the U.S. Special Forces: 5 Takeaways on a Culture of Lawlessness in Afghanistan",
    "link": "https://www.nytimes.com/2025/09/30/magazine/afghanistan-war-green-berets-trump-hegseth.html",
    "summary": "Until now, many of the troubling events that took place during the war in Afghanistan have been shrouded in secrecy."
  },
  {
    "title": "She Speaks Trump’s Language: Meet Ukraine’s New Prime Minister",
    "link": "https://www.nytimes.com/2025/10/03/world/europe/ukraine-prime-minister-trump-war-svyrydenko.html",
    "summary": "The appointment of Yuliia Svyrydenko, a business-oriented official, shows how Kyiv is trying to persuade the Trump administration that working with the country can be lucrative, even in wartime."
  },
  {
    "title": "‘Czech Trump’ Andrej Babis Is Poised to Return as Prime Minister in Elections",
    "link": "https://www.nytimes.com/2025/10/03/world/europe/andrej-babis-czech-elections.html",
    "summary": "The party of Andrej Babis, former leader of the Czech government, is expected to prevail in parliamentary elections that begin Friday."
  },
  {
    "title": "A.I. Is Driving a Stock Market Rally in China, Too",
    "link": "https://www.nytimes.com/2025/10/03/business/china-tech-stocks-artificial-intelligence.html",
    "summary": "Surging interest in artificial intelligence is generating huge gains for Chinese tech stocks like Alibaba, which has more than doubled this year."
  },
  {
    "title": "OpenAI’s Sora Makes Disinformation Extremely Easy and Extremely Real",
    "link": "https://www.nytimes.com/2025/10/03/technology/sora-openai-video-disinformation.html",
    "summary": "The new A.I. app generated videos of store robberies and home intrusions — even bomb explosions on city streets — that never happened."
  },
  {
    "title": "Is ‘One Battle After Another’ the Best Movie of the Year?",
    "link": "https://www.nytimes.com/2025/10/02/podcasts/is-one-battle-after-another-the-best-movie-of-the-year.html",
    "summary": "“Vivá la Revolución!”"
  },
  {
    "title": "The East Wing Ballroom is Trump’s Raw Display of Power",
    "link": "https://www.nytimes.com/2025/10/03/opinion/trump-ballroom-rebrand.html",
    "summary": "The president is refashioning his residence into a palace. Our democracy is now a members-only club."
  },
  {
    "title": "President Trump’s War on Cartels",
    "link": "https://www.nytimes.com/2025/10/03/briefing/president-trumps-war-on-cartels.html",
    "summary": "Plus, we’re covering the government shutdown."
  },
  {
    "title": "Late Night Sums Up Day 2 of the Shutdown",
    "link": "https://www.nytimes.com/2025/10/03/arts/television/late-night-government-shutdown.html",
    "summary": "“No one has any idea how long it will last,” Jimmy Fallon said. “People are calling it the ‘Grey’s Anatomy’ of government shutdowns.”"
  },
  {
    "title": "Hamas Still Considering Trump Gaza Plan but Rejects ‘Take It or Leave It’ Deal",
    "link": "https://www.nytimes.com/2025/10/03/world/middleeast/hamas-response-trump-gaza-deal.html",
    "summary": "A senior member of the Palestinian group said that the group would soon announce its position on President Trump’s plan to end the war in Gaza."
  },
  {
    "title": "140,000 N.Y.C. Students Are Homeless. Can the Next Mayor Change That?",
    "link": "https://www.nytimes.com/2025/10/03/nyregion/nyc-homeless-students-can-mayor-fix.html",
    "summary": "The city’s housing crisis has contributed to an education crisis, with more children than ever living in temporary housing. They face dismal outcomes."
  },
  {
    "title": "Patricia Routledge, Hoity-Toity Housewife of ‘Keeping Up Appearances,’ Dies at 96",
    "link": "https://www.nytimes.com/2025/10/03/obituaries/patricia-routledge-dead.html",
    "summary": "Before she became known as the snooty suburbanite Hyacinth Bucket, Ms. Routledge was an acclaimed stage performer, appearing with the Royal Shakespeare Company and on the West End and Broadway."
  },
  {
    "title": "Can This Isolated British Island Keep Its Economy Afloat?",
    "link": "https://www.nytimes.com/2025/10/03/business/isle-wight-beaches-economy-uk.html",
    "summary": "The Isle of Wight, known for its beaches and a rock festival that featured Jimi Hendrix and Bob Dylan, has had setbacks in manufacturing, but there have also been bright spots."
  }
]