[
  {
    "title": "N.Y.C. Mass Shooting Was Nearly Impossible to Prevent, Experts Say",
    "link": "https://www.nytimes.com/2025/07/29/nyregion/new-york-gun-laws-shooting.html",
    "summary": "New York City has some of the toughest gun laws in the nation. But Monday’s mass shooting showed their limits, security experts said."
  },
  {
    "title": "The Familiar Suicide and Final Wish of the N.Y.C. Gunman",
    "link": "https://www.nytimes.com/2025/07/29/us/nfl-cte-suicides-violence.html",
    "summary": "Shane Tamura is not the first former football player to shoot himself in the chest and request that his brain be examined."
  },
  {
    "title": "A Fallen Officer’s Flag-Wrapped Body Makes a Somber Journey to a Mosque",
    "link": "https://www.nytimes.com/2025/07/29/nyregion/police-department-transfer-didarul-islam.html",
    "summary": "The “dignified transfer” is a New York Police Department rite. Its choreography honors those who died for their fellow citizens."
  },
  {
    "title": "Booker Accuses Democrats of Being ‘Complicit’ With Trump in Heated Exchange",
    "link": "https://www.nytimes.com/2025/07/29/us/politics/cory-booker-democrats-trump-senate.html",
    "summary": "When a pair of Democrats sought to win quick approval of a bipartisan package of policing legislation, a third rose to object, saying the party must take every opportunity to challenge President Trump."
  },
  {
    "title": "Ghislaine Maxwell Lawyer Says She Will Only Testify for Immunity or Clemency",
    "link": "https://www.nytimes.com/2025/07/29/us/politics/ghislaine-maxwell-epstein-testimony.html",
    "summary": "In a letter to Congress, the lawyer for Jeffrey Epstein’s convicted co-conspirator says clemency would allow her to talk to lawmakers."
  },
  {
    "title": "Senate Confirms Susan Monarez as C.D.C. Director",
    "link": "https://www.nytimes.com/2025/07/29/us/politics/susan-monarez-cdc-director.html",
    "summary": "Dr. Monarez, who has been the acting head of the Centers for Disease Control and Prevention since President Trump took office, was the president’s second pick for the job."
  },
  {
    "title": "Trump Admits Financial Penalties on Russia ‘May or May Not’ Work",
    "link": "https://www.nytimes.com/2025/07/29/us/politics/trump-sanctions-ukraine-russia.html",
    "summary": "President Trump’s threats have raised questions about how much leverage the United States has left with Moscow."
  },
  {
    "title": "Greene Calls Gaza Crisis a ‘Genocide,’ Hinting at Rift on the Right Over Israel",
    "link": "https://www.nytimes.com/2025/07/29/us/politics/marjorie-taylor-greene-gaza-genocide.html",
    "summary": "Marjorie Taylor Greene was the first Republican in Congress to use the term to describe the dire humanitarian situation in Gaza. But others in the MAGA movement have expressed growing concern about Israel."
  },
  {
    "title": "Satellite Image Shows Gazans Mobbing Aid Trucks",
    "link": "https://www.nytimes.com/2025/07/29/world/middleeast/gaza-satellite-aid-truck-famine.html",
    "summary": "Amid warnings of famine in Gaza, a satellite captures an image of hundreds of Palestinians converging on an aid convoy."
  },
  {
    "title": "The First Soda in Space: When NASA Got Caught Up in the Cola Wars",
    "link": "https://www.nytimes.com/2025/07/29/science/coke-pepsi-nasa-space-shuttle.html",
    "summary": "In the summer of 1985, NASA, the Reagan White House and seven talented astronauts were wrangled into an orbital battle over soft-drink supremacy."
  },
  {
    "title": "In Game-Changing Climate Rollback, E.P.A. Aims to Kill a Bedrock Scientific Finding",
    "link": "https://www.nytimes.com/2025/07/29/climate/epa-endangerment-finding-repeal-proposal.html",
    "summary": "The proposal is President Trump’s most consequential step yet to derail federal climate efforts and appears to represent a shift toward outright denial of the scientific consensus."
  },
  {
    "title": "Coal Plants Emailed the E.P.A. to Avoid Clean-Air Rules",
    "link": "https://www.nytimes.com/2025/07/29/climate/epa-air-pollution-exemptions-emails.html",
    "summary": "Sites including at least 15 coal plants sought exemptions from environmental rules using a new Trump administration system to fast-track requests, documents show."
  },
  {
    "title": "Countries Scramble to Strike Trade Deals With Trump as Deadline Nears",
    "link": "https://www.nytimes.com/2025/07/29/us/politics/trump-tariffs-trade-deals.html",
    "summary": "It’s a race against time for some of America’s top trading partners who are negotiating furiously to reach agreements by Aug. 1."
  },
  {
    "title": "U.S. and China Fail to Reach Immediate Deal to Prolong Trade Truce",
    "link": "https://www.nytimes.com/2025/07/29/world/europe/us-china-trade-deal-talks-tariffs.html",
    "summary": "After a “constructive” round of talks ahead of an Aug. 12 deadline, Treasury Secretary Scott Bessent said, “Nothing is agreed until we speak with President Trump.”"
  },
  {
    "title": "Trump’s Tariff Deals With E.U., U.K. and Japan Are a Blow to Canada’s Car Industry",
    "link": "https://www.nytimes.com/2025/07/29/world/canada/canada-automobile-tariffs-trump-trade.html",
    "summary": "Recent pacts with Britain, Europe and Japan mean that autos exported from those countries and regions face lower U.S. tariffs than Canadian vehicles do."
  },
  {
    "title": "How the E.U. Wooed Trump With Flashy but Flimsy Numbers",
    "link": "https://www.nytimes.com/2025/07/29/world/europe/europe-us-trade-deal-investments.html",
    "summary": "The Trump administration has been talking up provisions of its deal with the European Union that would secure hundreds of billions of dollars in investments."
  },
  {
    "title": "Grassley Spurns Whistle-Blowers in Bove Confirmation Fight",
    "link": "https://www.nytimes.com/2025/07/29/us/politics/grassley-whistle-blowers-emil-bove.html",
    "summary": "The senator’s treatment of whistle-blowers detailing allegations against Emil Bove, the Trump loyalist and appeals court nominee, has had a chilling effect, critics say."
  },
  {
    "title": "Restaurant Review: Taquería Frontera in Los Angeles",
    "link": "https://www.nytimes.com/2025/07/29/dining/restaurant-review-taqueria-frontera-tacos-los-angeles.html",
    "summary": "At Taquería Frontera, the art of Tijuana-style tacos is on full display."
  },
  {
    "title": "Class and Identity in Hilton Head: The Gullah v. Wealthy Landowners",
    "link": "https://www.nytimes.com/2025/07/29/us/south-carolina-gullah.html",
    "summary": "A legal fight over access to burial grounds has pitted the Gullah Geechee against wealthy landowners around Hilton Head Island."
  },
  {
    "title": "The Trump Presidency Takes a Better Turn",
    "link": "https://www.nytimes.com/2025/07/29/opinion/trump-president-policy-success.html",
    "summary": "If Trump’s opponents want to be effective, we have to come to grips with realities that have so far eluded us."
  },
  {
    "title": "How Netanyahu Played Trump for a Fool in Gaza",
    "link": "https://www.nytimes.com/2025/07/29/opinion/gaza-netanyahu-trump-israel-starvation.html",
    "summary": "This is the first Israeli-Palestinian war where the worst leaders on both sides are calling all the shots."
  },
  {
    "title": "Katy Perry and Justin Trudeau Get a Table for 2, Inviting a Serving of Speculation",
    "link": "https://www.nytimes.com/2025/07/29/world/canada/katy-perry-justin-trudeau-dinner.html",
    "summary": "The former Canadian prime minister had dinner on Monday night with the newly single American pop star in Montreal, spurring intrigue over how they ended up meeting."
  },
  {
    "title": "University of California Settles With Jewish Students Over U.C.L.A. Protests",
    "link": "https://www.nytimes.com/2025/07/29/us/ucla-jewish-students-settlement.html",
    "summary": "Jewish students and a professor said the university had allowed a hostile protest. After the settlement was announced, the Department of Justice separately said it had found the university violated civil rights laws."
  },
  {
    "title": "Arkansas Police Release Photo of ‘Person of Interest’ in Killing of Couple",
    "link": "https://www.nytimes.com/2025/07/29/us/person-of-interest-killing-devils-den-arkansas.html",
    "summary": "A picture and a sketch show a person that the state police are seeking to question in the deaths of Clinton David Brink, 43, and Cristen Amanda Brink, 41, in Devil’s Den State Park. Their daughters, 7 and 9, were not physically harmed."
  }
]