[
  {
    "title": "Some Americans Are Starting to Feel the Impact of the Government Shutdown",
    "link": "https://www.nytimes.com/2025/10/11/us/politics/government-shutdown-effects.html",
    "summary": "The Trump administration said over 4,000 workers would be laid off. Farmers trying to plan next year’s crops don’t have all the tools they need. Some medical services have been curtailed in Native communities."
  },
  {
    "title": "How the Government Shutdown Will Be Felt",
    "link": "https://www.nytimes.com/video/us/politics/100000010447931/how-the-government-shutdown-will-be-felt.html",
    "summary": "The effects of a shutdown tend to unfold in stages. As agencies, departments and federal employees figure out how to weather the storm, Karoun Demirjian, a Times reporter, explains what to know."
  },
  {
    "title": "Trump’s Shutdown Layoffs Deepen Impasse, Angering Democrats",
    "link": "https://www.nytimes.com/2025/10/11/us/politics/trump-government-shutdown-layoffs-democrats.html",
    "summary": "The president’s move to fire federal workers and his threats to make others go without pay were aimed at pressuring Democrats to cut a deal to reopen the government. The tactics have fueled Democrats’ resolve."
  },
  {
    "title": "The Trump Split Screen: A Peacemaker Abroad, a Retribution Campaign at Home",
    "link": "https://www.nytimes.com/2025/10/10/us/politics/trump-peace-retribution.html",
    "summary": "President Trump’s dueling personas were on display this week, providing endless ammunition to his allies and his enemies alike."
  },
  {
    "title": "Trump’s Aides and Officials Take Political Battles Online",
    "link": "https://www.nytimes.com/2025/10/10/style/trump-officials-social-media.html",
    "summary": "President Trump’s long, avid embrace of social media has been eagerly adopted by his top aides, replacing longstanding governmental norms with online ones."
  },
  {
    "title": "A Memo in a Bunker, Intercepted Communications and Hamas’s Oct. 7 Plans",
    "link": "https://www.nytimes.com/2025/10/11/world/middleeast/israel-hamas-plans.html",
    "summary": "A directive, which Israeli officials believe was written by Yahya Sinwar, the powerful leader of Hamas in Gaza, and recordings called for fighters to target soldiers and civilian communities — and to broadcast the violent acts."
  },
  {
    "title": "Thousands Return to Northern Gaza, Hopeful, but Faced With Devastation",
    "link": "https://www.nytimes.com/2025/10/11/world/middleeast/return-gaza-city-ceasefire.html",
    "summary": "With the cease-fire holding overnight, many Palestinians continued to travel toward Gaza City on Saturday to learn what remained of their lives and homes."
  },
  {
    "title": "At the Center of Letitia James’s Indictment, a House in Norfolk, Virginia",
    "link": "https://www.nytimes.com/2025/10/11/us/politics/letitia-james-indictment-house.html",
    "summary": "Attorney General Letitia James of New York purchased the $137,000 home for a grandniece who needed tranquillity. Prosecutors say it is an impermissible investment property."
  },
  {
    "title": "China Flexed. Trump Hit Back. So Much for the Thaw.",
    "link": "https://www.nytimes.com/2025/10/11/world/asia/china-trump-tariff-threat.html",
    "summary": "Beijing’s trade curbs and President Trump’s tariff threats show how quickly calm can give way to confrontation between the two largest economies."
  },
  {
    "title": "How China Powers Its Electric Cars and High-Speed Trains",
    "link": "https://www.nytimes.com/2025/10/11/business/china-electric-grid.html",
    "summary": "China is building a network of ultrahigh-voltage power lines to carry solar and wind energy hundreds and even thousands of miles as few citizens dare to protest."
  },
  {
    "title": "Beheaded and Sent to Watery Graves, Columbus Statues Get New Life",
    "link": "https://www.nytimes.com/2025/10/11/arts/design/christopher-columbus-statues.html",
    "summary": "More than 30 monuments to Christopher Columbus were toppled or taken down in 2020. Now some are being restored, and finding new, usually less-public homes."
  },
  {
    "title": "Peace in Trump’s Time — Except Here",
    "link": "https://www.nytimes.com/2025/10/11/opinion/trump-nobel-peace-prize.html",
    "summary": "Peace abroad and war at home — not very America first!"
  },
  {
    "title": "Who Can Stop a President Deploying Troops?",
    "link": "https://www.nytimes.com/2025/10/11/opinion/trump-national-guard-divided-america.html",
    "summary": "On this week’s round table: Courts, Congress and chaos under Trump."
  },
  {
    "title": "Following Through",
    "link": "https://www.nytimes.com/2025/10/11/briefing/following-through.html",
    "summary": "We love it when people cancel plans, but the cost may be steeper than we realize."
  },
  {
    "title": "What We Know About the Explosion in Central Tennessee",
    "link": "https://www.nytimes.com/2025/10/11/us/tennessee-plant-explosion-what-we-know.html",
    "summary": "The blast happened at a plant owned by Accurate Energetic Systems. Officials did not specify a death toll but said 19 people were missing."
  },
  {
    "title": "Criticism Greets Macron’s Repeat Pick of Lecornu for Prime Minister: ‘Bad Joke’",
    "link": "https://www.nytimes.com/2025/10/11/world/europe/france-macron-lecornu-prime-minister.html",
    "summary": "After appointing the same person prime minister for the second time in a week, President Emmanuel Macron is facing calls to explain his stubbornness or resign."
  },
  {
    "title": "How ‘TBPN’ Became Silicon Valley’s Newest Obsession",
    "link": "https://www.nytimes.com/2025/10/11/technology/tbpn-silicon-valley.html",
    "summary": "Silicon Valley is obsessed with “TBPN,” a streaming show on which no career move is too trivial to document."
  }
]