[
  {
    "title": "Guest List for State of the Union Includes Epstein Victims, Erika Kirk and U.S. Olympic Hockey Players",
    "link": "https://www.nytimes.com/2026/02/24/us/politics/state-of-the-union-guest-list.html",
    "summary": "Democratic lawmakers invited victims of Jeffrey Epstein and of President Trump’s aggressive immigration crackdown."
  },
  {
    "title": "How The New York Times Covers the SOTU Under Intense Deadline Pressure",
    "link": "https://www.nytimes.com/2026/02/24/insider/trump-state-of-the-union-new-york-times.html",
    "summary": "The editor who oversees White House coverage for The Times talks about the challenges of tracking a major speech by a president who regularly goes off script."
  },
  {
    "title": "House Narrowly Rejects Air Safety Bill After Pentagon Opposition",
    "link": "https://www.nytimes.com/2026/02/24/us/house-rotor-act-dc-plane-crash.html",
    "summary": "A move to swiftly pass the bill failed by a single vote. It would have required aircraft to carry technology that officials said might have prevented a midair collision near Washington last year."
  },
  {
    "title": "Pentagon Gives Anthropic an Ultimatum Over the Company’s A.I. Model",
    "link": "https://www.nytimes.com/2026/02/24/us/politics/pentagon-anthropic.html",
    "summary": "Anthropic insists on limits on how its technology is used and could be labeled a supply chain risk if it fails to accept the military’s demands."
  },
  {
    "title": "Mexico Is Caught Between Trump and the Cartels",
    "link": "https://www.nytimes.com/2026/02/24/world/americas/trump-sheinbaum-us-mexico-cartel.html",
    "summary": "President Trump has demanded President Claudia Sheinbaum confront the cartels. The killing of El Mencho suggests it might be working — but could come at a cost."
  },
  {
    "title": "What to Know About the Cartels Operating in Mexico",
    "link": "https://www.nytimes.com/2026/02/24/world/americas/mexico-cartels-leaders-el-mencho.html",
    "summary": "Other criminal groups in Mexico may try to take advantage of the death of Nemesio Oseguera Cervantes, also known as El Mencho, who ran the Jalisco New Generation Cartel."
  },
  {
    "title": "Is It Safe to Travel to Mexico Right Now, Given the Cartel Violence?",
    "link": "https://www.nytimes.com/2026/02/24/travel/mexico-tourism-safety-spring-break.html",
    "summary": "A wave of unrest after the killing of a cartel leader has rattled tourists in Mexico, prompting travelers to reconsider their plans. Here’s what to know."
  },
  {
    "title": "Snowball Fight in New York Turns Chaotic After Police Arrive",
    "link": "https://www.nytimes.com/2026/02/24/nyregion/nypd-snowball-fight-washington-square-park.html",
    "summary": "Police Commissioner Jessica Tisch said officers had been attacked at Washington Square Park. Mayor Zohran Mamdani said the episode looked like a snowball fight, not a crime."
  },
  {
    "title": "Providence, R.I. Digs Out From Three Feet of Snow",
    "link": "https://www.nytimes.com/2026/02/24/us/providence-rhode-island-snow-totals.html",
    "summary": "A day after the city got a record-breaking amount of snow, some residents clung to the magic. Others were gearing up for endless shoveling."
  },
  {
    "title": "Blizzard Causes Major Airport Delays and Cancellations: What Travelers Should Know",
    "link": "https://www.nytimes.com/2026/02/24/travel/blizzard-snow-storm-airport-delays-cancellations.html",
    "summary": "As major hubs in the Northeast dig out from up to three feet of snow, it could be days before some travelers get moving. Here’s where things stand."
  },
  {
    "title": "The U.S. Men’s Hockey Team Has Arrived in Washington",
    "link": "https://www.nytimes.com/2026/02/24/us/politics/us-hockey-team-trump.html",
    "summary": "Two gold medal-winning U.S. hockey teams were invited to Washington for the State of the Union address. Only one came to town."
  },
  {
    "title": "D.O.J. Sues U.C.L.A. After It Refused to Pay $1 Billion Fine",
    "link": "https://www.nytimes.com/2026/02/24/us/justice-department-ucla-lawsuit.html",
    "summary": "The Trump administration accused the university’s Los Angeles campus of not doing enough to curb antisemitism, months after the government tried to cut research money and demanded more than $1 billion."
  },
  {
    "title": "Trump’s New Tariffs Could Face Legal Challenges",
    "link": "https://www.nytimes.com/2026/02/24/us/politics/trump-tariffs-new-legal-challenges.html",
    "summary": "Critics are questioning the legality of the provision President Trump has used to replace his previous slate of tariffs, raising the prospect of yet another legal battle."
  },
  {
    "title": "How Jeffrey Epstein Ingratiated Himself With Top Microsoft Executives",
    "link": "https://www.nytimes.com/2026/02/24/technology/jeffrey-epstein-microsoft-executives.html",
    "summary": "For more than two decades, the convicted sex offender developed a network at the tech giant, making him privy to succession discussions and other business."
  },
  {
    "title": "After Being Shoved in Front of a Train, He Has Returned to the Subway",
    "link": "https://www.nytimes.com/2026/02/24/nyregion/joseph-lynskey-nyc-subway-shove-lawsuit.html",
    "summary": "Joseph Lynskey was determined to overcome his fear and reclaim his life as a New Yorker who enjoys the city in full. On Tuesday, he filed a lawsuit against the city and the M.T.A."
  },
  {
    "title": "How the Flood Fractured the Tightknit Camp Mystic Community",
    "link": "https://www.nytimes.com/2026/02/24/us/camp-mystic.html",
    "summary": "The camp has been the foundation of an invisible network of status and power in Texas. Now, following the flood, that social web is beginning to fray."
  },
  {
    "title": "Ukraine Battlefield Dead Could Reach 500,000 in Fifth Year, Estimates Suggest",
    "link": "https://www.nytimes.com/2026/02/24/world/europe/ukraine-war-deaths.html",
    "summary": "Russia has lost as many as 325,000 troops, according to some estimates, with more than 200,000 deaths verified by researchers."
  },
  {
    "title": "Study Shows Xi’s Purges of China’s Military Run Deep",
    "link": "https://www.nytimes.com/2026/02/24/world/asia/china-military-purges-xi.html",
    "summary": "Around 100 senior officers have been sidelined or vanished since 2022, hollowing out the top ranks and raising questions about the army’s capabilities."
  },
  {
    "title": "Germany’s Leader Heads to China and Walks a Tightrope Between Xi and Trump",
    "link": "https://www.nytimes.com/2026/02/24/world/europe/merz-germany-china-trip-beijing-xi.html",
    "summary": "Chancellor Friedrich Merz’s trip will test his ability to address tensions between the countries, at a time of strain between Europe and Washington."
  },
  {
    "title": "After a Big Loss, What to Expect From Trump at the State of the Union",
    "link": "https://www.nytimes.com/2026/02/24/opinion/trump-tariffs-state-of-union.html",
    "summary": "The Supreme Court’s tariffs ruling could make for a tense night."
  },
  {
    "title": "John Roberts Is Losing Patience With Trump",
    "link": "https://www.nytimes.com/2026/02/24/opinion/tariffs-trump-john-roberts.html",
    "summary": "How to read the gratuitous paragraph in the chief justice’s tariff opinion."
  },
  {
    "title": "Trump Will Deliver His State of the Union Address",
    "link": "https://www.nytimes.com/2026/02/24/briefing/trump-state-of-the-union-teens-ai-chatbots.html",
    "summary": "Also, most teens use A.I. chatbots for schoolwork. Here’s the latest at the end of Tuesday."
  },
  {
    "title": "Paramount Raises Its Bid for Warner Bros. Discovery",
    "link": "https://www.nytimes.com/2026/02/24/business/paramount-netflix-warner-bros-discovery.html",
    "summary": "Warner Bros. Discovery said Paramount’s new offer of $31 a share could lead to a “superior proposal” to the deal it signed with Netflix."
  },
  {
    "title": "Judge Dismisses Minnesota Gun Case as Prosecutors Struggle With Resignations",
    "link": "https://www.nytimes.com/2026/02/24/us/minnesota-gun-case-dismissed.html",
    "summary": "A judge took the unusual step of dropping the case over a speedy trial violation by the U.S. attorney’s office in Minnesota, which has been flooded with immigration-related cases."
  },
  {
    "title": "Éliane Radigue, Composer of Time, Silence and Space, Dies at 94",
    "link": "https://www.nytimes.com/2026/02/24/arts/music/eliane-radigue-dead.html",
    "summary": "Her Tibetan Buddhist spiritual practice and her experiments with synthesizers came together in vast, slow-moving works that drew wide acclaim."
  },
  {
    "title": "‘Abolish ICE’ Wins Chicago’s Snowplow Naming Contest",
    "link": "https://www.nytimes.com/2026/02/24/us/chicago-snowplow-contest-ice.html",
    "summary": "An annual contest usually draws lighthearted quips. This year, Chicagoans chose a political pun."
  }
]