[
  {
    "title": "Inside the Long Friendship Between Trump and Epstein",
    "link": "https://www.nytimes.com/2025/07/19/us/politics/inside-trump-epstein-friendship.html",
    "summary": "For nearly 15 years, the two men socialized together in Manhattan and Palm Beach, Fla., before a falling out that preceded Mr. Epstein’s first arrest."
  },
  {
    "title": "Trump Administration Requests Release of Epstein Grand Jury Records. What’s Next?",
    "link": "https://www.nytimes.com/2025/07/18/us/politics/epstein-grand-jury-what-to-know.html",
    "summary": "The records are at the center of President Trump’s effort to manage fallout from the Epstein case. But unsealing them is complex and requires a judge to sign off."
  },
  {
    "title": "Trump Sues Wall Street Journal for Article on Note to Epstein",
    "link": "https://www.nytimes.com/2025/07/18/business/media/trump-sues-wall-street-journal-epstein.html",
    "summary": "The lawsuit argues that The Journal falsely claimed President Trump “authored, drew and signed” a lewd birthday card to Jeffrey Epstein."
  },
  {
    "title": "Vance Boelter’s Life Before the Minnesota Shootings",
    "link": "https://www.nytimes.com/2025/07/19/us/minnesota-shootings-vance-boelter.html",
    "summary": "Periods of religious zealotry and an unsettled professional career were intertwined for years before he was accused of murder."
  },
  {
    "title": "Why Are More Than 100 People Still Missing in Texas, 2 Weeks After the Floods?",
    "link": "https://www.nytimes.com/2025/07/19/us/politics/texas-floods-missing.html",
    "summary": "The number of people unaccounted for dropped this week but remains stubbornly high as some searchers lose hope of finding them."
  },
  {
    "title": "Trump’s Immigration Crackdown Hits Senior Care Work Force",
    "link": "https://www.nytimes.com/2025/07/18/us/politics/immigration-senior-caregivers.html",
    "summary": "Nursing homes and home care agencies have lost workers as the Trump administration has moved to end deportation protections for migrants with temporary legal status."
  },
  {
    "title": "When Getting Fired Is Only the Beginning for Federal Workers",
    "link": "https://www.nytimes.com/2025/07/18/us/politics/trump-federal-layoffs-workers.html",
    "summary": "One thing is clear from a reporter’s conversations with laid-off federal workers this year: The cuts have been anything but straightforward and efficient."
  },
  {
    "title": "How Superman Handles a Lois Lane Interview",
    "link": "https://www.nytimes.com/2025/07/18/movies/superman-clip.html",
    "summary": "James Gunn, the screenwriter and director of “Superman,” narrates a sequence featuring David Corenswet and Rachel Brosnahan."
  },
  {
    "title": "Superman’s Other Secret Weakness? Journalism Ethics.",
    "link": "https://www.nytimes.com/2025/07/11/arts/superman-lois-lane-clark-kent-journalism.html",
    "summary": "Writing for The Daily Planet about his heroic alter ego raises thorny issues for Clark Kent. Lois Lane has her conflicts, too."
  },
  {
    "title": "An Ancient Law Could Shape the Modern Future of America’s Beaches. Here’s How.",
    "link": "https://www.nytimes.com/2025/07/19/climate/beach-erosion-sea-walls.html",
    "summary": "The growing battle over how to manage sea level rise turns partly on a legal principle set down in Roman times."
  },
  {
    "title": "Syria Declares Cease-Fire After a Week of Upheaval",
    "link": "https://www.nytimes.com/2025/07/19/world/europe/syria-ceasefire-druse-israel.html",
    "summary": "Sectarian-tinged clashes left hundreds dead and attracted Israeli military intervention. A U.S. envoy said Israel and Syria had agreed to a truce."
  },
  {
    "title": "Gaza Health Ministry Says Israeli Military Killed 32 Near Aid Site",
    "link": "https://www.nytimes.com/2025/07/19/world/middleeast/gaza-humanitarian-foundation-israel-attack.html",
    "summary": "The latest deaths add to U.N. figures showing that more than 670 Palestinians have been killed since May near sites built under a new Israel-backed aid system."
  },
  {
    "title": "Is the U.S. Stock Market a Riskier Investment Than Emerging Global Markets?",
    "link": "https://www.nytimes.com/2025/07/18/business/stocks-emerging-markets-risk.html",
    "summary": "While the U.S. stock market has rebounded, the combination of the Trump tariffs, a volatile dollar and an erratic bond market has begun to shake global investment thinking."
  },
  {
    "title": "What Life Is Like for Four Young Adults Supporting Their Aging Parents",
    "link": "https://www.nytimes.com/2025/07/19/business/reverse-boomerang-parents-adult-children.html",
    "summary": "Most young adults don’t expect to support their aging parents. Here’s what happened when four people had to."
  },
  {
    "title": "Wall Street Wants to Make Private Markets a Little More Public",
    "link": "https://www.nytimes.com/2025/07/19/business/dealbook/private-market-boom.html",
    "summary": "As value grows in private markets, fund managers, brokerage houses, and savvy start-ups are building products that aim to expand access to them."
  },
  {
    "title": "How a Sequoia Capital Partner’s Mamdani Posts Dragged the Firm Into Politics",
    "link": "https://www.nytimes.com/2025/07/19/technology/sequoia-capital-shaun-maguire-mamdani.html",
    "summary": "Sequoia Capital, which backed Nvidia, Google and Apple when they were start-ups, has long stayed above the fray. But one partner’s post about Zohran Mamdani set off a chain reaction."
  },
  {
    "title": "Jane Austen’s Books: A Guide",
    "link": "https://www.nytimes.com/article/jane-austen-books.html",
    "summary": "A peerless chronicler of class and romance, the “Pride and Prejudice” author was never prolific. But her work remains remarkably relevant, more than two centuries after her death."
  },
  {
    "title": "Russia Makes Gains in Ukraine in Summer Offensive",
    "link": "https://www.nytimes.com/2025/07/19/world/europe/russia-ukraine-military-economy.html",
    "summary": "The most important factors may be far from the battlefield."
  },
  {
    "title": "MAGA’s New Target: Trump",
    "link": "https://www.nytimes.com/2025/07/19/opinion/trump-maga-epstein-deep-state.html",
    "summary": "The president is in a deep-state fugue."
  },
  {
    "title": "Trump, Epstein and a Stinging SCOTUS Dissent",
    "link": "https://www.nytimes.com/2025/07/19/opinion/epstein-investigation-trump-supreme-court.html",
    "summary": "“The Opinions” round table discusses Trump and MAGA’s very bad week."
  },
  {
    "title": "Open Season",
    "link": "https://www.nytimes.com/2025/07/19/briefing/open-season.html",
    "summary": "The popular notions of summer fun and the things we actually feel like doing can sometimes be at odds with each other."
  },
  {
    "title": "Driver Plows Car Into Crowd in Los Angeles, Injuring at Least 30",
    "link": "https://www.nytimes.com/2025/07/19/us/los-angeles-vehicle-crowd.html",
    "summary": "At least seven people were in critical condition after a driver veered onto a sidewalk outside a music club, the Los Angeles Fire Department said early Saturday."
  },
  {
    "title": "Sohei Kamiya Brings Trump-Style Populism to Japan’s Election",
    "link": "https://www.nytimes.com/2025/07/19/world/asia/japan-election-sohei-kamiya.html",
    "summary": "With his calls to limit foreign workers, fight globalism and put “Japanese First,” Sohei Kamiya has brought a fiery right-wing populism to Japan’s election on Sunday."
  },
  {
    "title": "Astronomer CEO Andy Byron Placed on Leave After Video at Coldplay Concert Exposes Alleged Affair",
    "link": "https://www.nytimes.com/2025/07/18/style/coldplay-andy-byron-astronomer-video.html",
    "summary": "A video from a concert dominated internet discourse as people joked about a man and woman who appeared very upset to be shown on camera."
  },
  {
    "title": "Who Gets to Wear a Mask?",
    "link": "https://www.nytimes.com/2025/07/18/nyregion/ice-police-masks-nassau-county.html",
    "summary": "The tension over masked federal immigration agents expanded on Long Island, where police officers are now permitted to mask up — but no one else is."
  }
]