[
  {
    "title": "How Zohran Mamdani Beat Back New York’s Elite and Was Elected Mayor",
    "link": "https://www.nytimes.com/2025/11/04/nyregion/how-zohran-mamdani-won-nyc-mayor.html",
    "summary": "The 34-year-old assemblyman won the Democratic primary by defying the city’s all-powerful establishment. He secured the mayoralty by delicately disarming it."
  },
  {
    "title": "Mamdani is New York’s First Muslim and South Asian Mayor-Elect",
    "link": "https://www.nytimes.com/2025/11/04/nyregion/mamdani-nyc-mayor-muslim-south-asian.html",
    "summary": "Zohran Mamdani’s ascent was powered by a relentless focus on affordability. Along the way, he energized South Asian and Muslim communities that rarely receive sustained attention from politicians."
  },
  {
    "title": "The Democrats Just Took a Big Step Toward Getting Their Groove Back",
    "link": "https://www.nytimes.com/2025/11/05/us/politics/democratic-party-mamdani.html",
    "summary": "Victories in New York City, New Jersey, Virginia and elsewhere were decisive, but new political tests loom for a party still rebuilding its brand."
  },
  {
    "title": "Spanberger Wins Virginia Governor’s Race With Forceful Anti-Trump Campaign",
    "link": "https://www.nytimes.com/2025/11/04/us/politics/virginia-governor-election-spanberger.html",
    "summary": "Abigail Spanberger, a former congresswoman and C.I.A. officer, will be the first woman to serve as governor of Virginia, following a streak of 74 men."
  },
  {
    "title": "UPS Plane Crash Near Louisville Airport Kills at Least 7, Officials Say",
    "link": "https://www.nytimes.com/2025/11/04/us/louisville-ups-plane-crash.html",
    "summary": "The plane crashed and exploded shortly after taking off from a Kentucky airport, disrupting operations at the delivery company’s main air cargo hub."
  },
  {
    "title": "What We Know About the UPS Plane Crash in Louisville",
    "link": "https://www.nytimes.com/2025/11/04/us/plane-crash-louisville-kentucky-ups.html",
    "summary": "Seven people were dead after the cargo plane crashed soon after takeoff. The authorities canceled flights from the airport in Louisville, Ky., and local residents were ordered to remain indoors."
  },
  {
    "title": "On Eve of Shutdown Record, Trump Officials Threaten Pain Could Worsen",
    "link": "https://www.nytimes.com/2025/11/04/us/politics/trump-administration-pain-shutdown.html",
    "summary": "President Trump and administration officials indicated the fallout could intensify in the coming days, even as he has kept himself at a remove from the crisis."
  },
  {
    "title": "Judge Expresses Alarm About ICE Detention Conditions in Broadview, Ill.",
    "link": "https://www.nytimes.com/2025/11/04/us/illinois-immigration-broadview-conditions.html",
    "summary": "Several former detainees described tight quarters, a lack of sanitation and little access to lawyers at the Broadview, Ill., immigration detention facility."
  },
  {
    "title": "For Dick Cheney, a Journey From Champion of War to Voice of Resistance",
    "link": "https://www.nytimes.com/2025/11/04/us/politics/dick-cheney-trump.html",
    "summary": "Dick Cheney was to many the embodiment of the unpopular and bloody Iraq war. But his late-in-life anti-Trumpism changed his image for some of his longtime critics."
  },
  {
    "title": "Dick Cheney, Powerful Vice President and Washington Insider, Dies at 84",
    "link": "https://www.nytimes.com/2025/11/04/us/politics/dick-cheney-dead.html",
    "summary": "A former defense secretary and congressman, he held the nation’s No. 2 job under President George W. Bush and was an architect of policies in an era of war and economic change."
  },
  {
    "title": "How Cheney’s Presidential Power Push Paved the Way for Trump to Go Further",
    "link": "https://www.nytimes.com/2025/11/04/us/politics/trump-dick-cheney.html",
    "summary": "Donald J. Trump and Dick Cheney became adversaries, but the former vice president set the stage for Mr. Trump’s bid to expand his executive authority."
  },
  {
    "title": "Some Republicans Honor Dick Cheney, While Trump Remains Silent",
    "link": "https://www.nytimes.com/2025/11/04/us/politics/republicans-honor-dick-cheney.html",
    "summary": "The late vice president had called President Trump “a coward” and a “threat to our republic” and supported Vice President Kamala Harris in 2024."
  },
  {
    "title": "Trump Weighs Options, and Risks, for Attacks on Venezuela",
    "link": "https://www.nytimes.com/2025/11/04/us/politics/trump-weighs-attacks-venezuela.html",
    "summary": "President Trump has yet to make a decision, but his advisers are pressing a range of objectives — from attacking drug cartels to seizing oil fields — to try to justify ousting Nicolás Maduro."
  },
  {
    "title": "Latest U.S. Strike on Suspected Drug Boat Kills 2 in Pacific, Hegseth Says",
    "link": "https://www.nytimes.com/2025/11/04/us/politics/boat-strike-deaths-hegseth.html",
    "summary": "It was the 16th announced attack in two months and raised the death toll to at least 67 people in both the Caribbean Sea and the Pacific."
  },
  {
    "title": "What to Know About the Legal Scandal in Israel Over Accusations of Abuse",
    "link": "https://www.nytimes.com/2025/11/04/world/middleeast/israel-soldiers-detainee-tomer-yerushalmi.html",
    "summary": "The fallout from a legal case has reignited a highly charged debate within the country over whether Israeli soldiers accused of abusing Palestinians are held accountable."
  },
  {
    "title": "U.S. Seeks Two-Year U.N. Mandate for Gaza Stabilization Force",
    "link": "https://www.nytimes.com/2025/11/04/world/middleeast/un-mandate-gaza-force.html",
    "summary": "A draft Security Council resolution said that an international force would ensure that Gaza be demilitarized, though specifics were unclear."
  },
  {
    "title": "Right-Wing Chatbots Turbocharge America’s Political and Cultural Wars",
    "link": "https://www.nytimes.com/2025/11/04/business/right-wing-chatbots-gab-arya-chatgpt-gemini.html",
    "summary": "Once pitched as dispassionate tools to answer your questions, A.I. chatbots are now programmed to reflect the biases of their creators."
  },
  {
    "title": "The Editor Got a Letter From ‘Dr. B.S.’ So Did a Lot of Other Editors.",
    "link": "https://www.nytimes.com/2025/11/04/science/letters-to-the-editor-ai-chatbots.html",
    "summary": "The rise of artificial intelligence has produced serial writers to science and medical journals, most likely using chatbots to boost the number of citations they’ve published."
  },
  {
    "title": "How the Cop Show ‘Barney Miller’ Made Gay TV History, 50 Years Ago",
    "link": "https://www.nytimes.com/2025/11/04/arts/television/barney-miller-gay-couple.html",
    "summary": "A 1975 episode introduced audiences to one of the first openly gay couples in mainstream American television not depicted as deviants or criminals."
  },
  {
    "title": "Six Ways Zohran Mamdani Can Improve New York City",
    "link": "https://www.nytimes.com/2025/11/04/opinion/mayor-mamdani-new-york-election.html",
    "summary": "Mamdani, who campaigned on sweeping promises, can build a positive legacy by focusing on tangible accomplishments."
  },
  {
    "title": "Do Dumb Ideas Ever Die?",
    "link": "https://www.nytimes.com/2025/11/04/opinion/dumb-ideas-policy-trade-politics.html",
    "summary": "Unlike old soldiers, they don’t even fade away."
  },
  {
    "title": "Drone Strike Kills Dozens of Mourners at Funeral in Sudan",
    "link": "https://www.nytimes.com/2025/11/04/world/africa/sudan-civil-war.html",
    "summary": "The attack occurred in North Kordofan, which has seen an increased military buildup as the army and paramilitary forces jockey for control of the country."
  },
  {
    "title": "Tom Brady Says He Cloned His Dog",
    "link": "https://www.nytimes.com/2025/11/04/science/tom-brady-dog-cloning.html",
    "summary": "Mr. Brady became the latest celebrity to try to preserve a pet’s genetics, a move that animal rights groups have criticized."
  },
  {
    "title": "Fugitive Who Faked Abduction Is Found 13 Years Later, Enrolled in N.Y. College",
    "link": "https://www.nytimes.com/2025/11/04/us/oklahoma-sex-offender.html",
    "summary": "Anthony Lennon, a convicted sex offender from Oklahoma, was arrested in Canton, N.Y., where he was studying under an alias, the authorities said."
  }
]