[
  {
    "title": "Israel Gives Itself More Control Over West Bank, Clearing Barriers to Settlement",
    "link": "https://www.nytimes.com/2026/02/09/world/middleeast/israel-settlements-west-bank.html",
    "summary": "Actions by the security cabinet make it easier for Jews to buy land from Palestinians. Critics say the changes violate the Oslo Accords and international law and accelerate attempts to annex the territory."
  },
  {
    "title": "Andrew Farkas Called Jeffrey Epstein ‘Blessing’ as the Two Did Deals",
    "link": "https://www.nytimes.com/2026/02/09/nyregion/farkas-epstein-lawsuit-ties.html",
    "summary": "Andrew Farkas has repeatedly played down ties to Jeffrey Epstein. But they swapped business favors in the Virgin Islands, and in nearly 2,000 emails, the two expressed admiration for each other."
  },
  {
    "title": "A Raid in a Small Town Brings Trump’s Deportations to Deep-Red Idaho",
    "link": "https://www.nytimes.com/2026/02/09/us/politics/trump-deportation-idaho.html",
    "summary": "Wilder, Idaho, prided itself on comity. Then federal agents stormed a racetrack outside of town in October, and the reverberations are still shaking the community."
  },
  {
    "title": "Hungry Families, ICE and Secret Grocery Networks in Minneapolis",
    "link": "https://www.nytimes.com/2026/02/09/dining/minneapolis-ice-grocery-stores-hunger.html",
    "summary": "As immigrants become increasingly afraid to leave their homes for fear of being detained, access to food, including free school lunches, is being cut off."
  },
  {
    "title": "Trump’s Oil Grab in Venezuela Shatters an American Taboo",
    "link": "https://www.nytimes.com/2026/02/08/us/politics/trump-oil-venezuela.html",
    "summary": "U.S. presidents have long been accused of plotting to control foreign oil. But President Trump has asserted a U.S. right to take it."
  },
  {
    "title": "Trump Is a Global ‘Wrecking Ball,’ European Security Experts Say",
    "link": "https://www.nytimes.com/2026/02/09/world/europe/trump-munich-conference-security-report.html",
    "summary": "The organizers of the Munich Security Conference, Europe’s main defense-related forum, said in a report that President Trump is helping destroy the postwar international order."
  },
  {
    "title": "Bad Bunny Super Bowl Halftime Review: A History Lesson Full of Puerto Rican Pride",
    "link": "https://www.nytimes.com/2026/02/09/arts/music/bad-bunny-super-bowl-halftime-show-review.html",
    "summary": "The superstar showcased Puerto Rican pride during a 13-minute set that turned a global opportunity into an intimate, personal performance."
  },
  {
    "title": "Bad Bunny’s Super Bowl Halftime Show: Best and Worst Moments",
    "link": "https://www.nytimes.com/2026/02/09/arts/music/bad-bunny-super-bowl-halftime-show-best-worst.html",
    "summary": "The Puerto Rican superstar’s set included cameos, stunts and powerful statements."
  },
  {
    "title": "Trump Criticizes Bad Bunny’s Super Bowl Halftime Show",
    "link": "https://www.nytimes.com/2026/02/09/us/trump-bad-bunny-super-bowl-halftime-show.html",
    "summary": "Bad Bunny, the Puerto Rican superstar who has denounced ICE, celebrated Latino heritage in his largely Spanish-language performance."
  },
  {
    "title": "San Francisco Teachers Begin Strike, Closing School for 50,000 Students",
    "link": "https://www.nytimes.com/2026/02/09/us/san-francisco-teachers-strike.html",
    "summary": "The strike closed public schools for more than 50,000 students in the city and had no end date. Health care costs are a key issue in negotiations."
  },
  {
    "title": "N.Y.C. Nurses and Hospital Officials Reach Deal to End Strike",
    "link": "https://www.nytimes.com/2026/02/09/nyregion/nyc-nurses-strike-ends.html",
    "summary": "A tentative agreement was reached between the New York State Nurses Association and the Mount Sinai Health System and Montefiore Medical Center."
  },
  {
    "title": "Will This High School Coach Get to 973 Wins Before He Gets Fired?",
    "link": "https://www.nytimes.com/2026/02/09/nyregion/ron-naclerio-basketball-cardozo-nyc.html",
    "summary": "After 45 years at a high school in Queens, Ron Naclerio was closing in on the record for most wins in New York State. But potential recruiting violations threatened his legacy."
  },
  {
    "title": "Vietnam’s Leader Has New Power, and He’s in a Hurry",
    "link": "https://www.nytimes.com/2026/02/09/world/asia/vietnam-to-lam.html",
    "summary": "To Lam is a former security chief who carved his way to prominence and relishes the good life. He has promised to make Communist Vietnam rich and influential."
  },
  {
    "title": "A.I. Is Making Doctors Answer a Question: What Are They Really Good For?",
    "link": "https://www.nytimes.com/2026/02/09/health/ai-chatbots-doctors-medicine.html",
    "summary": "Many physicians find chatbots threatening, but that doesn’t mean they’re giving up on medicine."
  },
  {
    "title": "Health Advice From A.I. Chatbots Is Frequently Wrong, Study Shows",
    "link": "https://www.nytimes.com/2026/02/09/well/chatgpt-health-advice.html",
    "summary": "In part, the problem has to do with how users are asking their questions."
  },
  {
    "title": "Respite From Wind-Driven, Bone-Chilling Cold Weather Is in Sight",
    "link": "https://www.nytimes.com/2026/02/09/us/extreme-cold-weather-northeast.html",
    "summary": "Wind chills below zero were expected to persist across parts of the Northeast and New England on Monday but should finally ease, forecasters said."
  },
  {
    "title": "How Japan’s Leader, Sanae Takaichi, Rescued Her Party from the Abyss",
    "link": "https://www.nytimes.com/2026/02/09/world/asia/japan-election-takaichi-analysis.html",
    "summary": "Sanae Takaichi, Japan’s first female prime minister, harnessed her personal popularity and a shift to the right among voters to achieve a record election win."
  },
  {
    "title": "What to Know About the Disappearance of Savannah Guthrie’s Mom, Nancy",
    "link": "https://www.nytimes.com/article/savannah-guthrie-mom-missing.html",
    "summary": "Nancy Guthrie, 84, the “Today” show host’s mother, vanished from her home on Feb. 1."
  },
  {
    "title": "7 Days, No Suspects: The Disappearance of Nancy Guthrie",
    "link": "https://www.nytimes.com/2026/02/08/us/nancy-guthrie-savannah-guthrie-family.html",
    "summary": "The mother of the “Today” show host Savannah Guthrie has not been heard from since an evening of dinner and games with family members."
  },
  {
    "title": "2 to 3 Cups of Coffee a Day May Reduce Dementia Risk. But Not if It’s Decaf.",
    "link": "https://www.nytimes.com/2026/02/09/health/coffee-tea-dementia-risk.html",
    "summary": "One to two cups of caffeinated tea per day helps too, researchers found after following nearly 132,000 people for 40 years."
  },
  {
    "title": "What We Can Learn From Southern Red States About Education",
    "link": "https://www.nytimes.com/2026/02/09/opinion/red-states-good-schools.html",
    "summary": "Mississippi, Alabama and Louisiana traditionally were America’s educational basement, but now they are showing blue states a way forward."
  },
  {
    "title": "It’s Time for America to Admit That It Has a Marijuana Problem",
    "link": "https://www.nytimes.com/2026/02/09/opinion/regulate-legalized-marijuana.html",
    "summary": "Given the growing harms from marijuana use, American lawmakers should do more to regulate it."
  },
  {
    "title": "The Death Toll in Ukraine",
    "link": "https://www.nytimes.com/2026/02/09/briefing/the-death-toll-in-ukraine.html",
    "summary": "We are covering the latest from the war."
  },
  {
    "title": "Monks Finish ‘Walk for Peace’ Across a Weary America",
    "link": "https://www.nytimes.com/2026/02/09/us/monks-peace-walk.html",
    "summary": "A diverse swath of Americans searching for calm said they found some as a group of Buddhist monks finished a 2,300-mile trek from Texas to Washington."
  },
  {
    "title": "From Fishing Nets to Furniture: Turning Ocean Plastic Into Usable Products",
    "link": "https://www.nytimes.com/2026/02/09/business/gravity-wave-conservation.html",
    "summary": "A brother-and-sister team in Spain started a sustainable business model recycling old and damaged nets into stadium seating and decorations."
  },
  {
    "title": "Jimmy Lai’s 20-Year Sentence Follows Beijing’s Playbook on Dissent",
    "link": "https://www.nytimes.com/2026/02/09/world/asia/jimmy-lai-sentence-analysis.html",
    "summary": "The sentence for the media mogul, along with long prison terms for his editors, shows how Hong Kong enforces Xi Jinping’s red lines with a new severity."
  },
  {
    "title": "2025 Tax Returns: Here’s What to Know About Filing This Year",
    "link": "https://www.nytimes.com/2026/02/06/business/2025-taxes-return-refund-income.html",
    "summary": "Many Americans will see bigger refunds and new deductions, while others may be revisiting the dreaded alternative minimum tax. Don’t panic just yet."
  }
]