[
  {
    "title": "After Venezuela, Trump Offers Hints About What Could Be Next",
    "link": "https://www.nytimes.com/2026/01/05/us/politics/trump-venezuela-monroe-doctrine.html",
    "summary": "President Trump’s comments about Greenland, Colombia and Cuba offered a glimpse of how emboldened he feels after the quick capture of Nicolás Maduro."
  },
  {
    "title": "Sanctioned Oil Tankers Flee Venezuela in Defiance of U.S. Blockade",
    "link": "https://www.nytimes.com/2026/01/05/world/americas/oil-tankers-venezuela-blockade.html",
    "summary": "The ships are using deceptive tactics as part of a seemingly coordinated attempt to bypass American naval forces in the region."
  },
  {
    "title": "Hochul Will Back New Safeguards to Protect Children Online",
    "link": "https://www.nytimes.com/2026/01/05/nyregion/hocul-social-media-children-protections.html",
    "summary": "In her State of the State address, Gov. Kathy Hochul will propose that the default setting for online platforms should ban viewing or messaging minors."
  },
  {
    "title": "Minnesota Gov. Tim Walz Abandons Re-election Bid, and Amy Klobuchar May Run Instead",
    "link": "https://www.nytimes.com/2026/01/05/us/walz-governor-fraud-klobuchar.html",
    "summary": "Mr. Walz said a growing scandal over fraud in social services programs led him to abandon his run for a third term as governor of Minnesota."
  },
  {
    "title": "Republican Lawmakers Like MTG Have Criticized Trump as They Depart Congress",
    "link": "https://www.nytimes.com/article/trump-republican-critics-lawmakers-exit.html",
    "summary": "It turns out that few things liberate Republicans to speak their minds about President Trump like the fact that they are departing Congress."
  },
  {
    "title": "The Key Senate Races to Watch in 2026",
    "link": "https://www.nytimes.com/2026/01/05/us/politics/the-key-senate-races-to-watch-in-2026.html",
    "summary": "Democrats want to regain control of the chamber, and they have recruited some top candidates. But they are facing a tough map."
  },
  {
    "title": "Hegseth Starts Proceedings Against Sen. Mark Kelly Over His Remarks",
    "link": "https://www.nytimes.com/2026/01/05/us/politics/hegseth-mark-kelly.html",
    "summary": "Defense Secretary Pete Hegseth blasted the senator for “seditious” remarks. Mr. Kelly said he had done nothing wrong and cited similar comments by Mr. Hegseth."
  },
  {
    "title": "Man in Custody After JD Vance’s Ohio Home Is Vandalized",
    "link": "https://www.nytimes.com/2026/01/05/us/jd-vance-home-damage-cincinnati-arrest.html",
    "summary": "U.S. Secret Service agents detained a man early Monday after the vice president’s home in Cincinnati was damaged. No injuries were reported."
  },
  {
    "title": "Lia Smith Hoped to Start Fresh At Middlebury. In Trump’s America, It Seemed Impossible.",
    "link": "https://www.nytimes.com/2026/01/05/us/middlebury-college-trans-student-suicide.html",
    "summary": "Lia Smith was a senior at Middlebury College, a transgender woman and, for a time, an athlete on the school’s diving team. But she struggled to feel accepted, and in October, she took her own life."
  },
  {
    "title": "Israel’s Stinging Retort to Mamdani Was Meant as Retaliation in Kind",
    "link": "https://www.nytimes.com/2026/01/05/world/middleeast/israel-mamdani-antisemitism.html",
    "summary": "After Mayor Zohran Mamdani of New York scrapped two executive orders on antisemitism and boycotts, the Israeli Foreign Ministry issued an aggressive response to what it saw as an aggressive act."
  },
  {
    "title": "Dimon’s $770 Million Windfall Shows How Banking Is Great Again",
    "link": "https://www.nytimes.com/2026/01/05/business/banking-deregulation-jamie-dimon.html",
    "summary": "The Trump administration is lifting regulations, and deal making is heating up. For Jamie Dimon, being JPMorgan Chase’s chief executive was more lucrative in 2025 than ever."
  },
  {
    "title": "In Ukraine, an Arsenal of Killer A.I. Drones Is Being Born in War Against Russia",
    "link": "https://www.nytimes.com/2025/12/31/magazine/ukraine-ai-drones-war-russia.html",
    "summary": "As the war grinds on, sophisticated Russian defenses have pushed Ukraine to develop a frightening new weapon: semiautonomous killing machines."
  },
  {
    "title": "How Pete Wells, Former New York Times Restaurant Critic, Changed His Eating Habits",
    "link": "https://cooking.nytimes.com/article/our-former-restaurant-critic-changed-his-eating-habits-you-can-too",
    "summary": "Pete Wells tells how he recovered from an out-of-control diet. And each week in January, he and experts will suggest ways to reset your own appetite."
  },
  {
    "title": "Trump Is Unleashing Forces Beyond His Control",
    "link": "https://www.nytimes.com/2026/01/05/opinion/trump-venezuela-maduro-clausewitz-aquinas.html",
    "summary": "The high cost of forgetting what world war is really like."
  },
  {
    "title": "Which City Burns Next?",
    "link": "https://www.nytimes.com/2026/01/05/opinion/los-angeles-fires-lessons.html",
    "summary": "One year later, we haven’t really begun to reckon with the real meaning of the Los Angeles fires."
  },
  {
    "title": "Trial Begins for Former Officer Over Uvalde School Shooting Response",
    "link": "https://www.nytimes.com/2026/01/05/us/politics/uvalde-school-shooting-trial-robb.html",
    "summary": "Families of the victims and survivors of the 2022 elementary school shooting in Texas are expected to testify."
  },
  {
    "title": "Eva Schloss, Anne Frank’s Stepsister and Auschwitz Survivor, Dies at 96",
    "link": "https://www.nytimes.com/2026/01/05/world/europe/eva-schloss-dead.html",
    "summary": "Ms. Schloss, who was sent to Auschwitz as a teenager, dedicated her life to educating people about her experiences and the dangers of prejudice."
  },
  {
    "title": "Supreme Court Increasingly Favors the Rich, Economists Say",
    "link": "https://www.nytimes.com/2026/01/05/us/politics/supreme-court-study-rich-poor.html",
    "summary": "A new study found that the court’s Republican appointees voted for the wealthier side in cases 70 percent of the time in 2022, up from 45 percent in 1953."
  },
  {
    "title": "New Car Sales Are Rising Thanks to Purchases by the Well-Off",
    "link": "https://www.nytimes.com/2026/01/05/business/new-car-sales.html",
    "summary": "A larger proportion of new cars are being bought by affluent Americans as prices and interest rates for auto loans climb, analysts said."
  }
]