[
  {
    "title": "Trump’s Sweeping Tariffs Invalidated by Appeals Court",
    "link": "https://www.nytimes.com/2025/08/29/business/economy/trump-tariffs-appeals-court.html",
    "summary": "The decision is a big blow to President Trump’s trade policies, but the judges left the duties in place for now to allow time for a likely appeal to the Supreme Court."
  },
  {
    "title": "What Is IEEPA, the Law Trump Used to Impose Tariffs?",
    "link": "https://www.nytimes.com/2025/02/02/us/politics/trump-tariffs-ieepa.html",
    "summary": "A federal appeals court struck down tariffs that President Trump had imposed by invoking a decades-old law."
  },
  {
    "title": "The Nobel Prize and a Testy Phone Call: How the Trump-Modi Relationship Unraveled",
    "link": "https://www.nytimes.com/2025/08/30/us/politics/trump-modi-india.html",
    "summary": "President Trump’s repeated claims about having “solved” the India-Pakistan war infuriated Prime Minister Narendra Modi of India. And that was only the beginning."
  },
  {
    "title": "Judge Blocks Pillar of Trump’s Mass Deportation Campaign",
    "link": "https://www.nytimes.com/2025/08/29/us/politics/judge-fast-track-deportations.html",
    "summary": "Judge Jia M. Cobb rejected what she called “a truly startling argument” from the government that it could use a fast-track procedure to remove people arrested far from the southern border."
  },
  {
    "title": "Trump Officials Move to Fire Most Voice of America Journalists",
    "link": "https://www.nytimes.com/2025/08/29/us/politics/voice-of-america-layoffs-kari-lake-trump.html",
    "summary": "The layoffs set up a potential battle with a federal judge who blocked previous efforts by Kari Lake, a fierce Trump ally, to restructure the agency."
  },
  {
    "title": "Transportation Dept. Cancels $679 Million for Offshore Wind Projects",
    "link": "https://www.nytimes.com/2025/08/29/climate/transportation-dept-cancels-679-million-wind-industry.html",
    "summary": "The Trump administration’s campaign against wind power continued as it targeted funding for marine terminals and ports to support development of the industry."
  },
  {
    "title": "What to Know About Secret Service Protection for Former Vice Presidents",
    "link": "https://www.nytimes.com/2025/08/29/us/politics/secret-service-vice-presidents-harris-trump.html",
    "summary": "The Secret Service usually protects a former vice president for six months after they leave office."
  },
  {
    "title": "Will the C.D.C. Survive?",
    "link": "https://www.nytimes.com/2025/08/29/health/cdc-kennedy-public-health.html",
    "summary": "Robert F. Kennedy Jr.’s assault may have dealt lasting damage to the agency, experts fear, with harsh consequences for public health."
  },
  {
    "title": "How the Trump-Kennedy Alliance Is Pushing the Boundaries of Public Health",
    "link": "https://www.nytimes.com/2025/08/29/us/politics/trump-kennedy-alliance-vaccines.html",
    "summary": "The mutually beneficial relationship between President Trump and Robert F. Kennedy Jr. is based on a striking alignment of some of their views."
  },
  {
    "title": "What to Know About Jim O’Neill, the New Acting C.D.C. Director",
    "link": "https://www.nytimes.com/2025/08/29/health/james-oneill-cdc.html",
    "summary": "The selection of Jim O’Neill, a former Silicon Valley executive, drew objections from Democrats, who noted his lack of medical or scientific training."
  },
  {
    "title": "The Overlooked Element to the ‘KPop Demon Hunters’ Phenomenon",
    "link": "https://www.nytimes.com/2025/08/28/movies/kpop-demon-hunters-fandom.html",
    "summary": "Beyond its catchy songs and memorable characters, the Netflix movie does an admirable job of capturing what it’s like to be an adoring fan."
  },
  {
    "title": "London’s Peace Monk Chants, Drums and Walks to Urge an End to War",
    "link": "https://www.nytimes.com/2025/08/30/world/europe/london-peace-monk-battersea.html",
    "summary": "For 40 years, the Rev. Gyoro Nagase has overseen a temple to peace in a popular park in Battersea, his ever-present drum by his side."
  },
  {
    "title": "China Revisits Its War With Japan, Stirring Pride and Fears of Hatred",
    "link": "https://www.nytimes.com/2025/08/30/world/asia/china-japan-wwii-nationalism.html",
    "summary": "A series of World War II dramas about China’s fight against Japan is drawing audiences to their feet, and, in some cases, to tears. Some say it helps deflect public discontent."
  },
  {
    "title": "Missouri Unveils Redistricting Plan, Aiming to Add a Republican Seat",
    "link": "https://www.nytimes.com/2025/08/29/us/missouri-governor-redistricting-maps.html",
    "summary": "Following Texas, Gov. Mike Kehoe called a special legislative session to redraw his state’s Congressional district lines to boost Republicans."
  },
  {
    "title": "Iowa’s Joni Ernst Will Not Seek Re-election, Putting a Competitive Senate Seat in Play",
    "link": "https://www.nytimes.com/2025/08/29/us/politics/joni-ernst-senate-iowa-re-election.html",
    "summary": "Democrats still face an uphill fight to win in Iowa and retake the majority in the closely divided Senate."
  },
  {
    "title": "The ‘Economic Storm’ of Crises That Is Battering Afghanistan",
    "link": "https://www.nytimes.com/2025/08/30/world/africa/afghanistan-economy-deportation.html",
    "summary": "Afghanistan was on a timid recovery path. But four years after the Taliban retook power, it has been badly hit by aid cuts and an inflow of two million Afghans forced out of Iran and Pakistan."
  },
  {
    "title": "Families of Minneapolis Church Shooting Victims Pay Loving Tributes",
    "link": "https://www.nytimes.com/2025/08/29/us/minneapolis-shooting-victims-families.html",
    "summary": "The impact of the deaths of Fletcher Merkel, 8, and Harper Moyski, 10, and the injuries sustained by 18 others are only beginning to be felt."
  },
  {
    "title": "Conservatives Use Minneapolis Shooting in Anti-Transgender Campaigns",
    "link": "https://www.nytimes.com/2025/08/29/us/politics/minneapolis-shooting-anti-transgender-conservatives-robin-westman.html",
    "summary": "Activists are pointing to the attacker’s gender identity to falsely portray all transgender people as prone to mental illness and violence."
  },
  {
    "title": "Riding Amtrak’s New Acela Train: Sleeker, Comfier and a Tiny Bit Faster",
    "link": "https://www.nytimes.com/2025/08/29/travel/amtrak-acela-train-launch.html",
    "summary": "The NextGen high-speed trains feel more like those in China, Japan or France. But topping out at 160 m.p.h., they’re still relatively slow."
  },
  {
    "title": "Strangers Come Together to Deliver Baby Girl at Burning Man Festival",
    "link": "https://www.nytimes.com/2025/08/29/us/burning-man-baby.html",
    "summary": "A woman unexpectedly went into labor at the desert festival. Within minutes, a neonatal nurse, an OB-GYN, a pediatric doctor and other attendees filled her camper."
  },
  {
    "title": "Can This Chef Revive Babbo, Mario Batali’s Signature Restaurant?",
    "link": "https://www.nytimes.com/2025/08/29/dining/mark-ladner-babbo-mario-batali.html",
    "summary": "Mark Ladner, a master of Italian cooking and a Batali protégé, is reinventing the Manhattan restaurant under the same famous (and infamous) name."
  },
  {
    "title": "Why the Texas Democrats’ Walkout Worked",
    "link": "https://www.nytimes.com/2025/08/29/opinion/gerrymandering-texas-newsom-trump.html",
    "summary": "Losing loudly has been a crucial feature of successful political movements."
  },
  {
    "title": "Los Angeles Wildfires Left the City With a Toxic Mess",
    "link": "https://www.nytimes.com/2025/08/29/opinion/los-angeles-wildfires-toxic-public-health.html",
    "summary": "Urban wildfires are becoming public health emergencies."
  },
  {
    "title": "At Least 70 Drown Off Mauritania After Boat Capsizes",
    "link": "https://www.nytimes.com/2025/08/29/world/africa/boat-capsize-mauritania-gambia-senegal.html",
    "summary": "Around 150 people boarded a boat in Gambia that was thought to have been headed for Europe. The boat capsized after traveling about 380 miles."
  },
  {
    "title": "3 Killed as Protests in Indonesia Spread Beyond Jakarta",
    "link": "https://www.nytimes.com/2025/08/30/world/asia/indonesia-protests-dead-prabowo-subianto.html",
    "summary": "The student-led demonstrations are against President Prabowo Subianto’s economic policies and fatal police brutality."
  },
  {
    "title": "Now on Sale: Trumpworld Trolling, With a Familiar-Looking Hat",
    "link": "https://www.nytimes.com/2025/08/29/style/newsom-trump-hat-merch.html",
    "summary": "What Gavin Newsom is up to in his “Patriot Shop.”"
  },
  {
    "title": "What’s Behind the Political Instability in Thailand",
    "link": "https://www.nytimes.com/2025/08/28/world/asia/thailand-politics-crisis.html",
    "summary": "While the country is a constitutional monarchy that holds regular elections, analysts say it is beholden to an unelected old guard."
  }
]