[
  {
    "title": "What We Learned About Trump’s Attack on Iran",
    "link": "https://www.nytimes.com/video/us/politics/100000010243701/trumps-public-statements-and-iran-planning.html",
    "summary": "Over the past week, President Trump claimed he would make a decision about Iran in “two weeks” and repeatedly pressed it to come to the negotiating table. But the swiftness of the attack on Saturday night suggests that plans were underway after Israel began its bombing campaign against Iran a little more than a week ago."
  },
  {
    "title": "Trump’s Cease-Fire Announcement Catches His Own Top Officials by Surprise",
    "link": "https://www.nytimes.com/2025/06/23/world/middleeast/trump-ceasefire-israel-iran.html",
    "summary": "Before asserting that Iran and Israel had agreed to a cease-fire, President Trump spoke to Prime Minister Benjamin Netanyahu of Israel and Iranian officials, with Qatar helping to mediate."
  },
  {
    "title": "Trump Administration to End Protections for 58 Million Acres of National Forests",
    "link": "https://www.nytimes.com/2025/06/23/climate/trump-end-protections-for-58-million-acres-of-national-forests.html",
    "summary": "Agriculture Secretary Brooke Rollins said the Clinton-era rule barring road construction and logging was outdated and “absurd.”"
  },
  {
    "title": "Judge Blocks Trump Proclamation Barring Harvard’s International Students",
    "link": "https://www.nytimes.com/2025/06/23/us/harvard-trump-international-students.html",
    "summary": "The same judge issued an order last week blocking a separate government effort to keep the school from enrolling students from abroad."
  },
  {
    "title": "Why Factories Are Having Trouble Filling Nearly 400,000 Open Jobs",
    "link": "https://www.nytimes.com/2025/06/23/business/factory-jobs-workers-trump.html",
    "summary": "For every 20 positions, there’s one qualified candidate, says one manufacturing chief executive. Some of President Trump’s policies are likely to exacerbate the problem."
  },
  {
    "title": "Ford Will Keep Battery Factory Even if Republicans Ax Tax Break",
    "link": "https://www.nytimes.com/2025/06/23/business/ford-battery-factory-electric-vehicles.html",
    "summary": "Ford Motor said it would open a new plant in Michigan that could become ineligible for federal incentives under a policy bill championed by President Trump and passed by the House."
  },
  {
    "title": "Cuomo and Mamdani Push to Raise Turnout in ‘Jump Ball’ Mayor’s Race",
    "link": "https://www.nytimes.com/2025/06/23/nyregion/mayor-primary-mamdani-cuomo.html",
    "summary": "A new poll shows the New York City mayor’s race tightening in its final days. Former Gov. Andrew M. Cuomo and Assemblyman Zohran Mamdani are scrambling for every last vote."
  },
  {
    "title": "As Black New Yorkers Move Out, N.Y.C. Politics May Be Reshaped",
    "link": "https://www.nytimes.com/2025/06/23/nyregion/nyc-mayor-black-voters.html",
    "summary": "Housing affordability and quality-of-life concerns are pushing longtime Black New Yorkers out of the city, underscoring Democrats’ challenges with their base ahead of the mayoral election."
  },
  {
    "title": "In a Big Place With Few People, a Minister Needs a Pilot’s License",
    "link": "https://www.nytimes.com/2025/06/24/world/australia/australia-flying-padres-chaplains.html",
    "summary": "The Salvation Army’s “Flying Padres” cross the Australian outback by air, dropping in on ranches and small communities — sometimes, just to lend an ear."
  },
  {
    "title": "Scenes From the Hottest Blocks in New York City",
    "link": "https://www.nytimes.com/2025/06/23/nyregion/heat-weather-nyc-queens.html",
    "summary": "Whatever the temperature is in Central Park, it’s hotter alongside Newtown Creek, the toxic and industrial waterway separating Brooklyn from Queens."
  },
  {
    "title": "Why the Heat Index Makes the Temperature Feel Worse",
    "link": "https://www.nytimes.com/2025/06/23/weather/what-is-the-heat-index-humidity.html",
    "summary": "Some hot days feel even worse thanks to high humidity, trapped heat and dew points. Cities are especially vulnerable."
  },
  {
    "title": "US Heat Wave: Latest Forecast for the East Coast",
    "link": "https://www.nytimes.com/2025/06/22/weather/heat-wave-temperatures.html",
    "summary": "This week is delivering the hottest temperatures of the year so far to much of the eastern United States."
  },
  {
    "title": "Vera Rubin Telescope Quickly Found 1,200 New Asteroids",
    "link": "https://www.nytimes.com/2025/06/23/science/rubin-telescope-asteroids.html",
    "summary": "The Vera C. Rubin Observatory is expected to find millions of unknown objects in our solar system, and perhaps even a mysterious Planet Nine."
  },
  {
    "title": "Vera Rubin’s Legacy Lives On in a Troubled Scientific Landscape",
    "link": "https://www.nytimes.com/2025/06/22/science/vera-rubin-women-astronomy.html",
    "summary": "A powerful new telescope will usher in a new era of cosmic discovery, but in a political climate vastly different from when it was named for a once overlooked female astronomer."
  },
  {
    "title": "New York Again Embraces Nuclear Power With Plans to Build New Plant",
    "link": "https://www.nytimes.com/2025/06/23/nyregion/new-york-nuclear-power-plant.html",
    "summary": "In her announcement, Gov. Kathy Hochul gave few details about where the plant would be built, how much the project would cost or how long it would take to complete."
  },
  {
    "title": "Putin Has Lost the West. This Was Not the Plan.",
    "link": "https://www.nytimes.com/2025/06/24/opinion/putin-trump-nato-russia.html",
    "summary": "The loss is a tragedy for Russia."
  },
  {
    "title": "What Environmentalists Like Me Got Wrong About Climate Change",
    "link": "https://www.nytimes.com/2025/06/23/opinion/climate-change-methane-natural-gas.html",
    "summary": "Governments and U.S. states committed to climate action now need to persuade the oil industry to protect the world from climate chaos."
  },
  {
    "title": "As Sean ‘Diddy’ Combs Took a Victory Lap, He Planned Sex Nights, Prosecutors Say",
    "link": "https://www.nytimes.com/2025/06/23/arts/music/sean-combs-diddy-trial-sex-night-expenses.html",
    "summary": "Questioning its final witness, the government laid out flight plans, escort prices, hotel reservations and a web of payments for sexual encounters in 2023."
  },
  {
    "title": "Bodies of 3 Hikers Who Jumped in Water Near Lake Tahoe Are Recovered",
    "link": "https://www.nytimes.com/2025/06/23/us/missing-hikers-dead-rattlesnake-falls-california.html",
    "summary": "The three men had been hiking in Soda Springs, Calif., when they jumped into the water near Rattlesnake Falls, a remote and isolated area that made rescue difficult."
  },
  {
    "title": "The Curtain Drops on Improv Theater for the New York Police",
    "link": "https://www.nytimes.com/2025/06/23/nyregion/nypd-acting-improv-class.html",
    "summary": "Police Commissioner Jessica Tisch said a staffing crisis kept her from letting officers participate in a Brooklyn theater group that began after the death of Eric Garner, who died after a police officer put him in a chokehold, in 2014."
  },
  {
    "title": "Florida Men Accused of Stealing More Than $100 Million Meant for People With Special Needs",
    "link": "https://www.nytimes.com/2025/06/23/us/politics/florida-nonprofit-millions-stolen.html",
    "summary": "Federal prosecutors say the money was used to fly on a private jet, buy real estate and help operate a brewery."
  }
]