[
  {
    "title": "White House Distances Trump From Initial Response to Minnesota Killing",
    "link": "https://www.nytimes.com/2026/01/26/us/politics/trump-minneapolis-nurse-shooting-video.html",
    "summary": "Officials clearly understood that the fatal shooting of a demonstrator posed one of the gravest political threats to President Trump since his inauguration."
  },
  {
    "title": "Our Photographer Describes the Scene After the Pretti Shooting",
    "link": "https://www.nytimes.com/video/us/100000010667387/our-photographer-describes-pretti-shooting-scene.html",
    "summary": "David Guttenfelder, a Times photographer based in Minneapolis, describes what he saw at the scene where Alex Jeffrey Pretti had been killed by federal agents."
  },
  {
    "title": "Democrats Embrace a Shutdown Fight They Wanted to Avoid",
    "link": "https://www.nytimes.com/2026/01/26/us/politics/democrats-shutdown-ice-shooting.html",
    "summary": "After a second fatal shooting of a U.S. citizen in Minneapolis, Democrats say public opinion is on their side and they are willing to risk a backlash to counter what they see as police-state tactics."
  },
  {
    "title": "Thousands of Flights Canceled Monday After Snowstorm",
    "link": "https://www.nytimes.com/2026/01/26/business/storm-flight-cancellations-delays.html",
    "summary": "Delays and cancellations persisted a day after more than 11,000 flights were canceled. Airports in the Northeastern U.S. were hit the hardest."
  },
  {
    "title": "Scenes From the Winter Storm",
    "link": "https://www.nytimes.com/2026/01/24/us/winter-storm-snow-photos-videos.html",
    "summary": "Images from across much of the United States illuminate snow-covered streets and the storm’s aftermath."
  },
  {
    "title": "As U.S. Warships Get Closer, Iran Ramps Up Threats to Retaliate",
    "link": "https://www.nytimes.com/2026/01/26/world/middleeast/us-warships-gulf-waters-iran-retaliation-threats.html",
    "summary": "Iran and its militia allies say they will respond aggressively in the region if attacked. A U.S. aircraft carrier and warships are approaching the region."
  },
  {
    "title": "Home Sourdough Bakers Are Turning Their Hobbies Into Full-Time Jobs",
    "link": "https://www.nytimes.com/2026/01/26/dining/home-bakers-sourdough-microbakeries.html",
    "summary": "Home bakers are finding devoted customer bases that allow them to stay home with family and still make a decent living — but they do have get up in the middle of the night."
  },
  {
    "title": "On Venezuela and Greenland, Many Trump Fans Give Him the Benefit of the Doubt",
    "link": "https://www.nytimes.com/2026/01/26/us/politics/trump-supporters-foreign-policy-greenland-iran.html",
    "summary": "At least so far, President Trump has managed to bring along even those conservative supporters who are skeptical of foreign interventions."
  },
  {
    "title": "NATO Chief Says Europe Is ‘Dreaming’ if It Thinks It Can Defend Itself Without U.S.",
    "link": "https://www.nytimes.com/2026/01/26/world/europe/nato-chief-europe-greenland-trump-us.html",
    "summary": "Mark Rutte, the secretary general of the alliance, told members of the European Parliament that President Trump was “doing a lot of good stuff.”"
  },
  {
    "title": "Under Biden Administration, Justice Dept. Began Examining Ilhan Omar’s Finances",
    "link": "https://www.nytimes.com/2026/01/26/us/politics/ilhan-omar-investigation-finances.html",
    "summary": "The inquiry, initiated by the U.S. attorney’s office in Washington, appears to have stalled for lack of evidence."
  },
  {
    "title": "The ‘R-Word’ Returns, Dismaying Those Who Fought to Oust It",
    "link": "https://www.nytimes.com/2026/01/26/us/r-word-slur-disability.html",
    "summary": "The term, long considered a slur for those with intellectual disabilities, is seeing a resurgence on social media and across the political right."
  },
  {
    "title": "How Bad Are A.I. Delusions? We Asked People Treating Them.",
    "link": "https://www.nytimes.com/2026/01/26/us/chatgpt-delusions-psychosis.html",
    "summary": "Dozens of doctors and therapists said chatbots had led their patients to psychosis, isolation and unhealthy habits."
  },
  {
    "title": "Yann LeCun, an A.I. Pioneer, Warns the Tech ‘Herd’ Could Hit a Dead End",
    "link": "https://www.nytimes.com/2026/01/26/technology/an-ai-pioneer-warns-the-tech-herd-is-marching-into-a-dead-end.html",
    "summary": "Yann LeCun helped create the technology behind today’s chatbots. Now he says many tech companies are on the wrong path to creating intelligent machines."
  },
  {
    "title": "Israel Recovers Body of Ran Gvili From Gaza, Closing a Chapter",
    "link": "https://www.nytimes.com/2026/01/26/world/middleeast/gaza-hostage-returned-israel.html",
    "summary": "The recovery of Master Sgt. Ran Gvili’s body paves the way for the next stage of the Gaza cease-fire plan, though the path forward is unclear."
  },
  {
    "title": "These Liberals Listen to Right-Wing Podcasts to Leave Their Media Comfort Zone",
    "link": "https://www.nytimes.com/2026/01/26/style/podcast-listening-club-right-wing.html",
    "summary": "To get outside their bubbles — and crib some tactics — members of a listening club are plunging themselves into a world they had once avoided."
  },
  {
    "title": "New Videos of the Beckham Feud Are Fake. Nobody Seems to Care.",
    "link": "https://www.nytimes.com/2026/01/26/business/media/brooklyn-beckham-victoria-feud-ai-videos-dancing.html",
    "summary": "A.I.-generated content of Victoria Beckham has spread as wedding drama has engulfed the celebrity clan and the public has clamored for receipts (even fabricated ones)."
  },
  {
    "title": "The War in Minnesota Is for Our Phones",
    "link": "https://www.nytimes.com/2026/01/26/opinion/minnesota-minneapolis-phone-ice-shooting.html",
    "summary": "We need to protect our right to carry cameras to document ICE’s violence."
  },
  {
    "title": "‘We Are Creating the Conditions for a Catastrophe’: Three Columnists on the Shooting of Alex Pretti in Minneapolis",
    "link": "https://www.nytimes.com/2026/01/26/opinion/minneapolis-alex-pretti-ice-shooting.html",
    "summary": "On immigration raids, the shooting death of Alex Pretti and where we go from here."
  },
  {
    "title": "Trump Changes Course in Minnesota",
    "link": "https://www.nytimes.com/2026/01/26/briefing/trump-minnesota-winter-storm-cold.html",
    "summary": "Also, large parts of the U.S. are dangerously cold. Here’s the latest at the end of Monday."
  },
  {
    "title": "Private Jet Crashes at Maine Airport, Killing 6",
    "link": "https://www.nytimes.com/2026/01/25/us/bangor-maine-airport-crash.html",
    "summary": "A Bombardier Challenger 600 crashed during takeoff Sunday at the Bangor airport, officials said."
  },
  {
    "title": "430,000-Year-Old Wooden Tools Are the Oldest Ever Found",
    "link": "https://www.nytimes.com/2026/01/26/science/archaeology-neanderthals-tools.html",
    "summary": "The finding, along with the discovery of a 500,000-year-old hammer made of bone, indicates that our human ancestors were making tools even earlier than archaeologists thought."
  },
  {
    "title": "Thomas Fogarty, 91, Who Helped Revolutionize Vascular Surgery, Dies",
    "link": "https://www.nytimes.com/2026/01/26/science/thomas-fogarty-dead.html",
    "summary": "Drawing on his love of fly-fishing, he developed a balloon catheter that removes blood clots from patients’ limbs in a minimally invasive way. It has saved millions of lives."
  },
  {
    "title": "A Year After DC Plane Crash, Concerns About Airport’s Safety Continue",
    "link": "https://www.nytimes.com/2026/01/26/us/politics/reagan-national-airport-crash.html",
    "summary": "The Federal Aviation Administration says it has reduced traffic in and out of the airport and designed safer routes. Crash victims’ families want more."
  }
]