[
  {
    "title": "‘Unrestrained’ Chinese Cyberattackers May Have Stolen Data From Almost Every American",
    "link": "https://www.nytimes.com/2025/09/04/world/asia/china-hack-salt-typhoon.html",
    "summary": "Information collected during the yearslong  Salt Typhoon attack could allow Beijing’s intelligence services to track targets from the United States and dozens of other countries."
  },
  {
    "title": "Florida Moves to End Vaccine Mandates, and Trump Battles Wind Farms",
    "link": "https://www.nytimes.com/2025/09/04/podcasts/the-headlines/florida-vaccine-mandates-trump-wind-farms.html",
    "summary": "Plus, a Chinese coffee giant comes to America."
  },
  {
    "title": "In Tariff Standoff With Trump, China Boycotts American Soybeans",
    "link": "https://www.nytimes.com/2025/09/04/business/china-soybeans-trump-tariffs.html",
    "summary": "U.S. farmers need to sell their incoming crop, and China needs to buy it in case its main alternative, Brazil, has a flood or drought. But their trade war prevents a deal."
  },
  {
    "title": "John Deere, a U.S. Icon, Is Undermined by Tariffs and Struggling Farmers",
    "link": "https://www.nytimes.com/2025/09/04/business/john-deere-tractor-sales-down-farmers-struggle.html",
    "summary": "The tractor maker said that sales were down and that higher metal tariffs would cost it $600 million, while American farmers face dwindling overseas demand for some crops."
  },
  {
    "title": "Trump Asks Supreme Court to Allow His Sweeping Tariffs",
    "link": "https://www.nytimes.com/2025/09/03/us/politics/trump-supreme-court-tariffs.html",
    "summary": "A federal appeals court had invalidated a centerpiece of President Trump’s economic strategy, finding that a 1977 law did not authorize the tariffs."
  },
  {
    "title": "RFK Jr. Faces Senate Grilling After Vaccine Changes and C.D.C. Shake-Up",
    "link": "https://www.nytimes.com/2025/09/04/us/politics/kennedy-senate-hearing-vaccines-cdc.html",
    "summary": "Some Republican lawmakers have questioned whether Health Secretary Robert F. Kennedy Jr.’s recent actions contradict pledges he made about vaccine access in order to win confirmation."
  },
  {
    "title": "Kennedy to Add New Members to Vaccine Advisory Panel",
    "link": "https://www.nytimes.com/2025/09/03/health/rfk-jr-acip-vaccine-members.html",
    "summary": "The health secretary fired the original committee members in June, replacing them with some who have been critical of vaccines."
  },
  {
    "title": "Russia Wants ‘Security Guarantees’ Too. Here’s What They Look Like.",
    "link": "https://www.nytimes.com/2025/09/04/world/europe/russia-security-guarantees.html",
    "summary": "The Kremlin’s vision of national security comes at the expense of Ukrainian sovereignty, underlining the challenges of striking a peace deal."
  },
  {
    "title": "Europe Aims to Show It Is Ready to Secure Postwar Ukraine",
    "link": "https://www.nytimes.com/2025/09/04/world/europe/ukraine-macron-postwar.html",
    "summary": "President Emmanuel Macron of France is hosting a meeting of leaders who will review options for protecting any peace with Russia."
  },
  {
    "title": "Trump Grows Frustrated With Putin, as Russian President Bonds With China’s Leader",
    "link": "https://www.nytimes.com/2025/09/03/us/politics/trump-putin-russia-ukraine-china.html",
    "summary": "President Trump’s extraordinary summit with President Vladimir V. Putin of Russia last month has yet to yield any concrete results on the war in Ukraine."
  },
  {
    "title": "Trump Administration Targets Financial Relief for Undocumented Students",
    "link": "https://www.nytimes.com/2025/09/04/us/politics/trump-tuition-undocumented-students.html",
    "summary": "The Justice Department has challenged several states that offer in-state tuition to unauthorized immigrants, contending that the policies discriminate against U.S. citizens."
  },
  {
    "title": "Stephen Miran, Trump’s Fed Pick, to Face Grilling From Lawmakers",
    "link": "https://www.nytimes.com/2025/09/04/business/stephen-miran-federal-reserve-trump.html",
    "summary": "Stephen Miran, who served as one of the president’s top economic advisers, will have to reconcile his past criticism of the central bank with his new responsibilities if he becomes a governor."
  },
  {
    "title": "Inside Trump’s Unorthodox Climate Attacks in Courts Nationwide",
    "link": "https://www.nytimes.com/2025/09/04/climate/lawsuits-superfund-trump-justice-climate.html",
    "summary": "The administration is cranking up efforts to kill state laws and legal cases that would force fossil-fuel companies to pay for climate damage."
  },
  {
    "title": "ICE Opens Immigrant Detention Center in Louisiana’s Angola Prison",
    "link": "https://www.nytimes.com/2025/09/03/us/ice-detention-center-angola-louisiana.html",
    "summary": "Critics are questioning the decision to hold immigrants at the maximum-security facility known as Angola, which has a troubled history."
  },
  {
    "title": "Judge Rules Trump Administration Illegally Canceled Harvard Funding",
    "link": "https://www.nytimes.com/2025/09/03/us/harvard-trump-funding-ruling.html",
    "summary": "The ruling was a victory for the university in its battle with President Trump, but the judge’s decision may not be the final word."
  },
  {
    "title": "Trump Administration Says Boat Strike Is Start of Campaign Against Venezuelan Cartels",
    "link": "https://www.nytimes.com/2025/09/03/us/politics/hegseth-venezuela-drug-strike.html",
    "summary": "The defense secretary and President Trump said a small boat was carrying drugs but offered little evidence and few details."
  },
  {
    "title": "Palestinian Leaders Urge U.S. to End Visa Ban Ahead of Statehood Summit",
    "link": "https://www.nytimes.com/2025/09/04/world/middleeast/palestinian-leaders-visa-ban-statehood-conference.html",
    "summary": "When world leaders meet in New York this month, several plan to recognize a Palestinian state, but Palestinian leaders may not be there to revel in the moment."
  },
  {
    "title": "Hamas Says It Is Ready for a Comprehensive Deal to End the Gaza War",
    "link": "https://www.nytimes.com/2025/09/04/world/middleeast/hamas-gaza-war-israel-ceasefire-deal.html",
    "summary": "The Palestinian militant group has expressed similar positions in the past, and Prime Minister Benjamin Netanyahu of Israel dismissed its statement as “spin” and “nothing new.”"
  },
  {
    "title": "She Decides Who’s Famous Enough for Free U.S. Open Tickets",
    "link": "https://www.nytimes.com/2025/09/04/nyregion/us-open-celebrities.html",
    "summary": "Every year, Amanda Wight makes sure that a steady stream of A-listers get to see the world’s best tennis players — and be seen by millions on TV."
  },
  {
    "title": "For Donald Trump, Everything Is an Emergency",
    "link": "https://www.nytimes.com/2025/09/04/briefing/trump-state-of-emergency.html",
    "summary": "He’s exploiting a diabolical problem in our legal system to expand presidential power."
  },
  {
    "title": "Portugal Searches for Cause of Lisbon Funicular Crash as Death Toll Rises",
    "link": "https://www.nytimes.com/2025/09/04/world/europe/lisbon-funicular-crash-elevador-da-gloria-portugal.html",
    "summary": "The authorities were also working to identify the 17 victims, who they said had Portuguese and foreign surnames. The funicular is popular with tourists."
  },
  {
    "title": "Lisbon Funicular Crash: What to Know About Cause and Victims",
    "link": "https://www.nytimes.com/2025/09/04/world/europe/lisbon-funicular-crash-gloria.html",
    "summary": "At least 17 people were killed after the Glória funicular, one of the city’s most popular tourist attractions, derailed and crashed."
  },
  {
    "title": "What Can Democrats Do to Get Rid of the Scarlet L for Loser?",
    "link": "https://www.nytimes.com/2025/09/04/opinion/democrats-republicans-trump-2026.html",
    "summary": "Is there a way for them to get rid of the scarlet L, for loser?"
  },
  {
    "title": "The War in Ukraine Has a Shocking New Weapon",
    "link": "https://www.nytimes.com/2025/09/04/opinion/russia-ukraine-sabotage-teens.html",
    "summary": "Teenagers are being recruited for one-off covert attacks behind enemy lines."
  },
  {
    "title": "How Trump Exploits Emergency Declarations to Expand Presidential Power",
    "link": "https://www.nytimes.com/2025/09/04/briefing/how-trump-exploits-emergency-declarations-to-expand-presidential-power.html",
    "summary": "We catalog the president’s emergencies to explore how he is using them to remake the government."
  },
  {
    "title": "Late Night Thinks Trump Has a Case of Parade Envy",
    "link": "https://www.nytimes.com/2025/09/04/arts/television/late-night-trump-china-parade.html",
    "summary": "“It sounds like somebody’s bummed he wasn’t invited to the supervillain sleepover,” Jimmy Kimmel said of the president’s reaction to China’s big military parade."
  },
  {
    "title": "Former Suntory Boss Says He Used CBD Supplements for Jet Lag",
    "link": "https://www.nytimes.com/2025/09/04/business/suntory-takeshi-niinami-jetlag-cbd.html",
    "summary": "Takeshi Niinami said he never used the products in Japan, where officials are investigating whether they are banned under the country’s strict drug laws."
  },
  {
    "title": "Rosalyn Drexler, Artistic Whirlwind Who Defied Categories, Dies at 98",
    "link": "https://www.nytimes.com/2025/09/03/books/rosalyn-drexler-dead.html",
    "summary": "She wrote plays, novels and an Emmy-winning Lily Tomlin special. She was a painter, a sculptor and a nightclub singer. Oh, and she also wrestled professionally."
  },
  {
    "title": "Vetements Takes Its Trademark Fight to U.S. Supreme Court",
    "link": "https://www.nytimes.com/2025/09/04/world/europe/vetements-trademark-lawsuit.html",
    "summary": "Why does Veuve Clicquot get a U.S. trademark while Vetements — home of the packing-tape minidress, no less! — does not? Its lawyers want to know."
  },
  {
    "title": "As Starbucks Slumps, a Chinese Coffee Giant Sees an Opening in New York",
    "link": "https://www.nytimes.com/2025/09/04/nyregion/luckin-coffee-nyc-starbucks.html",
    "summary": "Luckin Coffee, a dominant chain from China, arrived in the city in June vowing to inject “new vitality” into American coffee culture."
  }
]