[
  {
    "title": "Veterans See Costs and Risks in Hegseth’s Military Rewind to 1990",
    "link": "https://www.nytimes.com/2025/10/02/us/hegseth-military-veterans-standards.html",
    "summary": "Defense Secretary Pete Hegseth has identified real problems, veteran officers say, but by looking back 35 years for policy cues, he risks hurting, not helping, military readiness."
  },
  {
    "title": "Why Pete Hegseth Summoned Top Military Leaders",
    "link": "https://www.nytimes.com/video/us/politics/100000010431240/why-pete-hegseth-summoned-top-military-leaders.html",
    "summary": "Secretary of Defense Pete Hegseth faced a room of hundreds of generals and admirals whom he had summoned from across the globe, and made his case for shaking up a force that he said had gone soft and “woke.” Greg Jaffe, the Pentagon reporter for The New York Times, discusses Hegseth’s speech."
  },
  {
    "title": "What Women Heard in Hegseth’s Remarks About Physical Standards",
    "link": "https://www.nytimes.com/2025/10/02/us/politics/women-military-hegseth-physical-standards.html",
    "summary": "The defense secretary raised the issue suggesting women were getting into combat not because they met high standards, but because they were given a pass."
  },
  {
    "title": "Trump Asked Universities to Sign a Compact. Some See a Trap.",
    "link": "https://www.nytimes.com/2025/10/02/us/trump-universities-compact-funding.html",
    "summary": "Trump officials want universities to sign on to conservative priorities to get special treatment. Some in higher education say agreeing would end academic freedom."
  },
  {
    "title": "Apple Takes Down ICE Tracking Apps Amid Trump Pressure Campaign",
    "link": "https://www.nytimes.com/2025/10/02/us/politics/apple-iceblock-app-store-trump.html",
    "summary": "Trump administration officials have issued several legal threats over ICEBlock, a popular app that allows users to alert others to the presence of nearby immigration agents."
  },
  {
    "title": "Kennedy Fires N.I.H. Scientist Who Filed Whistle-Blower Complaint",
    "link": "https://www.nytimes.com/2025/10/02/health/kennedy-marrazzo-nih.html",
    "summary": "Dr. Jeanne Marrazzo, who was on administrative leave, alleged that the Trump administration had defied court orders and undermined vaccine research."
  },
  {
    "title": "After Trump Pulls Funding, Work Continues on N.Y. Area Transit Projects",
    "link": "https://www.nytimes.com/2025/10/02/nyregion/trump-infrastructure-hudson-river-tunnel.html",
    "summary": "Two of the largest infrastructure initiatives in the United States were still moving forward this week despite the battles over a government shutdown surrounding them."
  },
  {
    "title": "Partisan Language Inserted Into Education Dept. Workers’ Automated Emails",
    "link": "https://www.nytimes.com/2025/10/02/us/politics/education-dept-shutdown-emails.html",
    "summary": "The out-of-office responses from the accounts of employees on furlough cast blame for the shutdown on Democrats."
  },
  {
    "title": "A Government Shutdown Silver Lining: Federal Workers Eat and Drink at a Discount",
    "link": "https://www.nytimes.com/2025/10/02/dining/government-shutdown-restaurants-discounts.html",
    "summary": "Washington watering holes and restaurants are showing solidarity and seizing an opportunity to draw in out-of-work government employees."
  },
  {
    "title": "FDA Approves Generic Version of Abortion Pill Mifepristone",
    "link": "https://www.nytimes.com/2025/10/02/health/abortion-pill-generic-fda.html",
    "summary": "The decision enraged opponents of abortion, who have been pressuring the Trump administration to restrict access to abortion medication."
  },
  {
    "title": "On ‘The Life of a Showgirl,’ Taylor Swift Has a Lust for Love (and Her Foes)",
    "link": "https://www.nytimes.com/2025/10/03/arts/music/taylor-swift-the-life-of-a-showgirl-review.html",
    "summary": "On her 12th original album, the pop superstar sounds hungry to embrace her future — but not until she attends to some unfinished business."
  },
  {
    "title": "Taylor Swift Wears Bob Mackie’s Bejeweled Designs for ‘Life of a Showgirl’",
    "link": "https://www.nytimes.com/2025/10/03/style/taylor-swift-bob-mackie-showgirl-costumes.html",
    "summary": "Bob Mackie, whose bejeweled designs have appeared on a list of performers that now includes the singer, reflects on a role he has dressed many for."
  },
  {
    "title": "Sean ‘Diddy’ Combs Asks Judge for Mercy: ‘I Lost My Way’",
    "link": "https://www.nytimes.com/2025/10/02/arts/music/sean-combs-diddy-sentencing-letter-judge.html",
    "summary": "The music mogul submitted a letter to the court ahead of his sentencing on Friday for his conviction on two prostitution-related counts."
  },
  {
    "title": "After Declining to Give Trump a Sword for King Charles, a Museum Leader Is Out",
    "link": "https://www.nytimes.com/2025/10/02/arts/design/trump-eisenhower-king-charles-sword.html",
    "summary": "The departure of Todd Arrington, who led the Dwight D. Eisenhower Presidential Library and Museum, came after the administration sought a sword from its collection as a gift for King Charles."
  },
  {
    "title": "Deadly Car Ramming and Stabbing Outside UK Synagogue Is Declared Terrorist Attack",
    "link": "https://www.nytimes.com/2025/10/02/world/europe/terrorist-attack-uk-synagogue-manchester.html",
    "summary": "The police identified the attacker as Jihad al-Shamie, 35, a British citizen of Syrian descent. He was shot dead, the police said, after killing two people in Manchester, England."
  },
  {
    "title": "Manchester Synagogue Attack Fuels Fears of Antisemitism in Britain",
    "link": "https://www.nytimes.com/2025/10/02/world/europe/britain-antisemitism-manchester.html",
    "summary": "In the hours after an attack, a blanket of fear and grief fell over synagogues and Jewish community centers across the country."
  },
  {
    "title": "As Russian Drones Menace Europe, Putin Says Moscow Has No Plans to Invade",
    "link": "https://www.nytimes.com/2025/10/02/world/europe/putin-russia-drones.html",
    "summary": "President Vladimir V. Putin lashed out at “European elites” for “whipping up the hysteria” about the “Russian threat.”"
  },
  {
    "title": "OpenAI’s Sora Video App Is Jaw-Dropping (for Better and Worse)",
    "link": "https://www.nytimes.com/2025/10/02/technology/openai-sora-video-app.html",
    "summary": "Sora, OpenAI’s new video-generating app, is really a social network in disguise that can bring creative A.I. to the masses — and its problems, too."
  },
  {
    "title": "A.I. Is Driving a Stock Market Rally in China, Too",
    "link": "https://www.nytimes.com/2025/10/03/business/china-tech-stocks-artificial-intelligence.html",
    "summary": "Surging interest in artificial intelligence is generating huge gains for Chinese tech stocks like Alibaba, which has more than doubled this year."
  },
  {
    "title": "Madagascar’s President Rajoelina Dissolved His Government, but Calls for His Resignation Continue",
    "link": "https://www.nytimes.com/2025/10/02/world/africa/madagascar-protests-president.html",
    "summary": "A growing protest movement on the African island, despite deadly clashes with security forces, vows to keep fighting until Andry Rajoelina is ousted."
  },
  {
    "title": "This City Was Forced to Overhaul Its Police Department. Crime Plummeted.",
    "link": "https://www.nytimes.com/2025/10/02/nyregion/newark-police-federal-oversight.html",
    "summary": "A federal judge said she was prepared to release Newark from a 2016 consent decree imposed after investigators found the city’s police routinely used excessive force and conducted unconstitutional stops and searches."
  },
  {
    "title": "Trump’s ‘Compact’ With Universities Is Just Extortion",
    "link": "https://www.nytimes.com/2025/10/02/opinion/trump-compact-universities-constitution.html",
    "summary": "There seems to be no limit to the president’s odious attempts to control higher education."
  },
  {
    "title": "Taylor Swift Is No Showgirl",
    "link": "https://www.nytimes.com/2025/10/02/opinion/taylor-swift-showgirl-release-history.html",
    "summary": "Once you’re a showgirl, you’ll never be anyone’s girl next door again."
  },
  {
    "title": "American Soldiers in American Cities",
    "link": "https://www.nytimes.com/2025/10/02/world/american-military-trump-manchester-synagogue-taylor-swift.html",
    "summary": "Our Pentagon reporter explains how President Trump has tapped into a fear that resonates in many places around the world."
  },
  {
    "title": "Tesla Is Sued by Family Who Says Faulty Cybertruck Doors Led to Woman’s Death",
    "link": "https://www.nytimes.com/2025/10/02/business/tesla-cybertruck-doors-lawsuit-california.html",
    "summary": "A college student was trapped in a burning Cybertruck because electronic doors made it difficult for her to get out or be rescued, a lawsuit claims."
  },
  {
    "title": "The Big Bad Wolf Is Afraid of You",
    "link": "https://www.nytimes.com/2025/10/02/science/wolves-humans-fear-study.html",
    "summary": "Researchers found that the predatory canines were far more likely to flee recordings of human voices than they were to run away from other sounds."
  },
  {
    "title": "Paramount Nears a Deal to Buy Bari Weiss’s Free Press",
    "link": "https://www.nytimes.com/2025/10/02/business/media/paramount-free-press-bari-weiss-deal.html",
    "summary": "Ms. Weiss, a co-founder of the site, would become editor in chief of CBS News, people briefed on the talks said."
  },
  {
    "title": "Texas Megachurch Pastor Pleads Guilty to Child Sex Abuse",
    "link": "https://www.nytimes.com/2025/10/02/world/asia/robert-morris-pastor-sex-abuse.html",
    "summary": "Robert Morris, the founder of Gateway Church, which has one of the nation’s largest congregations, admitted to sexually abusing a child in the 1980s."
  }
]