[
  {
    "title": "ICE Is Cracking Down on Chicago. Some Chicagoans Are Fighting Back.",
    "link": "https://www.nytimes.com/2025/10/14/us/chicago-ice-trump.html",
    "summary": "Residents have begun forming volunteer groups to monitor their neighborhoods for federal immigration agents. Others honk their horns or blow whistles when they see agents nearby."
  },
  {
    "title": "Chicago’s Uprising Against ICE, and 80,000 Stolen Phones",
    "link": "https://www.nytimes.com/2025/10/15/podcasts/the-headlines/chicago-ice-stolen-phones-uk.html",
    "summary": "Plus, there may be lead in your protein supplements."
  },
  {
    "title": "Will the Voting Rights Act Be Gutted? Supreme Court Could Decide Its Future.",
    "link": "https://www.nytimes.com/2025/10/15/us/politics/supreme-court-voting-rights-act.html",
    "summary": "If the justices decide that lawmakers cannot consider race in drafting maps, redistricting could result in congressional seats flipping from blue to red throughout the country."
  },
  {
    "title": "Who Are the Louisiana Voters Behind a Major Supreme Court Challenge?",
    "link": "https://www.nytimes.com/2025/10/12/us/politics/supreme-court-voting-rights.html",
    "summary": "There is little information in court filings about the dozen plaintiffs who challenged the state’s voting map as an illegal racial gerrymander."
  },
  {
    "title": "Supreme Court Asks When Police Can Enter Without Warrant in Emergency",
    "link": "https://www.nytimes.com/2025/10/15/us/politics/supreme-court-warrants-emergency.html",
    "summary": "Montana is defending the actions of law enforcement officers who did not have a warrant when they responded to a possibly suicidal Army veteran."
  },
  {
    "title": "Trump Administration Guts Education Department With More Layoffs",
    "link": "https://www.nytimes.com/2025/10/14/us/politics/trump-education-department-federal-layoffs.html",
    "summary": "About a fifth of the agency’s remaining staff was affected, including employees working on special education, funding for low-income students and civil rights enforcement."
  },
  {
    "title": "The Shutdown Enters Its Third Week",
    "link": "https://www.nytimes.com/2025/10/15/us/shutdown-government-caribbean-strike-trump.html",
    "summary": "Cuts to transportation and energy. Funding for food assistance and the military. Here’s the latest from the shutdown."
  },
  {
    "title": "Spies, Burgers and Bombs: After a New War, Old Wounds Resurface in Tehran",
    "link": "https://www.nytimes.com/2025/10/15/world/middleeast/iran-tehran-united-states.html",
    "summary": "A deep sense of unease has gripped Iran since American and Israeli airstrikes in June, but on a recent visit to the capital, we found that many Iranians seemed to be just trying to get by."
  },
  {
    "title": "First Burials to Be Held for Israelis Returned From Gaza",
    "link": "https://www.nytimes.com/2025/10/15/world/middleeast/israel-hostages-hamas-returned-gaza-funerals.html",
    "summary": "Hamas has handed over the bodies of eight people, but says it is struggling to find the remains of others in Gaza after two years of war."
  },
  {
    "title": "How the U.S. and the Arab World Teamed Up to Seal the Gaza Deal",
    "link": "https://www.nytimes.com/2025/10/14/world/middleeast/us-arab-gaza-deal.html",
    "summary": "The cease-fire talks in Egypt showed that with pressure on Hamas and Israel, seemingly huge impediments could be overcome or set aside."
  },
  {
    "title": "Julia Roberts and Luca Guadagnino on ‘After the Hunt’ and Ambiguity",
    "link": "https://www.nytimes.com/2025/10/15/movies/julia-roberts-luca-guadagnino-after-the-hunt.html",
    "summary": "The film touches on #MeToo and cancel culture, but the star and director wanted audiences to make up their own minds."
  },
  {
    "title": "London Became a Global Hub for Phone Theft. Now We Know Why.",
    "link": "https://www.nytimes.com/2025/10/15/world/europe/london-police-phone-theft-china-gang.html",
    "summary": "About 80,000 phones were stolen in the British capital last year. The police are finally discovering where many of them went."
  },
  {
    "title": "Belarus Is as Repressive as Ever. Why Is the U.S. Warming Up to It?",
    "link": "https://www.nytimes.com/2025/10/15/world/europe/belarus-us-trump-russia.html",
    "summary": "Analysts say they are unsure what the Trump administration hopes to get out of its gifts and concessions to Belarus’s autocratic leader, a close ally of Russia."
  },
  {
    "title": "What Are Tomahawk Missiles, and Why Might Trump Give Them to Ukraine?",
    "link": "https://www.nytimes.com/2025/10/15/us/politics/tomahawk-missiles-trump-ukraine.html",
    "summary": "Largely used by naval forces for more than 40 years, Ukraine could receive a newly developed land-based launcher to strike Moscow and beyond."
  },
  {
    "title": "Syria’s New Leaders Are Talking to Russia, a Former Enemy",
    "link": "https://www.nytimes.com/2025/10/15/world/middleeast/syria-russia-ahmed-al-shara-putin.html",
    "summary": "President Ahmed al-Shara is making his first trip to Moscow, which backed the regime his rebels overthrew. Both sides have reasons to put the past aside."
  },
  {
    "title": "A Curfew In Greenville, Miss., Is Working to Curb Violent Crime",
    "link": "https://www.nytimes.com/2025/10/15/us/greenville-mississippi-crime-curfew.html",
    "summary": "In Greenville this year, leaders imposed a strict curfew to curb gun violence. So far, the approach is working, even as some question how far a city should go to fight crime."
  },
  {
    "title": "How D’Angelo Made His Masterpiece, ‘Voodoo’",
    "link": "https://www.nytimes.com/2025/10/15/arts/music/dangelo-voodoo.html",
    "summary": "The singer, songwriter and producer’s 2000 album was the result of years in the studio listening to inspiring music, jamming and rediscovering his artistic purpose."
  },
  {
    "title": "D’Angelo’s ‘Untitled’ Video Supercharged and Derailed His Career",
    "link": "https://www.nytimes.com/2025/10/14/arts/music/dangelo-untitled-video.html",
    "summary": "The video for “Untitled (How Does It Feel)” brought him new levels of fame, but not always the kind of attention he sought."
  },
  {
    "title": "Trump’s Tariff Fight With China Means Trouble for a Vast Wilderness in Brazil",
    "link": "https://www.nytimes.com/2025/10/15/climate/china-brazil-soybeans-trade-midwest-amazon.html",
    "summary": "Brazilian farmers are lobbying to roll back deforestation restrictions in order to sell more soybeans to the huge Chinese market."
  },
  {
    "title": "Cuomo Tries to Make Prostitution an Issue in NYC Mayor’s Race",
    "link": "https://www.nytimes.com/2025/10/15/nyregion/mamdani-cuomo-prostitution-nyc.html",
    "summary": "Former Gov. Andrew M. Cuomo has criticized Assemblyman Zohran Mamdani over his past support for decriminalizing prostitution. Mr. Mamdani’s campaign has not emphasized the issue."
  },
  {
    "title": "‘Promises Have Not Been Kept’: What’s Behind Africa’s Youth Protests",
    "link": "https://www.nytimes.com/2025/10/15/world/africa/africa-gen-z-protests-kenya.html",
    "summary": "Protesters say their anger reflects a lack of economic opportunity on a continent with the world’s youngest population."
  },
  {
    "title": "Philly’s LOVE Skate Park Was Rebuilt in Malmö. I Had to See It for Myself.",
    "link": "https://www.nytimes.com/2025/10/15/magazine/skateboarding-philadelphia-love-park-malmo-sweden.html",
    "summary": "One of America’s most iconic ’90s skate spots has now been rebuilt in — of all places — Malmo, Sweden."
  },
  {
    "title": "What Trump’s Peace Deal Really Means for Gaza",
    "link": "https://www.nytimes.com/2025/10/15/opinion/israel-gaza-peace-deal-trump.html",
    "summary": "The war might have ended, one lawyer argues, but the occupation remains."
  },
  {
    "title": "Stephen Colbert Ridicules Trump’s Time Magazine Cover",
    "link": "https://www.nytimes.com/2025/10/15/arts/television/stephen-colbert-trump-time-magazine.html",
    "summary": "“The Late Show” host called President Trump’s photo the “worst Georgia O’Keeffe ever.”"
  },
  {
    "title": "Katie Porter Says She ‘Fell Short’ in Viral Video Moments",
    "link": "https://www.nytimes.com/2025/10/15/us/katie-porter-videos-response.html",
    "summary": "Videos surfaced last week showing the former congresswoman belittling a television reporter and berating an aide. Porter, who is running for California governor, pledged to do better."
  },
  {
    "title": "Raila Odinga, Former Kenyan Prime Minister and Champion of Democracy, Dies at 80",
    "link": "https://www.nytimes.com/2025/10/15/world/africa/raila-odinga-kenya-dead.html",
    "summary": "A pivotal political leader who helped usher in multiparty democracy in the East African country, he ran unsuccessfully for the presidency five times."
  },
  {
    "title": "South Korea Targets Cambodia’s Scam Industry After Kidnaps, Torture and a Death",
    "link": "https://www.nytimes.com/2025/10/15/world/asia/cambodia-south-korea-scams.html",
    "summary": "South Korea’s efforts are part of a widening international crackdown on criminal groups running online fraud schemes from Southeast Asia."
  },
  {
    "title": "The Chicago Rat Hole Was Not Made by a Rat",
    "link": "https://www.nytimes.com/2025/10/14/science/chicago-rat-hole-squirrel.html",
    "summary": "A statistical analysis of an infamous indentation in a sidewalk suggested a 99 percent likelihood that another rodent made the mark."
  }
]