[
  {
    "title": "Putin Escalates His War Against Ukraine, Undeterred by Trump’s Words",
    "link": "https://www.nytimes.com/2025/07/09/world/europe/russia-ukraine-putin-trump.html",
    "summary": "The Russian leader is convinced that Moscow’s battlefield superiority is growing, and that Ukraine’s defenses may collapse in the coming months, according to people close to the Kremlin."
  },
  {
    "title": "Russia Makes Record Attack on Ukraine as Trump Castigates Putin",
    "link": "https://www.nytimes.com/2025/07/09/world/europe/russia-ukraine-attack-weapons-trump-putin.html",
    "summary": "The number of Russian drones and missiles in the barrage set a single-night record and underscored Ukraine’s need for weapons."
  },
  {
    "title": "European Court Holds Russia Liable for Human Rights Violations in Ukraine and MH17 Attack",
    "link": "https://www.nytimes.com/2025/07/09/world/europe/european-court-human-rights-russia-mh17-ukraine.html",
    "summary": "In symbolic rulings, Moscow was again blamed for the downing of Flight MH17 in 2014 and for an array of war-related human rights violations, including the transfer of Ukrainian children to Russia."
  },
  {
    "title": "Trump Takes Reins on U.S. Economy With Policy Bill and Tariffs Renewal",
    "link": "https://www.nytimes.com/2025/07/09/us/politics/trump-bill-tariffs-economy.html",
    "summary": "President Trump has achieved much of his agenda, leaving the fate of the economy squarely in his hands."
  },
  {
    "title": "Canada Thinks Its Trade Talks With Trump Are Unique. Does That Matter?",
    "link": "https://www.nytimes.com/2025/07/09/world/canada/tariffs-trump-trade-us.html",
    "summary": "Tariff negotiations between the two top trading partners are on a different track from those the U.S. is pursuing with other nations. But Canada may not get a better outcome."
  },
  {
    "title": "Trump Treats Tariffs More as a Form of Power Than as a Trade Tool",
    "link": "https://www.nytimes.com/2025/07/09/us/politics/trump-tariffs-trade-policy.html",
    "summary": "Instead of viewing tariffs as part of a broader trade policy, President Trump sees them as a valuable weapon he can wield on the world stage."
  },
  {
    "title": "A Dark-of-Night Flood Escape at the River Inn in Texas",
    "link": "https://www.nytimes.com/2025/07/09/us/texas-floods-river-inn.html",
    "summary": "Along the Guadalupe River, a 60-room inn and nearby homes were quickly filling with water. Confusion, desperation and heroism ensued."
  },
  {
    "title": "Did the Texas Flood Warnings Come in Time?",
    "link": "https://www.nytimes.com/video/us/100000010273289/tracking-texas-flood-warning-system.html",
    "summary": "When deadly floods swept through Texas, the National Weather Service issued a series of warnings that should have automatically triggered alerts to be sent to cellphones as the Guadalupe River began to rise. Judson Jones, a meteorologist and reporter for The New York Times, explains how catastrophe ensued despite those warnings."
  },
  {
    "title": "Death Toll Reaches at Least 119 in Texas Floods, With 173 Missing",
    "link": "https://www.nytimes.com/2025/07/09/us/texas-floods-missing-search.html",
    "summary": "Officials defended their actions in the hardest-hit county, where no survivors have been found since Friday and questions are mounting over disaster preparation and flood warnings."
  },
  {
    "title": "Gary Shteyngart Believes in Living the Good Life",
    "link": "https://www.nytimes.com/2025/07/08/style/gary-shteyngart-book-vera-or-faith.html",
    "summary": "Mr. Shteyngart was once told he might be. With his sixth novel, “Vera, or Faith,” out now, he’s spent the last few years spending it well."
  },
  {
    "title": "Book Review: ‘Vera, or Faith,’ by Gary Shteyngart",
    "link": "https://www.nytimes.com/2025/07/07/books/review/gary-shteyngart-vera-or-faith.html",
    "summary": "“Vera, or Faith” follows a 10-year-old girl navigating family drama and a dystopian America."
  },
  {
    "title": "How Crypto Lobbying Won Over Trump",
    "link": "https://www.nytimes.com/2025/07/09/us/politics/trump-crypto-lobbying.html",
    "summary": "The industry’s courtship of Donald J. Trump resulted in one of the great lobbying free-for-alls in recent Washington history."
  },
  {
    "title": "As Truth Social Business Struggles, Trump Media Goes Big on Crypto",
    "link": "https://www.nytimes.com/2025/07/09/business/truth-social-trump-media-crypto.html",
    "summary": "The pivot to crypto highlights the reality of Truth Social, one of President Trump’s highest-profile business interests: It doesn’t generate much revenue."
  },
  {
    "title": "How a Single Overdose Unraveled an Empire of Heroin",
    "link": "https://www.nytimes.com/2025/07/09/nyregion/heroin-flow-rutland-vermont-bronx.html",
    "summary": "A man’s death after using “Flow” in a small Vermont city exposed a drug operation that spanned continents and sent a New York prosecutor on a heartbreaking journey."
  },
  {
    "title": "X CEO Linda Yaccarino Says She Is Leaving Elon Musk’s Platform",
    "link": "https://www.nytimes.com/2025/07/09/technology/linda-yaccarino-x-steps-down.html",
    "summary": "Linda Yaccarino, whom Elon Musk hired to run X in 2023, grappled with the challenges the company faced after Mr. Musk took over."
  },
  {
    "title": "Elon Musk Consulted Curtis Yarvin, Right-Wing Thinker, on Third Party",
    "link": "https://www.nytimes.com/2025/07/09/us/politics/elon-musk-curtis-yarvin-third-party.html",
    "summary": "The two men spoke about Mr. Musk’s push to create the America Party before the midterm elections. Mr. Yarvin has expressed support for a monarchy, along with provocative ideas about race."
  },
  {
    "title": "What Happened to Tesla’s Annual Shareholders Meeting?",
    "link": "https://www.nytimes.com/2025/07/09/business/tesla-shareholder-meeting-2025.html",
    "summary": "A group of state treasurers and investors is complaining that the company, facing falling sales, is about to miss a legal deadline to hold a shareholder forum."
  },
  {
    "title": "Israel Launches New Ground Incursion in Lebanon, Raising Fears for Truce",
    "link": "https://www.nytimes.com/2025/07/09/world/middleeast/israel-lebanon.html",
    "summary": "Israel has been conducting near-daily strikes against what it says are Hezbollah targets as the Iranian-backed group comes under pressure to disarm amid fears of a renewed war."
  },
  {
    "title": "After Decades as Enemies, Syria and Israel Now Share a Common Foe",
    "link": "https://www.nytimes.com/2025/07/09/world/middleeast/syria-israel-talks.html",
    "summary": "The longtime enemies have opened contacts, reflecting a power shift across a Middle East in which they have newfound common ground: antipathy for Iran."
  },
  {
    "title": "How the Women of ‘Too Much’ Made Lena Dunham’s Rom-Com Just Right",
    "link": "https://www.nytimes.com/2025/07/09/arts/television/too-much-lena-dunham-emily-ratajkowski-megan-stalter.html",
    "summary": "Lena Dunham wanted to open up the world of romantic comedies with her new Netflix series. In interviews, she and the stars Megan Stalter, Janicza Bravo and Emily Ratajkowski discuss how they did it."
  },
  {
    "title": "“Too Much” and the Reality of Looking for Love in London",
    "link": "https://www.nytimes.com/2025/07/09/style/americans-england-romance-tv-movies.html",
    "summary": "Like the lead character of “Too Much,” they moved across the Atlantic with visions of Jane Austen and Merchant Ivory. The reality was a little less dreamy."
  },
  {
    "title": "If Zohran Mamdani Wins, Then What?",
    "link": "https://www.nytimes.com/2025/07/09/opinion/zohran-mamdani-mayor-power.html",
    "summary": "He would become the leftist others look to, either as a savior or as a villain."
  },
  {
    "title": "As the Texas Floodwaters Rose, One Indispensable Voice Was Silent",
    "link": "https://www.nytimes.com/2025/07/09/opinion/texas-floods-nws.html",
    "summary": "The National Weather Service put out good forecasts. But a vital employee was missing."
  },
  {
    "title": "A Classroom Experiment",
    "link": "https://www.nytimes.com/2025/07/09/briefing/artificial-intelligence-education-students.html",
    "summary": "We explain how schools are using artificial intelligence."
  },
  {
    "title": "New Research Questions Severity of Withdrawal From Antidepressants",
    "link": "https://www.nytimes.com/2025/07/09/health/antidepressants-withdrawal-symptoms.html",
    "summary": "Warnings about withdrawal from antidepressants have rippled through society in recent years. A new study claims they are overblown."
  },
  {
    "title": "Umbrellas Optional? East Asia’s Monsoon Rains Are No Longer a Sure Thing",
    "link": "https://www.nytimes.com/2025/07/09/world/asia/monsoon-season-south-korea-japan.html",
    "summary": "Parts of South Korea and Japan have had short rainy seasons this year. Scientists say that climate change has helped make the summer rains more unreliable."
  },
  {
    "title": "Jailed Kurdish Leader Declares the End to PKK’s Armed Struggle In Turkey",
    "link": "https://www.nytimes.com/2025/07/09/world/middleeast/turkey-pkk-kurdish-leader-ocalan-armed-struggle.html",
    "summary": "In the first footage of him to be released publicly in 25 years, Abdullah Ocalan said the P.K.K. insurgency against Turkey would be replaced by politics."
  }
]