[
  {
    "title": "Trump Said He Wouldn’t Touch the East Wing. Then He Tore It All Down.",
    "link": "https://www.nytimes.com/2025/10/22/us/politics/east-wing-white-house-demolition-trump.html",
    "summary": "President Trump initially said the ballroom construction would not affect the East Wing. The White House now says it was cheaper and more structurally sound to simply demolish it."
  },
  {
    "title": "The White House Wrecking Ball",
    "link": "https://www.nytimes.com/2025/10/22/us/politics/trump-white-house-demolition.html",
    "summary": "President Trump’s demolition of the East Wing has struck a nerve in Washington and beyond."
  },
  {
    "title": "Mamdani Plans to Keep Tisch as Police Commissioner if Elected NYC Mayor",
    "link": "https://www.nytimes.com/2025/10/22/nyregion/jessica-tisch-nypd-mamdani.html",
    "summary": "Zohran Mamdani’s intention to retain Jessica Tisch is likely to placate powerful New Yorkers who have lobbied Mr. Mamdani to keep her."
  },
  {
    "title": "University of Virginia Makes Deal With White House to Halt Investigations",
    "link": "https://www.nytimes.com/2025/10/22/us/politics/university-of-virginia-trump-agreement.html",
    "summary": "The Justice Department had been scrutinizing one of the nation’s premier public universities over accusations of civil rights violations."
  },
  {
    "title": "Pentagon Announces ‘Next Generation’ Press Corps",
    "link": "https://www.nytimes.com/2025/10/22/business/media/pentagon-press-reporters.html",
    "summary": "The Defense Department said that dozens of new reporters had agreed to sign the Pentagon’s rules on reporting, which have been rejected by many major news organizations."
  },
  {
    "title": "As Shutdown Drags and Trump Flexes, Congress Cedes Its Relevance",
    "link": "https://www.nytimes.com/2025/10/22/us/politics/trump-shutdown-congress-power.html",
    "summary": "“It’s like we have given up,” one Republican lawmaker said."
  },
  {
    "title": "As Johnson Delays, Grijalva Sues to Be Sworn In to Congress",
    "link": "https://www.nytimes.com/2025/10/22/us/politics/adelita-grijalva-lawsuit-swearing-in-congress.html",
    "summary": "Representative-elect Adelita Grijalva, Democrat of Arizona, along with the state’s attorney general, argued that the speaker had no authority to delay swearing her into office."
  },
  {
    "title": "Testosterone Is Giving Women Back Their Sex Drive but Risks Side Effects",
    "link": "https://www.nytimes.com/2025/10/22/magazine/testosterone-women-health-sex-libido-menopause.html",
    "summary": "There is no F.D.A.-approved testosterone product for women. Insurance won’t cover it. Many doctors won’t prescribe it. It’s become a cultural phenomenon."
  },
  {
    "title": "U.S. Strikes Boat in Pacific, Expanding Operation Against Drug Running Suspects",
    "link": "https://www.nytimes.com/2025/10/22/us/politics/trump-drug-boat-strike-colombia.html",
    "summary": "It was the eighth known strike, and the first outside the Caribbean, in the Trump administration’s campaign against what it says are boats carrying drugs bound for the United States."
  },
  {
    "title": "Drug-Smuggling Submarines on Display at Latin American Naval Base",
    "link": "https://www.nytimes.com/2025/10/22/world/americas/drug-smuggling-submarines.html",
    "summary": "A display of confiscated vessels at a naval base in Ecuador offers a peek at why drug smuggling is so hard to stop."
  },
  {
    "title": "Trump Said Black Chicagoans Wanted His ‘Blitz.’ Many Disagree.",
    "link": "https://www.nytimes.com/2025/10/22/us/politics/trump-black-chicago.html",
    "summary": "Six weeks into the federal crackdown in Chicago, the attack on crime that the president promised hasn’t happened, and many in the city’s Black population haven’t been won over."
  },
  {
    "title": "Federal Agents Head to San Francisco Bay Area for Planned Immigration Crackdown",
    "link": "https://www.nytimes.com/2025/10/22/us/border-patrol-san-francisco-bay-area.html",
    "summary": "U.S. Customs and Border Protection agents are being sent to a U.S. Coast Guard base in Alameda, Calif., ahead of an immigration operation in the San Francisco region."
  },
  {
    "title": "The U.S. Struggles to Break Out From China’s Grip on Rare Earths",
    "link": "https://www.nytimes.com/2025/10/22/us/politics/china-trump-rare-earths.html",
    "summary": "The Trump administration is trying an array of unconventional measures to shore up U.S. rare earths supplies. It remains uncertain whether the strategy will work."
  },
  {
    "title": "Three Offers in One Month: Paramount’s Secret Pursuit of Warner Bros. Discovery",
    "link": "https://www.nytimes.com/2025/10/22/business/dealbook/paramounts-secret-bids-warner-bros-discovery.html",
    "summary": "A letter from Paramount’s chief executive, David Ellison, to Warner Bros.’ board of directors reveals weeks of talks between the companies."
  },
  {
    "title": "At a Mass Burial in Gaza, Palestinians Mourn the Unknown Dead",
    "link": "https://www.nytimes.com/2025/10/22/world/middleeast/mass-burial-gaza.html",
    "summary": "Under the terms of a cease-fire deal, Israel and Hamas have been exchanging remains, but Gaza’s medical authorities have not been able to identify many of them."
  },
  {
    "title": "I.C.J. Tells Israel to Facilitate Aid to Gaza",
    "link": "https://www.nytimes.com/2025/10/22/world/middleeast/icj-israel-gaza-aid.html",
    "summary": "The International Court of Justice said Israel must work with U.N. agencies, including UNRWA, the group for Palestinian refugees, which Israel has banned."
  },
  {
    "title": "Why King Charles Has Not Yet Removed Andrew’s Most Valued Title: Prince",
    "link": "https://www.nytimes.com/2025/10/22/world/europe/king-charles-prince-andrew-title-epstein.html",
    "summary": "New disclosures about Prince Andrew’s ties to the notorious sex offender Jeffrey Epstein have led to calls for further action from the king and Parliament."
  },
  {
    "title": "Misty Copeland Will Take Her Final Bow",
    "link": "https://www.nytimes.com/2025/10/22/arts/dance/misty-copeland-ballet-life-career-photos.html",
    "summary": "The famed ballerina retires from her career with the American Ballet Theater after one final performance on Wednesday night."
  },
  {
    "title": "On the Menu in New York: One Repair, Coming Right Up",
    "link": "https://www.nytimes.com/2025/10/21/climate/on-the-menu-in-new-york-one-repair-coming-right-up.html",
    "summary": "The state leads the country in “repair cafes,” which bring neighbors together while keeping all manner of items out of the trash."
  },
  {
    "title": "Samantha Eggar, Oscar-Nominated Star of ‘The Collector,’ Dies at 86",
    "link": "https://www.nytimes.com/2025/10/22/movies/samantha-eggar-dead.html",
    "summary": "She also had leading roles in “Doctor Dolittle” with Rex Harrison, “Walk, Don’t Run” with Cary Grant and “The Molly Maguires” with Sean Connery."
  },
  {
    "title": "Trump Wants the American People to Pay Him $230 Million",
    "link": "https://www.nytimes.com/2025/10/22/opinion/trump-230-million-justice-department.html",
    "summary": "Trump should pay a political price for his brazen corruption. Instead, he is telling American taxpayers to pay a price, directly to him."
  },
  {
    "title": "Trump Revives Foreign Aid, Helping Needy Billionaires",
    "link": "https://www.nytimes.com/2025/10/22/opinion/trump-aid-argentina.html",
    "summary": "As children die for want of cheap medicines, the U.S. spends billions on Argentina — thus rescuing rich investors who made bad bets."
  },
  {
    "title": "Trump Is Demolishing the Entire East Wing",
    "link": "https://www.nytimes.com/2025/10/22/briefing/trump-is-demolishing-the-entire-east-wing.html",
    "summary": "Also, oil prices have fallen sharply. Here’s the latest at the end of Wednesday."
  },
  {
    "title": "Why Weren’t the Jewels Stolen From the Louvre Insured?",
    "link": "https://www.nytimes.com/2025/10/22/business/louvre-robbery-jewelry-heist-insurance.html",
    "summary": "Thieves snatched jewelry valued at more than $100 million, but the museum will not be compensated for the loss."
  },
  {
    "title": "Soo Catwoman, ‘the Female Face of Punk,’ Is Dead at 70",
    "link": "https://www.nytimes.com/2025/10/22/fashion/soo-catwoman-dead.html",
    "summary": "With a tuft of hair on either side of her shaved head and long tendrils of eyeliner swiped across her lids, she helped define a scene."
  },
  {
    "title": "Cardiovascular Benefits of Wegovy Extend Beyond Weight Loss, Study Shows",
    "link": "https://www.nytimes.com/2025/10/22/well/wegovy-cardiovascular-benefits-weight-loss-study.html",
    "summary": "An analysis found that a shrinking waist size was responsible for only around a third of the cardiovascular benefits in people who took Wegovy."
  },
  {
    "title": "Iceland Says It Is No Longer Mosquito-Free",
    "link": "https://www.nytimes.com/2025/10/22/world/europe/iceland-mosquito-discovery.html",
    "summary": "Iceland was one of the only mosquito-free places in the world, at least according to its records. Not anymore."
  }
]