[
  {
    "title": "‘They Couldn’t Break Me’: A Protester, the White House and a Doctored Photo",
    "link": "https://www.nytimes.com/2026/02/03/us/politics/nekima-levy-armstrong-minnesota-protest.html",
    "summary": "President Trump and the White House regularly circulate imagery that has been manipulated by A.I. But the photo of Nekima Levy Armstrong was different."
  },
  {
    "title": "Polls Show Strong G.O.P. Support for Trump on Immigration",
    "link": "https://www.nytimes.com/2026/02/03/us/politics/trump-ice-immigration-polls-republicans.html",
    "summary": "A small, but growing, share of Republicans say that enforcement has gone too far, after the killing of two Minneapolis protesters."
  },
  {
    "title": "‘Don Colossus,’ a Golden Statue of President Trump, Waits for Its Home",
    "link": "https://www.nytimes.com/2026/02/03/technology/trump-statue-don-colossus.html",
    "summary": "A group of cryptocurrency investors backing a memecoin hopes the statue will soon be installed at one of Mr. Trump’s golf courses in Florida."
  },
  {
    "title": "Colombian President Gustavo Petro Meets with Trump at the White House",
    "link": "https://www.nytimes.com/2026/02/03/us/politics/colombia-petro-trump-meeting.html",
    "summary": "President Trump was meeting privately with President Gustavo Petro of Colombia on Tuesday. They have clashed in the past, but there are signs that tensions are easing."
  },
  {
    "title": "Trump’s Kennedy Center Shutdown Plan Jolts Workers and Performers",
    "link": "https://www.nytimes.com/2026/02/03/arts/music/trumps-kennedy-center.html",
    "summary": "The administration’s announcement to shut the center for a major overhaul led to a swirl of confusion and anxiety among performers and patrons about its future."
  },
  {
    "title": "Ruptures in China’s Leadership Could Be Due to Paranoia and Power Plays",
    "link": "https://www.nytimes.com/2026/02/03/us/politics/china-xi-military-purge.html",
    "summary": "U.S. intelligence analysts say that Xi Jinping, China’s leader, has a remarkable level of fear. He has carried out mass purges, and surprised many by removing his top general."
  },
  {
    "title": "House Cancels Contempt Vote As Clintons Agree to Testify on Epstein",
    "link": "https://www.nytimes.com/2026/02/03/us/politics/clintons-epstein-testify.html",
    "summary": "Bill and Hillary Clinton agreed to be deposed this month by an investigative panel but requested that it be in public, a request that the Republican chairman ignored."
  },
  {
    "title": "Jeffrey Epstein’s Trust Reveals Beneficiaries of His Fortune",
    "link": "https://www.nytimes.com/2026/02/03/business/jeffrey-epstein-trust-inherit-karyna-shuliak.html",
    "summary": "Jeffrey Epstein wanted most of his money to go to his girlfriend. Mr. Epstein’s brother and a Harvard math professor were also named beneficiaries."
  },
  {
    "title": "Epstein Files Reveal Name of Woman Who Accused Alexander Brothers",
    "link": "https://www.nytimes.com/2026/02/03/nyregion/alexanders-brothers-trial-epstein.html",
    "summary": "Defense lawyers unsuccessfully asked for a mistrial after the brothers appeared in the latest batch of Epstein emails. The Alexanders have not been linked to Jeffrey Epstein’s crimes."
  },
  {
    "title": "A Role Model for How to Die",
    "link": "https://www.nytimes.com/2026/02/03/nyregion/cancer-friend-death-role-model.html",
    "summary": "What if you really did live every day as if it were your last? That was Brian’s plan."
  },
  {
    "title": "Colleges See Major Racial Shifts in Student Enrollment",
    "link": "https://www.nytimes.com/2026/02/03/us/colleges-see-major-racial-shifts-in-student-enrollment.html",
    "summary": "An analysis finds that flagship state universities, as well as less selective colleges, had major increases in Black and Hispanic students following a ban on race-conscious admissions."
  },
  {
    "title": "Nick Shirley, the Influencer Who Spurred the Federal Crackdown in Minneapolis",
    "link": "https://www.nytimes.com/2026/02/03/us/nick-shirley-san-diego.html",
    "summary": "Nick Shirley had struggled to expand his reach. With a new approach after a missionary trip, he caused a sensation with a video about possible fraud."
  },
  {
    "title": "Search Continues for Savannah Guthrie’s Mother, Nancy Guthrie",
    "link": "https://www.nytimes.com/2026/02/03/us/savannah-guthrie-mom-nancy-guthrie-search-updates.html",
    "summary": "Ms. Guthrie, 84, was last seen on Saturday at her home in Tucson, Ariz. A sheriff said that investigators were treating her disappearance as a crime."
  },
  {
    "title": "What to Know About the Disappearance of Savannah Guthrie’s Mom, Nancy",
    "link": "https://www.nytimes.com/2026/02/03/us/savannah-guthrie-mom-missing.html",
    "summary": "Nancy Guthrie, 84, the “Today” show host’s mother, was last seen on Saturday night, the authorities said. The disappearance is being investigated as a crime."
  },
  {
    "title": "This is How Hard It Will Be to Get Around Italy’s Winter Olympics",
    "link": "https://www.nytimes.com/2026/02/03/world/europe/italy-winter-olympics-logistical-nightmare.html",
    "summary": "The Games in northern Italy, which start on Friday, will be spread across 8,500 square miles. Long distances, narrow roads, complex connections and snowfall will make it a logistical nightmare."
  },
  {
    "title": "Disney Names Josh D’Amaro as Next C.E.O.",
    "link": "https://www.nytimes.com/2026/02/03/business/disney-damaro-ceo.html",
    "summary": "Mr. D’Amaro, 54, has most recently served as chairman of Disney Experiences, a division that includes theme parks, cruise vacations and consumer products."
  },
  {
    "title": "Instead of Battling Trump, San Francisco’s Mayor Is Sweating the Small Stuff",
    "link": "https://www.nytimes.com/2026/02/03/us/san-francisco-mayor-daniel-lurie.html",
    "summary": "Daniel Lurie has focused more on mundane matters than addressing national tensions, and his approval ratings have been strong. It remains to be seen how long he can avoid the political fray."
  },
  {
    "title": "More Parents Are Rejecting a Lifesaving Vitamin Shot for Newborns",
    "link": "https://www.nytimes.com/2026/02/03/well/vitamin-k-shots-parents.html",
    "summary": "For decades, hospitals have given babies a vitamin K injection to protect against bleeding. Now, the shot appears to be facing resistance."
  },
  {
    "title": "How to Watch the 2026 Westminster Dog Show",
    "link": "https://www.nytimes.com/2026/02/03/style/westminster-dog-show-how-to-watch.html",
    "summary": "Everything you (and your dog) need to know about the competition, now in its 150th outing."
  },
  {
    "title": "Westminster Dog Show 2026: Behind-the-Scenes Photos",
    "link": "https://www.nytimes.com/2026/02/03/style/westminster-dog-show-photos.html",
    "summary": "Brushing, panting, licking and leaping: Here’s what we saw at the Javits Convention Center, where show dogs could let their fur down before taking to the ring."
  },
  {
    "title": "A Hamas Hostage’s Secret Ordeal",
    "link": "https://www.nytimes.com/2026/02/03/world/middleeast/hamas-hostage-abuse.html",
    "summary": "Guy Gilboa-Dalal says he was sexually abused by one of his captors in the tunnels of Gaza and threatened with death if he said anything."
  },
  {
    "title": "Palestinians Return to Gaza for First Time in Nearly Two Years",
    "link": "https://www.nytimes.com/2026/02/03/world/middleeast/palestinians-gaza-return.html",
    "summary": "Only 12 returnees were allowed to cross the newly reopened border with Egypt on the first day, far fewer than the expected number."
  },
  {
    "title": "William Stevenson, Jill Biden’s Ex-Husband, Is Accused of Killing His Current Wife",
    "link": "https://www.nytimes.com/2026/02/03/us/william-stevenson-jill-biden-homicide.html",
    "summary": "William Stevenson was arrested after being indicted on charges of first-degree murder in the death of his wife in December. He was married to Dr. Biden in the 1970s."
  },
  {
    "title": "Let’s Start Project 2028",
    "link": "https://www.nytimes.com/2026/02/03/opinion/project-2028-democratic-party-platform.html",
    "summary": "An outline of items in a hypothetical Democratic Party platform."
  },
  {
    "title": "‘Melania’ the Book Was Bad. ‘Melania’ the Movie Is Somehow Worse.",
    "link": "https://www.nytimes.com/2026/02/03/opinion/melania-trump-movie-memoir.html",
    "summary": "The surface is all there is."
  },
  {
    "title": "A Lifeline for Gaza",
    "link": "https://www.nytimes.com/2026/02/03/briefing/a-lifeline-for-gaza.html",
    "summary": "We look at the significance of the Rafah border crossing."
  },
  {
    "title": "Police Search X’s Premises in France as Prosecutors Summon Elon Musk",
    "link": "https://www.nytimes.com/2026/02/03/world/europe/musk-x-france-police-search.html",
    "summary": "The move followed a yearlong investigation into X and escalated a wider standoff between European officials and American tech companies over the regulation of social media."
  },
  {
    "title": "Shopping Sprees and a Penthouse: Public Defender Pleads Guilty to Fraud",
    "link": "https://www.nytimes.com/2026/02/03/nyregion/queens-defenders-corruption-lori-zeno.html",
    "summary": "Lori Zeno, the former head of the Queens Defenders, faces around five years in prison for stealing public money to pay for international vacations and teeth whitening."
  },
  {
    "title": "Research Finds Interaction With Father, Not Mother, Affects Child Health",
    "link": "https://www.nytimes.com/2026/02/03/health/fathers-child-health.html",
    "summary": "A long-term study of 292 families linked fathers’ parenting style to their children’s heart health years later. To researchers’ surprise, no such link was found with mothers."
  },
  {
    "title": "Jewish Heirs Say Met Museum Pissarro Was Sold Under Nazi-Era Duress",
    "link": "https://www.nytimes.com/2026/02/03/arts/design/jewish-heirs-met-museum-pissarro-nazis.html",
    "summary": "The museum says a Jewish collector received a fair price for the work in 1941. The heirs say sales from that time are considered to have been forced and void under French law."
  }
]