[
  {
    "title": "At Home and on the Seas, Trump Expands Use of American Force",
    "link": "https://www.nytimes.com/2025/09/17/us/politics/trump-shift-national-security-focus.html",
    "summary": "His first term focused on America’s rival superpowers. Now the emphasis is on homeland defense and troops on city streets."
  },
  {
    "title": "Trump’s Medicaid Cuts Could Hamper Efforts to House the Homeless",
    "link": "https://www.nytimes.com/2025/09/17/us/politics/trumps-medicaid-cuts-homeless.html",
    "summary": "President Trump’s signature domestic policy law could make it harder for states to fund programs to help people find stable housing."
  },
  {
    "title": "Investors Are Bullish as a Pivotal Fed Decision Looms",
    "link": "https://www.nytimes.com/2025/09/17/business/investors-are-bullish-as-a-pivotal-fed-decision-looms.html",
    "summary": "The S&amp;P 500 is in record territory, and investors are pricing in a quarter-point cut to interest rates on Wednesday."
  },
  {
    "title": "Most U.K. Political Leaders Are Cautiously Welcoming Trump. Not This One.",
    "link": "https://www.nytimes.com/2025/09/17/world/europe/ed-davey-trump-uk-state-dinner-boycott.html",
    "summary": "Ed Davey, of the Liberal Democrats, says that President Trump does not represent British values, and is boycotting a state dinner with the U.S. leader over Gaza."
  },
  {
    "title": "Gilded Carriages and Bearskin Hats: U.K. Royals Welcome Trump",
    "link": "https://www.nytimes.com/2025/09/17/world/europe/trump-uk-state-visit-photos.html",
    "summary": "Photographs of the pomp and spectacle of the U.S. president’s second state visit to Britain."
  },
  {
    "title": "Netanyahu and an Israel Without Restraint",
    "link": "https://www.nytimes.com/2025/09/17/world/middleeast/netanyahu-israel-gaza.html",
    "summary": "With the assault on Gaza City, Israel’s prime minister has piled defiance on defiance, as any check from the Trump administration falls away."
  },
  {
    "title": "Israel Pounds Gaza City as Fears Mount for Those Inside",
    "link": "https://www.nytimes.com/2025/09/17/world/middleeast/israel-gaza-city.html",
    "summary": "With hundreds of thousands of Palestinians still in the city, the Israeli military said it was opening another temporary evacuation route. The U.N. warned that food supplies in northern Gaza would soon run out."
  },
  {
    "title": "Israel’s Assault on Gaza City Stifles Hope of Diplomatic Resolution to War",
    "link": "https://www.nytimes.com/2025/09/17/world/middleeast/israel-assault-gaza-city-diplomacy.html",
    "summary": "A negotiated settlement to end the fighting remains distant, in part because of the maximalist positions of Israel’s leader, Benjamin Netanyahu, and of Hamas."
  },
  {
    "title": "What to Know About ‘Hate Speech’ and the First Amendment",
    "link": "https://www.nytimes.com/2025/09/17/us/politics/what-to-know-hate-speech.html",
    "summary": "There has been a lot of talk from Trump administration officials about punishing speech. Here is what the law says."
  },
  {
    "title": "A Note, a Gun and a Mother’s Conscience Led to an Arrest in Kirk’s Killing",
    "link": "https://www.nytimes.com/2025/09/17/us/politics/charlie-kirk-killer.html",
    "summary": "The man accused of shooting Charlie Kirk left a trail of evidence and had no way to outrun his parents’ recognition, court documents showed."
  },
  {
    "title": "He Raised Three Marines. His Wife Is American. The U.S. Wants to Deport Him.",
    "link": "https://www.nytimes.com/2025/09/17/us/narciso-barranco-ice-deport-marines-trump.html",
    "summary": "After three decades in California, Narciso Barranco was arrested by agents while weeding outside an IHOP, stirring outrage and a fight to stop his deportation."
  },
  {
    "title": "The ‘Most Colorful Home in Queens’ Has a Dark Secret",
    "link": "https://www.nytimes.com/2025/09/16/realestate/queens-real-estate-fraud.html",
    "summary": "Inside the real estate scam that tore through a tight-knit immigrant community in New York."
  },
  {
    "title": "He’s Left MoMA Smarter, Richer and at a Crossroads",
    "link": "https://www.nytimes.com/2025/09/17/arts/design/glenn-lowry-moma-director-steps-down.html",
    "summary": "Glenn D. Lowry led the Museum of Modern Art for longer than anyone. But the institution he reconstructed (twice) is facing all-new trials."
  },
  {
    "title": "How Christophe Cherix Welcomed a Cuban Master Back to MoMA",
    "link": "https://www.nytimes.com/2025/09/17/arts/design/christophe-cherix-moma-director-cuba-wifredo-lam.html",
    "summary": "Cuba balked at lending the museum work by Wifredo Lam, but the new director threw his firepower into assembling a global survey."
  },
  {
    "title": "It Isn’t Just the U.S. The Whole World Has Soured on Climate Politics.",
    "link": "https://www.nytimes.com/2025/09/16/magazine/climate-politics-us-world-paris-agreement.html",
    "summary": "How do we think about the climate future, now that the era marked by the Paris Agreement has so utterly disappeared?"
  },
  {
    "title": "Corals Won’t Survive a Warmer Planet, a New Study Finds",
    "link": "https://www.nytimes.com/2025/09/17/climate/corals-climate-change.html",
    "summary": "Most corals in the Atlantic Ocean will soon stop growing. Many are already dying, leaving shorelines and marine ecosystems vulnerable."
  },
  {
    "title": "Jerry of Ben & Jerry’s Resigns, Saying Company Has Been ‘Silenced’",
    "link": "https://www.nytimes.com/2025/09/17/business/ben-and-jerrys-cofounder-resigns.html",
    "summary": "Jerry Greenfield said that the ice cream company, known for its activism, had been muzzled by Unilever, its parent company."
  },
  {
    "title": "A Vineyard Baseball Field Where Immigration Fears Fade Away",
    "link": "https://www.nytimes.com/2025/09/17/business/ice-raids-vineyards-baseball.html",
    "summary": "As ICE raids stoke anxiety in California, Latino men find solace at a baseball field built in the middle of a Sonoma County vineyard."
  },
  {
    "title": "Nonpartisan Groups Struggle to Stay Neutral in California’s Redistricting Fight",
    "link": "https://www.nytimes.com/2025/09/17/us/political-neutrality-redistricting-california.html",
    "summary": "Two nonprofits prided themselves on being neutral voices. Then they found that there seemed to be no middle ground in the nation’s redistricting war."
  },
  {
    "title": "Robert Redford: A Classic American Ideal Who Escaped the Mold",
    "link": "https://www.nytimes.com/2025/09/16/movies/robert-redford-career.html",
    "summary": "Though he got his start under the old studio system, he remained a natural in the New Hollywood and beyond."
  },
  {
    "title": "Robert Redford Didn’t Love Hollywood, Yet Hollywood Loved Him",
    "link": "https://www.nytimes.com/2025/09/17/business/robert-redford-hollywood.html",
    "summary": "Mr. Redford’s outspoken opinions and his championing of young filmmakers overshadowed his many criticisms of the industry."
  },
  {
    "title": "What Democrats Can Learn From Charlie Kirk",
    "link": "https://www.nytimes.com/2025/09/17/opinion/charlie-kirk-democrats-men.html",
    "summary": "He built one of the most effective youth mobilization machines in recent memory."
  },
  {
    "title": "Tina Brown: When Trump Visits King Charles III",
    "link": "https://www.nytimes.com/2025/09/17/opinion/king-charles-trump-britain-visit.html",
    "summary": "He may be the last man standing who can exude global gravitas in the dumpster fire of our digitally dominated world."
  },
  {
    "title": "Times Square Casino Proposal Is Voted Down After Mounting Opposition",
    "link": "https://www.nytimes.com/2025/09/17/nyregion/times-square-casino-proposal-vote.html",
    "summary": "The $5.4 billion casino, Caesars Palace Times Square, was one of eight proposed gambling facilities under consideration for the New York City area."
  },
  {
    "title": "U.S. Government to Invest $75 Million in Ukraine’s Minerals",
    "link": "https://www.nytimes.com/2025/09/17/world/europe/ukraine-us-minerals-deal.html",
    "summary": "The investment will ease fears in Kyiv that Washington is pulling back from Ukraine’s war effort. It also underscores the mercantile nature of the U.S.-Ukrainian alliance under President Trump."
  },
  {
    "title": "San Francisco Politician Recalled Over the Great Highway’s Closure",
    "link": "https://www.nytimes.com/2025/09/17/us/joel-engardio-san-francisco.html",
    "summary": "Supervisor Joel Engardio was ousted by voters who were angry that he helped turn a thoroughfare into a park."
  },
  {
    "title": "Georgia Election Official Who Defied Trump Enters Governor’s Race",
    "link": "https://www.nytimes.com/2025/09/17/us/brad-raffensperger-georgia-governor-election.html",
    "summary": "Brad Raffensperger, the two-term Republican secretary of state, joins a primary that also includes the state’s lieutenant governor and attorney general."
  }
]