[
  {
    "title": "Prosecutors Began Investigating Renee Good’s Killing. Washington Told Them to Stop.",
    "link": "https://www.nytimes.com/2026/02/07/us/renee-good-investigation-minnesota-trump.html",
    "summary": "Federal prosecutors had a warrant to collect evidence from Ms. Good’s vehicle, but Trump administration leaders said to drop it. About a dozen prosecutors have departed, leaving the Minnesota U.S. attorney’s office in turmoil."
  },
  {
    "title": "Why Trump’s Calls to ‘Nationalize’ Voting Have Raised Midterm Fears",
    "link": "https://www.nytimes.com/article/trumps-nationalize-voting-elections-midterms-explainer.html",
    "summary": "The president has escalated his language as his administration takes steps to involve itself more in election matters."
  },
  {
    "title": "Hegseth Says Defense Department Will Cut Ties With Harvard",
    "link": "https://www.nytimes.com/2026/02/06/us/politics/hegseth-defense-harvard.html",
    "summary": "Mr. Hegseth’s order appeared to target his alma mater, Harvard’s Kennedy School for public policy."
  },
  {
    "title": "Trump Deletes Racist Video Portraying the Obamas as Apes",
    "link": "https://www.nytimes.com/2026/02/06/us/politics/trump-obamas-video-apes-truth-social.html",
    "summary": "The video clip that President Trump posted in a late-night flurry of social media activity caused an unusually strong and public outcry from members of his own party."
  },
  {
    "title": "U.S. Judge Says Trump Cannot Halt Funding for Gateway Tunnel Project",
    "link": "https://www.nytimes.com/2026/02/06/nyregion/gateway-tunnel-project-funding-trump.html",
    "summary": "Nearly all of the work had stopped on Friday while negotiations continued in Washington and litigation played out in court."
  },
  {
    "title": "Mexican Cartels Overwhelm Police With Ammunition Made for the U.S. Military",
    "link": "https://www.nytimes.com/2026/02/07/us/lake-city-army-ammunition-plant-missouri-mexico.html",
    "summary": "Drug syndicates have used .50-caliber ammunition, produced at a plant owned by the U.S. Army and then smuggled across the border, in attacks on Mexican civilians and police."
  },
  {
    "title": "Lindsey Vonn Aims to Become the Oldest Alpine Olympic Medalist, Despite Ruptured A.C.L.",
    "link": "https://www.nytimes.com/2026/02/07/us/lindsey-vonn-ski-winter-olympics-2026.html",
    "summary": "The 41-year-old American aims to complete her comeback by racing in the women’s Olympic downhill on Sunday despite rupturing her left A.C.L. a week ago."
  },
  {
    "title": "Super Bowl Halftime Is the World’s Biggest Stage. He Designs It.",
    "link": "https://www.nytimes.com/2026/02/07/arts/music/super-bowl-halftime-is-the-worlds-biggest-stage-he-designs-it.html",
    "summary": "From Prince’s giant symbol to Kendrick Lamar’s streetlamps, the set production designer Bruce Rodgers “makes the impossible possible.”"
  },
  {
    "title": "The 2026 Super Bowl Ads (So Far), Ranked",
    "link": "https://www.nytimes.com/2026/02/06/arts/television/super-bowl-ads-ranked-2026.html",
    "summary": "Here is our critic’s survey of this year’s Super Bowl commercials, from best to worst to A.I."
  },
  {
    "title": "Trump’s Obama Derangement Syndrome",
    "link": "https://www.nytimes.com/2026/02/07/opinion/trump-obama-apes-post-video.html",
    "summary": "The president shows, once again, that he shouldn’t be anywhere near the Oval."
  },
  {
    "title": "How Hard Is It to Rig an American Election, Really?",
    "link": "https://www.nytimes.com/2026/02/07/opinion/trump-nationalize-elections.html",
    "summary": "The round table convenes to debate whether we need to worry about the midterms being free and fair."
  },
  {
    "title": "Vanity Fair",
    "link": "https://www.nytimes.com/2026/02/07/briefing/vanity-fair.html",
    "summary": "Behind the scenes at the Westminster Dog Show, the entrants were affectionate. Or at least they acted like it."
  },
  {
    "title": "Smaller N.Y.C. Classes Will Cost Millions. Can Mamdani Pull It Off?",
    "link": "https://www.nytimes.com/2026/02/07/nyregion/mamdani-nyc-class-size.html",
    "summary": "Mayor Zohran Mamdani wants to make classes smaller across the largest U.S. school system. Like other parts of his agenda, it’s a costly task."
  },
  {
    "title": "Russian Strikes Pummel Ukraine’s Power Grid",
    "link": "https://www.nytimes.com/2026/02/07/world/europe/russia-strikes-ukraine-energy.html",
    "summary": "The drone and missile bombardments were the latest attacks on Ukrainian energy infrastructure during a winter freeze, as peace talks have made little progress."
  },
  {
    "title": "Japan Ocean-Mining Test Successfully Hauls Up Potentially Valuable Mud",
    "link": "https://www.nytimes.com/2026/02/07/climate/ocean-seabed-mining-japan-rare-earths.html",
    "summary": "It’s the latest twist in the controversial global race to mine the deep sea for rare-earth elements and other valuable resources."
  },
  {
    "title": "What’s Up With This Big Freeze? Some Scientists See Climate Change Link",
    "link": "https://www.nytimes.com/2026/02/07/climate/whats-up-with-this-big-freeze-some-scientists-see-climate-change-link.html",
    "summary": "A warming Arctic can stretch the polar vortex, a high-altitude air ribbon, one says. The “wobble” can disrupt the jet stream, causing extreme cold in the East."
  }
]