[
  {
    "title": "New York Mayor’s Race Sees Highest Voter Turnout in Decades",
    "link": "https://www.nytimes.com/2025/11/04/nyregion/nyc-mayor-election-turnout.html",
    "summary": "Voter participation in the city, which once surpassed 90 percent, cratered in recent elections. Here’s a look at why it fell, and why this year has been different."
  },
  {
    "title": "Mamdani’s Mayoral Run Gave Gen Z More Than Politics",
    "link": "https://www.nytimes.com/2025/11/04/nyregion/mamdani-young-voters.html",
    "summary": "Members of Gen Z found something unexpected in the mayoral race: a chance to hang out. Their enthusiasm turned into real votes."
  },
  {
    "title": "Photos From NYC Mayoral Race Capture Campaigns of Mamdani, Cuomo and Sliwa",
    "link": "https://www.nytimes.com/2025/11/03/nyregion/photos-nyc-mayor-mamdani-cuomo-sliwa.html",
    "summary": "Times photographers caught signal moments from the campaign trail as Zohran Mamdani, Andrew Cuomo and Curtis Sliwa battled for votes."
  },
  {
    "title": "Republicans Reprise Unfounded Claims of Widespread Election Interference",
    "link": "https://www.nytimes.com/2025/11/04/us/politics/republicans-reprise-unfounded-claims-of-widespread-election-interference.html",
    "summary": "Prominent conservatives, including the president, sounded familiar alarms about voter suppression and other efforts to manipulate the vote on Election Day, without presenting evidence."
  },
  {
    "title": "UPS Plane Crash Near Louisville Airport Leaves Multiple Injured, Police Say",
    "link": "https://www.nytimes.com/2025/11/04/us/louisville-ups-plane-crash.html",
    "summary": "Data from Flightradar24 showed that a cargo plane bound for Honolulu reached an altitude of just 175 feet before swiftly descending."
  },
  {
    "title": "Trump Weighs Options, and Risks, for Attacks on Venezuela",
    "link": "https://www.nytimes.com/2025/11/04/us/politics/trump-weighs-attacks-venezuela.html",
    "summary": "President Trump has yet to make a decision, but his advisers are pressing a range of objectives — from attacking drug cartels to seizing oil fields — to try to justify ousting Nicolás Maduro."
  },
  {
    "title": "Nigeria Resists Christian ‘Mass Murder’ Claims Amid Trump Threats",
    "link": "https://www.nytimes.com/2025/11/04/world/africa/nigeria-rejects-trump-christian-killings.html",
    "summary": "Officials have accused the United States of foreign interference and called on Washington to support the country’s democracy instead of fomenting division."
  },
  {
    "title": "Dick Cheney, Powerful Vice President and Washington Insider, Dies at 84",
    "link": "https://www.nytimes.com/2025/11/04/us/politics/dick-cheney-dead.html",
    "summary": "A former defense secretary and congressman, he held the nation’s No. 2 job under President George W. Bush and was an architect of policies in an era of war and economic change."
  },
  {
    "title": "How Cheney’s Presidential Power Push Paved the Way for Trump to Go Further",
    "link": "https://www.nytimes.com/2025/11/04/us/politics/trump-dick-cheney.html",
    "summary": "Donald J. Trump and Dick Cheney became adversaries, but the former vice president set the stage for Mr. Trump’s bid to expand his executive authority."
  },
  {
    "title": "Dick Cheney’s Unwavering Image",
    "link": "https://www.nytimes.com/2025/11/04/style/dick-cheney-machiavellian-style.html",
    "summary": "The former vice president embodied a calculating technocrat out of central casting. He didn’t care."
  },
  {
    "title": "Some Republicans Honor Dick Cheney, While Trump Remains Silent",
    "link": "https://www.nytimes.com/2025/11/04/us/politics/republicans-honor-dick-cheney.html",
    "summary": "The late vice president had called President Trump “a coward” and a “threat to our republic” and supported Vice President Kamala Harris in 2024."
  },
  {
    "title": "Republicans Hold Firm on Filibuster and Prosecutor Veto Power, Despite Trump’s Frustrations",
    "link": "https://www.nytimes.com/2025/11/04/us/politics/trump-republicans-filibuster.html",
    "summary": "President Trump is showing mounting frustration at his inability to win confirmation of U.S. attorneys in blue states or break the filibuster's grip on the Senate. The G.O.P. has been uncharacteristically uncooperative."
  },
  {
    "title": "Trump Aides Raise Recession Fears, and Point Fingers at the Fed",
    "link": "https://www.nytimes.com/2025/11/04/us/politics/trump-aides-recession-fears-federal-reserve.html",
    "summary": "Treasury Secretary Scott Bessent said some sectors were in a recession as he argued for more interest rate cuts."
  },
  {
    "title": "A Beloved Vintage Store Closed. A Customer Bought All 4,500 Items.",
    "link": "https://www.nytimes.com/2025/11/04/business/vicky-szuflita-vintage-store.html",
    "summary": "Everything in the shop appeared to have been abandoned. A devoted customer took it all home and started selling the items herself."
  },
  {
    "title": "What to Know About the Legal Scandal in Israel Over Accusations of Abuse",
    "link": "https://www.nytimes.com/2025/11/04/world/middleeast/israel-soldiers-detainee-tomer-yerushalmi.html",
    "summary": "The fallout from a legal case has reignited a highly charged debate within the country over whether Israeli soldiers accused of abusing Palestinians are held accountable."
  },
  {
    "title": "U.S. Seeks Two-Year U.N. Mandate for Gaza Stabilization Force",
    "link": "https://www.nytimes.com/2025/11/04/world/middleeast/un-mandate-gaza-force.html",
    "summary": "A draft Security Council resolution said that an international force would ensure that Gaza be demilitarized, though specifics were unclear."
  },
  {
    "title": "Right-Wing Chatbots Turbocharge America’s Political and Cultural Wars",
    "link": "https://www.nytimes.com/2025/11/04/business/right-wing-chatbots-gab-arya-chatgpt-gemini.html",
    "summary": "Once pitched as dispassionate tools to answer your questions, A.I. chatbots are now programmed to reflect the biases of their creators."
  },
  {
    "title": "The Editor Got a Letter From ‘Dr. B.S.’ So Did a Lot of Other Editors.",
    "link": "https://www.nytimes.com/2025/11/04/science/letters-to-the-editor-ai-chatbots.html",
    "summary": "The rise of artificial intelligence has produced serial writers to science and medical journals, most likely using chatbots to boost the number of citations they’ve published."
  },
  {
    "title": "China’s Security State Sells an A.I. Dream",
    "link": "https://www.nytimes.com/2025/11/04/world/asia/china-police-ai-surveillance.html",
    "summary": "China’s new national drive to embrace artificial intelligence is also giving the authorities new ways to monitor and control its citizens."
  },
  {
    "title": "How the Cop Show ‘Barney Miller’ Made Gay TV History, 50 Years Ago",
    "link": "https://www.nytimes.com/2025/11/04/arts/television/barney-miller-gay-couple.html",
    "summary": "A 1975 episode introduced audiences to one of the first openly gay couples in mainstream American television not depicted as deviants or criminals."
  },
  {
    "title": "The Tragedy of Dick Cheney",
    "link": "https://www.nytimes.com/2025/11/04/opinion/dick-cheney-vice-president-authority-trump.html",
    "summary": "He tried to warn Americans about Trump, but they had already learned not to believe him."
  },
  {
    "title": "What Conservatives Should Do About Nick Fuentes",
    "link": "https://www.nytimes.com/2025/11/04/opinion/nick-fuentes-antisemitism-republicans.html",
    "summary": "There are no shortcuts in the fight against right-wing antisemitism."
  },
  {
    "title": "Americans Vote",
    "link": "https://www.nytimes.com/2025/11/04/briefing/election-day-trump-military-venezuela.html",
    "summary": "Also, Trump is weighing military options in Venezuela. Here’s the latest at the end of Tuesday."
  },
  {
    "title": "Drone Strike Kills Dozens of Mourners at Funeral in Sudan",
    "link": "https://www.nytimes.com/2025/11/04/world/africa/sudan-civil-war.html",
    "summary": "The attack occurred in North Kordofan, which has seen an increased military buildup as the army and paramilitary forces jockey for control of the country."
  },
  {
    "title": "Aging N.Y.C. Seminary’s Prayers Are Answered With a Lease by Vanderbilt",
    "link": "https://www.nytimes.com/2025/11/04/nyregion/nyc-seminary-episcopal-vanderbilt-university.html",
    "summary": "The Tennessee university has promised to make repairs to the General Theological Seminary buildings as it establishes a satellite campus in Chelsea."
  },
  {
    "title": "Sara Terry, Photographer Who Captured War’s Aftermath, Dies at 70",
    "link": "https://www.nytimes.com/2025/11/04/arts/design/sara-terry-dead.html",
    "summary": "Her haunting work focused on the lingering traces of conflict in places like Bosnia and Sierra Leone, after the firing had stopped."
  },
  {
    "title": "Fugitive Who Faked Abduction Is Found 13 Years Later, Enrolled in N.Y. College",
    "link": "https://www.nytimes.com/2025/11/04/us/oklahoma-sex-offender.html",
    "summary": "Anthony Lennon, a convicted sex offender from Oklahoma, was arrested in Canton, N.Y., where he was studying under an alias, the authorities said."
  }
]