[
  {
    "title": "Grim Evidence of Trump’s Boat Strikes Washes Ashore on a Colombian Peninsula",
    "link": "https://www.nytimes.com/2025/12/29/world/americas/trump-boat-strikes-gulf-of-venezuela-wreckage.html",
    "summary": "First came the scorched boat. Then the mangled bodies. Then the packets with traces of marijuana. Now, fishermen fear the ocean that feeds them."
  },
  {
    "title": "More Kennedy Center Performances Are Canceled After Trump’s Renaming",
    "link": "https://www.nytimes.com/2025/12/29/arts/kennedy-center-new-years-eve-concerts-canceled.html",
    "summary": "A dance company withdrew from two performances next year, and the arts center’s website says two New Year’s Eve jazz concerts have been canceled."
  },
  {
    "title": "Trump Says the U.S. Struck a ‘Big Facility’ in Campaign Against Venezuela",
    "link": "https://www.nytimes.com/2025/12/28/us/politics/trump-drug-facility-venezuela.html",
    "summary": "The administration provided no details of what the president said was an attack last week linked to U.S. efforts to disrupt drug trafficking from Latin America."
  },
  {
    "title": "Israel Strips U.N. Agency for Palestinian Refugees of Diplomatic Immunity",
    "link": "https://www.nytimes.com/2025/12/29/world/middleeast/israel-unrwa-diplomatic-immunity.html",
    "summary": "The legislation was the latest blow to the agency, known as UNRWA. Israel has accused it of being extensively infiltrated by Hamas."
  },
  {
    "title": "Iran’s Currency Collapse Pushes Protesters to the Streets",
    "link": "https://www.nytimes.com/2025/12/29/world/middleeast/iran-currency-collapse-rial-inflation-protests.html",
    "summary": "High inflation and a currency collapse have squeezed Iranians’ budgets, challenging the country’s leaders."
  },
  {
    "title": "Russia Threatens to Toughen Its Stance on Ending the War in Ukraine",
    "link": "https://www.nytimes.com/2025/12/29/world/europe/russia-claims-ukraine-attack-putin.html",
    "summary": "Moscow said a Ukrainian drone attack targeted a residence of President Vladimir V. Putin, which Ukraine denied, accusing the Kremlin of fabricating an excuse not to make peace."
  },
  {
    "title": "For Zelensky, Just Keeping Trump Talking About Ukraine Peace Deal Counts as a Win",
    "link": "https://www.nytimes.com/2025/12/29/world/europe/zelensky-trump-ukraine-peace-talks.html",
    "summary": "Though discussions produced little tangible progress, President Volodymyr Zelensky of Ukraine at least avoided the type of setbacks that have blighted earlier meetings."
  },
  {
    "title": "Inside Marjorie Taylor Greene’s Break With Trump and MAGA",
    "link": "https://www.nytimes.com/2025/12/29/magazine/marjorie-taylor-greene-trump-maga-split.html",
    "summary": "How the Georgia congresswoman went from the president’s loudest cheerleader to his loudest Republican critic."
  },
  {
    "title": "Four Takeaways From the New York Times Profile of Marjorie Taylor Greene",
    "link": "https://www.nytimes.com/2025/12/29/magazine/marjorie-taylor-greene-interview-takeaways.html",
    "summary": "The congresswoman discussed her break with President Trump and her journey from MAGA zealot to political isolation."
  },
  {
    "title": "Claire Brosseau Wants to Die. Will Canada Let Her?",
    "link": "https://www.nytimes.com/2025/12/29/health/assisted-death-mental-illness-canada.html",
    "summary": "Ms. Brosseau says mental illness has made her life unbearable. She wants a medically assisted death. Even her psychiatrists are split over whether she should have one."
  },
  {
    "title": "Mamdani Will Be Sworn In at Abandoned Subway Station Beneath City Hall",
    "link": "https://www.nytimes.com/2025/12/29/nyregion/mamdani-subway-sworn-in-mayor.html",
    "summary": "Hours before Mayor-elect Zohran Mamdani holds an inauguration block party outside City Hall, he will officially become mayor in a small private ceremony."
  },
  {
    "title": "As Mamdani Leaves Queens for the Upper East Side, a Cool Welcome Awaits",
    "link": "https://www.nytimes.com/2025/12/29/nyregion/mamdani-gracie-neighborhood-astoria.html",
    "summary": "Mayor-elect Zohran Mamdani loves his Astoria, Queens, neighborhood, and the feeling is mutual. But voters who live near Gracie Mansion, his new home, really wanted his opponent to win."
  },
  {
    "title": "The New Billionaires of the A.I. Boom",
    "link": "https://www.nytimes.com/2025/12/29/technology/new-billionaires-ai-boom.html",
    "summary": "Just like past tech booms, the latest frenzy has produced a group of billionaires — at least on paper — from smaller start-ups."
  },
  {
    "title": "As Youth Sports Professionalize, Kids Are Burning Out Fast",
    "link": "https://www.nytimes.com/2025/12/29/business/youth-sports-stress.html",
    "summary": "A growing body of research shows how pressure from overbearing coaches and parents is stunting children’s emotional well-being and leading to injuries."
  },
  {
    "title": "10 Fitness Tips to Help You Get Moving in 2026",
    "link": "https://www.nytimes.com/2025/12/29/well/move/fitness-workout-tips-2026.html",
    "summary": "Turn your walk into a better workout, build strength without weights and more exercise advice for the year ahead."
  },
  {
    "title": "Who Says Rock Is Dead?",
    "link": "https://www.nytimes.com/2025/12/29/arts/music/year-in-rock-geese-turnstile.html",
    "summary": "In 2025, rock was still hanging in. As artificial intelligence infiltrates music, the genre’s handmade imperfections are more crucial than ever."
  },
  {
    "title": "A Bold Alliance Ends as Innovative Opera Director Bows Out in Detroit",
    "link": "https://www.nytimes.com/2025/12/29/arts/music/yuval-sharon-detroit-opera.html",
    "summary": "Yuval Sharon will leave the financially strained Detroit Opera after this season. In March, he brings his unorthodox vision to Wagner at the Metropolitan Opera."
  },
  {
    "title": "One of America’s Most Successful Experiments Is Coming to a Shuddering Halt",
    "link": "https://www.nytimes.com/2025/12/29/opinion/indian-americans-trump.html",
    "summary": "Amid an astonishing wave of anti-Indian animus, Indian Americans are questioning their place in the country."
  },
  {
    "title": "A Love Letter to My Dutch Oven",
    "link": "https://www.nytimes.com/2025/12/29/opinion/dutch-oven-cooking-kitchen.html",
    "summary": "How a piece of kitchen equipment watched me grow up."
  },
  {
    "title": "Russia Threatens to Harden Its Stance on Ukraine",
    "link": "https://www.nytimes.com/2025/12/29/briefing/russia-venezuela-rfk.html",
    "summary": "Plus, food trends for 2026. Here’s the latest at the end of Monday."
  },
  {
    "title": "Idris Elba and Cynthia Erivo Make King Charles’s New Year Honors List",
    "link": "https://www.nytimes.com/2025/12/29/world/europe/idris-elba-cynthia-erivo-king-charles-honors.html",
    "summary": "Mr. Elba received a knighthood and Ms. Erivo was also honored in an annual British tradition celebrating professional excellence and community service."
  },
  {
    "title": "Uber Flags Sexual Misconduct but Many Drivers Stay on the Road",
    "link": "https://www.nytimes.com/2025/12/29/business/uber-sexual-assault-drivers-complaints.html",
    "summary": "The company monitors passenger feedback for risky driver behavior. Some accused of serious sexual assault had prior records of complaints."
  },
  {
    "title": "Ice Storm Makes Travel Dangerous in Parts of New York and New England",
    "link": "https://www.nytimes.com/2025/12/29/us/new-york-new-england-ice-storm.html",
    "summary": "Officials in Vermont and Buffalo, N.Y., warned residents to stay off the roads as a winter weather system brought thick sheets of ice and snow. Tens of thousands of power customers faced outages."
  }
]