[
  {
    "title": "Trump’s Attempt to Fire the Fed’s Lisa Cook Risks Global Economic Stability",
    "link": "https://www.nytimes.com/2025/08/26/us/politics/trump-fed-lisa-cook.html",
    "summary": "President Trump’s attempt to fire Lisa Cook, a Fed governor, will set off a long legal battle. Economists warn it could lead to higher inflation and government borrowing costs."
  },
  {
    "title": "Can Trump Fire a Fed Governor? What to Know as He Moves to Remove Lisa Cook",
    "link": "https://www.nytimes.com/2025/08/22/us/politics/can-trump-fire-a-fed-governor.html",
    "summary": "The Supreme Court has indicated that there are distinctive reasons to shield the Federal Reserve from political interference."
  },
  {
    "title": "What to Know About the Fed’s Lisa Cook and Mortgage Fraud Allegations",
    "link": "https://www.nytimes.com/2025/08/22/us/politics/trump-lisa-cook-fed-mortgage-fraud.html",
    "summary": "Trump administration officials have accused the Federal Reserve governor of mortgage fraud. She has not been charged with any wrongdoing."
  },
  {
    "title": "Judge Dismisses Trump Administration Suit Against Federal Bench in Maryland",
    "link": "https://www.nytimes.com/2025/08/26/us/politics/trump-suit-maryland-judges.html",
    "summary": "The judge used the ruling to take President Trump and some of his top aides to task for having repeatedly attacked other judges who have dared to rule against the White House."
  },
  {
    "title": "DOGE Put Critical Social Security Data at Risk, Whistle-Blower Says",
    "link": "https://www.nytimes.com/2025/08/26/us/politics/doge-social-security-data.html",
    "summary": "DOGE team members uploaded a database with the personal information of hundreds of millions of Americans to a vulnerable cloud server, according to the agency’s chief data officer."
  },
  {
    "title": "Jack Smith’s Legal Team Fires Back Against Ethics Complaint",
    "link": "https://www.nytimes.com/2025/08/26/us/jack-smith-ethics-complaint-trump.html",
    "summary": "For months, the former special counsel has remained silent as the president and his advisers have publicly attacked him."
  },
  {
    "title": "Public Broadcast Cuts Hit Rural Areas, Revealing a Political Shift",
    "link": "https://www.nytimes.com/2025/08/26/us/politics/public-broadcast-cuts.html",
    "summary": "Threatened by the president with political retribution, Republicans agreed to defund public broadcasting, imperiling a lifeline of communication in rural Alaska."
  },
  {
    "title": "Russia and Ukraine Target Energy Sites, Seeking Leverage Away From the Front",
    "link": "https://www.nytimes.com/2025/08/26/world/europe/russia-ukraine-energy-war.html",
    "summary": "The two countries appear to be trying to raise political pressure on each other and send signals to Washington in case peace talks move forward."
  },
  {
    "title": "Russian Troops Gain a Toehold in Another Ukrainian Region",
    "link": "https://www.nytimes.com/2025/08/26/world/europe/russia-ukraine-villages-dnipropetrovsk.html",
    "summary": "For the first time, Russian forces seized villages in the Dnipropetrovsk region, a minor but symbolic gain that gives the Kremlin another bargaining chip."
  },
  {
    "title": "Donald Trump’s Big Gay Government",
    "link": "https://www.nytimes.com/2025/08/26/style/gay-men-trump-administration-republicans.html",
    "summary": "On the town with the A-Gays of Washington, who have never been happier to be out, proud and Republican."
  },
  {
    "title": "A Teen Was Suicidal. ChatGPT Was the Friend He Confided In.",
    "link": "https://www.nytimes.com/2025/08/26/technology/chatgpt-openai-suicide.html",
    "summary": "More people are turning to general-purpose chatbots for emotional support. At first, Adam Raine, 16, used ChatGPT for schoolwork, but then he started discussing plans to end his life."
  },
  {
    "title": "The Deadly Risks of Reporting In Gaza",
    "link": "https://www.nytimes.com/2025/08/26/world/middleeast/palestinian-journalists-risk-reporting.html",
    "summary": "Journalists endure the same harrowing reality as other Gazans: hunger and the constant threat of death. Those challenges risk further stifling what the world hears about the war."
  },
  {
    "title": "Israel Links Deadly Hospital Attack in Gaza to Hamas Surveillance Camera",
    "link": "https://www.nytimes.com/2025/08/26/world/middleeast/israel-hospital-attack-gaza-camera-hamas.html",
    "summary": "A day after the strike killed 20 people, including five journalists, the Israeli military said its initial inquiry found that militants had placed an observation camera in the area. It provided no evidence."
  },
  {
    "title": "Israel Faces Growing Pressure Over Hostages and Gaza Offensive",
    "link": "https://www.nytimes.com/2025/08/26/world/middleeast/israel-netanyahu-gaza-protests.html",
    "summary": "As rallies spread to demand action to free captives, the country’s security cabinet met for the first time since Hamas agreed to a new cease-fire proposal, officials said."
  },
  {
    "title": "Trump Wants Europe to Stop Regulating Big Tech. Will It Bend?",
    "link": "https://www.nytimes.com/2025/08/26/business/trump-technology-european-union-tariffs.html",
    "summary": "The White House suggested that countries with digital regulations restricting U.S. tech companies could face penalties. The question is whether Europe can stand firm."
  },
  {
    "title": "Fears of a French Government Collapse Send Its Borrowing Costs Soaring",
    "link": "https://www.nytimes.com/2025/08/26/business/france-government-collapse-economy.html",
    "summary": "France, a cornerstone economy in Europe, is rapidly becoming one of its weakest links as a political and debt crisis loom."
  },
  {
    "title": "Taylor Swift and Travis Kelce Are Engaged, Singer Announces",
    "link": "https://www.nytimes.com/2025/08/26/style/taylor-swift-engaged-travis-kelce.html",
    "summary": "The news was announced on Instagram: “Your English teacher and your gym teacher are getting married.”"
  },
  {
    "title": "What the Bloom After L.A.’s Wildfires Reveals About Our Ecological Future",
    "link": "https://www.nytimes.com/2025/08/26/magazine/wildfires-ecology-los-angeles.html",
    "summary": "Many of Southern California’s plants and animals evolved with fire as part of their life cycles. Can they weather the worsening fires to come?"
  },
  {
    "title": "Judge Rules Utah Must Redraw Its Congressional Map, Frustrating Republicans",
    "link": "https://www.nytimes.com/2025/08/26/us/utah-congress-gerrymander-redistricting.html",
    "summary": "A G.O.P. effort to carve up a Democratic stronghold ignored the will of voters, a judge said. The ruling, which Republicans can appeal, makes the state another battleground in the national fight over redistricting."
  },
  {
    "title": "Restaurant Review: Diane’s Place and Vinai in Minneapolis Celebrate Hmong Cuisines",
    "link": "https://www.nytimes.com/2025/08/26/dining/hmong-cuisines-minneapolis.html",
    "summary": "The chefs at Diane’s Place and Vinai serve as guardians and interpreters of their foodways."
  },
  {
    "title": "The Only Real Solution to the A.I. College Cheating Crisis",
    "link": "https://www.nytimes.com/2025/08/26/opinion/culture/ai-chatgpt-college-cheating-medieval.html",
    "summary": "Since A.I. has made the mental effort of writing and problem solving optional, universities need new ways to require the work needed for learning."
  },
  {
    "title": "Trump Is Trying to End Fed Independence",
    "link": "https://www.nytimes.com/2025/08/26/opinion/politics/trump-fed-independence-lisa-cook.html",
    "summary": "If the courts allow Trump to get away with firing Lisa Cook, the Fed will be stripped of its insulation from political pressure."
  },
  {
    "title": "Australia Says Iran Was Behind Antisemitic Arson Attacks on Its Soil",
    "link": "https://www.nytimes.com/2025/08/26/world/australia/australia-iran-antisemitic-attacks.html",
    "summary": "The government expelled Iran’s diplomats, saying the country had orchestrated attacks on a Melbourne synagogue and a Sydney restaurant."
  },
  {
    "title": "Mediterranean Diet Reduces Diabetes Risk, Study Shows",
    "link": "https://www.nytimes.com/2025/08/25/well/mediterranean-diet-diabetes.html",
    "summary": "Strong evidence suggests that following the diet, cutting calories and exercising lowers the chances of developing diabetes for those with metabolic risk factors."
  },
  {
    "title": "Robert Moses Tore the South Bronx in Half. Is It About to Happen Again?",
    "link": "https://www.nytimes.com/2025/08/22/nyregion/south-bronx-park-expressway.html",
    "summary": "It took decades for the Bronx to recover after the Cross Bronx Expressway was built. With years of repairs on the horizon, some residents worry about new trauma."
  }
]