[
  {
    "title": "Europe Talks Big on Gaza but Struggles to Act",
    "link": "https://www.nytimes.com/2025/09/22/world/europe/europe-eu-gaza-israel.html",
    "summary": "Even as criticism of Israel ramps up and a growing number of countries say they’ll recognize a Palestinian state, concrete actions remain limited."
  },
  {
    "title": "Britain, Australia, Canada and Portugal Recognize a Palestinian State",
    "link": "https://www.nytimes.com/2025/09/21/world/europe/starmer-uk-recognize-palestinian-state.html",
    "summary": "The moves came just before the annual U.N. General Assembly, increasing pressure on Israel and putting key allies at odds with the Trump administration."
  },
  {
    "title": "What Would Recognizing a Palestinian State Mean?",
    "link": "https://www.nytimes.com/2025/07/29/world/middleeast/palestinian-statehood-israel.html",
    "summary": "Announcements by Australia, Britain, Canada and Portugal reflect frustration with Israel’s conduct in Gaza and the West Bank, experts say."
  },
  {
    "title": "U.N. Gathers Amid Its 80th Anniversary and a ‘Free Fall’",
    "link": "https://www.nytimes.com/2025/09/21/world/middleeast/un-general-assembly-80th-anniversary.html",
    "summary": "The wars in Ukraine, Gaza and Sudan will hang over the annual gathering of the U.N. General Assembly next week in New York. So, too, will budget and identity crises."
  },
  {
    "title": "Trump Remembers Kirk as a Martyr While Attacking Political Opponents",
    "link": "https://www.nytimes.com/2025/09/21/us/elections/trump-charlie-kirk-memorial-service.html",
    "summary": "President Trump oscillated between honoring Charlie Kirk’s life and promoting his own political agenda in his remarks at the conservative activist’s memorial in Arizona."
  },
  {
    "title": "At Kirk Service, an Extraordinary Fusion of Government and Christianity",
    "link": "https://www.nytimes.com/2025/09/21/us/politics/kirk-memorial-service-christianity-religion.html",
    "summary": "The memorial reflected the degree to which conservative Christianity had melded with Republican politics in the Trump era."
  },
  {
    "title": "The Patriotic Dress Code at Charlie Kirk’s Funeral",
    "link": "https://www.nytimes.com/2025/09/21/style/a-patriotic-dress-code-for-a-political-memorial.html",
    "summary": "A service for Charlie Kirk called for attendees to wear red, white and blue."
  },
  {
    "title": "In Assault on Free Speech, Trump Targets Speech He Hates",
    "link": "https://www.nytimes.com/2025/09/21/us/politics/trump-free-speech.html",
    "summary": "The president’s complaints about negative coverage undermine the rationales offered by his own officials."
  },
  {
    "title": "Trump’s $100,000 H1-B Visa Fee Spurs Confusion and Chaos for Companies",
    "link": "https://www.nytimes.com/2025/09/20/business/trump-h1b-visas-fee-employees.html",
    "summary": "The White House sought to clarify the proclamation on Saturday, but many companies remained cautious. “We are still flying in somewhat foggy conditions,” one attorney said."
  },
  {
    "title": "Trump Says the Murdochs May Join TikTok Investors",
    "link": "https://www.nytimes.com/2025/09/21/business/media/fox-corporation-tiktok-lachlan-rupert-murdoch-ellison-trump.html",
    "summary": "Fox Corporation is considering investing in the popular video app as part of a bid to avert a U.S. ban, a person familiar with the situation said after the president’s remarks."
  },
  {
    "title": "Can the Galápagos Adapt to Airbnb?",
    "link": "https://www.nytimes.com/2025/09/21/business/galapagos-airbnb.html",
    "summary": "The islands that Charles Darwin made famous have become more accessible. Too accessible, say some residents and researchers, who fear nature is imperiled."
  },
  {
    "title": "Ukraine Counterattacks, Scoring Rare, if Modest, Success in Northeast",
    "link": "https://www.nytimes.com/2025/09/21/world/europe/ukraine-sumy-advances.html",
    "summary": "The gains could help counter Moscow’s narrative that Russian advances are unstoppable and that Kyiv should settle for a peace deal, even if it means giving up territory."
  },
  {
    "title": "How Russia’s Sanctions Evasion Could Create Lasting Costs",
    "link": "https://www.nytimes.com/2025/09/20/world/europe/russia-shadow-fleet-oil-sanctions-ukraine-war.html",
    "summary": "Restrictions have made it expensive for Moscow to ship oil by sea. They have also expanded the illicit shipping economy."
  },
  {
    "title": "Trump’s Tariffs Are Damaging America’s Biggest Foreign Source of Screws",
    "link": "https://www.nytimes.com/2025/09/22/business/taiwan-manufacturing-trump-tariffs.html",
    "summary": "Taiwan has long been the top provider of screws to the United States. But its factories are struggling to survive under tariffs on steel and aluminum."
  },
  {
    "title": "Trump’s Tariffs on Switzerland Prompt Identity Crisis for Swiss Army Knife",
    "link": "https://www.nytimes.com/2025/09/21/business/swiss-army-knife-trump-tariffs.html",
    "summary": "President Trump’s 39 percent tariff on Switzerland has forced some companies to consider whether they could produce in the United States while still retaining their Swiss identity."
  },
  {
    "title": "A Benefit for the Palestinian Cause Filled an Arena. Are More Coming?",
    "link": "https://www.nytimes.com/2025/09/20/arts/music/together-for-palestine-kneecap.html",
    "summary": "Onstage campaigning for an end to the war in Gaza is now common in the British music scene, and pro-Palestinian benefit shows can sell out huge venues."
  },
  {
    "title": "Novo Nordisk’s Woes Are Slimming Denmark’s Economic Growth",
    "link": "https://www.nytimes.com/2025/09/22/business/novo-nordisk-denmark-economy.html",
    "summary": "Because of its size, the drugmaker has an outsize effect on the country. Now, as it sheds jobs, forecasts for Denmark’s growth are falling, too."
  },
  {
    "title": "Palestinians Need More Than the Gesture of Statehood",
    "link": "https://www.nytimes.com/2025/09/22/opinion/palestinian-statehood-united-nations.html",
    "summary": "Recognition of the State of Palestine must be accompanied by holding Israel accountable for its actions."
  },
  {
    "title": "This Is the Feeling of Losing a Country. I Know It Well.",
    "link": "https://www.nytimes.com/2025/09/21/opinion/trump-kirk-trans-people-russia.html",
    "summary": "This is one of those moments in history."
  },
  {
    "title": "They Were Building a Homeless Shelter. But the Land had a Grim Past.",
    "link": "https://www.nytimes.com/2025/09/21/nyregion/inwood-homeless-shelter.html",
    "summary": "The search for a place to build a shelter in Manhattan resurfaced New York’s often overlooked history of slavery."
  },
  {
    "title": "Cyberattack Forces Brussels Airport to Cancel More Flights",
    "link": "https://www.nytimes.com/2025/09/21/world/europe/brussels-airport-delays-europe-cyberattack.html",
    "summary": "The announcement signaled that delays and cancellations, which snarled traffic at major European travel hubs over the weekend, would continue into a third day."
  },
  {
    "title": "Man Is Charged in Shooting at Sky Meadow Country Club in New Hampshire",
    "link": "https://www.nytimes.com/2025/09/20/us/new-hampshire-country-club-shooting.html",
    "summary": "A 23-year-old was arrested and charged with murder after one person was killed and two more were wounded by gunfire. Officials said people dining at the club intervened to stop the shooter."
  }
]