[
  {
    "title": "How The New York Times Investigated Videos of ICE Agents Killing Alex Pretti",
    "link": "https://www.nytimes.com/2026/01/26/insider/minneapolis-ice-shooting-videos-investigation.html",
    "summary": "Using more than a dozen videos related to the shooting of Alex Pretti, The Times worked to establish what is called ground truth: what happened, how it happened and who might be responsible."
  },
  {
    "title": "Winter Storm Debilitates the South, Encasing Cities in Ice and Snow",
    "link": "https://www.nytimes.com/2026/01/26/weather/south-us-winter-storm-snow-ice.html",
    "summary": "The forecasts had predicted that the storm could be among the worst in a generation to hit the region. By Monday, it was clear that is exactly what happened."
  },
  {
    "title": "Scenes From the Winter Storm",
    "link": "https://www.nytimes.com/2026/01/24/us/winter-storm-snow-photos-videos.html",
    "summary": "Images from across much of the United States illuminate snow-covered streets and the storm’s aftermath."
  },
  {
    "title": "How Does Climate Change Affect Winter Storms?",
    "link": "https://www.nytimes.com/2026/01/26/weather/winter-storm-climate-change-snow.html",
    "summary": "A warmer atmosphere has the potential to hold more moisture, which can contribute to heavier precipitation in any season, scientists say."
  },
  {
    "title": "Winter Storm Linked to at Least 22 Deaths in the US",
    "link": "https://www.nytimes.com/2026/01/26/weather/winter-storm-death-toll-snow.html",
    "summary": "The storm deaths were reported in New York, Tennessee, Louisiana, Kansas, Texas, Massachusetts, Arkansas, Ohio, Pennsylvania, Mississippi, Kentucky and New Jersey, and other deaths were under investigation."
  },
  {
    "title": "What to Expect for a Cold NYC Commute: Trains, Buses and Rail",
    "link": "https://www.nytimes.com/2026/01/26/weather/nyc-winter-storm-transit-trains-buses.html",
    "summary": "Mass transit is slowly getting back to normal around the city."
  },
  {
    "title": "No Snow Day? In New York City Parks, It Felt Like One.",
    "link": "https://www.nytimes.com/2026/01/26/weather/snow-parks-children-remote-schooling.html",
    "summary": "Some children skipped remote classes in city schools in favor of activities they felt were more important: sledding and snowball fights."
  },
  {
    "title": "After Mamdani Nods to ‘Heated Rivalry,’ Library E-Book Downloads Surge",
    "link": "https://www.nytimes.com/2026/01/26/nyregion/mamdani-heated-rivalry-library.html",
    "summary": "As a snowstorm arrived, Mayor Zohran Mamdani reminded New Yorkers that they could access the romance series that inspired the TV show through their public library."
  },
  {
    "title": "Record Debt in the World’s Richest Nations Threatens Global Growth",
    "link": "https://www.nytimes.com/2026/01/27/business/economy/government-debt-bonds.html",
    "summary": "The cost of borrowing is already choking crucial public spending in many developing economies. Now it’s raising broader alarms."
  },
  {
    "title": "Trump Says He Will Raise Tariffs on South Korea to 25%",
    "link": "https://www.nytimes.com/2026/01/26/business/economy/trump-tariffs-south-korea.html",
    "summary": "President Trump threatened to increase tariffs on South Korean exports, including cars, citing the country’s slow ratification of a trade deal."
  },
  {
    "title": "UK Seeks Trade With China Without Triggering Trump’s Fury",
    "link": "https://www.nytimes.com/2026/01/27/world/europe/uk-china-visit-starmer-trade.html",
    "summary": "Prime Minister Keir Starmer hopes to boost his country’s lagging economy with a trip to Beijing. But he must carefully navigate between two superpowers."
  },
  {
    "title": "Home Sourdough Bakers Are Turning Their Hobbies Into Full-Time Jobs",
    "link": "https://www.nytimes.com/2026/01/26/dining/home-bakers-sourdough-microbakeries.html",
    "summary": "Home bakers are finding devoted customer bases that allow them to stay home with family and still make a decent living — but they do have get up in the middle of the night."
  },
  {
    "title": "Social Media Giants Face Landmark Legal Tests on Child Safety",
    "link": "https://www.nytimes.com/2026/01/27/technology/social-media-addiction-trial.html",
    "summary": "Starting this week, a series of trials will test a new legal strategy claiming that Meta, TikTok, Snap and YouTube caused personal injury through addictive products."
  },
  {
    "title": "The Social Media Addiction Trials: What to Know",
    "link": "https://www.nytimes.com/2026/01/27/technology/what-to-know-about-the-social-media-addiction-trials.html",
    "summary": "Landmark trials beginning this week will test a new legal strategy claiming that Meta, TikTok, Snap and YouTube caused personal injury through addictive products."
  },
  {
    "title": "Trump Briefed on Intelligence Saying Iran’s Government Is Weaker",
    "link": "https://www.nytimes.com/2026/01/26/us/politics/trump-reports-iran-government.html",
    "summary": "Protests that erupted late last year shook elements of the Iranian government, according to the reports."
  },
  {
    "title": "Democrats Embrace a Shutdown Fight They Wanted to Avoid",
    "link": "https://www.nytimes.com/2026/01/26/us/politics/democrats-shutdown-ice-shooting.html",
    "summary": "After a second fatal shooting of a U.S. citizen in Minneapolis, Democrats say public opinion is on their side and they are willing to risk a backlash to counter what they see as police-state tactics."
  },
  {
    "title": "Court Affirms Ruling That Alina Habba Served Unlawfully as U.S. Attorney",
    "link": "https://www.nytimes.com/2026/01/26/nyregion/alina-habba-appeal.html",
    "summary": "The Justice Department lost a bid to challenge a decision that had found Ms. Habba was serving unlawfully as New Jersey’s top federal prosecutor."
  },
  {
    "title": "Trump Administration Takes Another Stake in Rare Earth Sector",
    "link": "https://www.nytimes.com/2026/01/26/us/politics/trump-rare-earth-howard-lutnick.html",
    "summary": "The administration announced a $1.6 billion deal with USA Rare Earth. The firm also does business with Cantor Fitzgerald, which is run by the sons of President Trump’s commerce secretary."
  },
  {
    "title": "NATO Chief Says Europe Is ‘Dreaming’ if It Thinks It Can Defend Itself Without U.S.",
    "link": "https://www.nytimes.com/2026/01/26/world/europe/nato-chief-europe-greenland-trump-us.html",
    "summary": "Mark Rutte, the secretary general of the alliance, told members of the European Parliament that President Trump was “doing a lot of good stuff.”"
  },
  {
    "title": "A Year After DC Plane Crash, Concerns About Airport’s Safety Continue",
    "link": "https://www.nytimes.com/2026/01/26/us/politics/reagan-national-airport-crash.html",
    "summary": "The Federal Aviation Administration says it has reduced traffic in and out of the airport and designed safer routes. Crash victims’ families want more."
  },
  {
    "title": "F.A.A. Rolls Out Agency Overhaul for Improving Air Safety",
    "link": "https://www.nytimes.com/2026/01/26/us/politics/faa-overhaul-safety-modernization.html",
    "summary": "The announcement of a reorganization comes nearly a year after a midair collision killed 67 people and prompted a public outcry for enhancing the security of aviation travel."
  },
  {
    "title": "All-Night Concerts in War-Ravaged Myanmar",
    "link": "https://www.nytimes.com/2026/01/27/world/asia/myanmar-concert-zat-pwe-war.html",
    "summary": "But the shows, which combine dance, drama and music, are also part of an effort by Myanmar’s military rulers to project a veneer of legitimacy."
  },
  {
    "title": "The Time Has Come for the U.S. to Act in Iran",
    "link": "https://www.nytimes.com/2026/01/27/opinion/iran-protests-military-intervention.html",
    "summary": "It is time for the U.S. to intervene militarily in Iran, at least to deter future killings of protesters."
  },
  {
    "title": "The War in Minnesota Is for Our Phones",
    "link": "https://www.nytimes.com/2026/01/26/opinion/minnesota-minneapolis-phone-ice-shooting.html",
    "summary": "We need to protect our right to carry cameras to document ICE’s violence."
  },
  {
    "title": "How Bad Are A.I. Delusions? We Asked People Treating Them.",
    "link": "https://www.nytimes.com/2026/01/26/us/chatgpt-delusions-psychosis.html",
    "summary": "Dozens of doctors and therapists said chatbots had led their patients to psychosis, isolation and unhealthy habits."
  },
  {
    "title": "Chinese Pandas Leave Japanese Zoo",
    "link": "https://www.nytimes.com/2026/01/26/world/asia/japan-pandas-china.html",
    "summary": "As Japan and China feud, an animal long used in Chinese diplomacy has been summoned back home."
  },
  {
    "title": "Thomas Fogarty, 91, Who Helped Revolutionize Vascular Surgery, Dies",
    "link": "https://www.nytimes.com/2026/01/26/science/thomas-fogarty-dead.html",
    "summary": "Drawing on his love of fly-fishing, he developed a balloon catheter that removes blood clots from patients’ limbs in a minimally invasive way. It has saved millions of lives."
  },
  {
    "title": "Canada’s Marineland Whales Could Find New Homes in U.S.",
    "link": "https://www.nytimes.com/2026/01/26/world/canada/canada-marineland-beluga-whales.html",
    "summary": "Marineland, a closed aquatic park in Ontario, had threatened to euthanize its whales after the government denied an application to send them to China."
  }
]