[
  {
    "title": "As Hours Dwindled Before Flight Cuts, the Government Was Publicly Mum",
    "link": "https://www.nytimes.com/2025/11/06/us/politics/flight-cuts-government-airports-faa.html",
    "summary": "Airlines did not wait for an announcement, notifying passengers and airports of expected changes before the Trump administration made official its list of affected airports."
  },
  {
    "title": "Here Are Airports That Will Be Affected by the Air Traffic Slowdown",
    "link": "https://www.nytimes.com/2025/11/06/us/politics/airports-list-flight-cuts-government-shutdown.html",
    "summary": "The cuts to flights are expected to begin Friday and deepen over the weekend to reach a 10 percent reduction in air traffic by next Friday."
  },
  {
    "title": "What Travelers Need to Know About the Shutdown, Flight Reductions and Delays",
    "link": "https://www.nytimes.com/2025/11/06/travel/shutdown-faa-flight-delays-cancellations.html",
    "summary": "As the government shutdown continues, more challenges await passengers as they deal with the newest announcement from the Trump administration: a 10 percent cut in flights at 40 U.S. airports."
  },
  {
    "title": "Elon Musk Wins $1 Trillion Tesla Pay Package",
    "link": "https://www.nytimes.com/2025/11/06/business/elon-musk-tesla-pay-vote.html",
    "summary": "Tesla shareholders approved a plan to grant Elon Musk shares worth nearly $1 trillion if he meets ambitious goals, including vastly expanding the company’s stock market valuation."
  },
  {
    "title": "Judge Orders Trump Administration to Fully Fund SNAP Benefits This Month",
    "link": "https://www.nytimes.com/2025/11/06/us/politics/snap-food-stamps-shutdown-trump.html",
    "summary": "The Justice Department later said it would appeal, leaving the program known as SNAP in limbo."
  },
  {
    "title": "Supreme Court Clears Way for Trump Transgender Passport Policy",
    "link": "https://www.nytimes.com/2025/11/06/us/politics/supreme-court-transgender-passport.html",
    "summary": "A lower court judge had temporarily blocked the administration’s policy requiring that passports reflect sex as found on an original birth certificate."
  },
  {
    "title": "Trump’s Tariffs Leave Swiss Farmers With Too Much Milk",
    "link": "https://www.nytimes.com/2025/11/07/business/switzerland-tariffs-trump-milk-cheese-cows.html",
    "summary": "The country’s dairy farmers produced a bumper harvest of milk, but higher U.S. duties have forced them to consider ways to cut back, including slaughtering cows."
  },
  {
    "title": "Trump Team Now Claims Its Trillions in Tariff Revenue Are ‘Incidental’",
    "link": "https://www.nytimes.com/2025/11/06/us/politics/trump-tariffs-revenue-supreme-court.html",
    "summary": "In arguments before the Supreme Court, the White House backed away from its claims that President Trump’s tariffs were about raising revenue."
  },
  {
    "title": "Egypt’s Grand Museum Is Finally Open. Now, ‘We Need Our Stuff Back.’",
    "link": "https://www.nytimes.com/2025/11/06/arts/design/grand-egyptian-museum-opening.html",
    "summary": "The museum’s most anticipated exhibit is the full 5,500 items from King Tutankhamen’s tomb. Egyptians say it’s time to experience their most precious antiquities at home."
  },
  {
    "title": "San Francisco Sees Nancy Pelosi as a Tireless Leader for the City",
    "link": "https://www.nytimes.com/2025/11/06/us/nancy-pelosi-san-francisco-retirement.html",
    "summary": "Representative Nancy Pelosi, after announcing her retirement, was praised by many San Franciscans for her tireless efforts on behalf of the city. Some of her work went unheralded."
  },
  {
    "title": "Who Will Replace Nancy Pelosi in Congress?",
    "link": "https://www.nytimes.com/2025/11/06/us/nancy-pelosi-retirement-replacement.html",
    "summary": "Two Democrats have already announced their campaigns to replace Representative Nancy Pelosi in her San Francisco district, and others may join the race soon."
  },
  {
    "title": "Republicans Retire Pelosi as a Villain, and Turn to Mamdani",
    "link": "https://www.nytimes.com/2025/11/06/us/politics/nancy-pelosi-zohran-mamdani-republicans.html",
    "summary": "Searching for another liberal boogeyman, Republicans have zeroed in on Zohran Mamdani. Whether their strategy will work in the midterms is less clear."
  },
  {
    "title": "Justice Dept. Is Said to Be Investigating D.C. Mayor Over Foreign Trip",
    "link": "https://www.nytimes.com/2025/11/06/us/politics/trump-muriel-bowser-qatar-investigation.html",
    "summary": "The investigation into Muriel E. Bowser, which is being handled by the U.S. attorney’s office in Washington, could face significant hurdles because of the known facts of the case and recent turmoil inside the Justice Department."
  },
  {
    "title": "Sexual Assault of Mexico’s President Exposes Challenges of Her Equality Push",
    "link": "https://www.nytimes.com/2025/11/06/world/americas/mexico-sheinbaum-women-abuse.html",
    "summary": "President Claudia Sheinbaum was groped on the street this week, in an episode that set off a national conversation about what has and has not changed since Mexico elected its first female leader."
  },
  {
    "title": "Mamdani Wants to Tax the Rich. Can He Persuade State Leaders?",
    "link": "https://www.nytimes.com/2025/11/06/nyregion/mamdani-hochul-childcare-tax.html",
    "summary": "After an impressive victory, Mayor-elect Zohran Mamdani now must find funds for his programs. His push for higher taxes puts Gov. Kathy Hochul, who faces a re-election fight, in a tough spot."
  },
  {
    "title": "Stefanik to Launch Campaign to Challenge Gov. Hochul in New York",
    "link": "https://www.nytimes.com/2025/11/06/nyregion/stefanik-governor.html",
    "summary": "Elise Stefanik, a Republican congresswoman, is a leading ally of President Trump who has gone to great lengths to criticize Ms. Hochul and Mayor-elect Zohran Mamdani."
  },
  {
    "title": "Anti-Defamation League Creates ‘Mamdani Monitor’ Tip Line for Antisemitism Reports",
    "link": "https://www.nytimes.com/2025/11/06/nyregion/zohran-mamdani-monitor-antisemitism-adl.html",
    "summary": "The group, which has taken aim at Mayor-elect Zohran Mamdani over his criticism of Israel, is facing backlash after unveiling a website where New Yorkers could report incidents of antisemitism."
  },
  {
    "title": "U.S. Sends Attack Aircraft to El Salvador Amid Regional Troop Buildup",
    "link": "https://www.nytimes.com/2025/11/06/world/americas/us-military-planes-el-salvador.html",
    "summary": "A New York Times analysis of satellite imagery and air traffic control communications found that U.S. military planes began operating out of the Central American country in mid-October."
  },
  {
    "title": "How Radio Traffic Let Us Track U.S. Drones in the Caribbean",
    "link": "https://www.nytimes.com/video/world/americas/100000010501858/how-radio-traffic-let-us-track-us-drones-in-the-caribbean.html",
    "summary": "The U.S. military’s buildup near Venezuela has been rapidly growing and changing. Riley Mellen, from Visual Investigations, describes what’s visible, and audible, about the deployment."
  },
  {
    "title": "Republicans Block Measure to Bar Military Strike on Venezuela",
    "link": "https://www.nytimes.com/2025/11/06/us/politics/republicans-military-strike-venezuela.html",
    "summary": "All but two G.O.P. senators voted against a resolution to stop the president from expanding his military campaign against drug traffickers to include land targets inside Venezuela."
  },
  {
    "title": "California Fire Victims Urge State to Hold Insurers Accountable",
    "link": "https://www.nytimes.com/2025/11/06/us/la-fires-insurance-homeowners.html",
    "summary": "“We thought we could trust the system,” said a homeowner in Altadena whose insurance policy was canceled only months before the January fires destroyed his home."
  },
  {
    "title": "Trump Officials Accused of Bullying Tactics to Kill a Climate Measure",
    "link": "https://www.nytimes.com/2025/11/06/climate/trump-climate-international-bullying.html",
    "summary": "Nations were poised to approve the first fee on pollution from ships. That’s when the Trump administration began the threats."
  },
  {
    "title": "Who’s Selling the $10 Million Gold Toilet? Signs Point to the Mets’ Owner.",
    "link": "https://www.nytimes.com/2025/11/06/arts/design/golden-toilet-10-million-dsteven-cohen-mets-owner.html",
    "summary": "The billionaire Steve Cohen is reported to have purchased the 18-karat flushable sculpture by Maurizio Cattelan in 2017. It’s now coming up for sale at Sotheby’s."
  },
  {
    "title": "Trump Announces Deal to Drop Obesity Drug Prices to as Little as $149 a Month",
    "link": "https://www.nytimes.com/2025/11/06/health/obesity-drug-prices-trump.html",
    "summary": "President Trump announced a deal with Eli Lilly and Novo Nordisk to lower prices on hugely popular weight-loss drugs for Medicare, Medicaid and American patients who pay with their own money."
  },
  {
    "title": "What Trump’s New Drug Pricing Deal Means for People With Obesity",
    "link": "https://www.nytimes.com/2025/11/06/health/trump-obesity-drug-prices-explainer.html",
    "summary": "The president’s agreement with drug companies involves a range of prices, depending on dose, product and how you’re paying."
  },
  {
    "title": "Will Hamas Lay Down Its Arms?",
    "link": "https://www.nytimes.com/2025/11/07/opinion/israel-gaza-hamas-disarming-peace-plan.html",
    "summary": "For a movement that built its legitimacy around what it called resistance, giving up its weapons is not just a tactical concession, it is an existential unraveling."
  },
  {
    "title": "I Photographed an Appalachian Family for 15 Years",
    "link": "https://www.nytimes.com/2025/11/06/opinion/appalachia-family-photographs-poverty.html",
    "summary": "A photographer spends 15 years documenting an Appalachian family and the constant pressure of poverty in their lives."
  },
  {
    "title": "Lawsuits Blame ChatGPT for Suicides and Harmful Delusions",
    "link": "https://www.nytimes.com/2025/11/06/technology/chatgpt-lawsuit-suicides-delusions.html",
    "summary": "Seven complaints, filed on Thursday, claim the popular chatbot encouraged dangerous discussions and led to mental breakdowns."
  },
  {
    "title": "Antisemitism Task Force Severs Ties With the Heritage Foundation",
    "link": "https://www.nytimes.com/2025/11/06/us/politics/heritage-foundation-antisemitism-task-force.html",
    "summary": "The move comes as the venerable conservative think tank is roiled by turmoil caused by its leader’s defense of a Tucker Carlson interview with a white nationalist."
  },
  {
    "title": "Cleaning Woman Killed in Indiana Shooting After Arriving at Wrong Home",
    "link": "https://www.nytimes.com/2025/11/06/us/whitestown-indiana-shooting-cleaner-dead.html",
    "summary": "The shooting of the woman, an immigrant from Guatemala, took place on Wednesday in Indiana, a state with a “stand your ground” law."
  },
  {
    "title": "Woman Gets 15 Years to Life in Actress’s Death From Silicone Shots",
    "link": "https://www.nytimes.com/2025/11/06/us/butt-lady-sentenced-california.html",
    "summary": "Cindyana Santangelo had an embolism after receiving injections of silicone oil into her buttocks by Libby Adame, the second fatal augmentation procedure connected to her."
  }
]