[
  {
    "title": "Federal Courts Undercut Trump’s Mass Deportation Campaign",
    "link": "https://www.nytimes.com/2026/02/01/us/habeas-corpus-detainee-immigrant-trump-federal-courts.html",
    "summary": "A policy intended to keep immigrants detained indefinitely has led to a deluge of lawsuits, overwhelming some federal courts and resulting in many releases."
  },
  {
    "title": "How Alex Pretti’s Death Became a National Tipping Point",
    "link": "https://www.nytimes.com/2026/02/01/us/alex-pretti-minneapolis.html",
    "summary": "Several factors converged to force a remarkable shift in the federal government’s aggressive efforts in Minnesota."
  },
  {
    "title": "Facing Immigration Backlash, Trump Called Schumer to Cut a Deal",
    "link": "https://www.nytimes.com/2026/01/31/us/politics/trump-schumer-deal.html",
    "summary": "The president and the top Senate Democrat, who are often at each other’s throats, agreed to try to keep the government open and to start talks on new limits on federal immigration agents."
  },
  {
    "title": "They Said They Weren’t Close to Epstein. New Documents Show Otherwise.",
    "link": "https://www.nytimes.com/2026/01/31/us/epstein-powerful-men.html",
    "summary": "Materials released by the Justice Department revealed that leading business and political figures had enduring relationships with the disgraced financier."
  },
  {
    "title": "‘Melania’ Arrives With Strong Box Office Showing for a Documentary",
    "link": "https://www.nytimes.com/2026/01/31/business/melania-documentary-box-office.html",
    "summary": "Amazon backed up the Brink’s trucks for the vanity film, resulting in weekend ticket sales of about $7 million in North America, enough for third place."
  },
  {
    "title": "Starmer Urges Former Prince Andrew to Testify to Congress Over Epstein Ties",
    "link": "https://www.nytimes.com/2026/02/01/world/europe/andrew-mountbatten-windsor-jeffrey-epstein.html",
    "summary": "Mr. Mountbatten-Windsor was stripped of his royal titles in October by his brother King Charles III because of growing questions around his links to Mr. Epstein."
  },
  {
    "title": "Ukraine Peace Talks Delayed After Russia and U.S. Meet",
    "link": "https://www.nytimes.com/2026/02/01/world/europe/ukraine-russia-us-peace-talks.html",
    "summary": "It was unclear why the latest round of negotiations, which had been expected on Sunday, were postponed for several days."
  },
  {
    "title": "Democratic Upset in Deep Red Texas District Rattles Republicans",
    "link": "https://www.nytimes.com/2026/02/01/us/democratic-upset-texas-district-republicans.html",
    "summary": "A Democrat won a state legislative special election in a district that President Trump carried by 17 percentage points, unnerving Republicans in Texas and beyond."
  },
  {
    "title": "Gavin Newsom Memoir Describes Difficult Childhood, Contrary to Image",
    "link": "https://www.nytimes.com/2026/02/01/us/politics/with-new-memoir-newsom-wants-americans-to-know-he-struggled-growing-up.html",
    "summary": "Mr. Newsom, the California governor and a potential presidential candidate, writes that the privileged caricature of his background is mistaken."
  },
  {
    "title": "Takeaways From Gavin Newsom’s New Memoir, ‘Young Man in a Hurry’",
    "link": "https://www.nytimes.com/2026/02/01/us/politics/gavin-newsom-memoir-takeaways.html",
    "summary": "His introspective memoir tries to challenge the conventional wisdom about his upbringing, explores his marriages and airs a little dirty laundry — but says relatively little about politics."
  },
  {
    "title": "The Richest 2026 Players: A.I., Crypto, Pro-Israel Groups and Trump",
    "link": "https://www.nytimes.com/2026/02/01/us/politics/ai-crypto-trump-super-pac-israel-2026-midterms.html",
    "summary": "All have amassed enormous war chests, new filings show, making them the financial wild cards of this year’s midterm elections and feared political spenders."
  },
  {
    "title": "At a Grammys Light on Drama, All Eyes Will Be on Bad Bunny",
    "link": "https://www.nytimes.com/2026/01/31/arts/music/grammys-bad-bunny-kendrick-lamar-lady-gaga.html",
    "summary": "Kendrick Lamar has the most nominations on Sunday, followed by Lady Gaga. But one week before his Super Bowl halftime show, the Puerto Rican superstar could make history."
  },
  {
    "title": "R&B May Have a Major Grammys Night. Leon Thomas Is Ready.",
    "link": "https://www.nytimes.com/2026/01/31/arts/music/leon-thomas-mutt-grammys.html",
    "summary": "The 32-year-old performer has spent years coming up as a singer and songwriter. On Sunday, he’ll compete for two top awards, album of the year and best new artist."
  },
  {
    "title": "2026 Grammys: How to Watch, Red Carpet Time and Stream Details",
    "link": "https://www.nytimes.com/2026/02/01/arts/music/grammys-2026-when-time-how-watch.html",
    "summary": "A guide to everything you need to know for the 68th annual awards on Sunday night."
  },
  {
    "title": "Winter Storm Hits the Carolinas, Bringing Dangerous Ice and Snow",
    "link": "https://www.nytimes.com/2026/01/31/us/winter-storm-snow-carolina-north-south.html",
    "summary": "A foot of snow fell in some parts of the region, as freezing temperatures were predicted to linger for a wide swath of the Southeast."
  },
  {
    "title": "Mamdani Announces New Shelter Beds as Death Toll During Cold Rises to 14",
    "link": "https://www.nytimes.com/2026/02/01/nyregion/mamdani-cold-deaths-shelters-nyc.html",
    "summary": "The 50 units in Upper Manhattan will house single people who may be reluctant to stay in group shelters."
  },
  {
    "title": "Could the Hudson River Freeze Over?",
    "link": "https://www.nytimes.com/2026/01/30/weather/hudson-river-new-york-frozen.html",
    "summary": "New York City is icy and cold right now, but you’re probably not going to be able to walk to New Jersey any time soon."
  },
  {
    "title": "Snow Drought in the West Reaches Record Levels",
    "link": "https://www.nytimes.com/2026/02/01/science/snow-drought-climate-change-west.html",
    "summary": "Warm temperatures and extremely low snowfall threaten water resources for the year."
  },
  {
    "title": "This Hasidic Reporter Has a Few Questions for Mayor Mamdani",
    "link": "https://www.nytimes.com/2026/02/01/nyregion/jacob-kornbluh-mamdani-hasidic-jewish-reporter.html",
    "summary": "Jacob Kornbluh, a former lox-slinger with no degrees, became an unlikely fixture in New York politics. Now he is chasing the story of a lifetime, inside the new City Hall."
  },
  {
    "title": "My Patient Was Dying. His Wife Would Not Accept It.",
    "link": "https://www.nytimes.com/2026/02/01/opinion/hospital-doctors-difficult-patients.html",
    "summary": "How doctors can better navigate difficult patients and families."
  },
  {
    "title": "Trump Has Overwhelmed Himself",
    "link": "https://www.nytimes.com/2026/02/01/opinion/trump-minneapolis-power-muzzle-velocity.html",
    "summary": "This is a presidency that is, by any measure, failing."
  },
  {
    "title": "How Trump Took Up the ‘Christian Genocide’ Cause in Nigeria",
    "link": "https://www.nytimes.com/2026/02/01/world/africa/nigeria-christians-trump.html",
    "summary": "A yearslong effort to convince Washington of religious persecution is shifting foreign policy toward the West African nation, with major consequences."
  },
  {
    "title": "X.J. Kennedy, a Poet of Wit Who Clung to Rhyme and Meter, Dies at 96",
    "link": "https://www.nytimes.com/2026/02/01/books/xj-kennedy-dead.html",
    "summary": "Spurning the free verse of many of his contemporaries, he held to an older tradition. He also wrote spirited poems for children."
  },
  {
    "title": "Woman Says Tal Alexander Assaulted Her When She Was 13 Years Old",
    "link": "https://www.nytimes.com/2026/02/01/nyregion/alexanders-trial-victim-abuse.html",
    "summary": "The woman told police she was at a party when she was drugged and assaulted by five boys, including Mr. Alexander, who is currently on trial for sex trafficking."
  },
  {
    "title": "What to Know About the Rafah Border Crossing in Gaza",
    "link": "https://www.nytimes.com/2026/02/01/world/middleeast/rafah-crossing-gaza-egypt-israel.html",
    "summary": "The only crossing that connects Gaza with Egypt is reopening after nearly a year of closures. This will allow residents to leave for medical care or return to homes and families in the territory."
  }
]