[
  {
    "title": "Europeans Worry Trump Will Pressure Zelensky After Meeting With Putin",
    "link": "https://www.nytimes.com/2025/08/16/world/europe/putin-trump-alaska-summit-ukraine.html",
    "summary": "With no strategy of their own for ending the war, the continent’s leaders are anxious that President Trump will force Kyiv to accept terms that favor Russia too much."
  },
  {
    "title": "6 Takeaways From Trump’s Meeting With Putin",
    "link": "https://www.nytimes.com/2025/08/15/us/politics/trump-putin-meeting-takeaways.html",
    "summary": "While no deal was announced, the Russian leader secured some wins and left on good terms with the U.S. president."
  },
  {
    "title": "The Power of the Trump-Putin Presidential Photo Op",
    "link": "https://www.nytimes.com/2025/08/16/world/europe/trump-putin-red-carpet-photo-op.html",
    "summary": "At their meeting in Alaska, President Trump and President Vladimir V. Putin of Russia both understood the power of the summit’s imagery, even if their goals were not accomplished."
  },
  {
    "title": "Trump Administration Backs Off New Attempt to Widen Control of D.C. Police",
    "link": "https://www.nytimes.com/2025/08/15/us/washington-dc-police-trump-lawsuit.html",
    "summary": "The chief will remain after a lawsuit challenged the Justice Department’s attempt to install a new leader as part of an effort to put the agency under federal control."
  },
  {
    "title": "Where D.C. Crime Is Bad, Residents Question Trump’s Motives for Federal Takeover",
    "link": "https://www.nytimes.com/2025/08/16/us/politics/trump-washington-crime.html",
    "summary": "The president might have found allies in Southeast Washington, where violent crime has long vexed residents. But when he described the city as “disgusting,” with “roving mobs,” his remarks left those looking for help cold."
  },
  {
    "title": "Who’s in Charge of D.C.? Here’s What the Law Says.",
    "link": "https://www.nytimes.com/2025/08/15/upshot/washington-dc-home-rule-explained.html",
    "summary": "The city’s limited self-governance set the stage for the president’s push to take over the police."
  },
  {
    "title": "Government Shuts Down Air Canada Strike That Grounded Hundreds of Flights",
    "link": "https://www.nytimes.com/2025/08/16/world/canada/air-canada-strike.html",
    "summary": "A walkout by flight attendants ended after about 12 hours with the imposition of binding arbitration. But getting travel back to normal will take days."
  },
  {
    "title": "The Air Canada Strike: Here’s What to Know About Flight Cancellations and More",
    "link": "https://www.nytimes.com/2025/08/15/travel/air-canada-strike-flight-cancellations.html",
    "summary": "The carrier’s flight attendants are now on strike, disrupting plans for 130,000 travelers a day. Here’s what to know if your flight is affected."
  },
  {
    "title": "‘South Park’ Is Crude and Childish. That May Make It Perfect for This Moment.",
    "link": "https://www.nytimes.com/2025/08/16/arts/television/south-park-trump-administration-paramount.html",
    "summary": "For decades, “South Park” has been crude, cynical and childish. That may be what makes it perfect for this moment."
  },
  {
    "title": "Environmental Groups Face ‘Generational’ Setbacks Under Trump",
    "link": "https://www.nytimes.com/2025/08/16/climate/environmental-strategy-trump.html",
    "summary": "As President Trump dismantles the country’s efforts to fight climate change, environmental groups are back on their heels."
  },
  {
    "title": "One Way Gen Z Finds Stress Relief? Overspending on Treats.",
    "link": "https://www.nytimes.com/2025/08/16/business/gen-z-treat-spending.html",
    "summary": "Any excuse is good enough for young adults to treat themselves, whether it’s failing an exam, getting a “job well done” from a boss or simply washing the dishes."
  },
  {
    "title": "Unraveling in Las Vegas, Then a Massacre in New York",
    "link": "https://www.nytimes.com/2025/08/16/nyregion/park-avenue-gunman-profile.html",
    "summary": "Shane Tamura was barely known in the city where he lived, working at night and navigating mental health crises. He drove 2,500 miles east to commit New York’s deadliest shooting in a quarter-century."
  },
  {
    "title": "Criminal Fights Crime",
    "link": "https://www.nytimes.com/2025/08/16/opinion/criminal-fights-crime.html",
    "summary": "Democrats should remember: “It’s the crime, stupid!”"
  },
  {
    "title": "Trump vs. the U.S. Economy",
    "link": "https://www.nytimes.com/2025/08/16/opinion/ezra-klein-podcast-natasha-sarin.html",
    "summary": "Natasha Sarin walks through how Trump’s tariffs, the A.I. boom and the leadership shake-up at the Bureau of Labor Statistics are impacting the economy."
  },
  {
    "title": "No Deal",
    "link": "https://www.nytimes.com/2025/08/16/briefing/no-deal.html",
    "summary": "President Trump came home empty-handed."
  },
  {
    "title": "Mamdani’s Video Savvy: Easy to Envy, Hard to Duplicate",
    "link": "https://www.nytimes.com/2025/08/16/nyregion/cuomo-adams-mamdani-social-media.html",
    "summary": "Former Gov. Andrew M. Cuomo and Mayor Eric Adams are trying to mimic Assemblyman Zohran Mamdani’s buzzy online videos in the New York City mayor’s race."
  },
  {
    "title": "New Statue of Martin Luther King Jr. Draws Criticisms Over Its Proportions",
    "link": "https://www.nytimes.com/2025/08/16/us/mlk-statue-florida.html",
    "summary": "A statue in Florida has prompted complaints about its shoes, arm and head but also a discussion about art and representations of historic figures."
  },
  {
    "title": "Why Is the U.S. Offering a $5 Million Reward for a Haitian Gang Leader?",
    "link": "https://www.nytimes.com/2025/08/16/us/haiti-gang-barbeque-bounty.html",
    "summary": "A major bounty has been offered for help apprehending Jimmy Cherizier, a gang leader known as “Barbecue.” Experts have doubts about whether it will make any difference."
  }
]