[
  {
    "title": "Democrats Scale Back Shutdown Demands, but G.O.P. Digs In",
    "link": "https://www.nytimes.com/2025/11/07/us/politics/shutdown-democrats-schumer-thune.html",
    "summary": "After weeks of stalemate, Senate Democrats said they were willing to reopen the government in exchange for a one-year extension of health care subsidies. Republicans ruled it out."
  },
  {
    "title": "Judge Blocks National Guard From Portland and Says Trump Overstepped His Authority",
    "link": "https://www.nytimes.com/2025/11/07/us/politics/portland-oregon-national-guard.html",
    "summary": "With her temporary block expiring, Judge Karin Immergut said the Trump administration had failed to prove that protesters were hampering President Trump’s policies."
  },
  {
    "title": "Immigration Agents Arrest Man in L.A. Raid and Drive Off With His Toddler",
    "link": "https://www.nytimes.com/2025/11/07/us/immigration-raid-los-angeles-toddler.html",
    "summary": "The child was later reunited with her grandmother, but the episode alarmed immigrant rights groups. The father, a U.S. citizen, faces a gun possession charge."
  },
  {
    "title": "How Courts Have Ruled in Challenges to Trump’s National Guard Deployments",
    "link": "https://www.nytimes.com/2025/10/10/us/federal-courts-national-guard-trump.html",
    "summary": "Federal courts across the country have heard legal challenges to the mobilization of troops in Chicago, Portland, Ore., Los Angeles and other cities. Here’s how judges have ruled, so far."
  },
  {
    "title": "New York Prepares for a Potential Trump Immigration Crackdown",
    "link": "https://www.nytimes.com/2025/11/07/nyregion/nyc-immigration-raids-trump-mamdani.html",
    "summary": "The election of Zohran Mamdani as mayor has stoked speculation that President Trump might move to send forces into the city."
  },
  {
    "title": "A Decade Later, Supreme Court Is Asked to Revisit Same-Sex Marriage Decision",
    "link": "https://www.nytimes.com/2025/11/07/us/politics/supreme-court-same-sex-marriage.html",
    "summary": "Kim Davis, a Kentucky county clerk once jailed for refusing to issue same-sex marriage licenses, has asked the court to reconsider its landmark 2015 opinion."
  },
  {
    "title": "Did Trump’s Supreme Court Tariffs Brief Include a Strategic Blunder?",
    "link": "https://www.nytimes.com/2025/11/07/us/trump-statements-supreme-court-tariffs.html",
    "summary": "The justices are generally reluctant to take account of a president’s public statements. But extensive quotes from Mr. Trump in a key filing may change the legal calculus."
  },
  {
    "title": "A Light in Very Dark Days: Nancy Pelosi and AIDS",
    "link": "https://www.nytimes.com/2025/11/07/us/politics/nancy-pelosi-aids-lgbtq.html",
    "summary": "As Ms. Pelosi announced her retirement, she was celebrated for her long tenure in Washington. But back home, she was remembered for showing up at a terrifying moment when others turned away."
  },
  {
    "title": "Who Will Replace Nancy Pelosi in Congress? London Breed Is Among Those Eyeing the Seat.",
    "link": "https://www.nytimes.com/2025/11/06/us/nancy-pelosi-retirement-replacement.html",
    "summary": "Two Democrats have already announced their campaigns to replace Representative Nancy Pelosi in her San Francisco district. Ms. Breed and others may join the race soon."
  },
  {
    "title": "Inside China’s Quest to Defy Aging with Longevity Labs and ‘Immortality Islands’",
    "link": "https://www.nytimes.com/2025/11/08/world/asia/china-aging-longevity-science.html",
    "summary": "Longevity labs, “immortality islands” and grapeseed pills are part of China’s national project to conquer aging, despite sometimes shaky science and extravagant claims."
  },
  {
    "title": "James D. Watson, Co-Discoverer of the Structure of DNA, Is Dead at 97",
    "link": "https://www.nytimes.com/2025/11/07/science/james-watson-dead.html",
    "summary": "His decoding of the blueprint for life with Francis H.C. Crick made him one of the most important scientists of the 20th century. He wrote a celebrated memoir and later ignited an uproar with racist views."
  },
  {
    "title": "The DNA Helix Changed How We Thought About Ourselves",
    "link": "https://www.nytimes.com/2025/11/07/science/watson-dna-humanity.html",
    "summary": "“The laws of inheritance are quite unknown,” Charles Darwin acknowledged in 1859. The discovery of DNA’s shape altered how we conceived of life itself."
  },
  {
    "title": "Hegseth Is Purging Military Leaders With Little Explanation",
    "link": "https://www.nytimes.com/2025/11/07/us/politics/hegseth-firing-military-leaders.html",
    "summary": "The moves to fire or sideline generals and admirals are without precedent in recent decades and have rattled the top brass."
  },
  {
    "title": "What to Know About Trump’s Transgender Passport Policy After Supreme Court Ruling",
    "link": "https://www.nytimes.com/2025/11/07/travel/supreme-court-transgender-passport-policy.html",
    "summary": "A policy that requires passports to display a person’s sex assigned at birth will come into play during renewals and first-time applications."
  },
  {
    "title": "What I Learned From the ‘New Globalists’ of an Optimistic Nation",
    "link": "https://www.nytimes.com/2025/11/08/world/asia/what-i-learned-from-the-new-globalists-of-an-optimistic-nation.html",
    "summary": "Few countries are excited about globalization anymore, but Vietnam is still into it — wholeheartedly. Do the reasons go beyond economic growth?"
  },
  {
    "title": "In Cozying Up to Trump, Leaders Hedge Their Reliance on Moscow and Beijing",
    "link": "https://www.nytimes.com/2025/11/07/us/politics/central-asia-leaders-trump.html",
    "summary": "President Trump has made it easier for countries that are close to Russia and China to build ties with the United States. Those countries are embracing the opportunity."
  },
  {
    "title": "Trump Signals Openness to Exempting Hungary from Russian Oil Sanctions",
    "link": "https://www.nytimes.com/2025/11/07/world/europe/trump-orban-meeting-russia-sanctions.html",
    "summary": "Despite a chummy relationship, new U.S. penalties on Russian energy were likely to be a sticking point as President Trump and Prime Minister Viktor Orban of Hungary met."
  },
  {
    "title": "Is A.I. a Journalist or Just a Newsroom Tool?",
    "link": "https://www.nytimes.com/2025/11/07/business/media/ai-news-media.html",
    "summary": "A.I. has set off industrywide soul-searching about its potential and pitfalls."
  },
  {
    "title": "The Farmers’ Almanac Succumbs to the Digital Age",
    "link": "https://www.nytimes.com/2025/11/07/us/farmers-almanac-shutting-down.html",
    "summary": "One of two major American almanacs is ceasing publication after more than two centuries of predicting the weather and offering tidbits of wisdom."
  },
  {
    "title": "Canada Culls Hundreds of Ostriches as a Court and a Kennedy Fail to Save Them",
    "link": "https://www.nytimes.com/2025/11/07/world/canada/canada-ostrich-cull-rfk-jr.html",
    "summary": "The birds, exposed to the avian flu, were killed after Canada’s Supreme Court refused to hear an appeal and a rescue effort by Robert F. Kennedy Jr. fell short."
  },
  {
    "title": "Why Democrats Could Win the Redistricting War",
    "link": "https://www.nytimes.com/2025/11/07/upshot/democrats-redistricting-gerrymanders.html",
    "summary": "Amending state constitutions seemed like a long shot, but Virginia’s move suggests more blue states may be willing to try, opening new possibilities."
  },
  {
    "title": "A Democrat Pushing 80 Confronts the Young(er) and Restless",
    "link": "https://www.nytimes.com/2025/11/07/us/politics/massachusetts-senate-markey-moulton-pressley.html",
    "summary": "A fight brewing in Massachusetts could preview Democrats’ age battles."
  },
  {
    "title": "Just How Bad Was Trump’s Very Bad Night?",
    "link": "https://www.nytimes.com/2025/11/07/opinion/ezra-klein-podcast-election.html",
    "summary": "Ezra Klein and Aaron Retica discuss whether affordability is the Democrats’ winning message, Trump’s politics of cruelty and how liberalism can win right now."
  },
  {
    "title": "Trump Is Resurrecting the Gatsby Era. The Hangover Could Be Brutal.",
    "link": "https://www.nytimes.com/2025/11/07/opinion/donald-trump-great-gatsby-roating-20s-sec.html",
    "summary": "Donald Trump’s recent Gatsby party encapsulates this moment of economic peril."
  },
  {
    "title": "Rise in Kidney Disease Tied to Other Chronic Conditions, Study Finds",
    "link": "https://www.nytimes.com/2025/11/07/well/kidney-disease-rise-study.html",
    "summary": "Rates of the disease have been rising for decades, driven in part by diabetes and high blood pressure."
  },
  {
    "title": "New York State Officials Approve Proposal for Controversial Underwater Gas Pipeline",
    "link": "https://www.nytimes.com/2025/11/07/nyregion/underwater-gas-pipeline-nyc-approved.html",
    "summary": "The contentious proposal, previously rebuffed by state regulators who expressed environmental concerns, was deemed acceptable on Friday."
  },
  {
    "title": "Virginia Teen Narrowly Defeats His Former Civics Teacher in County Election",
    "link": "https://www.nytimes.com/2025/11/07/us/politics/surry-county-virginia-supervisor-election.html",
    "summary": "Cameran Drew, 19, defeated his former high school government teacher, Kenneth Bell, by 10 votes for a seat on the Surry County Board of Supervisors this week. There are no hard feelings."
  },
  {
    "title": "Biden Warns of a ‘Very, Very Dark Moment’ as He Hits Out at Trump",
    "link": "https://www.nytimes.com/2025/11/07/us/politics/biden-trump-omaha-nebraska.html",
    "summary": "The former president, now a far less popular figure in his party, appeared in Nebraska for an overtly political speech that slammed his successor."
  }
]