[
  {
    "title": "India, Once America’s Counterweight to China, Is Now Facing Trump’s Wrath",
    "link": "https://www.nytimes.com/2025/08/06/business/india-china-trump-tariffs.html",
    "summary": "With threats of tariffs up to 50 percent, President Trump seems to be scrapping America’s plan to turn India into a counterweight to China, declaring instead that it is a “dead economy.”"
  },
  {
    "title": "Trump to Announce Additional $100 Billion Apple Investment in U.S.",
    "link": "https://www.nytimes.com/2025/08/06/us/politics/trump-apple-investment.html",
    "summary": "The White House said the pledge would bring more of the company’s supply chain and advanced manufacturing to the United States."
  },
  {
    "title": "What to Know About India’s Oil Trade With Russia",
    "link": "https://www.nytimes.com/2025/08/05/business/india-russia-oil.html",
    "summary": "President Trump accused India of aiding Moscow’s war on Ukraine by purchasing Russian energy, derailing trade talks between India and the United States."
  },
  {
    "title": "China Turns to A.I. in Information Warfare",
    "link": "https://www.nytimes.com/2025/08/06/us/politics/china-artificial-intelligence-information-warfare.html",
    "summary": "Documents examined by researchers show how one company in China has collected data on members of Congress and other influential Americans."
  },
  {
    "title": "Uber’s Festering Sexual Assault Problem",
    "link": "https://www.nytimes.com/2025/08/06/business/uber-sexual-assault.html",
    "summary": "The company has tested tools that make rides safer, court records show. Measures to stem the violence have been set aside in favor of protecting the company’s business."
  },
  {
    "title": "Their Last Love Token: A Dinosaur Rebuilt From Its Excavated Bones",
    "link": "https://www.nytimes.com/2025/08/06/arts/triceratops-dinosaur-paleontologist-barry-james.html",
    "summary": "When his wife died, the paleontologist Barry James poured his grief into the reconstruction of a triceratops skeleton that they had started together."
  },
  {
    "title": "The ‘Hamilton’ Effect: 10 Revolutionary Years on Broadway",
    "link": "https://www.nytimes.com/2025/08/06/theater/hamilton-broadway-lin-manuel-miranda.html",
    "summary": "Lin-Manuel Miranda’s much-loved musical opened on Broadway a decade ago, ushering in a new era of race-conscious casting, audience outreach and even stardom."
  },
  {
    "title": "Trump Spending Bill Means Big Cuts for New Mexico",
    "link": "https://www.nytimes.com/2025/08/06/us/new-mexico-federal-budget-cuts.html",
    "summary": "Health care. Food. Outdoor recreation. Wildfire protection. The arts. President Trump’s new domestic policy law will have wide-ranging effects in New Mexico, which depends heavily on federal funding."
  },
  {
    "title": "Trump Amps Up an Obama Strategy to Crack Down on Colleges",
    "link": "https://www.nytimes.com/2025/08/06/us/politics/trump-universities-title-ix-vi-obama.html",
    "summary": "Under Obama, federal rules pushed universities to build new bureaucracies to address sexual misconduct. Trump is doubling down on that tactic for antisemitism claims."
  },
  {
    "title": "Stanford Newspaper Challenges Legal Basis for Student Deportations",
    "link": "https://www.nytimes.com/2025/08/06/us/politics/stanford-lawsuit-student-activist-deportations.html",
    "summary": "A new lawsuit brought by a First Amendment watchdog group argues that the use of a rarely invoked immigration law to target pro-Palestinian demonstrators is unconstitutional."
  },
  {
    "title": "Despite Opposition, Netanyahu’s Security Cabinet to Discuss Gaza Military Push",
    "link": "https://www.nytimes.com/2025/08/06/world/middleeast/israel-gaza-occupation-netanyahu.html",
    "summary": "Israeli Prime Minister Benjamin Netanyahu will meet with a group of senior ministers on Thursday as the families of the hostages warn that moving into new areas could endanger the captives."
  },
  {
    "title": "How One Company Maintained a Monopoly on U.S. Fire Retardant",
    "link": "https://www.nytimes.com/2025/08/06/business/fire-retardant-monopoly.html",
    "summary": "Perimeter Solutions sought to undercut rivals, leaving federal officials worried about their reliance on a single company for a crucial product."
  },
  {
    "title": "Wildfire In Wet Washington State Is Changing Under Climate Change",
    "link": "https://www.nytimes.com/2025/08/06/climate/washington-state-wildfire-risk.html",
    "summary": "The famously rainy state is facing longer, hotter and drier fire seasons, raising the risk of a mammoth fire that will be nearly impossible to fight. All the state can do is prepare."
  },
  {
    "title": "Aldi’s Passionate, Cultlike Following Fuels Its Rapid Expansion Plans",
    "link": "https://www.nytimes.com/2025/08/06/business/aldi-grocery-expansion.html",
    "summary": "“It feels like I’m at a bougie store, but I’m not paying bougie prices,” one shopper said of the discount grocer, which is set to open hundreds of stores as consumers look to save and buy organic."
  },
  {
    "title": "Is the Tampa Bay Rays’ Owner Brilliant or a Failure?",
    "link": "https://www.nytimes.com/2025/08/06/magazine/tampa-rays-stu-sternberg-baseball.html",
    "summary": "Stu Sternberg used quantitative wizardry to turn the Tampa Bay Rays into a perennial contender. But the fans were the one equation he could never solve."
  },
  {
    "title": "They Let Their Children Cross the Street and Now They’re Felons",
    "link": "https://www.nytimes.com/2025/08/06/opinion/children-traffic-death-parents.html",
    "summary": "They went to jail when their boy was killed. Why don’t road planners bear some guilt?"
  },
  {
    "title": "Donald Trump and John Roberts Have a Lot in Common",
    "link": "https://www.nytimes.com/2025/08/06/opinion/supreme-court-voting-rights-act.html",
    "summary": "The Supreme Court may extinguish a law that more than any other made the promise of American democracy a reality."
  },
  {
    "title": "Raucous Town Halls",
    "link": "https://www.nytimes.com/2025/08/06/briefing/republican-town-halls.html",
    "summary": "We explore the new political danger of a centuries-old format."
  },
  {
    "title": "5 Soldiers Shot at Fort Stewart in Georgia",
    "link": "https://www.nytimes.com/2025/08/06/us/fort-stewart-airfield-active-shooter.html",
    "summary": "The gunman was quickly apprehended, the authorities said and a lockdown of the base was lifted."
  },
  {
    "title": "Helicopter Crash Kills Ghana Defense and Environment Ministers",
    "link": "https://www.nytimes.com/2025/08/06/world/africa/ghana-helicopter-crash-defense-officials.html",
    "summary": "The helicopter had taken off from Accra, the capital, en route to a mining conference when it went “off the radar,” the armed forces said."
  },
  {
    "title": "Video Forces Pakistan to Confront ‘Honor Killings’ and Gender Violence",
    "link": "https://www.nytimes.com/2025/08/06/world/asia/pakistan-honor-killing-gender-violence.html",
    "summary": "Women in Pakistan die every day for supposedly dishonoring their families, and arrests are rare. But Bano Bibi’s defiant last words were caught on video."
  },
  {
    "title": "Alec Luhn, Missing American Journalist, Found Alive in Norway",
    "link": "https://www.nytimes.com/2025/08/06/world/europe/alec-luhn-norway-found.html",
    "summary": "Rescue workers found Mr. Luhn, a journalist who had not been heard from for days after setting off alone in a Norwegian national park."
  }
]