[
  {
    "title": "Appeals Court Blocks Trump’s Use of Alien Enemies Act to Deport Venezuelans",
    "link": "https://www.nytimes.com/2025/09/03/us/politics/trump-alien-enemies-act-court.html",
    "summary": "The ruling was a setback for the Trump administration on the mass deportation of immigrants, one of its domestic policy goals."
  },
  {
    "title": "L.A. Ruling Complicates Trump’s Threats to Send Troops to More Cities",
    "link": "https://www.nytimes.com/2025/09/02/us/trump-military-cities.html",
    "summary": "As Democratic cities brace for possible military deployments, Democratic governors see in a lower-court ruling the potential for legal protections."
  },
  {
    "title": "Google Must Share Search Data With Rivals, Judge Rules in Antitrust Case",
    "link": "https://www.nytimes.com/2025/09/02/technology/google-search-antitrust-decision.html",
    "summary": "Judge Amit P. Mehta said the company must hand over some of its search data to rivals, but did not force other big changes the U.S. wanted."
  },
  {
    "title": "What Will Happen to Google After the Antitrust Ruling?",
    "link": "https://www.nytimes.com/2025/09/02/technology/google-antitrust-case-ruling.html",
    "summary": "The judge’s decision positions Google to keep its search business running largely without interruption."
  },
  {
    "title": "What the Fixes for Google’s Search Monopoly Mean for You: It’s a ‘Nothingburger’",
    "link": "https://www.nytimes.com/2025/09/02/technology/personaltech/what-the-fixes-for-googles-search-monopoly-mean-for-you-its-a-nothingburger.html",
    "summary": "A federal judge’s remedy stops short of making meaningful changes to how we use our phones, computers and the web."
  },
  {
    "title": "Trump Responds to Rumors About His Health During Oval Office Press Conference",
    "link": "https://www.nytimes.com/2025/09/02/us/politics/trump-health-bruise-conspiracies.html",
    "summary": "In the world of presidential health, distrust and speculation run so rampant that even Mr. Trump’s online assurance that he was fine was immediately explained away as part of a cover-up."
  },
  {
    "title": "Cook’s Lawyers Fire Back at Trump’s Claim of Vast Powers to Oust Fed Officials",
    "link": "https://www.nytimes.com/2025/09/02/business/trump-fed-lisa-cook.html",
    "summary": "Lisa Cook is seeking a swift ruling on her ability to remain on the Federal Reserve’s Board of Governors as the case is litigated."
  },
  {
    "title": "Xi Parades Firepower to Signal That China Won’t Be Bullied Again",
    "link": "https://www.nytimes.com/2025/09/02/world/asia/xi-putin-kim-parade.html",
    "summary": "The parade, attended by the leaders of Russia and North Korea, had a defiant message. President Trump fired back, accusing Xi Jinping of ignoring America’s role in World War II."
  },
  {
    "title": "Kim Jong-un Brings a His Daughter and Potential Heir, Ju-ae, to Beijing",
    "link": "https://www.nytimes.com/2025/09/02/world/asia/kim-jong-un-ju-ae-china.html",
    "summary": "Kim Ju-ae’s presence at a major gathering of world leaders is the latest sign that North Korea’s dictator considers her a successor, analysts said."
  },
  {
    "title": "China’s Military Spectacle",
    "link": "https://www.nytimes.com/2025/09/03/world/asia/china-military-parade.html",
    "summary": "China used a parade of fighter jets, missiles and goose-stepping troops to honor the country’s wartime sacrifice and issue a defiant warning to rivals."
  },
  {
    "title": "A Hidden Camera Protest Turned the Tables on China’s Surveillance State",
    "link": "https://www.nytimes.com/2025/09/02/business/china-chongqing-protest.html",
    "summary": "Before fleeing China, an activist in Chongqing staged an elaborate one-man demonstration against the Communist Party that doubled as performance art."
  },
  {
    "title": "After Name Mix-Up, Online Rage Is Directed at Wrong C.E.O. in U.S. Open Hat Scandal",
    "link": "https://www.nytimes.com/2025/09/02/world/europe/us-open-drog-bruk-ceo-szczerek.html",
    "summary": "The chief executive of the Polish company Drogbruk was captured on video snatching a hat in front of a child. The head of Drog-Bruk, a different firm, is getting attacked. The executives also have similar surnames."
  },
  {
    "title": "House Oversight Panel Releases Some Epstein Files as Pressure Mounts",
    "link": "https://www.nytimes.com/2025/09/02/us/politics/epstein-files-release-house-oversight.html",
    "summary": "The move came as Republican leaders pressed colleagues not to force a vote on disclosing all the material. Most of what was released on Tuesday was not new."
  },
  {
    "title": "Trump Says U.S. Attacked Boat Carrying Venezuelan Gang Members, Killing 11",
    "link": "https://www.nytimes.com/2025/09/02/us/politics/trump-venezuela-boat-drugs-attack.html",
    "summary": "The vessel was transporting illegal narcotics through international waters to the United States, the president said."
  },
  {
    "title": "Maduro Says War With Venezuela Would Stain Trump’s Hands with Blood",
    "link": "https://www.nytimes.com/2025/09/02/world/americas/maduro-trump-venezuela-war.html",
    "summary": "As U.S. warships and troops gather in the Caribbean, Mr. Maduro threatened an “armed fight” in response to any military action. He also appealed for peace."
  },
  {
    "title": "Netanyahu Faces High-Level Opposition to His Stance on Gaza Truce",
    "link": "https://www.nytimes.com/2025/09/02/world/middleeast/netanyahu-israel-gaza-war-ceasefire.html",
    "summary": "High-level political and security figures are said to be resisting the prime minister’s demand for a comprehensive deal to end the war in Gaza."
  },
  {
    "title": "A Kennedy, a Protégé and a Progressive Star Eye Nadler’s N.Y. House Seat",
    "link": "https://www.nytimes.com/2025/09/02/nyregion/nadler-retire-successor-replace.html",
    "summary": "Representative Jerrold Nadler’s departure is still 16 months away, but Democrats are already testing the waters in what is expected to be a highly contested race."
  },
  {
    "title": "Animal Activists Target Farmers in Sonoma, Known as ‘America’s Provence’",
    "link": "https://www.nytimes.com/2025/09/02/us/california-farmers-animal-activists-bay-area-sonoma.html",
    "summary": "A new generation of activists has used extreme tactics and viral video to challenge farmers in Sonoma County, a region known for some of the industry’s most humane practices."
  },
  {
    "title": "Nemat Shafik, Columbia President During Protests, Takes Another Tough Job",
    "link": "https://www.nytimes.com/2025/09/03/world/europe/minouche-shafik-uk-columbia-starmer.html",
    "summary": "Dr. Shafik, who came under fire for her handling of pro-Palestinian campus protests last year, is now the chief economic adviser to Britain’s prime minister."
  },
  {
    "title": "Is ‘The Wizard of Oz’ at Sphere the Future of Cinema? Or the End of It?",
    "link": "https://www.nytimes.com/2025/09/01/movies/wizard-of-oz-sphere-review.html",
    "summary": "Our critic went to Las Vegas to see the immersive presentation of the classic 1939 film. What she saw defied easy categorization."
  },
  {
    "title": "Heidi Gardner and More ‘SNL’ Cast Members Exit Show Ahead of Season 51",
    "link": "https://www.nytimes.com/2025/09/02/arts/television/snl-cast-departures-season-51.html",
    "summary": "The upcoming season of “Saturday Night Live” will feature five new faces. Departing are Heidi Gardner, Michael Longfellow, Emil Wakim and Devon Walker."
  },
  {
    "title": "Mass Migration and Liberalism’s Fall",
    "link": "https://www.nytimes.com/2025/09/02/opinion/immigration-liberal-europe-merkel.html",
    "summary": "A decade on, Angela Merkel’s immigration disaster has created a right-wing surge."
  },
  {
    "title": "The Door to Another African Democracy Is Closing",
    "link": "https://www.nytimes.com/2025/09/03/opinion/chad-africa-democracy-masra.html",
    "summary": "The conviction of the transitional prime minister in Chad is emblematic of how democracy is eroding across the Sahel region of Northern Africa."
  },
  {
    "title": "Cardi B Is Found Not Liable for Assault in Civil Trial",
    "link": "https://www.nytimes.com/2025/09/02/arts/music/cardi-b-verdict-assault-trial.html",
    "summary": "The rapper and pop star had been accused in a lawsuit of scratching and spitting on a security guard in 2018."
  },
  {
    "title": "Under New Law, Greece Can Imprison Rejected Asylum Seekers",
    "link": "https://www.nytimes.com/2025/09/02/world/europe/greece-asylum-seekers.html",
    "summary": "A surge in migrants landing on Crete this summer has diminished, but Greece is hoping to deter future undocumented immigration."
  },
  {
    "title": "Mark Knoller, 73, White House Reporter and Font of Presidential Facts, Dies",
    "link": "https://www.nytimes.com/2025/09/02/business/media/mark-knoller-dead.html",
    "summary": "As a longtime correspondent for CBS News Radio, he kept meticulous records of presidential activities, from vacation days to teleprompter use."
  },
  {
    "title": "Alberta Backs Off on School Library Book Ban",
    "link": "https://www.nytimes.com/2025/09/02/world/canada/alberta-canada-edmonton-school-book-ban.html",
    "summary": "Alberta ordered schools to pull “inappropriate” books, but paused its plan after a large school district banned scores of books in an apparent effort to make a point."
  }
]