[
  {
    "title": "From Epstein to Obama, Trump’s Washington Is Consumed by Competing Conspiracies",
    "link": "https://www.nytimes.com/2025/07/26/us/politics/trump-epstein-obama-conspiracies.html",
    "summary": "President Trump is trying to divert attention from the Epstein conspiracy theory with a new-and-improved one about Barack Obama and treason."
  },
  {
    "title": "A Clash Over a Promotion Puts Hegseth at Odds With His Generals",
    "link": "https://www.nytimes.com/2025/07/26/us/politics/hegseth-pentagon-leadership.html",
    "summary": "Suspicions about leaks and a mistrust of senior military officers have defined much of the defense secretary’s first six months on the job."
  },
  {
    "title": "Right-Wing Influencers Say Ghislaine Maxwell Is Key to Unlocking Epstein Case",
    "link": "https://www.nytimes.com/2025/07/26/us/ghislaine-maxwell-trump-epstein.html",
    "summary": "Some conservative influencers have celebrated the move to approach the longtime associate of Jeffrey Epstein, but it comes with risks."
  },
  {
    "title": "No Proof Hamas Routinely Stole U.N. Aid, Israeli Military Officials Say",
    "link": "https://www.nytimes.com/2025/07/26/world/middleeast/hamas-un-aid-theft.html",
    "summary": "Israel has long restricted aid to Gaza on the argument that Hamas steals it to use as a weapon of control over the population. On Saturday, the Israeli military announced new airdrops of aid."
  },
  {
    "title": "Amid Growing Fury Over Gaza, Israel Says It Is Easing Aid Restrictions",
    "link": "https://www.nytimes.com/2025/07/26/world/middleeast/gaza-aid-restrictions-eased.html",
    "summary": "As starvation rises in Gaza, prompting global outrage, Israel’s military said it would restart airborne aid delivery there and make land deliveries less dangerous."
  },
  {
    "title": "What to Know About the Deadly Shootings Near a Gaza Aid Site",
    "link": "https://www.nytimes.com/article/israel-gaza-aid-ground-offensive.html",
    "summary": "The head of the United Nations, Antonio Guterres, said the situation in Gaza was “a moral crisis that challenges the global conscience.”"
  },
  {
    "title": "A Kennedy Toils in Mississippi, Tracing His Grandfather’s Path",
    "link": "https://www.nytimes.com/2025/07/26/us/politics/joe-kennedy-mississippi.html",
    "summary": "Joe Kennedy III, the grandson of Senator Robert F. Kennedy, says there is work to do in red states. He also has a few things to say about his uncle, Robert F. Kennedy Jr."
  },
  {
    "title": "This Democrat Wants Cognitive Standards in Congress. Her Colleagues Disagree.",
    "link": "https://www.nytimes.com/2025/07/26/us/politics/age-cognitive-standards-congress.html",
    "summary": "Representative Marie Gluesenkamp Perez says age-related cognitive decline among elected officials is a major issue for voters."
  },
  {
    "title": "E.U. Cuts Aid to Ukraine Over Corruption Concerns",
    "link": "https://www.nytimes.com/2025/07/26/world/europe/eu-ukraine-corruption-aid.html",
    "summary": "The $1.7 billion reduction capped a tough week for President Volodymyr Zelensky as he deals with Ukraine’s governance issues."
  },
  {
    "title": "In Russia, Corruption Cases Follow Battlefield Failures",
    "link": "https://www.nytimes.com/2025/07/26/world/europe/russia-corruption-ukraine-war.html",
    "summary": "Officials in three of the five Russian regions bordering Ukraine have been accused of embezzling funds for border defenses."
  },
  {
    "title": "He Read (at Least) 3,599 Books in His Lifetime. Now Anyone Can See His List.",
    "link": "https://www.nytimes.com/2025/07/26/books/man-died-book-list-thousands.html",
    "summary": "After Dan Pelzer died this month at 92, his children uploaded the handwritten reading list to what-dan-read.com, hoping to inspire readers everywhere."
  },
  {
    "title": "Thailand and Cambodia Trade Fire Despite Cease-Fire Promises",
    "link": "https://www.nytimes.com/2025/07/26/world/asia/thailand-cambodia-conflict.html",
    "summary": "President Trump said on Saturday that both countries had agreed to a halt in the fighting. But on Sunday morning, skirmishes erupted once more."
  },
  {
    "title": "What to Know About the Thailand-Cambodia Clash",
    "link": "https://www.nytimes.com/2025/07/24/world/asia/thailand-cambodia-border-fight.html",
    "summary": "The conflict over the shared border between the two countries grew on Saturday, in the deadliest conflict between them in more than a decade."
  },
  {
    "title": "Houston’s Astrodome Was a Vision of the Future. It’s Past Its Prime.",
    "link": "https://www.nytimes.com/2025/07/26/us/houston-astrodome.html",
    "summary": "Once a wonder of the world, the storied but moldering stadium has long been part of life in Houston. Is it worth saving?"
  },
  {
    "title": "Saving for College Once Felt Essential. Some Parents Are Rethinking Their Plans.",
    "link": "https://www.nytimes.com/2025/07/26/business/529-parents-saving-college.html",
    "summary": "Generations of parents have opened 529 plans to save for their children’s educations. Now some are reconsidering the value of college and looking into other options."
  },
  {
    "title": "11 People Injured in Stabbing at a Michigan Walmart, Officials Say",
    "link": "https://www.nytimes.com/2025/07/26/us/stabbing-traverse-city-walmart.html",
    "summary": "One person was in custody after what the authorities said was a random attack at a store near Traverse City, Mich."
  },
  {
    "title": "Hunter Noack and His Piano Have Reached the Mountaintop",
    "link": "https://www.nytimes.com/2025/07/26/arts/music/hunter-noack-pianist-outdoor-concerts-national-parks.html",
    "summary": "The classical pianist Hunter Noack has embarked on an unusual journey, to take his music to natural landscapes well beyond the concert halls."
  },
  {
    "title": "If I Don’t Post About My Vacation on Instagram, Did It Even Happen?",
    "link": "https://www.nytimes.com/2025/07/27/opinion/posting-vacation-photos.html",
    "summary": "I know that craving the high of posting, of all those comments and hearts, is lame, but leaving is really hard."
  },
  {
    "title": "Opinion: The Path to Peace in the Middle East (and a Nobel Prize for Trump)",
    "link": "https://www.nytimes.com/2025/07/21/opinion/iran-israel-trump-peace.html",
    "summary": "A possible path to peace in the Middle East."
  },
  {
    "title": "Drivers vs. Cyclists: A Battle for the Streets in Canada’s Largest City",
    "link": "https://www.nytimes.com/2025/07/26/world/canada/bike-lanes-toronto.html",
    "summary": "Cyclists in Toronto are resisting a law that would have the city rip out miles of bike lanes, setting back efforts toward safer streets."
  },
  {
    "title": "Seven Charged in Child Abuse Ring Run From an Alabama Bunker, Officials Say",
    "link": "https://www.nytimes.com/2025/07/26/us/sex-trafficking-concrete-bunker-alabama.html",
    "summary": "A sheriff called it the worst child abuse case he’d seen in his 33-year career. Victims as young as 3 are now in state care and getting medical, emotional and psychological support."
  },
  {
    "title": "Illinois Man Convicted in Killing of Palestinian American Boy Dies in Custody",
    "link": "https://www.nytimes.com/2025/07/26/us/czuba-palestinian-boy-stabbing.html",
    "summary": "Joseph Czuba, who was convicted of killing 6-year-old Wadee Alfayoumi in 2023, died two months after a judge sentenced him to 53 years in prison. He was 73."
  },
  {
    "title": "James Leprino, ‘Willy Wonka of Cheese’ Who Revolutionized Pizza, Dies at 87",
    "link": "https://www.nytimes.com/2025/07/26/business/james-leprino-dead.html",
    "summary": "He turned a small family grocery store into a mozzarella empire, producing most of the cheese for American pizza chains like Domino’s, Papa Johns and Pizza Hut."
  }
]