[
  {
    "title": "With Military Strike His Predecessors Avoided, Trump Takes a Huge Gamble",
    "link": "https://www.nytimes.com/2025/06/21/us/politics/trump-iran-risks.html",
    "summary": "President Trump is betting the United States can repel whatever retaliation Iran orders, and that it has destroyed the regime’s chances of reconstituting its nuclear program."
  },
  {
    "title": "Trump Picks a Side on Entering the War in Iran, for Now",
    "link": "https://www.nytimes.com/2025/06/22/us/politics/trump-iran-maga-rift-isolationists-hawks.html",
    "summary": "Even as he announced the strikes on Iran, President Trump appeared to be rapidly trying to get himself back to the middle by insisting the operation was a one-off."
  },
  {
    "title": "Missteps, Confusion and ‘Viral Waste’: The 14 Days That Doomed U.S.A.I.D.",
    "link": "https://www.nytimes.com/2025/06/22/us/politics/usaid-cuts-doge.html",
    "summary": "The rapid dismantling of the global aid agency remains one of the most consequential outcomes of President Trump’s efforts to overhaul the federal government, showing his willingness to tear down institutions in defiance of the courts."
  },
  {
    "title": "‘An Existential Threat’: Food Banks Brace for Fallout From Trump Cuts",
    "link": "https://www.nytimes.com/2025/06/22/nyregion/nyc-food-banks-cuts.html",
    "summary": "New York City food banks aren’t sure how they will survive the administration’s funding cuts, which could also affect the programs they turn to for help."
  },
  {
    "title": "Dangerous Heat Wave Expands Over Central and Eastern United States",
    "link": "https://www.nytimes.com/2025/06/22/weather/heat-wave-temperatures.html",
    "summary": "A multiday heat wave is bringing high temperatures and health risks from the Midwest to the Northeast, prompting warnings and emergency measures."
  },
  {
    "title": "It’s About to Get Brutally Hot in New York City",
    "link": "https://www.nytimes.com/2025/06/22/weather/nyc-heat-wave.html",
    "summary": "Temperatures in Central Park are forecast to soar into the high 90s on Monday and Tuesday, but it will feel like it’s 105 degrees outside."
  },
  {
    "title": "‘I Feel Like I’ve Been Lied To’: When a Measles Outbreak Hits Home",
    "link": "https://www.nytimes.com/2025/06/22/us/i-feel-like-ive-been-lied-to-when-a-measles-outbreak-hits-home.html",
    "summary": "From a lone clinic in Texas to an entire school district in North Dakota, the virus is upending daily life and revealing a deeper crisis of belief."
  },
  {
    "title": "Vera Rubin’s Legacy Lives On in a Troubled Scientific Landscape",
    "link": "https://www.nytimes.com/2025/06/22/science/vera-rubin-women-astronomy.html",
    "summary": "A powerful new telescope will usher in a new era of cosmic discovery, but in a political climate vastly different from when it was named for a once overlooked female astronomer."
  },
  {
    "title": "Palm Beach, Never Richer, Is a Draw for Young MAGA. Locals Aren’t Pleased.",
    "link": "https://www.nytimes.com/2025/06/22/business/palm-beach-trump-maga.html",
    "summary": "Donald Trump’s presidency has turned this Florida island into the nightlife headquarters of MAGA, but the town’s old guard — much of it Republican — doesn’t love the new vibe."
  },
  {
    "title": "Andrew Cuomo’s Complicated Legacy in New York City",
    "link": "https://www.nytimes.com/2025/06/22/nyregion/cuomo-legacy-governor-nyc.html",
    "summary": "Mr. Cuomo, the front-runner in the mayoral race and former governor, has a long — and, his critics say, mixed — record handling important issues in the city."
  },
  {
    "title": "An Actor, a Bookseller and a Chef Walk Into a Voting Booth",
    "link": "https://www.nytimes.com/2025/06/22/nyregion/celebrity-ballots-mayor-nyc.html",
    "summary": "We asked scores of well-known New Yorkers from a broad spectrum of the city to give us their ranked-choice ballots for mayor. Here’s what some told us."
  },
  {
    "title": "Bill Clinton Endorses Andrew Cuomo for NYC Mayor",
    "link": "https://www.nytimes.com/2025/06/22/nyregion/bill-clinton-endorse-cuomo-mayor.html",
    "summary": "The former president’s endorsement is the latest example of how establishment Democrats seem to prefer Mr. Cuomo to his prime rival, Zohran Mamdani."
  },
  {
    "title": "As Tariffs Make Weddings Costlier, David’s Bridal Tries to Adapt",
    "link": "https://www.nytimes.com/2025/06/22/business/davids-bridal-kelly-cook-tariffs.html",
    "summary": "Most wedding dresses are made in China, so tariffs are a new worry for brides. At David’s Bridal, the largest seller of gowns in the United States, its chief executive, Kelly Cook, is trying to do something about it."
  },
  {
    "title": "Aide Who Was Sean ‘Diddy’ Combs’s ‘Right Hand’ Draws Scrutiny at His Trial",
    "link": "https://www.nytimes.com/2025/06/22/arts/music/sean-diddy-combs-kristina-khorram-kk.html",
    "summary": "Kristina Khorram, the mogul’s former chief of staff, was not charged in his indictment, but the government has identified her and other staff as co-conspirators."
  },
  {
    "title": "How the Attacks on Iran Are Part of a Much Bigger Global Struggle",
    "link": "https://www.nytimes.com/2025/06/22/opinion/iran-israel-attack-global-struggle.html",
    "summary": "Putin and the ayatollahs want the same kind of world."
  },
  {
    "title": "Roll Back Legal Same-Sex Marriage? Republicans Are Getting It Wrong.",
    "link": "https://www.nytimes.com/2025/06/22/opinion/gay-marriage-republicans-obergefell-hodges.html",
    "summary": "The cultural winds have shifted on many issues, but Republican voters are not clamoring to unravel same-sex marriage rights."
  },
  {
    "title": "America Strikes Iran",
    "link": "https://www.nytimes.com/2025/06/22/briefing/america-trump-iran-strike.html",
    "summary": "We explain what we know about the attacks."
  },
  {
    "title": "Michigan Church Shooting Leaves at Least 1 Injured and Gunman Dead, Police Say",
    "link": "https://www.nytimes.com/2025/06/22/us/shooting-church-wayne-michigan.html",
    "summary": "A church security guard fatally shot the gunman, the Wayne Police Department said."
  },
  {
    "title": "Israel Recovers Bodies of Three Hostages Held by Hamas in Gaza",
    "link": "https://www.nytimes.com/2025/06/22/world/middleeast/israeli-soldiers-recovered-the-bodies-of-three-hostages-in-gaza.html",
    "summary": "The retrieval of the bodies of three Israelis taken hostage by Hamas jolted Israelis’ focus back to a conflict that had been overshadowed by the escalating crisis with Iran."
  },
  {
    "title": "Boat Capsizes on Lake Tahoe, Leaving 6 Dead",
    "link": "https://www.nytimes.com/2025/06/22/us/lake-tahoe-boat-capsize.html",
    "summary": "A large wave overturned a 27-foot-long boat on Saturday afternoon, the U.S. Coast Guard said. Two people remained missing."
  },
  {
    "title": "Europe Is Finally Ready to Spend More on Defense. The Hard Part Is How.",
    "link": "https://www.nytimes.com/2025/06/22/business/europe-nato-defense-spending.html",
    "summary": "After a yearslong debate over NATO spending, European nations are poised to commit more funds to deter Russia. Now the region must decide how to unify its fragmented manufacturing."
  }
]