[
  {
    "title": "Trump Bets on Diplomacy Without Diplomats",
    "link": "https://www.nytimes.com/2026/02/17/us/politics/trump-witkoff-kushner-diplomacy.html",
    "summary": "President Trump’s most trusted envoys, Steve Witkoff and Jared Kushner, are at the center of the Iran and Ukraine negotiations."
  },
  {
    "title": "U.S. and Iran Make ‘Good Progress’ in Geneva Talks, Foreign Minister Says",
    "link": "https://www.nytimes.com/2026/02/17/us/politics/us-iran-nuclear-talks.html",
    "summary": "The Iranian minister, Abbas Araghchi, said both sides had agreed on a “set of guiding principles.” President Trump has called on Iran to make an immediate accord or face a possible U.S. attack."
  },
  {
    "title": "Trump Said He’d End the War in Ukraine in a Day. It’s Harder Than He Thought.",
    "link": "https://www.nytimes.com/2026/02/17/world/europe/trump-ukraine-war-putin.html",
    "summary": "Russian attacks and Ukrainian civilian deaths rose as President Trump’s peace talks dragged on during his first year back in the White House."
  },
  {
    "title": "Mamdani Threatens 9.5% Property Tax Increase if Wealth Tax Is Not Passed",
    "link": "https://www.nytimes.com/2026/02/17/nyregion/budget-mamdani-property-taxes.html",
    "summary": "Mayor Zohran Mamdani said his proposal to raise New York City property taxes was a “last resort” to close a budget gap."
  },
  {
    "title": "Mamdani Ushers in a New Tradition: Ramadan in City Hall",
    "link": "https://www.nytimes.com/2026/02/17/nyregion/mamdani-ramadan-muslim.html",
    "summary": "Zohran Mamdani, New York City’s first Muslim mayor, will observe Ramadan as he runs the nation’s largest city, blending his faith into his public life."
  },
  {
    "title": "Trump Sought Vast Budget Cuts. Congress Granted Few.",
    "link": "https://www.nytimes.com/2026/02/17/us/politics/trump-congress-budget-cuts.html",
    "summary": "In a series of deals over the past three months, lawmakers rejected some of the president’s most aggressive attempts to whittle down the government."
  },
  {
    "title": "Obama Took On Recession, Health Care and Iraq. What He Didn’t See Coming Was Trump.",
    "link": "https://www.nytimes.com/2026/02/17/us/politics/obama-trump-oral-history.html",
    "summary": "A new set of oral history interviews documents how Barack Obama and his advisers missed the shifting mood of the country that would ultimately replace him with a successor they considered a “con man,” “clown” and “laughingstock.”"
  },
  {
    "title": "Colbert Slams Trump Administration After CBS Pulls Talarico Interview",
    "link": "https://www.nytimes.com/2026/02/17/business/media/colbert-cbs-fcc-talarico-carr.html",
    "summary": "Stephen Colbert said he had to drop an interview with James Talarico from his Monday broadcast because of new F.C.C. guidance that targeted political interviews on late-night shows."
  },
  {
    "title": "Jesse Jackson’s Death Arrives at a Crucial Moment for Black Political Power",
    "link": "https://www.nytimes.com/2026/02/17/us/politics/jesse-jackson-black-voters-voting-rights-act.html",
    "summary": "There are more Black senators than ever before, but a major Supreme Court ruling could reduce Black representation in the House."
  },
  {
    "title": "Jesse Jackson, Charismatic Champion of Civil Rights, Dies at 84",
    "link": "https://www.nytimes.com/2026/02/17/us/jesse-jackson-dead.html",
    "summary": "An impassioned orator, he was a moral and political force, forming a “rainbow coalition” of poor and working-class people and seeking the presidency. His mission, he said, was “to transform the mind of America.”"
  },
  {
    "title": "Jesse Jackson Changed Chicago. And It Changed Him.",
    "link": "https://www.nytimes.com/2026/02/17/us/jesse-jackson-changed-chicago-and-it-changed-him.html",
    "summary": "Mr. Jackson, who spent much of his life in the city, died at his home there on Tuesday. “He ushered in new politics in Chicago,” one longtime organizer said."
  },
  {
    "title": "White House Shrugs Off Lutnick’s Epstein Ties",
    "link": "https://www.nytimes.com/2026/02/17/us/politics/trump-howard-lutnick-epstein.html",
    "summary": "Commerce Secretary Howard Lutnick has acknowledged traveling to Jeffrey Epstein’s island and meeting him on another occasion."
  },
  {
    "title": "Daniel Radcliffe on Returning to Broadway in ‘Every Brilliant Thing’",
    "link": "https://www.nytimes.com/2026/02/17/theater/daniel-radcliffe-every-brilliant-thing.html",
    "summary": "The Tony winner returns to the stage in “Every Brilliant Thing,” an interactive monologue with a message of hope “that might be vital for somebody to hear.”"
  },
  {
    "title": "The Price of Admission to Epstein’s World: Silence",
    "link": "https://www.nytimes.com/2026/02/17/well/epstein-files-associates.html",
    "summary": "There were plenty of signs that something wasn’t right with Jeffrey Epstein. Why didn’t anyone say something?"
  },
  {
    "title": "California Wealth Tax Opponents Intensify Efforts Before Bernie Sanders Visit",
    "link": "https://www.nytimes.com/2026/02/17/us/california-wealth-tax-opposition-bernie-sanders.html",
    "summary": "The opponents’ latest moves include online ads tied to Gov. Gavin Newsom, a crypto-related push to raise money and competing ballot measures."
  },
  {
    "title": "Potomac Sewage Spill Becomes Ecological Disaster and Political Fight",
    "link": "https://www.nytimes.com/2026/02/17/climate/potomac-river-trump-moore.html",
    "summary": "A D.C. utility had been working for weeks to repair a collapsed sewer line when the president blamed Maryland’s governor for the contamination on Monday."
  },
  {
    "title": "Goldman Sachs to Drop D.E.I. Criteria for Board Members",
    "link": "https://www.nytimes.com/2026/02/17/business/goldman-sachs-diversity-board.html",
    "summary": "The move would be the Wall Street firm’s latest retreat from diversity mandates that its chief executive, David Solomon, had once made a priority."
  },
  {
    "title": "Height Surgery for Men Can Add Inches But Has Risks",
    "link": "https://www.nytimes.com/2026/02/17/us/height-surgery-limb-lengthening-men-health.html",
    "summary": "Limb-lengthening can add inches to a person’s stature. But its risks have made it controversial."
  },
  {
    "title": "Book Review: ‘On Morrison,’ by Namwali Serpell",
    "link": "https://www.nytimes.com/2026/02/16/books/review/on-morrison-namwali-serpell.html",
    "summary": "A new study by the novelist and scholar Namwali Serpell subjects the Nobel laureate’s work to rigorous inspection — with thrilling results."
  },
  {
    "title": "Toni Morrison’s Best Books: A Guide",
    "link": "https://www.nytimes.com/article/best-toni-morrison-books.html",
    "summary": "Her novels reveal a deeply American desire for freedom and adventure, and one of her work’s great joys lies in always finding something new to discover. Here’s where to start."
  },
  {
    "title": "Netanyahu Plays Trump and American Jews for Fools — Again",
    "link": "https://www.nytimes.com/2026/02/17/opinion/israel-iran-netanyahu.html",
    "summary": "Netanyahu has gotten Trump to focus on Iran and ignore the destructive things Bibi is doing in Gaza, in the West Bank and inside Israel."
  },
  {
    "title": "What the American Right Wants From Europe",
    "link": "https://www.nytimes.com/2026/02/17/opinion/rubio-munich-security-conference.html",
    "summary": "The tensions in Marco Rubio’s trans-Atlantic vision."
  },
  {
    "title": "Trump Officials Hold High-Stakes Talks in Geneva",
    "link": "https://www.nytimes.com/2026/02/17/briefing/trump-kushner-witkoff-sewage-spill.html",
    "summary": "Also, the Epstein emails have rocked several industries. Here’s the latest at the end of Tuesday."
  },
  {
    "title": "Are You a New Yorker with a Unique Parking Situation? We Want to Hear It.",
    "link": "https://www.nytimes.com/2026/02/17/us/are-you-a-new-yorker-with-a-unique-parking-situation-we-want-to-hear-it.html",
    "summary": "We want to hear from New Yorkers who rent driveways or have surprising parking garage arrangements."
  },
  {
    "title": "California Forecast: Storms to Bring More Snow and Rain",
    "link": "https://www.nytimes.com/2026/02/17/weather/california-rain-snow-forecast.html",
    "summary": "Search efforts were underway on Tuesday afternoon after heavy snow caused an avalanche in the Sierra Nevada, the authorities said."
  },
  {
    "title": "It’s Mardi Gras in New Orleans. This Year, the Party Might Be a Bit Greener.",
    "link": "https://www.nytimes.com/2026/02/17/climate/mardi-gras-carnival-beads-environment.html",
    "summary": "Carnival can generate more than 1,000 tons of trash every year. A coalition of nonprofit groups, city officials and scientists has a plan to clean it up."
  },
  {
    "title": "Shia LaBeouf Charged With Battery in New Orleans",
    "link": "https://www.nytimes.com/2026/02/17/movies/shia-labeouf-arrested-new-orleans.html",
    "summary": "The actor, known for his roles in “Transformers” and “Megalopolis,” was arrested early Tuesday after reportedly assaulting two people, the authorities said."
  },
  {
    "title": "Peru Votes to Impeach President José Jerí",
    "link": "https://www.nytimes.com/2026/02/17/world/americas/peru-president-jose-jeri-impeachment.html",
    "summary": "Peru’s Congress voted to impeach President José Jerí, four months after he replaced Dina Boluarte, who had also been removed from the presidency."
  }
]