[
  {
    "title": "Up Against Time, a Desperate Search Presses Ahead",
    "link": "https://www.nytimes.com/2025/07/07/us/central-texas-flood-search.html",
    "summary": "Officials, emergency crews and volunteers in Central Texas were holding out hope for finding survivors of the flash flooding, as the death toll climbed."
  },
  {
    "title": "Officials Feared Flood Risk to Youth Camps but Rejected Warning System",
    "link": "https://www.nytimes.com/2025/07/06/us/texas-flood-warnings-sirens.html",
    "summary": "Kerr County had discussed buying such things as water gauges and sirens after previous flood disasters. But as with many rural Texas counties, cost was an issue."
  },
  {
    "title": "The Agonizing Search in Texas, and a Looming Trade Deadline",
    "link": "https://www.nytimes.com/2025/07/07/podcasts/the-headlines/search-texas-flood-trade-deadline.html",
    "summary": "Plus, what your TV knows about you."
  },
  {
    "title": "What’s at Stake as Netanyahu and Trump Meet in Washington",
    "link": "https://www.nytimes.com/2025/07/07/world/middleeast/trump-netanyahu-washington.html",
    "summary": "With the fighting in Iran over, President Trump is considering whether to pursue a new nuclear agreement with Tehran. He is also urging a new cease-fire deal to end the fighting in Gaza."
  },
  {
    "title": "Israel’s Deadly Assault on Iran Prison Incites Fury, Even Among Dissidents",
    "link": "https://www.nytimes.com/2025/07/06/world/middleeast/israel-iran-evin-prison.html",
    "summary": "The June 23 airstrikes on Evin prison, including the hospital ward, have turned it from a hated symbol of oppression into a new rallying cry against Israel, even among the Iranian regime’s domestic critics."
  },
  {
    "title": "Trump Threatens Tariffs on Countries Aligned With BRICS Nations",
    "link": "https://www.nytimes.com/2025/07/07/us/politics/trump-brics-nations-tariffs.html",
    "summary": "President Trump said nations that support the group’s “Anti-American policies” would face an additional 10 percent tariff. He did not elaborate."
  },
  {
    "title": "Canada Shipping Natural Gas to Asia as It Looks Beyond the US for Trade",
    "link": "https://www.nytimes.com/2025/07/07/world/canada/natural-gas-asia-us-trade.html",
    "summary": "A tanker is headed to South Korea with a first shipment of liquefied natural gas from Canada, which hopes to reduce its export reliance on its neighbor."
  },
  {
    "title": "Can Taiwan Really Disconnect Its Economy From China?",
    "link": "https://www.nytimes.com/2025/07/07/business/china-taiwan-chips.html",
    "summary": "Momentum is building in Taiwan to lessen its business dependency on China, its biggest trading partner. Doing so will not be easy."
  },
  {
    "title": "RFK Jr.’s Battle Against Food Dyes Hits a Roadblock: M&M’s",
    "link": "https://www.nytimes.com/2025/07/07/us/politics/rfk-food-dyes-candy.html",
    "summary": "The health secretary has used peer pressure to persuade food makers to nix synthetic dyes. The candy industry is holding out, arguing American consumers like bright sweets."
  },
  {
    "title": "From Food Aid to Dog Chow? How Trump’s Cuts Hurt Kansas Farmers.",
    "link": "https://www.nytimes.com/2025/07/07/us/politics/trump-farmers.html",
    "summary": "Kansans created Food for Peace, for 70 years a font of rural income and pride. Now at least one grain broker is trying to sell grain that once fed the world as dog food."
  },
  {
    "title": "Trump Says Musk Is ‘Off the Rails’ With America Party Effort",
    "link": "https://www.nytimes.com/2025/07/06/us/politics/trump-musk-america-party.html",
    "summary": "The tech billionaire’s effort to create a new political party, called the America Party, comes amid a ramped-up feud with the president over his new domestic policy law."
  },
  {
    "title": "How the Assad Regime Built a Mass Grave in Syria",
    "link": "https://www.nytimes.com/video/world/middleeast/100000010209709/how-the-assad-regime-built-a-mass-grave-in-syria.html",
    "summary": "Months after President Bashar al-Assad’s regime was toppled, Charlie Smart, a reporter at The New York Times, traveled to a mass burial site in Syria to understand how the Assad regime hid the bodies of the people it had made disappear."
  },
  {
    "title": "Ukrainian Troops Struggle to Hold the Line on the Eastern Front",
    "link": "https://www.nytimes.com/2025/07/07/world/europe/ukraine-war-russia-donetsk.html",
    "summary": "Kyiv is defending Kostiantynivka from Russian drone attacks. The embattled city is a gateway to Ukraine’s last major defense in the Donetsk region."
  },
  {
    "title": "Ukraine Turns to Fishing Nets to Catch Russian Drones",
    "link": "https://www.nytimes.com/2025/07/07/world/europe/ukraine-russia-drones-nets.html",
    "summary": "With their dense mesh, the nets can tangle drone propellers. It’s a simple but effective countermeasure that reflects how low-tech means can blunt high-tech weapons in the war."
  },
  {
    "title": "Erin Patterson Is Found Guilty of Murder in Australia Mushroom Poisoning Case",
    "link": "https://www.nytimes.com/2025/07/07/world/australia/mushroom-poisoning-trial-verdict.html",
    "summary": "Three people died in 2023 after eating beef Wellington made by Erin Patterson, whose subsequent trial gripped the country."
  },
  {
    "title": "South African Police’s Frequent Use of Torture Echoes Apartheid’s Brutality",
    "link": "https://www.nytimes.com/2025/07/07/world/africa/south-africa-torture-police-tubing.html",
    "summary": "A government led by freedom fighters who helped to liberate the country more than 30 years ago is now overseeing a police force accused of staggering abuses."
  },
  {
    "title": "Where Are the Men in Boys’ Lives?",
    "link": "https://www.nytimes.com/2025/07/05/upshot/boys-men-mentors.html",
    "summary": "Jobs working with children are largely done by women, leaving many boys, especially in low-income areas, with few men as role models."
  },
  {
    "title": "The Ruthless Ambition of Stephen Miller",
    "link": "https://www.nytimes.com/2025/07/07/opinion/stephen-miller.html",
    "summary": "The Ruthless Ambition of Stephen Miller"
  },
  {
    "title": "Texas Hill Country Is Underwater, and America’s Emergency Lifeline Is Fraying",
    "link": "https://www.nytimes.com/2025/07/07/opinion/texas-floods-fema.html",
    "summary": "With each passing day, the federal government is becoming less prepared to face the next big disaster."
  },
  {
    "title": "Your Questions, Answered",
    "link": "https://www.nytimes.com/2025/07/07/briefing/your-questions-answered.html",
    "summary": "We address your queries about the news."
  },
  {
    "title": "Tropical Storm Chantal Floods Parts of North Carolina",
    "link": "https://www.nytimes.com/2025/07/07/weather/tropical-storm-chantal-floods-north-carolina.html",
    "summary": "The storm, which made landfall on Sunday, caused significant flooding that closed roads and stranded drivers. It is heading northeast."
  },
  {
    "title": "Fiona the Pregnant Sea Reptile’s Fossil Hints at the Birth of a New Ocean",
    "link": "https://www.nytimes.com/2025/07/06/science/ichthyosaur-fossil-fiona-chile.html",
    "summary": "An ichthyosaur preserved beneath a Chilean glacier is helping scientists understand the extinct animals and the world around them as a supercontinent broke up."
  },
  {
    "title": "Supreme Court Insists on Reams of Paper for Case Briefs in Digital Age",
    "link": "https://www.nytimes.com/2025/07/07/us/politics/supreme-court-cases-paper-electronic.html",
    "summary": "The court’s rules require many litigants to submit 40 copies of their briefs, resulting in millions of pages printed each term. Critics call the process outdated and wasteful."
  }
]