[
  {
    "title": "Trump’s Post Attacking Rob Reiner After Stabbing Death Draws Immediate Outrage",
    "link": "https://www.nytimes.com/2025/12/15/us/politics/trump-rob-reiner.html",
    "summary": "The president attributed the killing of Rob Reiner and his wife to “Trump derangement syndrome.” There was no indication that the couple’s political beliefs were linked to their deaths."
  },
  {
    "title": "Nick Reiner Talked Openly About His Struggles",
    "link": "https://www.nytimes.com/2025/12/15/us/nick-reiner-rob-reiner-son.html",
    "summary": "He and his father, the director Rob Reiner, also worked together on a film that was loosely inspired by the son’s early life."
  },
  {
    "title": "U.K. Spy Chief Warns of Growing Russia Threat in Europe",
    "link": "https://www.nytimes.com/2025/12/15/world/europe/uk-mi6-russia-chaos.html",
    "summary": "In her first public speech as head of MI6, Blaise Metreweli said Russia was attempting to export chaos to Europe through hybrid attacks and disinformation."
  },
  {
    "title": "Ukraine Claims First Strike by Underwater Drone on Russian Submarine",
    "link": "https://www.nytimes.com/2025/12/15/world/europe/ukraine-russia-submarine-drones.html",
    "summary": "As it tries to demonstrate its continuing ability to fight, Ukraine said it had used drones to inflict serious damage on a Russian Kilo-class submarine at a Black Sea port."
  },
  {
    "title": "How the Bondi Beach Shooting Unfolded at a Hanukkah Celebration",
    "link": "https://www.nytimes.com/2025/12/15/world/australia/bondi-beach-shooting-sydney-australia.html",
    "summary": "Two men toting long guns opened fire on hundreds of people who were celebrating Hanukkah on Bondi Beach in Sydney, the core of the Australian city’s Jewish community."
  },
  {
    "title": "Albanese Vows to Toughen Gun Laws After Deadly Bondi Shooting",
    "link": "https://www.nytimes.com/2025/12/15/world/australia/albanese-gun-control-bondi-shooting.html",
    "summary": "The police said on Monday that they expected to bring criminal charges against the surviving suspect, who is in a coma after being shot by the police."
  },
  {
    "title": "Ahmed el Ahmed, Who Tackled One of the Bondi Beach Gunmen, Is Recovering in a Hospital",
    "link": "https://www.nytimes.com/2025/12/15/world/australia/ahmed-bondi-shooting-hero-tackled-shooter-injured.html",
    "summary": "Video of Ahmed el Ahmed disarming one of the gunmen has gone viral, and officials around the world have hailed his bravery."
  },
  {
    "title": "He Tried to Protect His Son From Bullies. He Didn’t Know How Far They Would Go.",
    "link": "https://www.nytimes.com/2025/12/15/magazine/bullying-teenagers-gilbert-goons-gang.html",
    "summary": "After his son was repeatedly attacked, Rick Kuehner reached out to his suburban school, to the police and to other parents. The violence only got worse."
  },
  {
    "title": "Ford Will Take $19.5 Billion Hit as It Rolls Back E.V. Plans",
    "link": "https://www.nytimes.com/2025/12/15/business/ford-electric-vehicles-hybrids.html",
    "summary": "Ford Motor said the costs came from its decision to make fewer electric vehicles than it had planned and more hybrids that use both gasoline engines and batteries."
  },
  {
    "title": "U.S. Soldiers and Translator Killed in Syria Are Identified",
    "link": "https://www.nytimes.com/2025/12/15/us/syria-killed-soldiers-iowa-national-guard.html",
    "summary": "The shooting attack in Palmyra, Syria, on Saturday struck Iowa National Guard troops. Two were killed, along with an American civilian interpreter; three others were wounded."
  },
  {
    "title": "Heng Guan Documented China’s Detention of Uyghurs. The U.S. Wants to Deport Him.",
    "link": "https://www.nytimes.com/2025/12/15/us/heng-guan-china-uyghurs-deportation-uganda.html",
    "summary": "Heng Guan fled to the United States and released rare video evidence of China’s clampdown. His supporters say that sending him to Uganda puts him at risk."
  },
  {
    "title": "How the Winklevoss Twins Won Big in Trump’s Pro-Crypto Washington",
    "link": "https://www.nytimes.com/2025/12/15/us/politics/trump-crypto-winklevoss.html",
    "summary": "Few industry players seem closer to Trump than the 44-year-old billionaire brothers. And they have gotten more than just invitations to the White House this year."
  },
  {
    "title": "Trump Administration Begins Program to Increase Government’s Tech Worker Ranks",
    "link": "https://www.nytimes.com/2025/12/15/us/politics/trump-tech-workers.html",
    "summary": "The U.S. Tech Force is aiming to hire about 1,000 top-level technical employees and supervisors to join federal agencies and work on projects related to artificial intelligence and modernization."
  },
  {
    "title": "Anthony Geary, Luke on ‘General Hospital,’ Dies at 78",
    "link": "https://www.nytimes.com/2025/12/15/arts/television/anthony-geary-dead.html",
    "summary": "Portraying Luke Spencer, he was one of the best-known soap opera stars in American television. His onscreen romance with Laura Webber, played by Genie Francis, changed the landscape of daytime television."
  },
  {
    "title": "How Tech’s Biggest Companies Are Offloading the Risks of the A.I. Boom",
    "link": "https://www.nytimes.com/2025/12/15/technology/ai-risks-debt.html",
    "summary": "The data centers used for work on artificial intelligence can cost tens of billions to build. Tech giants are finding ways to avoid being on the hook for some of those costs."
  },
  {
    "title": "In A.I. Boom, Venture Capital Firms Are Raising Loads More Money",
    "link": "https://www.nytimes.com/2025/12/15/technology/ai-venture-capital-big-funds.html",
    "summary": "Lightspeed Venture Partners, a Silicon Valley venture firm, has amassed more than $9 billion to invest in artificial intelligence. That is its biggest haul."
  },
  {
    "title": "The 52 Best Breakup Lines (Said in Real Life)",
    "link": "https://www.nytimes.com/2025/12/15/style/best-breakup-lines.html",
    "summary": "To mark the winter holidays — an especially popular time to break up — we asked people around the world for their most striking parting words to each other."
  },
  {
    "title": "Trump’s Dated Strategy Is Putting Us on a Path to World War III",
    "link": "https://www.nytimes.com/2025/12/15/opinion/monroe-doctrine-trump.html",
    "summary": "We are headed for more confrontation, more brinkmanship, more war."
  },
  {
    "title": "13 Holiday Gifts that Cost (Almost) Nothing",
    "link": "https://www.nytimes.com/2025/12/15/opinion/contributors/holiday-gifts-presents-free.html",
    "summary": "We asked readers to tell us about the most memorable presents they’ve received."
  },
  {
    "title": "Rob Reiner’s Son Arrested After Fatal Stabbing",
    "link": "https://www.nytimes.com/2025/12/15/briefing/rob-reiners-son-arrested.html",
    "summary": "Also, police search for Brown University shooter. Here’s the latest at the end of Monday."
  },
  {
    "title": "Controlling Blood Sugar Cut Heart Disease Risk in Half, New Study Says",
    "link": "https://www.nytimes.com/2025/12/15/well/blood-sugar-heart-disease-risk.html",
    "summary": "People who brought their blood glucose down to a normal level had a lower risk of death from heart disease or hospitalization for heart failure after 20 years."
  },
  {
    "title": "Robert Samuelson, Award-Winning Economics Columnist, Dies at 79",
    "link": "https://www.nytimes.com/2025/12/15/business/media/robert-samuelson-dead.html",
    "summary": "He was a familiar byline in Newsweek and The Washington Post for decades, explaining the intricacies of economic policy in reader-friendly vernacular."
  },
  {
    "title": "E.U. Flies 110 Tons of Aid to Darfur. But Will It Reach Those In Need?",
    "link": "https://www.nytimes.com/2025/12/15/world/africa/darfur-sudan-eu-aid.html",
    "summary": "The European Union has mounted an “air bridge” effort, with at least eight aid flights planned to Sudan. But getting supplies to the areas with the most dire need is an enormous challenge."
  },
  {
    "title": "How the Pandemic Lockdowns Changed a Songbird’s Beak",
    "link": "https://www.nytimes.com/2025/12/15/science/covid-ecology-anthropause-birds.html",
    "summary": "For ecologists, the Covid-19 pandemic has presented a remarkable natural experiment in what can happen to wild animals when humans stay home."
  }
]