[
  {
    "title": "Trump Administration Guts Education Department With More Layoffs",
    "link": "https://www.nytimes.com/2025/10/14/us/politics/trump-education-department-federal-layoffs.html",
    "summary": "About a fifth of the agency’s remaining staff was affected, including employees working on special education, funding for low-income students and civil rights enforcement."
  },
  {
    "title": "Trump Renews Threat to Cut ‘Democrat Programs’ as Government Shutdown Enters Third Week",
    "link": "https://www.nytimes.com/2025/10/14/us/politics/trump-threats-democrats-shutdown.html",
    "summary": "The president said his administration was “closing up Democrat programs that we disagree with, and they’re never going to open again.” He promised to release a list of programs by Friday."
  },
  {
    "title": "How the U.S. and the Arab World Teamed Up to Seal the Gaza Deal",
    "link": "https://www.nytimes.com/2025/10/14/world/middleeast/us-arab-gaza-deal.html",
    "summary": "The cease-fire talks in Egypt showed that with pressure on Hamas and Israel, seemingly huge impediments could be overcome or set aside."
  },
  {
    "title": "Trump Says He May Give Tomahawks to Ukraine. Is He Bluffing?",
    "link": "https://www.nytimes.com/2025/10/14/us/politics/trump-tomahawks-ukraine-russia.html",
    "summary": "President Trump’s threats to provide the missiles to Ukraine, whether he follows through on them or not, are a sign of his growing frustration with Moscow."
  },
  {
    "title": "U.S. Military Kills 6 People in Boat Attack Near Venezuela, Trump Says",
    "link": "https://www.nytimes.com/2025/10/14/us/politics/trump-drugs-boat-attack.html",
    "summary": "In a social media post, the president said the people aboard a boat were suspected of smuggling drugs for an unspecified group his team had labeled terrorists."
  },
  {
    "title": "As U.S. Warships Patrol Caribbean, Drug Smugglers Shift Tactics",
    "link": "https://www.nytimes.com/2025/10/14/us/us-drug-trafficking-boats-caribbean.html",
    "summary": "With the United States surging its military presence in the region and bombing boats, countries in the Caribbean are seeing more flights carrying illegal drugs."
  },
  {
    "title": "Trump Awards Charlie Kirk the Presidential Medal of Freedom",
    "link": "https://www.nytimes.com/2025/10/14/us/politics/trump-charlie-kirk-medal.html",
    "summary": "President Trump presented the medal to Charlie Kirk’s widow, Erika, on what would have been his 32nd birthday."
  },
  {
    "title": "Trump Dangles $20 Billion Lifeline for Argentina, With Strings Attached",
    "link": "https://www.nytimes.com/2025/10/14/us/politics/trump-argentina-leader-bailout.html",
    "summary": "President Trump said the economic support is contingent on whether his political ally, President Javier Milei of Argentina, remains in power."
  },
  {
    "title": "D’Angelo, Acclaimed R&B Singer, Dies at 51 After Cancer Battle",
    "link": "https://www.nytimes.com/2025/10/14/arts/music/dangelo-dead.html",
    "summary": "After hitting No. 1 with “Voodoo,” the genre-melding 2000 album that he promoted with a risqué music video, he vanished for more than a decade."
  },
  {
    "title": "D’Angelo’s ‘Untitled’ Video Supercharged and Derailed His Career",
    "link": "https://www.nytimes.com/2025/10/14/arts/music/dangelo-untitled-video.html",
    "summary": "The video for “Untitled (How Does It Feel)” brought him new levels of fame, but not always the kind of attention he sought."
  },
  {
    "title": "D’Angelo: 14 Essential Songs",
    "link": "https://www.nytimes.com/2025/10/14/arts/music/dangelo-songs-playlist.html",
    "summary": "The soul singer, songwriter and producer, who died on Tuesday at 51, released three studio albums of meticulously constructed, vocally ambitious, genre-crossing music."
  },
  {
    "title": "London Became a Global Hub for Phone Theft. Now We Know Why.",
    "link": "https://www.nytimes.com/2025/10/15/world/europe/london-police-phone-theft-china-gang.html",
    "summary": "About 80,000 phones were stolen in the British capital last year. The police are finally discovering where many of them went."
  },
  {
    "title": "Katie Porter Says She ‘Fell Short’ in Viral Video Moments",
    "link": "https://www.nytimes.com/2025/10/15/us/katie-porter-videos-response.html",
    "summary": "Videos surfaced last week showing the former congresswoman belittling a television reporter and berating an aide. Porter, who is running for California governor, pledged to do better."
  },
  {
    "title": "The Chicago Rat Hole Was Not Made by a Rat",
    "link": "https://www.nytimes.com/2025/10/14/science/chicago-rat-hole-squirrel.html",
    "summary": "A statistical analysis of an infamous indentation in a sidewalk suggested a 99 percent likelihood that another rodent made the mark."
  },
  {
    "title": "In a New Memoir, Kevin Federline Sounds an Alarm on Britney Spears",
    "link": "https://www.nytimes.com/2025/10/14/arts/music/britney-spears-kevin-federline-book.html",
    "summary": "Her ex-husband says in his book that since the pop star’s conservatorship ended, “It’s become impossible to pretend everything’s OK.”"
  },
  {
    "title": "The Matcha Market Cracks Under Pressure",
    "link": "https://www.nytimes.com/2025/10/14/dining/matcha.html",
    "summary": "Once consumed mainly in small, formal tea ceremonies, matcha is now mixed into fruity lattes and preyed on by counterfeiters. Can it survive its own popularity?"
  },
  {
    "title": "Trump Alone Can’t Save Argentina",
    "link": "https://www.nytimes.com/2025/10/15/opinion/argentina-milei-trump-bailout.html",
    "summary": "An American bailout can carry the country only so far."
  },
  {
    "title": "Mr. Trump, on the Middle East, Please Move Fast and Break Things",
    "link": "https://www.nytimes.com/2025/10/14/opinion/trump-israel-gaza-peace.html",
    "summary": "Message to Trump: As hard as Stage 1 was for Gaza peace, you have not even seen hard yet."
  },
  {
    "title": "Inmates Make Brazen Escape in Guatemala",
    "link": "https://www.nytimes.com/2025/10/14/world/americas/guatemala-prison-escape.html",
    "summary": "“I’m not going to deny the reality — there’s no good explanation,” the interior minister said of how the 20 inmates had slipped out, perhaps over a period of time."
  },
  {
    "title": "Artists Plan Nationwide Protests Against ‘Authoritarian Forces’",
    "link": "https://www.nytimes.com/2025/10/14/arts/artists-trump-protests-fall-freedom.html",
    "summary": "The visual artist Dread Scott, the playwright Lynn Nottage and others have organized a series of actions to unite the arts community against the Trump administration."
  },
  {
    "title": "As Trump Hurls Fresh Threats and Insults, Hochul Has Mamdani’s Back",
    "link": "https://www.nytimes.com/2025/10/14/nyregion/mamdani-hochul-trump.html",
    "summary": "Zohran Mamdani, the Democratic front-runner in the New York City mayor’s race, appeared with Gov. Kathy Hochul for the first time since she endorsed him last month."
  },
  {
    "title": "Report Finds Lead in Naked Protein Powders and Other Popular Brands",
    "link": "https://www.nytimes.com/2025/10/14/well/lead-protein-powder.html",
    "summary": "Experts said the levels were not high enough to cause immediate harm, but raised the risk of long-term health effects."
  }
]