[
  {
    "title": "What We Learned About Trump’s Attack on Iran",
    "link": "https://www.nytimes.com/video/us/politics/100000010243701/trumps-public-statements-and-iran-planning.html",
    "summary": "Over the past week, President Trump claimed he would make a decision about Iran in “two weeks” and repeatedly pressed it to come to the negotiating table. But the swiftness of the attack on Saturday night suggests that plans were underway after Israel began its bombing campaign against Iran a little more than a week ago."
  },
  {
    "title": "Florida Builds ‘Alligator Alcatraz’ Detention Center for Migrants in Everglades",
    "link": "https://www.nytimes.com/2025/06/23/us/politics/florida-alligator-alcatraz-migrant-detention-center.html",
    "summary": "Immigrant advocates said the move creates a whole new form of detention outside the scope of the federal government."
  },
  {
    "title": "Why Factories Are Having Trouble Filling Nearly 400,000 Open Jobs",
    "link": "https://www.nytimes.com/2025/06/23/business/factory-jobs-workers-trump.html",
    "summary": "For every 20 positions, there’s one qualified candidate, says one manufacturing chief executive. Some of President Trump’s policies are likely to exacerbate the problem."
  },
  {
    "title": "Ford Will Keep Battery Factory Even if Republicans Ax Tax Break",
    "link": "https://www.nytimes.com/2025/06/23/business/ford-battery-factory-electric-vehicles.html",
    "summary": "Ford Motor said it would open a new plant in Michigan that could become ineligible for federal incentives under a policy bill championed by President Trump and passed by the House."
  },
  {
    "title": "Cuomo and Mamdani Push to Raise Turnout in ‘Jump Ball’ Mayor’s Race",
    "link": "https://www.nytimes.com/2025/06/23/nyregion/mayor-primary-mamdani-cuomo.html",
    "summary": "A new poll shows the New York City mayor’s race tightening in its final days. Former Gov. Andrew M. Cuomo and Assemblyman Zohran Mamdani are scrambling for every last vote."
  },
  {
    "title": "As Black New Yorkers Move Out, N.Y.C. Politics May Be Reshaped",
    "link": "https://www.nytimes.com/2025/06/23/nyregion/nyc-mayor-black-voters.html",
    "summary": "Housing affordability and quality-of-life concerns are pushing longtime Black New Yorkers out of the city, underscoring Democrats’ challenges with their base ahead of the mayoral election."
  },
  {
    "title": "Why Humidity Makes the Temperature Feel Worse During a Heat Wave",
    "link": "https://www.nytimes.com/2025/06/23/weather/what-is-the-heat-index-humidity.html",
    "summary": "Some hot days feel even worse thanks to high humidity, trapped heat and dew points. Cities are especially vulnerable."
  },
  {
    "title": "US Heat Wave: Latest Forecast for the East Coast",
    "link": "https://www.nytimes.com/2025/06/22/weather/heat-wave-temperatures.html",
    "summary": "The next few days will bring the hottest temperatures of the year so far to much of the Eastern U.S."
  },
  {
    "title": "The MTV Reality Star in Trump’s Cabinet Who Wants You to Have More Kids",
    "link": "https://www.nytimes.com/2025/06/23/us/politics/sean-duffy-reality-television.html",
    "summary": "Sean Duffy, once the resident playboy on “The Real World,” is now a father of nine who presents his family as an example for America."
  },
  {
    "title": "Vera Rubin Telescope Quickly Found 1,200 New Asteroids",
    "link": "https://www.nytimes.com/2025/06/23/science/rubin-telescope-asteroids.html",
    "summary": "The Vera C. Rubin Observatory is expected to find millions of unknown objects in our solar system, and perhaps even a mysterious Planet Nine."
  },
  {
    "title": "Vera Rubin’s Legacy Lives On in a Troubled Scientific Landscape",
    "link": "https://www.nytimes.com/2025/06/22/science/vera-rubin-women-astronomy.html",
    "summary": "A powerful new telescope will usher in a new era of cosmic discovery, but in a political climate vastly different from when it was named for a once overlooked female astronomer."
  },
  {
    "title": "New York Again Embraces Nuclear Power With Plans to Build New Plant",
    "link": "https://www.nytimes.com/2025/06/23/nyregion/new-york-nuclear-power-plant.html",
    "summary": "In her announcement, Gov. Kathy Hochul gave few details about where the plant would be built, how much the project would cost or how long it would take to complete."
  },
  {
    "title": "Iran’s Weak Attack Is an Offramp. Trump Should Take It.",
    "link": "https://www.nytimes.com/2025/06/23/opinion/iran-qatar-attack.html",
    "summary": "The threat of war may propel both sides to work more earnestly to get back to the negotiating table."
  },
  {
    "title": "What Environmentalists Like Me Got Wrong About Climate Change",
    "link": "https://www.nytimes.com/2025/06/23/opinion/climate-change-methane-natural-gas.html",
    "summary": "Governments and U.S. states committed to climate action now need to persuade the oil industry to protect the world from climate chaos."
  },
  {
    "title": "Iran Fired Missiles at a U.S. Base",
    "link": "https://www.nytimes.com/2025/06/23/briefing/iran-us-base-heat-wave.html",
    "summary": "Also, a heat wave grips the eastern U.S. Here’s the latest at the end of Monday."
  },
  {
    "title": "As Sean ‘Diddy’ Combs Took a Victory Lap, He Planned Sex Nights, Prosecutors Say",
    "link": "https://www.nytimes.com/2025/06/23/arts/music/sean-combs-diddy-trial-sex-night-expenses.html",
    "summary": "Questioning its final witness, the government laid out flight plans, escort prices, hotel reservations and a web of payments for sexual encounters in 2023."
  },
  {
    "title": "Bodies of 3 Hikers Who Jumped in Water Near Lake Tahoe Are Recovered",
    "link": "https://www.nytimes.com/2025/06/23/us/missing-hikers-dead-rattlesnake-falls-california.html",
    "summary": "The three men had been hiking in Soda Springs, Calif., when they jumped into the water near Rattlesnake Falls, a remote and isolated area that made rescue difficult."
  },
  {
    "title": "The Curtain Drops on Improv Theater for the New York Police",
    "link": "https://www.nytimes.com/2025/06/23/nyregion/nypd-acting-improv-class.html",
    "summary": "Police Commissioner Jessica Tisch said a staffing crisis kept her from letting officers participate in a Brooklyn theater group that began after the death of Eric Garner, who died after a police officer put him in a chokehold, in 2014."
  },
  {
    "title": "Nearly 150 Report Being Jabbed With Needles at French Music Festival",
    "link": "https://www.nytimes.com/2025/06/23/world/europe/france-syringe-attacks-music-festival.html",
    "summary": "France’s Interior Ministry reported that 145 people said they had been stabbed with needles at festival events across the country."
  }
]