[
  {
    "title": "Trump Announces New Tariffs on Some European Countries in Greenland Standoff",
    "link": "https://www.nytimes.com/2026/01/17/us/politics/trump-eu-tariffs-greenland.html",
    "summary": "The president escalated his drive to take charge of the Danish territory, targeting Denmark and seven other European countries with a 10 percent rate."
  },
  {
    "title": "Greenlanders Protest Trump’s Takeover Plans",
    "link": "https://www.nytimes.com/2026/01/17/world/europe/greenland-denmark-protest-trump-takeover.html",
    "summary": "Protests erupted in several Greenlandic cites and in Denmark as President Trump intensified his efforts to take control of the Arctic island."
  },
  {
    "title": "White House Warns CBS: Air Trump Interview in Full, or ‘We’ll Sue’",
    "link": "https://www.nytimes.com/2026/01/17/business/media/cbs-news-trump-interview.html",
    "summary": "In previously unreported remarks, the White House press secretary Karoline Leavitt told CBS News that Mr. Trump would “sue” the news outlet if it did not air an interview unedited."
  },
  {
    "title": "World Leaders Consider Joining Trump’s ‘Board of Peace’ for Gaza",
    "link": "https://www.nytimes.com/2026/01/17/world/middleeast/trump-gaza-israel-board-peace.html",
    "summary": "The clash came as world leaders were deciding whether to join President Trump’s “Board of Peace” for Gaza."
  },
  {
    "title": "Conservative Influencer Chased From Minneapolis Streets by Counterprotesters",
    "link": "https://www.nytimes.com/2026/01/17/us/minneapolis-protests-immigration-fraud.html",
    "summary": "A protest at City Hall was organized by a conservative influencer to draw attention to a fraud scandal in the state. He was chased by counterprotesters lobbing water balloons in frigid temperatures."
  },
  {
    "title": "After Renee Good’s Killing, Some Conservatives Scorn Liberal Women",
    "link": "https://www.nytimes.com/2026/01/17/us/politics/white-women-conservatives.html",
    "summary": "Vocal Trump supporters are demonizing Renee Good, her partner and their allies, with some even using an acronym: AWFUL, or Affluent White Female Urban Liberal."
  },
  {
    "title": "National Anger Spills Into Target Stores, Again",
    "link": "https://www.nytimes.com/2026/01/17/business/target-immigration-minneapolis.html",
    "summary": "Videos of immigration officers dragging an employee out of a store near Minneapolis, the retailer’s hometown, set off renewed political debate after years of boycotts."
  },
  {
    "title": "How ICE Tensions and Immigration Politics Could Shape 2026 Midterm Elections",
    "link": "https://www.nytimes.com/2026/01/16/us/politics/ice-minnesota-midterms.html",
    "summary": "Three reporters discuss the Minneapolis chaos and how it could play a role in the midterms."
  },
  {
    "title": "Before Criticizing Pro-Hamas Chants, Mamdani Sought Jewish Leaders’ Input",
    "link": "https://www.nytimes.com/2026/01/17/nyregion/mamdani-hamas-protest.html",
    "summary": "The outreach by Mayor Zohran Mamdani’s team has demonstrated how the mayor is taking care to not inflame tensions on either side of the Israel-Gaza war."
  },
  {
    "title": "Mamdani Appoints New Parks Commissioner to Oversee NYC Green Spaces",
    "link": "https://www.nytimes.com/2026/01/17/nyregion/nyc-parks-commissioner-tricia-shimamura.html",
    "summary": "The mayor announced Tricia Shimamura as the city’s new parks commissioner amid broad calls for more park funding."
  },
  {
    "title": "A.I. Is Coming to Class. These Professors Want to Ease Your Worries.",
    "link": "https://www.nytimes.com/2026/01/17/nyregion/ai-college-classes.html",
    "summary": "Even as some instructors remain fervently opposed to chatbots, other writing and English professors are trying to improve them."
  },
  {
    "title": "AI Attack Ad in Texas Senate Race Shows John Cornyn Dancing With Jasmine Crockett",
    "link": "https://www.nytimes.com/2026/01/16/us/politics/ai-ad-texas-senate-paxton-cornyn.html",
    "summary": "A video from Ken Paxton, a Republican primary challenger to Senator John Cornyn of Texas, depicted A.I.-generated imagery of the senator twirling with Jasmine Crockett, a Democratic Senate candidate."
  },
  {
    "title": "One Year Later, What Kind of Country Have We Become?",
    "link": "https://www.nytimes.com/2026/01/18/opinion/trump-one-year-later.html",
    "summary": "The United States is broken, but not in every way."
  },
  {
    "title": "What ‘Landman’ Understands About Oil",
    "link": "https://www.nytimes.com/2026/01/18/opinion/landman-sheridan-oil-accuracy.html",
    "summary": "The show does far more to criticize the oil and gas industry than it does to bolster it."
  },
  {
    "title": "These Are the 12 States Vying to Kick Off Democrats’ 2028 Contest",
    "link": "https://www.nytimes.com/2026/01/17/us/politics/2028-democratic-primary-states-iowa-south-carolina-nevada-new-hampshire.html",
    "summary": "There were a few surprises, and subtle regional digs, as Democratic state parties angled for early spots on the next presidential primary calendar. The New York Times reviewed their applications."
  },
  {
    "title": "Virginia’s New Governor Moves Swiftly to Overhaul State University Boards",
    "link": "https://www.nytimes.com/2026/01/17/us/politics/spanberger-virginia-uva-board.html",
    "summary": "Abigail Spanberger, a Democrat, appointed new board members at three state schools, hours after she was sworn in as Virginia’s first female governor."
  },
  {
    "title": "France’s Embassy in Iraq Is a Spoil of Antisemitism, Jewish Family Charges",
    "link": "https://www.nytimes.com/2026/01/18/world/middleeast/jewish-family-iraq-embassy-.html",
    "summary": "A Jewish family that fled Iraq generations ago rented its home to France for use as an embassy, but Paris long ago stopped paying it rent, after Iraq stripped Jews of property."
  },
  {
    "title": "Trump Backs a Potential Primary Challenger to Bill Cassidy, a G.O.P. Senator",
    "link": "https://www.nytimes.com/2026/01/18/us/politics/trump-bill-cassidy-julia-letlow-primary-challenge-endorsement.html",
    "summary": "The president urged Representative Julia Letlow of Louisiana to run against Mr. Cassidy, in a move that is likely to further complicate his relationship with Senate Republicans."
  }
]