[
  {
    "title": "Trump Calls Affordability a ‘Con Job’ as His Edge on the Economy Slips",
    "link": "https://www.nytimes.com/2025/12/02/us/politics/trump-affordability-economy-messaging.html",
    "summary": "President Trump is growing frustrated as Americans struggle with higher prices and pessimism over the state of the economy."
  },
  {
    "title": "U.S. Pauses Immigration Applications From Nations on Travel Ban List",
    "link": "https://www.nytimes.com/2025/12/02/us/politics/trump-travel-ban-citizenship-green-cards-dc-shooting.html",
    "summary": "The pause, which will halt green card and U.S. citizenship processing for broad swaths of people, deepens a remarkable crackdown on legal immigration pathways in recent days."
  },
  {
    "title": "Immigration Officials Target Afghans for Deportation in Wake of D.C. Shooting",
    "link": "https://www.nytimes.com/2025/12/02/us/politics/afghans-deportation-shooting.html",
    "summary": "The stepped-up enforcement comes as the Trump administration has also moved to reassess the vetting of Afghans who came to the country under the Biden administration."
  },
  {
    "title": "Hegseth Says He Did Not See Survivors of Boat Strike Clinging to Wreckage",
    "link": "https://www.nytimes.com/2025/12/02/us/politics/hegseth-boat-strikes.html",
    "summary": "The defense secretary supported the admiral he said called for the second strike on Sept. 2 against a boat the administration says was smuggling drugs."
  },
  {
    "title": "Maduro Faces His Ultimate Fight as Trump Threatens Military Action in Venezuela",
    "link": "https://www.nytimes.com/2025/12/02/world/americas/venezuela-nicolas-maduro-trump.html",
    "summary": "President Trump’s threat of military action has confronted President Nicolás Maduro of Venezuela with the gravest challenge of his crisis-ridden reign."
  },
  {
    "title": "Venezuela Accepts Migrant Repatriation Flight From U.S. Amid Airspace Tensions",
    "link": "https://www.nytimes.com/2025/12/02/us/politics/venezuela-migrant-deportations-trump.html",
    "summary": "The flight’s approval illustrates how the United States and Venezuela are still communicating, after a declaration from President Trump that Venezuelan airspace was “closed in its entirety.”"
  },
  {
    "title": "Juan Orlando Hernández, Former President of Honduras, Is Freed From Prison After Trump Pardon",
    "link": "https://www.nytimes.com/2025/12/02/us/politics/hernandez-honduras-trump.html",
    "summary": "Juan Orlando Hernández was convicted of flooding the United States with cocaine and had been sentenced to 45 years in prison."
  },
  {
    "title": "Agriculture Dept. Threatens to Withhold SNAP Funding From Democratic States",
    "link": "https://www.nytimes.com/2025/12/02/us/politics/food-stamps-democratic-states.html",
    "summary": "The latest threat to SNAP funding came after weeks of confusion over the status of benefits during the government shutdown."
  },
  {
    "title": "The 85-Year-Old Activist Trying to Block the Trump Presidential Library Plan",
    "link": "https://www.nytimes.com/2025/12/02/us/trump-library.html",
    "summary": "After Marvin Dunn sued, the trustees of Miami Dade College voted for a second time to hand over a prime property for President Trump’s future library. He says he’ll keep fighting."
  },
  {
    "title": "Putin and Witkoff Meet in Russia as U.S. Pushes Ukraine Deal",
    "link": "https://www.nytimes.com/2025/12/02/world/europe/putin-witkoff-trump-ukraine-meeting.html",
    "summary": "The two sides did not reach any specific compromises, an aide to President Vladimir V. Putin said, as the United States pushes a plan to end the war in Ukraine."
  },
  {
    "title": "The 10 Best Books of 2025",
    "link": "https://www.nytimes.com/2025/12/02/books/review/best-books-2025.html",
    "summary": "The staff of The New York Times Book Review choose the year’s top fiction and nonfiction."
  },
  {
    "title": "Tennessee House Special Election 2025: What to Watch",
    "link": "https://www.nytimes.com/2025/12/02/us/politics/tennessee-house-behn-van-epps.html",
    "summary": "A special election for a House seat in Tennessee was supposed to be an easy Republican victory. But national spending and Democratic enthusiasm have made it an unusually high-profile race."
  },
  {
    "title": "Ayanna Pressley Won’t Challenge Markey for Senate in Massachusetts",
    "link": "https://www.nytimes.com/2025/12/02/us/politics/ayanna-pressley-markey-massachusetts-senate.html",
    "summary": "Ms. Pressley, a prominent progressive, will instead run for re-election to the House. Her move is expected to help Senator Ed Markey, though he still faces one well-known Democratic primary challenger."
  },
  {
    "title": "How Democrats Have Performed in 2025 Special Elections",
    "link": "https://www.nytimes.com/2025/12/02/us/elections/special-elections-democrats-tn7.html",
    "summary": "Tennessee’s Seventh District was created to be safely Republican, but in recent special elections across the country Democrats have done significantly better than they did in 2024."
  },
  {
    "title": "Elon Musk’s Foundation Grows to $14 Billion, but Gives Little to Outsiders",
    "link": "https://www.nytimes.com/2025/12/02/us/politics/elon-musk-foundation.html",
    "summary": "The philanthropy has become one of America’s biggest, but most of its giving went to charities closely tied to the world’s richest man."
  },
  {
    "title": "Michael and Susan Dell Pledge $6 Billion in Investment ‘Trump Accounts’ for Children",
    "link": "https://www.nytimes.com/2025/12/02/business/dell-children-trump-accounts.html",
    "summary": "The tech billionaire and his wife hope other philanthropists follow their $6 billion lead in expanding the reach of soon-to-be-created “Trump accounts.”"
  },
  {
    "title": "What to Know About Trump Accounts for Children and Eligibility After Dell Donation",
    "link": "https://www.nytimes.com/2025/12/02/business/trump-accounts-children-dell.html",
    "summary": "Next year, Michael and Susan Dell plan to move $250 into the new Trump accounts of millions of children under 10. You’ll need to live in the right ZIP code."
  },
  {
    "title": "The Dark Secrets of Denis Johnson’s ‘Train Dreams’",
    "link": "https://www.nytimes.com/2025/12/02/magazine/train-dreams-netflix-denis-johnson-biography.html",
    "summary": "An adaptation of Denis Johnson’s novella arrives at the same time as a new biography, unlocking one of his best-loved and least-understood books."
  },
  {
    "title": "Cancer-Detecting Blood Tests Are on the Rise. Do They Work?",
    "link": "https://www.nytimes.com/2025/12/02/well/cancer-detecting-blood-tests-are-on-the-rise-do-they-work.html",
    "summary": "The tests have not been approved by federal regulators, but that hasn’t stopped patients from wanting them — and doctors from worrying."
  },
  {
    "title": "University of Oklahoma Instructor on Leave After Failing Student’s Gender Essay",
    "link": "https://www.nytimes.com/2025/12/02/us/oklahoma-bible-essay-gender-teasing-zero.html",
    "summary": "The essay, written for a psychology class by a University of Oklahoma student, called the idea of multiple genders “demonic.” The instructor said it did not answer the assignment."
  },
  {
    "title": "Eugene Hasenfus, Gunrunner Who Exposed Iran-Contra Plot, Dies at 84",
    "link": "https://www.nytimes.com/2025/12/02/us/eugene-hasenfus-dead.html",
    "summary": "He emerged out of obscurity when his cargo plane was shot down while illegally ferrying arms to Nicaraguan rebels, setting off a scandal that tarnished the Reagan and Bush White Houses."
  },
  {
    "title": "Like Fancy Japanese Toilets? You’ll Love the Sound of This.",
    "link": "https://www.nytimes.com/2025/12/02/realestate/japanese-toilets-toto-sound-princess.html",
    "summary": "Devices that conceal unwanted noises are the next frontier in advanced toilet technology. Would you like some peaceful birdsong, or perhaps a burst of artillery fire?"
  },
  {
    "title": "Ukraine Is Still Worth Fighting For",
    "link": "https://www.nytimes.com/2025/12/02/opinion/ukraine-russia-peace-plan-business-deal.html",
    "summary": "Don’t let Trump sell out its freedom for business deals with Putin."
  },
  {
    "title": "Congress Should Investigate Trump’s Venezuela Boat Strikes",
    "link": "https://www.nytimes.com/2025/12/02/opinion/trump-venezuela-boat-strikes-congress-committee.html",
    "summary": "Federal lawmakers have ample powers to uncover and end administration abuse."
  },
  {
    "title": "Trump Frees Former President of Honduras",
    "link": "https://www.nytimes.com/2025/12/02/briefing/honduras-somalis-cdc.html",
    "summary": "Plus, C.D.C. advisers are set to change the vaccine schedule. Here’s the latest at the end of Tuesday."
  },
  {
    "title": "‘I Knew It Was Him’: Officer Recalls Confronting Mangione at McDonald’s",
    "link": "https://www.nytimes.com/2025/12/02/nyregion/police-mangione-arrest-testimony.html",
    "summary": "A Pennsylvania patrolman said a superior had offered him a hoagie if he responded to a call at a local McDonald’s. The officer recognized the suspect and then played for time."
  },
  {
    "title": "Prosecutors Drop Murder Case Against Man Who Served More Than 25 Years",
    "link": "https://www.nytimes.com/2025/12/02/nyregion/tonawanda-murder-charges-dropped-james-pugh.html",
    "summary": "James Pugh, one of two men originally convicted in the savage killing of Deborah Meindl near Buffalo in 1993, said all along that he was innocent."
  },
  {
    "title": "San Francisco Sues Ultraprocessed Food Companies",
    "link": "https://www.nytimes.com/2025/12/02/us/san-francisco-ultraprocessed-food-lawsuit.html",
    "summary": "The city attorney accuses large manufacturers of causing diseases that have burdened governments with public health costs."
  }
]