[
  {
    "title": "How Battlefield Tech Was Used in Minneapolis",
    "link": "https://www.nytimes.com/video/us/100000010669560/how-battlefield-tech-was-used-in-minneapolis.html",
    "summary": "Our reporter Thomas Gibbons-Neff, who deployed twice to Afghanistan as a Marine and later was our Kabul bureau chief, looks at the battlefield technology used for an immigration arrest at a home in Minneapolis."
  },
  {
    "title": "Democratic Governors Promise Accountability After Alex Pretti Killing",
    "link": "https://www.nytimes.com/2026/01/29/us/politics/democrats-governors-trump-minneapolis.html",
    "summary": "The chin-out rhetoric of Democratic governors about holding Trump administration officials responsible for violence in their cities may be more political than practicable."
  },
  {
    "title": "Man Accused of Squirting Ilhan Omar with Vinegar Is Charged With Assault",
    "link": "https://www.nytimes.com/2026/01/29/us/ilhan-omar-spray-anthony-j-kazmierczak-charged.html",
    "summary": "Ms. Omar was sprayed with liquid from a syringe as she spoke at a town hall and called for the resignation of Kristi Noem, who leads the Homeland Security Department."
  },
  {
    "title": "U.S. Trade Deficit Widens Despite Trump’s Tariffs",
    "link": "https://www.nytimes.com/2026/01/29/business/us-trade-deficit-tariffs.html",
    "summary": "The monthly trade deficit and imports rebounded in November after shrinking significantly in prior months, new data show."
  },
  {
    "title": "Trump’s Trade Policies Sort Manufacturers Into Winners and Losers",
    "link": "https://www.nytimes.com/2026/01/29/business/economy/manufacturing-factories-tariffs.html",
    "summary": "Tariffs have protected some companies, but more often they’ve hit the parts and materials many factories need to make finished goods."
  },
  {
    "title": "A Rug Maker Withstood One Year of Trump’s Tariffs. New Challenges Loom.",
    "link": "https://www.nytimes.com/2026/01/29/business/economy/tariffs-rugs-loloi.html",
    "summary": "Loloi stockpiled rugs from India, Turkey and other countries in advance, but inventory is running low."
  },
  {
    "title": "What We Learned After Tracking Every Lawsuit Challenging Trump’s Policies",
    "link": "https://www.nytimes.com/2026/01/29/us/politics/trump-lawsuits-tracker-takeaways.html",
    "summary": "President Trump’s agenda faced more than 600 lawsuits over the past year. In many cases, district court judges found his policies to be unlawful."
  },
  {
    "title": "Trump Warns Iran With Military Muscle, but Risks a Regional War",
    "link": "https://www.nytimes.com/2026/01/29/world/europe/trump-iran-threats.html",
    "summary": "Iran’s Islamic Republic, weakened by airstrikes in June and huge popular unrest, warns that it will strike back hard if attacked by the United States. This time, Iran may mean it."
  },
  {
    "title": "European Union Labels Iran’s Revolutionary Guard a Terrorist Group",
    "link": "https://www.nytimes.com/2026/01/29/world/europe/european-union-iran-sanctions-irgc.html",
    "summary": "The move, which comes after the killing of protesters, brings the European Union in line with the United States and Canada."
  },
  {
    "title": "Saks Fifth Avenue Bankruptcy Revives Debate Over the Future of Department Stores",
    "link": "https://www.nytimes.com/2026/01/29/style/saks-bankruptcy-department-store-shopping.html",
    "summary": "Saks Fifth Avenue’s bankruptcy filing has revived debates about how these once celebrated shopping emporiums can regain their luster."
  },
  {
    "title": "She Protested a Book Ban. Oklahoma Revoked Her Teacher’s License.",
    "link": "https://www.nytimes.com/2026/01/29/us/summer-boismier-oklahoma-book-ban-protest.html",
    "summary": "Summer Boismier, a high school English teacher in Oklahoma,  lost her teaching license after she protested a book ban. Now she is fighting to return to the classroom."
  },
  {
    "title": "Maxim Naumov to Skate at 2026 Olympics After Parents’ Death in D.C. Plane Crash",
    "link": "https://www.nytimes.com/2026/01/29/us/maxim-naumov-2026-olympics-dc-plane-crash.html",
    "summary": "After his parents died in the midair collision over Washington, D.C., a year ago, Maxim Naumov struggled to put on his skates. Now he will compete for the United States at the Milan-Cortina Games."
  },
  {
    "title": "Winter Storm Forecast to Bring Deep Snow to the Carolinas and Virginia",
    "link": "https://www.nytimes.com/2026/01/29/weather/winter-storm-weekend-forecast-snow.html",
    "summary": "Up to a foot is possible this weekend in parts of the Southeast and on Cape Cod, with smaller amounts expected for much of the East Coast."
  },
  {
    "title": "Why Some Cold States Are Making It Cheaper to Run a Heat Pump",
    "link": "https://www.nytimes.com/2026/01/29/upshot/heat-pumps-cheaper-winter.html",
    "summary": "New discounts can make heat pumps go from a bad investment to a good idea."
  },
  {
    "title": "San Jose Mayor Matt Mahan Will Run for California Governor in 2026",
    "link": "https://www.nytimes.com/2026/01/29/us/elections/matt-mahan-governor-california.html",
    "summary": "Matt Mahan, a moderate Democrat who serves as mayor of San Jose, Calif., is entering the crowded race for California governor."
  },
  {
    "title": "Amy Klobuchar Announces Run for Minnesota Governor",
    "link": "https://www.nytimes.com/2026/01/29/us/politics/amy-klobuchar-minnesota-governor.html",
    "summary": "The Democratic senator, who signaled her bid after Gov. Tim Walz said he wouldn’t run again, talked about moving past political divides in a video announcement."
  },
  {
    "title": "A State Senate Race in Texas Offers Republicans a Warning",
    "link": "https://www.nytimes.com/2026/01/29/us/politics/taylor-rehmet-leigh-wambsganss-texas-election.html",
    "summary": "A State Senate runoff on Saturday in the Fort Worth suburbs will preview whether a backlash against conservative social policies will give Democrats a chance to gain."
  },
  {
    "title": "Parents Navigate a Fracturing Vaccine Landscape",
    "link": "https://www.nytimes.com/2026/01/29/well/parents-vaccines.html",
    "summary": "Rattled by the C.D.C.’s actions and the spread of measles, some parents are scrambling to figure out how to best protect their children."
  },
  {
    "title": "New Food Stamp Rules Are Confusing Grocery Stores and Consumers",
    "link": "https://www.nytimes.com/2026/01/29/business/snap-benefits-food-stamps-rules-health.html",
    "summary": "A dizzying array of rules govern what can be bought with SNAP dollars, confusing grocery stores and consumers."
  },
  {
    "title": "TPS Expiration Under Trump Hits Haitian Workers in Critical Health Care Roles",
    "link": "https://www.nytimes.com/2026/01/29/us/trump-tps-haitians-health-care-job-losses.html",
    "summary": "Haitians are a vital source of employees for health care providers in many communities. The Trump administration is removing legal status next month for 330,000 of them."
  },
  {
    "title": "How the A.I. Boom Could Push Up the Price of Your Next PC",
    "link": "https://www.nytimes.com/2026/01/29/technology/ai-memory-chips-pc-smartphone.html",
    "summary": "A.I. companies are buying up memory chips, causing the prices of those components — which are also used in laptops and smartphones — to soar."
  },
  {
    "title": "Amazon and Google Eat Into Nvidia’s A.I. Chip Supremacy",
    "link": "https://www.nytimes.com/2026/01/29/technology/amazon-google-nvidia-chips-competition.html",
    "summary": "The rivals made billions of dollars in the business over the past year, showing other companies that Nvidia isn’t the only game in town."
  },
  {
    "title": "Netanyahu Vows to Cut Israel’s Reliance on U.S. Military Aid",
    "link": "https://www.nytimes.com/2026/01/29/world/middleeast/israel-us-aid-weapons-gaza-biden-netanyahu.html",
    "summary": "Prime Minister Benjamin Netanyahu blamed some soldiers’ deaths in the Gaza war on a lack of ammunition caused by a pause in American weapon deliveries during President Biden’s term."
  },
  {
    "title": "Girls Sue Saint Ann’s School and Former Teacher Over Sex Crimes",
    "link": "https://www.nytimes.com/2026/01/29/nyregion/saint-anns-school-winston-nguyen-lawsuit.html",
    "summary": "Winston Nguyen, a former teacher at Saint Ann’s School who pleaded guilty to a felony charge last year, is accused in the lawsuit of soliciting naked photos of students and sharing them online."
  },
  {
    "title": "Trump’s Lies Have a Purpose",
    "link": "https://www.nytimes.com/2026/01/29/opinion/truump-ice-minnesota-noem-miller.html",
    "summary": "What MAGA sees in the Minneapolis mirror."
  },
  {
    "title": "Hind Rajab’s Mother: No Child Deserves to Die Like My Daughter",
    "link": "https://www.nytimes.com/2026/01/29/opinion/israel-gaza-child-death-hind-rajab.html",
    "summary": "What was done to my daughter did not break me. It left me with a mother’s responsibility to ensure no child is left unheard."
  },
  {
    "title": "A Crisis for President Trump",
    "link": "https://www.nytimes.com/2026/01/29/briefing/a-crisis-for-president-trump.html",
    "summary": "The Department of Homeland Security is in turmoil after the killing of Alex Pretti."
  },
  {
    "title": "Former Deputy Sean Grayson Sentenced to 20 Years in Sonya Massey Shooting",
    "link": "https://www.nytimes.com/2026/01/29/us/sean-grayson-sentencing-sonya-massey-shooting.html",
    "summary": "The deputy, Sean Grayson, was convicted of second-degree murder for killing Ms. Massey in 2024 at her home in Springfield, Ill., after she had called 911."
  },
  {
    "title": "Why a New Mexico Developer Quit Natural Gas",
    "link": "https://www.nytimes.com/2026/01/29/climate/why-a-new-mexico-developer-quit-natural-gas.html",
    "summary": "For John Moscato, a land developer in Las Cruces, N.M., installing gas lines at new home sites was “an ongoing headache.” Ditching gas saved him money."
  },
  {
    "title": "Driver Rams Car Into Headquarters of Chabad Hasidic Movement",
    "link": "https://www.nytimes.com/2026/01/28/nyregion/chabad-crash-eastern-parkway.html",
    "summary": "No one was injured when a man drove into a rear door of the building on Eastern Parkway in Brooklyn. The man was arrested; the police are investigating the episode as a hate crime."
  },
  {
    "title": "Wynton Marsalis, Founder of Jazz at Lincoln Center, to Step Down",
    "link": "https://www.nytimes.com/2026/01/29/arts/music/wynton-marsalis-jazz-at-lincoln-center.html",
    "summary": "After 40 years with the organization, the trumpeter and impresario will end his role as managing and artistic director in July 2027."
  }
]