[
  {
    "title": "‘Flying Blind’: Trump Strips Government of Expertise at a High-Stakes Moment",
    "link": "https://www.nytimes.com/2025/08/21/us/politics/trump-government-expertise.html",
    "summary": "President Trump has few sources of independent advice just as he is trying to broker an end to the Russian invasion of Ukraine, perhaps the trickiest negotiation of his presidency."
  },
  {
    "title": "Vance Recounts Telling Zelensky to ‘Behave’ in Trump Meeting",
    "link": "https://www.nytimes.com/2025/08/21/us/politics/vance-zelensky-ukraine.html",
    "summary": "It was not the first time that the vice president had addressed Ukraine’s leader with words more commonly spoken to toddlers than heads of state."
  },
  {
    "title": "Newsom Signs California Redistricting Plan to Counter Texas Republicans",
    "link": "https://www.nytimes.com/2025/08/21/us/politics/california-newsom-redistricting-texas.html",
    "summary": "Gov. Gavin Newsom and Democratic state lawmakers moved quickly to create new districts that could help their party flip five congressional seats. Their plan still requires voter approval."
  },
  {
    "title": "Gavin Newsom’s Redistricting Ballot Fight Raises $6.2 Million Online",
    "link": "https://www.nytimes.com/2025/08/21/us/politics/newsom-gerrymandering-california-fundraising.html",
    "summary": "The figure makes plain how a gerrymandering push that began in Texas but spread nationwide has energized the Democratic base."
  },
  {
    "title": "Erik Menendez Has Been Denied Parole. Here’s What to Know.",
    "link": "https://www.nytimes.com/article/menendez-brothers-resentencing-hearing.html",
    "summary": "A California parole panel said Mr. Menendez should not be released from prison, 36 years after he and his brother, Lyle, killed their parents. Lyle’s parole hearing is Friday."
  },
  {
    "title": "Judge Orders ‘Alligator Alcatraz’ Detention Center in Florida to Shut Down for Now",
    "link": "https://www.nytimes.com/2025/08/21/us/alligator-alcatraz-florida-ruling.html",
    "summary": "A judge ruled that the state and federal governments acted illegally by not conducting an environmental review before building the center in the Florida Everglades."
  },
  {
    "title": "Noem’s Spending Rule Causes Delays at Homeland Security Dept.",
    "link": "https://www.nytimes.com/2025/08/21/us/kristi-noem-spending-contracts-homeland-security-department.html",
    "summary": "The secretary’s requirement that she personally approve any expense over $100,000 has created a backlog of “mission critical” contracts, records show."
  },
  {
    "title": "White House Lists Smithsonian Exhibits It Finds Objectionable",
    "link": "https://www.nytimes.com/2025/08/21/arts/design/smithsonian-trump.html",
    "summary": "The Trump administration highlighted material dealing with topics like sexuality, slavery and immigration."
  },
  {
    "title": "Trump Budget Office Is Withholding H.I.V. Funds That Congress Appropriated",
    "link": "https://www.nytimes.com/2025/08/21/health/hiv-aids-pepfar-funding-trump.html",
    "summary": "Lawmakers allocated $6 billion this fiscal year for PEPFAR, the H.I.V. prevention and treatment program, but the administration has indicated it will release less than half of that."
  },
  {
    "title": "Taking on the Fed, Trump Combines Retribution Tactics With a Power Play",
    "link": "https://www.nytimes.com/2025/08/21/us/politics/trump-fed-federal-reserve.html",
    "summary": "The president’s second term has been marked by his eagerness to go after his foes and his assertions of presidential authority. Both traits are on display as he seeks control over the central bank."
  },
  {
    "title": "Judge Says Habba Has Served as U.S. Attorney Without Legal Authority",
    "link": "https://www.nytimes.com/2025/08/21/nyregion/alina-habba-us-attorney-new-jersey.html",
    "summary": "Defense lawyers had questioned whether Alina Habba, a Trump loyalist, was legally authorized to run the U.S. attorney’s office in New Jersey."
  },
  {
    "title": "See Trump’s Deployment of the National Guard, Other Federal Agents in Washington, D.C.",
    "link": "https://www.nytimes.com/2025/08/21/us/politics/dc-police-national-guard-trump.html",
    "summary": "Times journalists reviewed hundreds of images and videos of law enforcement agents to determine what they have been doing on the ground."
  },
  {
    "title": "Red Envelopes With Cash Are Changing Hands at Adams Campaign Rallies",
    "link": "https://www.nytimes.com/2025/08/21/nyregion/eric-adams-chinese-cash-envelopes.html",
    "summary": "New York Times reporters witnessed supporters of Mayor Eric Adams handing out cash-filled envelopes. Sometimes, that money went to reporters from Chinese-language outlets."
  },
  {
    "title": "Across 5 Indictments, Prosecutors Paint a Picture of a City for Sale",
    "link": "https://www.nytimes.com/2025/08/21/nyregion/ingrid-lewis-martin-corruption-indictment.html",
    "summary": "Ingrid Lewis-Martin, the former chief adviser to Mayor Eric Adams, is accused of taking bribes in exchange for acting on behalf of favor-seekers across New York City."
  },
  {
    "title": "Hurricane Erin Is Heading Out to Sea. People Are Riveted Anyway.",
    "link": "https://www.nytimes.com/2025/08/21/us/hurricane-erin.html",
    "summary": "The Category 2 hurricane isn’t expected to make landfall. Still, it’s drawing notice as the first named storm to reach hurricane strength this year."
  },
  {
    "title": "Hurricane Erin Captured From International Space Station",
    "link": "https://www.nytimes.com/2025/08/21/weather/hurricane-erin-international-space-station.html",
    "summary": "The International Space Station captured the unusually large storm as it swirled near the East Coast of the United States."
  },
  {
    "title": "‘Twelfth Night’ Review: Lupita Nyong’o in Illyria",
    "link": "https://www.nytimes.com/2025/08/21/theater/twelfth-night-review-lupita-nyongo-in-illyria.html",
    "summary": "The actress is luminous, alongside her look-alike brother Junior Nyong’o, Sandra Oh and Peter Dinklage, in Shakespeare’s comedy at the newly revived Delacorte Theater."
  },
  {
    "title": "Delaware Looks to ‘Living Shorelines’ to Save Its Coasts",
    "link": "https://www.nytimes.com/2025/08/20/climate/delaware-living-shorelines.html",
    "summary": "Along with other East Coast states, Delaware is using natural materials to protect vulnerable coastal areas."
  },
  {
    "title": "The Rise of Right-Wing Nihilism",
    "link": "https://www.nytimes.com/2025/08/21/opinion/rufo-yarvin-trump-nihilism.html",
    "summary": "Rather than conserve or build, some people just want to destroy."
  },
  {
    "title": "One Sentence in the Constitution Is Causing America Huge Problems",
    "link": "https://www.nytimes.com/2025/08/21/opinion/trump-constitution-unitary-executive.html",
    "summary": "An amendment that can help save our democracy."
  },
  {
    "title": "What Do You Want to Read About Disability?",
    "link": "https://www.nytimes.com/2025/08/20/us/disability-stories-callout.html",
    "summary": "Input from readers will help shape our coverage."
  },
  {
    "title": "Minnesota’s Democratic Party Revokes Endorsement of Mayoral Candidate",
    "link": "https://www.nytimes.com/2025/08/21/us/minnesotas-democratic-party-revokes-endorsement-of-mayoral-candidate.html",
    "summary": "State Democratic officials withdrew the endorsement of a Minneapolis mayoral candidate who has drawn comparisons to Zohran Mamdani, the New York mayoral hopeful."
  },
  {
    "title": "Thaksin Shinawatra, Former Thai Premier, Cleared of Insulting Monarchy",
    "link": "https://www.nytimes.com/2025/08/21/world/asia/thailand-thaksin-royal-insult.html",
    "summary": "But the reprieve for Thaksin Shinawatra, who remains a political force, did not mean that the legal troubles for him and his family were over."
  },
  {
    "title": "Family of Slain New Jersey Woman Who Reported Harassment Says Police ‘Failed’",
    "link": "https://www.nytimes.com/2025/08/21/nyregion/semanchik-murder-new-jersey-police.html",
    "summary": "Dr. Lauren Semanchik told the police that she was “especially uncomfortable” because her ex-boyfriend was a state trooper. She and her boyfriend were later shot to death."
  }
]