[
  {
    "title": "Trump Buys Himself Time, and Opens Up Some New Options",
    "link": "https://www.nytimes.com/2025/06/19/us/politics/trump-buys-time-iran-decision.html",
    "summary": "While President Trump appears to be offering one more off ramp to the Iranians, he also is bolstering his own military options."
  },
  {
    "title": "U.S. Spy Agencies Assess Iran Remains Undecided on Building a Bomb",
    "link": "https://www.nytimes.com/2025/06/19/us/politics/iran-nuclear-weapons-assessment.html",
    "summary": "U.S. intelligence officials said Iran was likely to pivot toward producing a nuclear weapon if the U.S. attacked a main uranium enrichment site, or if Israel killed its supreme leader."
  },
  {
    "title": "A U.S. Attack on Iran Would Show the Limits of China’s Power",
    "link": "https://www.nytimes.com/2025/06/20/world/asia/us-iran-israel-china.html",
    "summary": "China, which depends on Iran for oil and to counter American influence, has a lot to lose from a wider war. But there’s not much it can do about it."
  },
  {
    "title": "Appeals Court Lets Trump Keep Control of California National Guard in L.A.",
    "link": "https://www.nytimes.com/2025/06/19/us/california-national-guard-trump.html",
    "summary": "A panel rejected a lower-court’s finding that it was likely illegal for President Trump to use state troops to protect immigration agents from protests."
  },
  {
    "title": "ICE Imposes New Rules on Congressional Visits",
    "link": "https://www.nytimes.com/2025/06/19/us/politics/ice-congress.html",
    "summary": "The policy says that ICE field offices are not subject to a federal law that allows members of Congress to make unannounced oversight visits to immigration facilities that “detain or otherwise house aliens.”"
  },
  {
    "title": "French Lawmaker Says He Was Denied Entry Into the United States",
    "link": "https://www.nytimes.com/2025/06/19/world/europe/france-lawmaker-denied-visa-us-trump-amirshahi.html",
    "summary": "Pouria Amirshahi, a leftist member of Parliament, hopes that the decision will be reversed so that he can travel to meet lawmakers to understand life under President Trump."
  },
  {
    "title": "Chinese Companies Set Their Sights on Brazil",
    "link": "https://www.nytimes.com/2025/06/20/business/china-temu-meituan-shein-brazil.html",
    "summary": "Confronted with tariffs and scrutiny in the United States and Europe, Chinese consumer brands are betting that they can become household names in Latin America’s biggest economy."
  },
  {
    "title": "How Black Lung Came Roaring Back to Coal Country",
    "link": "https://www.nytimes.com/2025/06/19/well/black-lung-appalachia-coal-miners.html",
    "summary": "Once nearly eradicated, the “old man’s disease” is back and suffocating younger miners. Federal cuts risk putting a solution further out of reach."
  },
  {
    "title": "The World’s 50 Best Restaurants Announces Its 2025 List",
    "link": "https://www.nytimes.com/2025/06/19/dining/the-worlds-50-best-restaurants-announces-its-2025-list.html",
    "summary": "A Peruvian spot took No. 1, while five U.S. chefs kept places on the list."
  },
  {
    "title": "The World’s 50 Best Restaurants anuncia su lista de 2025",
    "link": "https://www.nytimes.com/es/2025/06/19/espanol/estilos-de-vida/50-best-lista-2025-peru.html",
    "summary": "Perú, España, México y Dinamarca ocupan los primeros cinco lugares de la lista."
  },
  {
    "title": "Karen Read Acquittal Exposes Flaws in Police Practices, Supporters and Critics Say",
    "link": "https://www.nytimes.com/2025/06/19/us/karen-read-trial-police-investigation.html",
    "summary": "Both sides agreed that the investigation into the death of Ms. Read’s boyfriend, a Boston police officer, was flawed and plagued by unethical and unprofessional conduct."
  },
  {
    "title": "Man Is Charged With Trying to Kidnap Memphis Mayor, Police Say",
    "link": "https://www.nytimes.com/2025/06/19/us/threat-kidnapping-memphis-mayor.html",
    "summary": "The 25-year-old man told the police that he had gone to the home of Mayor Paul Young to confront him about crime. The police later found a stun gun, rope and duct tape in the man’s car, they said."
  },
  {
    "title": "Marijuana’s Links to Heart Attack and Stroke Are Becoming Clearer",
    "link": "https://www.nytimes.com/2025/06/19/well/marijuana-heart-health-risks.html",
    "summary": "The evidence is stacking up that the drug is associated with a greater likelihood of heart problems."
  },
  {
    "title": "The Supreme Court’s Blindness to Transgender Reality",
    "link": "https://www.nytimes.com/2025/06/19/opinion/the-supreme-court-fails-to-see-transgender-teens.html",
    "summary": "The retrenchment on transgender rights is fueled by fear: fear of the future, fear of unfamiliar concepts, fear of not knowing one’s child."
  },
  {
    "title": "The Progressive Regulator Winning Over the Populist Right",
    "link": "https://www.nytimes.com/2025/06/19/opinion/lina-khan-monopolies-trump.html",
    "summary": "Lina Khan wants to overthrow “the autocrats of trade.”"
  },
  {
    "title": "Police Investigate Threats to Mamdani in Mayoral Race’s Final Days",
    "link": "https://www.nytimes.com/2025/06/19/nyregion/zohran-mamdani-threats-nypd-investigation.html",
    "summary": "Voice mail messages promising violence against Zohran Mamdani, a progressive Democrat, came as attacks on politicians, judges and other government officials have skyrocketed."
  },
  {
    "title": "Cave Explorer Videos Show Decade of Trash in ‘Avatar’ Park in China",
    "link": "https://www.nytimes.com/2025/06/19/world/asia/china-caves-trash-avatar.html",
    "summary": "Officials ordered a huge cleanup effort after videos of the mountains of garbage spread widely online."
  },
  {
    "title": "Bear Whose Head Was Stuck for Two Years Is Freed",
    "link": "https://www.nytimes.com/2025/06/19/us/bear-lid-neck-freed-michigan.html",
    "summary": "An unwelcome plastic collar was removed from around the neck of a 2-year-old bear."
  },
  {
    "title": "Boy, 15, Survives Lightning Strike in Central Park, Police Say",
    "link": "https://www.nytimes.com/2025/06/19/nyregion/boy-survives-lightning-central-park.html",
    "summary": "The boy was standing under a tree when lightning hit and an electrical current transferred to a chain necklace around his neck, a law enforcement official said."
  }
]