[
  {
    "title": "Patel Under Scrutiny for Use of SWAT Teams to Protect His Girlfriend",
    "link": "https://www.nytimes.com/2025/11/23/us/politics/kash-patel-girlfriend-fbi-protection.html",
    "summary": "The F.B.I. director’s travel on government jets has contributed to growing questions inside the administration about whether he is using taxpayer-funded resources inappropriately."
  },
  {
    "title": "At Harvard-Yale Game, Rivals Come Together Against Trump Administration Attacks",
    "link": "https://www.nytimes.com/2025/11/23/us/politics/yale-harvard-football-trump.html",
    "summary": "Students and alumni set aside rivalries at the 141st Harvard-Yale football game on Saturday to summon support against attacks on higher education under the Trump administration."
  },
  {
    "title": "Georgia Voters Stand by Marjorie Taylor Greene After She Stood Up to Trump",
    "link": "https://www.nytimes.com/2025/11/22/us/georgia-marjorie-taylor-greene-voters.html",
    "summary": "Ms. Greene’s resignation blindsided her conservative Georgia district, which had stuck by her through ups and downs, including her split with the president."
  },
  {
    "title": "For Marjorie Taylor Greene, a Rough Education in MAGA Politics",
    "link": "https://www.nytimes.com/2025/11/22/us/politics/marjorie-taylor-greene.html",
    "summary": "The Georgia congresswoman strove to be both the ultimate Trump warrior and to be taken seriously. She wound up in political exile."
  },
  {
    "title": "In Russian-Occupied Mariupol, Everything Ukrainian Must Go",
    "link": "https://www.nytimes.com/2025/11/23/world/europe/russia-ukraine-mariupol.html",
    "summary": "Russia is remaking Mariupol, which was devastated by a brutal siege in 2022. Ukrainians seeking to move back are finding it hard to recognize the city, or to reclaim their property."
  },
  {
    "title": "Ukraine, U.S. Will Meet About Trump’s Peace Plan to End War With Russia",
    "link": "https://www.nytimes.com/2025/11/23/world/europe/ukraine-switzerland-russia-peace-talks.html",
    "summary": "Meetings in Geneva will include European officials, as the Trump administration’s pushes Kyiv to accept a 28-point peace plan to end the war with Russia."
  },
  {
    "title": "Tatiana Schlossberg, John F. Kennedy’s Granddaughter, Reveals Terminal Cancer Diagnosis",
    "link": "https://www.nytimes.com/2025/11/22/us/tatiana-schlossberg-kennedy-cancer.html",
    "summary": "Tatiana Schlossberg, a daughter of Caroline Kennedy, revealed a terminal cancer diagnosis in an essay published on the anniversary of her grandfather’s assassination."
  },
  {
    "title": "One Undocumented Worker Used a Stolen Identity. Two Men Paid the Price.",
    "link": "https://www.nytimes.com/2025/11/23/us/undocumented-worker-stolen-identity-dan-kluver.html",
    "summary": "Thousands of undocumented workers rely on fraudulent Social Security numbers. One of them belonged to Dan Kluver."
  },
  {
    "title": "America’s Housing Crisis, in One Chart",
    "link": "https://www.nytimes.com/2025/11/23/opinion/housing-crisis-america.html",
    "summary": "If we want more places for people to live, we’re going to have to get more creative."
  },
  {
    "title": "Trump Has Put the Military in an Impossible Situation",
    "link": "https://www.nytimes.com/2025/11/23/opinion/trump-illegal-war.html",
    "summary": "Who should take responsibility for the president’s undeclared war in the Caribbean?"
  },
  {
    "title": "Haitians Rejoice Over Their First World Cup Berth in 50 Years",
    "link": "https://www.nytimes.com/2025/11/23/world/americas/haiti-world-cup.html",
    "summary": "The national team’s success in landing a World Cup slot gave Haitians around the world a momentary reprieve from their country’s deep crises."
  },
  {
    "title": "Titanic Passenger’s Pocket Watch Sells for $2.3 Million",
    "link": "https://www.nytimes.com/2025/11/23/world/asia/titanic-watch-auction.html",
    "summary": "The watch belonged to Isidor Straus, a co-owner of Macy’s who was traveling first class on the Titanic with his wife when it sank in April 1912."
  },
  {
    "title": "Retiring Before (or After) Your Partner? How to Navigate Money Issues",
    "link": "https://www.nytimes.com/2025/11/22/business/couples-retirement-planning.html",
    "summary": "Too many couples have “undiscussed assumptions” about how they’ll live and spend once they leave the work force, experts say."
  }
]