[
  {
    "title": "Trump’s Finances Were Shaky. Then He Began to Capitalize on His Comeback.",
    "link": "https://www.nytimes.com/2025/07/02/us/trump-finances-crypto.html",
    "summary": "Contrary to the president’s assertions, records filed in a fraud case against him suggest that his riches were not the product of a steady and strong empire."
  },
  {
    "title": "The Winners and Losers of Trump’s Big Bill, and a ‘60 Minutes’ Settlement",
    "link": "https://www.nytimes.com/2025/07/02/podcasts/the-headlines/republican-bill-60-minutes-settlement.html",
    "summary": "Plus, the science of staying cool."
  },
  {
    "title": "Trump Faces the Biggest Test Yet of His Second-Term Political Power",
    "link": "https://www.nytimes.com/2025/07/01/us/politics/trump-test-political-power.html",
    "summary": "If President Trump gets his domestic policy bill over the finish line, it will be a vivid demonstration of his continuing hold over the Republican Party."
  },
  {
    "title": "Senate G.O.P. Gambles Its Legacy and Political Fate on Bill",
    "link": "https://www.nytimes.com/2025/07/01/us/politics/senate-republicans-bill.html",
    "summary": "The sprawling legislation that Republicans expended extraordinary effort to muscle through the Senate was a high-stakes risk that is likely to have major consequences for the party and the country."
  },
  {
    "title": "Paramount to Pay Trump $16 Million to Settle ‘60 Minutes’ Lawsuit",
    "link": "https://www.nytimes.com/2025/07/02/business/media/paramount-trump-60-minutes-lawsuit.html",
    "summary": "President Trump had sued over an interview with former Vice President Kamala Harris. The company needs federal approval for a multibillion-dollar sale."
  },
  {
    "title": "CBS News President to Depart Amid Network’s Tensions With Trump",
    "link": "https://www.nytimes.com/2025/05/19/business/media/cbs-60-minutes-trump-wendy-mcmahon.html",
    "summary": "Wendy McMahon, the president of CBS News and Stations, had allied herself with Bill Owens, the “60 Minutes” executive producer who recently resigned."
  },
  {
    "title": "Lack of New U.S. Sanctions Allows Restricted Goods and Funds Into Russia",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/trump-russia-sanctions.html",
    "summary": "President Trump has issued no new restrictions on Russia this year, in effect allowing Moscow to acquire the money and materials it needs in its conflict with Ukraine."
  },
  {
    "title": "Pause in U.S. Weapons Deepens Ukrainian Concerns as Russian Attacks Grow",
    "link": "https://www.nytimes.com/2025/07/02/world/europe/ukraine-russia-war-trump-weapons.html",
    "summary": "The suspension includes air defense interceptors, and it will directly affect Ukraine’s ability to fend off escalating Russian air assaults."
  },
  {
    "title": "Kim Jong-un Appears to Mourn His Troops Killed Fighting for Russia",
    "link": "https://www.nytimes.com/2025/07/02/world/asia/north-korea-troops-kim-jong-un.html",
    "summary": "Through an event shown on North Korean state television, Mr. Kim also highlighted the sacrifices made for Moscow and the rewards he seeks."
  },
  {
    "title": "Trump Withholds Nearly $7 Billion for Schools, With Little Explanation",
    "link": "https://www.nytimes.com/2025/07/01/us/trump-education-funds.html",
    "summary": "The money, which was allocated by Congress, helps pay for after-school programs, support for students learning English and other services."
  },
  {
    "title": "Penn Agrees to Limit Participation of Transgender Athletes",
    "link": "https://www.nytimes.com/2025/07/01/us/penn-title-ix-transgender-swimmer-trump.html",
    "summary": "In a deal with the Trump administration, the University of Pennsylvania will not allow transgender women to participate in women’s sports."
  },
  {
    "title": "Grand Theft A.T.M.: A Bodega Crime Wave Hits New York",
    "link": "https://www.nytimes.com/2025/07/02/nyregion/nyc-atm-thefts.html",
    "summary": "Common tools and a little muscle have fueled a crime wave that may have netted one burglary crew hundreds of thousands of dollars in a matter of months."
  },
  {
    "title": "Solar Industry Says Republican Policy Bill Would Cede Production to China",
    "link": "https://www.nytimes.com/2025/07/02/business/energy-environment/trump-bill-solar-panels-china.html",
    "summary": "A revival of U.S. solar panel manufacturing that began during the first Trump administration could end with the phasing out of tax incentives for clean energy."
  },
  {
    "title": "How Republican E.V. Cuts Could Put U.S. Carmakers Behind China",
    "link": "https://www.nytimes.com/2025/07/02/business/ev-cars-us-china-trump.html",
    "summary": "China’s lead in electric vehicle technology, which is already huge, could become insurmountable if incentive programs are slashed, auto experts and environmentalists say."
  },
  {
    "title": "Israeli Officials Express Optimism on Gaza Cease-Fire as Netanyahu Prepares to Meet With Trump",
    "link": "https://www.nytimes.com/2025/07/02/world/middleeast/israel-gaza-cease-fire-trump.html",
    "summary": "It is unclear whether the latest U.S.-backed effort can overcome the most entrenched sticking point between Israel and Hamas."
  },
  {
    "title": "Iran Suspends Cooperation With U.N. Nuclear Watchdog",
    "link": "https://www.nytimes.com/2025/07/02/world/middleeast/iran-nuclear-iaea.html",
    "summary": "The decision means that international inspectors will not be able to oversee sites, as experts warn that Tehran could revive plans to build a bomb."
  },
  {
    "title": "Former Criminology Student Is Set to Plead Guilty in Idaho Murders",
    "link": "https://www.nytimes.com/2025/07/02/us/idaho-murders-kohberger-plea.html",
    "summary": "Bryan Kohberger, now 30, was charged in the 2022 murders that shook the University of Idaho. In exchange, he would avoid a possible death penalty."
  },
  {
    "title": "Inside the Surprise Idaho Murders Plea Deal That Left Some Families Fuming",
    "link": "https://www.nytimes.com/2025/07/02/us/idaho-murders-kohberger-plea-deal.html",
    "summary": "After two and a half years of legal wrangling, prosecutors and lawyers for the defendant, Bryan Kohberger, reached a deal just weeks before his trial was set to begin."
  },
  {
    "title": "Dalai Lama Tightens Grip on Reins of Succession in the Face of Chinese Pressure",
    "link": "https://www.nytimes.com/2025/07/02/world/asia/dalai-lama-successor-tibet-china.html",
    "summary": "The aging Tibetan spiritual leader is looking to prevent Beijing from taking advantage of a power vacuum that might arise after his death."
  },
  {
    "title": "Dalai Lama Succession: How the Next Tibetan Spiritual Leader Will Be Chosen",
    "link": "https://www.nytimes.com/2025/07/02/world/asia/next-dalai-lama-tibet.html",
    "summary": "The Tibetan spiritual leader said that his lineage would continue, and that China would have no say about his successor."
  },
  {
    "title": "How Immigration Could Muddy the Jobs Numbers",
    "link": "https://www.nytimes.com/2025/07/02/business/jobs-numbers-immigration-fed.html",
    "summary": "Job growth is expected to fall this year, adding to pressure on the Federal Reserve to cut interest rates. But the slowdown might reflect a smaller labor force, not declining demand from employers."
  },
  {
    "title": "Squashing Spotted Lanternflies Will Get Us Only So Far. We Need Wasps.",
    "link": "https://www.nytimes.com/2025/07/02/opinion/lanternflies-biocontrol-invasive-species.html",
    "summary": "Is it wise to use one organism to combat another invasive one?"
  },
  {
    "title": "We Both Served as Treasury Secretary. We Know This Bill Is Dangerous.",
    "link": "https://www.nytimes.com/2025/07/02/opinion/republican-bill-fed-treasury-secretary.html",
    "summary": "Fighting the Fed, piling on tax cuts and pursuing a trade war will set American on an unsustainable path."
  },
  {
    "title": "The Senate and the Supreme Court",
    "link": "https://www.nytimes.com/2025/07/02/briefing/the-senate-and-the-supreme-court.html",
    "summary": "President Trump’s agenda passed in the Senate. It now goes to the House. Plus, we take a close look at this Supreme Court term."
  },
  {
    "title": "A Potential Mamdani Mayorship Strikes Fear in the Real Estate Industry",
    "link": "https://www.nytimes.com/2025/07/02/realestate/mamdani-rent-freeze-real-estate.html",
    "summary": "The democratic nominee has called for freezing the rent on a million apartments."
  },
  {
    "title": "A Power Line for Clean Energy Was in the Works. Now, an Investigation Looms.",
    "link": "https://www.nytimes.com/2025/07/02/climate/grain-belt-express-missouri-power-line.html",
    "summary": "The Grain Belt Express line, meant to carry electricity from wind farms across the Midwest, faces an inquiry from the Missouri attorney general."
  },
  {
    "title": "Sea Spiders Lack a Key Body Part and a Missing Gene Could Explain Why",
    "link": "https://www.nytimes.com/2025/07/01/science/sea-spiders-abdomen-genes.html",
    "summary": "Scientists have long sought to understand why sea spiders keep some of their most important organs in their legs."
  }
]