[
  {
    "title": "Trump’s Call to ‘Nationalize’ Elections Adds to State Officials’ Alarm",
    "link": "https://www.nytimes.com/2026/02/04/us/politics/trump-election-states-midterms.html",
    "summary": "Some top state election officials, who run voting across the country, worry that the federal government has become hostile to them and their work."
  },
  {
    "title": "Fulton County in Georgia Challenges the F.B.I.’s Seizure of 2020 Ballots",
    "link": "https://www.nytimes.com/2026/02/04/us/politics/fulton-county-fbi-raid-trump-gabbard.html",
    "summary": "The county filed a motion demanding the return of ballots and other election materials that were seized by the F.B.I. in a highly unusual move by the Trump administration."
  },
  {
    "title": "Man Convicted of Trying to Assassinate Trump Gets Life Sentence",
    "link": "https://www.nytimes.com/2026/02/04/us/man-convicted-of-trying-to-assassinate-trump-gets-life-sentence.html",
    "summary": "Federal prosecutors told the judge that Ryan Routh had “plotted painstakingly” to ambush Donald J. Trump in 2024 at his golf course near West Palm Beach."
  },
  {
    "title": "‘Neoroyalism’ and What It Says About Trump",
    "link": "https://www.nytimes.com/2026/02/04/business/economy/trump-history-newroyalism.html",
    "summary": "Experts are reaching to divine the president’s approach to global policy and economics, with one theory seeing antecedents in centuries-old dynastic rule."
  },
  {
    "title": "State Fiscal Chiefs Protest Federal Immigration Chaos",
    "link": "https://www.nytimes.com/2026/02/04/business/economy/state-fiscal-protest-ice.html",
    "summary": "Sixteen elected treasury officials, all Democrats, wrote to President Trump to say ICE crackdowns are bad for business and tax revenues: “People must feel safe to go to work.”"
  },
  {
    "title": "What the Crackdown Has Done to Minneapolis Children",
    "link": "https://www.nytimes.com/2026/02/04/us/minneapolis-children-ice-schools.html",
    "summary": "“It’s like living in fear all the time,” a teenager said about the federal raids that have shattered families."
  },
  {
    "title": "For Peace, More Ukrainians Consider the Once Unthinkable: Surrendering Land",
    "link": "https://www.nytimes.com/2026/02/04/world/europe/ukraine-russia-war-donbas-region.html",
    "summary": "Polls show a growing acceptance of territorial concessions among a war-weary public, if Ukraine receives strong security guarantees."
  },
  {
    "title": "Russia and Ukraine Resume Talks After a Huge Attack by Moscow",
    "link": "https://www.nytimes.com/2026/02/04/world/europe/ukraine-russia-us-peace-talks.html",
    "summary": "U.S., Russian and Ukrainian negotiators are meeting in the United Arab Emirates, but Russia continues to pummel Ukraine and has not softened demands that Kyiv calls unacceptable."
  },
  {
    "title": "Washington Post Begins Cutting More Than 300 Jobs",
    "link": "https://www.nytimes.com/2026/02/04/business/media/washington-post-layoffs.html",
    "summary": "The layoffs will cut into The Post’s local, international and sports coverage, and reduce the number of all its employees by about 30 percent."
  },
  {
    "title": "How Miss Piggy Went From Minor Muppet to TV’s Top Hog",
    "link": "https://www.nytimes.com/2026/02/04/arts/television/miss-piggy-muppet-show.html",
    "summary": "Miss Piggy began as a bit player, but a sassy attitude and a karate chop carried her to the pinnacle of pop culture. A new Muppets special premieres on Wednesday."
  },
  {
    "title": "Review: This is Your Grandparents’ ‘Muppet Show,’ Fortunately",
    "link": "https://www.nytimes.com/2026/02/03/arts/television/review-the-muppet-show.html",
    "summary": "Nobody put too much thought into reinventing the gonzo variety classic for its revival. That’s what makes it a delight."
  },
  {
    "title": "Libby Howes, a Promising Young Actress, Left New York in 1981 and Disappeared. What Happened?",
    "link": "https://www.nytimes.com/2026/02/04/theater/wooster-group-libby-howes-theater.html",
    "summary": "Libby Howes was an imposing presence onstage with the Wooster Group. But after abruptly leaving New York in 1981 she became a theater world mystery. What happened?"
  },
  {
    "title": "Once the Hottest Bet on Wall St., Private Credit Has Started to Crack",
    "link": "https://www.nytimes.com/2026/02/04/business/private-credit-blue-owl-ai.html",
    "summary": "Concerns about defaults, particularly among software companies, have spooked investors in the private credit firms that lend to them."
  },
  {
    "title": "How 2026 Winter Olympics Security Is Preparing For The Opening Ceremony",
    "link": "https://www.nytimes.com/2026/02/04/world/europe/winter-olympics-security-milan-cortina.html",
    "summary": "Thousands of Italian security officers will be deployed, though the presence of U.S. ICE personnel has stirred anger. Italian officials said Wednesday they had thwarted a Russian cyberattack aimed at some Olympics hotels."
  },
  {
    "title": "How Universities and States Are Increasing Surveillance of Professors",
    "link": "https://www.nytimes.com/2026/02/04/us/professors-classroom-surveillance-politics.html",
    "summary": "Scrutiny of university classrooms is being formalized, with new laws requiring professors to post syllabuses and tip lines for students to complain."
  },
  {
    "title": "Yair Golan’s Battle for a Two-State Solution and the Future of Israel",
    "link": "https://www.nytimes.com/2026/02/04/magazine/yair-golan-israel-palestine-gaza-war.html",
    "summary": "To many Israelis, he’s a war hero. To others, he’s a traitor guilty of “blood libel.” Can Yair Golan change politics in Israel?"
  },
  {
    "title": "Israel Launches Deadly Strikes on Gaza, Saying Militants Attacked Its Soldiers",
    "link": "https://www.nytimes.com/2026/02/04/world/middleeast/israel-gaza-strikes-palestinian-deaths.html",
    "summary": "Gaza officials said the Israeli airstrikes killed at least 21 Palestinians. Israel said one of its soldiers was critically wounded in the attack by Palestinian gunmen."
  },
  {
    "title": "Bright Horizons Child Care Centers Face Dozens of Alarming Complaints",
    "link": "https://www.nytimes.com/2026/02/04/nyregion/bright-horizons-child-abuse-nyc.html",
    "summary": "In New York City, health officials have moved to shut down one center where workers were charged with child abuse. Records show that problems extend across the network."
  },
  {
    "title": "The Questionable Science Behind the Odd-Looking Football Helmets",
    "link": "https://www.nytimes.com/2026/02/03/business/super-bowl-guardian-cap-helmet.html",
    "summary": "The N.F.L. claims Guardian Caps reduce the risk of concussions. The company that makes them says, “It has nothing to do with concussions.”"
  },
  {
    "title": "NFL Wants to Revise TV Deals Years Before They Expire",
    "link": "https://www.nytimes.com/2026/02/04/business/media/nfl-tv-deals-roger-goodell.html",
    "summary": "The league is so important to the business of media companies that they are likely to have little choice but to agree to renegotiations."
  },
  {
    "title": "Savannah Guthrie’s Missing Mother Has Nation Fixated on an Arizona Subdivision",
    "link": "https://www.nytimes.com/2026/02/04/us/savannah-guthrie-missing-mother-arizona.html",
    "summary": "The disappearance of Nancy Guthrie, mother of the news anchor Savannah Guthrie, has reporters, neighbors and drones flooding streets and foothills in Tucson, Ariz."
  },
  {
    "title": "Here’s How the U.S. Accepted Danish Control of Greenland 100 Years Ago.",
    "link": "https://www.nytimes.com/2026/02/04/world/americas/what-to-know-us-west-indies-greenland-history-denmark.html",
    "summary": "In 1917, the United States bought Caribbean islands from Denmark and agreed to respect Denmark’s hold over Greenland. The deal resurfaced with President Trump’s recent threats to seize Greenland."
  },
  {
    "title": "A Chevron Refinery May Take in More Venezuelan Oil.  Its Neighbors Are Concerned.",
    "link": "https://www.nytimes.com/2026/02/04/climate/chevron-venezuela-mississippi-refinery.html",
    "summary": "The American claim on Venezuela’s oil means even more of it could come to a huge Chevron refinery in Mississippi. Neighbors worried about pollution want the company to move them out."
  },
  {
    "title": "A lifelong lover of Dobermans reclaims best in show after 37 years.",
    "link": "https://www.nytimes.com/live/2026/02/03/style/westminster-dog-show/heres-the-latest",
    "summary": ""
  },
  {
    "title": "Catherine O’Hara, Star of ‘Best in Show,’ Honored in Westminster Tribute",
    "link": "https://www.nytimes.com/2026/02/03/style/catherine-ohara-westminster-dog-show.html",
    "summary": "Fans remembered the actress, who died last week at 71, for her role as the doting owner of a Norwich terrier destined for glory in the movie, a sendup of dog show culture."
  },
  {
    "title": "What a Baby’s Laugh Actually Tells Us",
    "link": "https://www.nytimes.com/2026/02/04/opinion/baby-laugh-developmental-milestone.html",
    "summary": "A kid’s first joke reveals a complex mind."
  },
  {
    "title": "Nurses Face Horrific Violence at Work. We’re Striking to Change That.",
    "link": "https://www.nytimes.com/2026/02/04/opinion/nurse-strike-new-york-workplace-violence.html",
    "summary": "Thousands of New York nurses are on strike. They’re demanding protections to stay safe in the face of a wave of workplace violence."
  },
  {
    "title": "The Melting Continent",
    "link": "https://www.nytimes.com/2026/02/04/briefing/the-melting-continent.html",
    "summary": "Today we look at an expedition to Antarctica."
  },
  {
    "title": "Are You ‘Biohacking’ to Perform Better at Work? We Want to Hear From You.",
    "link": "https://www.nytimes.com/2026/02/04/business/are-you-biohacking-to-perform-better-at-work-we-want-to-hear-from-you.html",
    "summary": "Please tell us what changes you’ve made to your health and wellness practices to improve your brain function and job performance. We may include your experiences in an article."
  },
  {
    "title": "Hochul Chooses Adrienne Adams to Join Her Re-election Ticket",
    "link": "https://www.nytimes.com/2026/02/04/nyregion/kathy-hochul-adrienne-adams-lieutenant-governor.html",
    "summary": "By choosing Ms. Adams as her nominee for lieutenant governor, Gov. Kathy Hochul created the first all-woman major-party ticket in New York State history."
  },
  {
    "title": "Snow Drought, Political Shifts and Strikes Batter Ski Industry in Western U.S.",
    "link": "https://www.nytimes.com/2026/02/02/travel/snow-drought-ski-rocky-mountains.html",
    "summary": "Little snowpack, strikes by mountain staff and Trump administration policies that are keeping international visitors away have made this a difficult season in the Rockies and beyond."
  },
  {
    "title": "Texas A&M Lecturer Who Was Fired Over Gender Lesson Sues University",
    "link": "https://www.nytimes.com/2026/02/04/us/texas-am-lecturer-gender-lesson-lawsuit.html",
    "summary": "In a federal lawsuit, the lecturer, Melissa McCoul, accused the university of violating the First Amendment."
  }
]