[
  {
    "title": "Already Pardoned by Trump, Jan. 6 Rioters Push for Compensation",
    "link": "https://www.nytimes.com/2025/08/31/us/politics/trump-jan-6-rioters-compensation.html",
    "summary": "One of the rioters’ lawyers wants to create a panel that would decide on financial damages for what the rioters believe were unfair prosecutions."
  },
  {
    "title": "In Trump’s Federal Work Force Cuts, Black Women Are Among the Hardest Hit",
    "link": "https://www.nytimes.com/2025/08/31/us/politics/trump-federal-work-force-black-women.html",
    "summary": "President Trump has cut hundreds of thousands of jobs from the federal work force, disproportionately affecting Black employees."
  },
  {
    "title": "Historians See Autocratic Playbook in Trump’s Attacks on Science",
    "link": "https://www.nytimes.com/2025/08/31/science/trump-science-autocrats.html",
    "summary": "Authoritarians have long feared and suppressed science as a rival for social influence. Experts see President Trump as borrowing some of their tactics."
  },
  {
    "title": "Rudy Giuliani Is Hurt in Car Crash in New Hampshire",
    "link": "https://www.nytimes.com/2025/08/31/us/politics/rudy-giuliani-accident-car-crash-new-hampshire.html",
    "summary": "Mr. Giuliani, the former New York City mayor and lawyer for President Trump, suffered a fractured vertebra, his head of security said."
  },
  {
    "title": "U.S. Suspends Visas for Palestinian Passport Holders, Officials Say",
    "link": "https://www.nytimes.com/2025/08/31/world/middleeast/us-palestinian-visa-suspensions.html",
    "summary": "The move will stop, at least temporarily, travel for medical treatment, attending university, visiting relatives or conducting business."
  },
  {
    "title": "Houthis Vow Revenge After Israeli Attack Kills Senior Officials",
    "link": "https://www.nytimes.com/2025/08/31/world/middleeast/yemen-houthis-israel.html",
    "summary": "Israel’s assassination of top officials last week is likely to make the Iranian-backed militia even more hawkish, Yemen analysts say."
  },
  {
    "title": "Israel Says It Killed Abu Obeida, Spokesman for Hamas’s Armed Wing",
    "link": "https://www.nytimes.com/2025/08/31/world/middleeast/hamas-abu-obeida-israel-gaza-city.html",
    "summary": "Hamas did not immediately comment on the Israeli military’s claim that Abu Obeida, one of the armed group’s best-known officials in the Arab world, had been killed."
  },
  {
    "title": "Trump Crime Strategy May Work for Now, but Not for Long, Experts Say",
    "link": "https://www.nytimes.com/2025/08/31/us/trump-crime-strategy-solutions.html",
    "summary": "The president is looking to add troops to city streets while cutting funds for programs that work, experts and local officials say. But one idea, beautifying neighborhoods, has buy-in."
  },
  {
    "title": "Chicago’s Mayor Rejects Trump’s Plans to Send Troops to His City",
    "link": "https://www.nytimes.com/2025/08/31/us/politics/chicago-order-trump-immigration-crackdown.html",
    "summary": "Mayor Brandon Johnson of Chicago ordered local police officers not to aid the federal crackdown, ramping up the tensions between the White House and state and local officials."
  },
  {
    "title": "How Trump Administration Cuts Are Hurting National Parks",
    "link": "https://www.nytimes.com/2025/08/27/us/politics/trump-cuts-national-parks.html",
    "summary": "Amid deep cuts, more than 90 parks have reported problems like lost revenue and cuts to emergency services. One expert called this “a dangerous path.”"
  },
  {
    "title": "Brazil Tightens Bolsonaro House Arrest Amid Escape Concerns",
    "link": "https://www.nytimes.com/2025/08/31/world/americas/brazil-bolsonaro-trial-restrictions.html",
    "summary": "Former President Jair Bolsonaro, who will stand trial on Tuesday, is being closely monitored by the Brazilian authorities, who fear he may try to flee."
  },
  {
    "title": "In the Hills of Puerto Rico, Feasting on a Very Smelly Fruit",
    "link": "https://www.nytimes.com/2025/08/31/us/puerto-rico-durian.html",
    "summary": "Every summer, superfans of durian converge on a remote farm in western Puerto Rico to devour one of the world’s most polarizing fruits."
  },
  {
    "title": "The Manhattan Park That Keeps Children Locked Out",
    "link": "https://www.nytimes.com/2025/08/31/nyregion/gw-bridge-park-dolphin-park.html",
    "summary": "A beloved park on state-owned land in Upper Manhattan has been closed for years, with neither the government nor any nonprofit groups willing to step in to operate it."
  },
  {
    "title": "The Corporate Logo That Broke the Internet",
    "link": "https://www.nytimes.com/2025/08/31/opinion/cracker-barrel-sydney-sweeney-rufo-maga.html",
    "summary": "How to bend political reality in two easy steps."
  },
  {
    "title": "Disney World Is the Happiest Place on Earth, if You Can Afford It",
    "link": "https://www.nytimes.com/2025/08/28/opinion/disney-world-economy-middle-class-rich.html",
    "summary": "The theme-park operator, like so many other companies, is abandoning America’s middle class."
  },
  {
    "title": "Man Found Dead at Burning Man, Prompting Homicide Investigation",
    "link": "https://www.nytimes.com/2025/08/31/us/burning-man-festival-dead.html",
    "summary": "The victim, whose identity was unknown, was found “lying in a pool of blood” on Saturday night, officials said."
  },
  {
    "title": "Northern Lights Could Put on a Show for Large Sections of U.S.",
    "link": "https://www.nytimes.com/2025/08/31/weather/northern-lights-aurora-tonight.html",
    "summary": "A dazzling display in the nighttime sky might be seen much farther south than usual, including parts of Iowa, Oregon and Pennsylvania, by Tuesday, forecasters said."
  },
  {
    "title": "Rikers Detainee Becomes Third Person to Die in N.Y.C. Custody in a Week",
    "link": "https://www.nytimes.com/2025/08/31/nyregion/rikers-jail-nyc-custody-death.html",
    "summary": "Days before the death of the man, Jimmy Avila, another detainee was pronounced dead in his cell at the troubled city jail complex, and a third died in police custody."
  },
  {
    "title": "How Builder.ai Collapsed Amid Silicon Valley’s Biggest Boom",
    "link": "https://www.nytimes.com/2025/08/31/technology/builder-ai-collapse.html",
    "summary": "Builder.ai went from a value of $1.5 billion to zero in a few months, amid questions over the sales of an A.I. product. Its downfall hints at a broader downturn."
  }
]