[
  {
    "title": "Man Tackled and Disarmed One of the Bondi Beach Gunmen, Video Shows",
    "link": "https://www.nytimes.com/2025/12/14/world/australia/bondi-beach-gunman-tackled-video.html",
    "summary": "The video, verified by The New York Times, shows a man sneaking up on one of the shooters who targeted a Hanukkah celebration in Sydney on Sunday."
  },
  {
    "title": "What We Know About the Bondi Beach Shooting in Australia",
    "link": "https://www.nytimes.com/2025/12/14/world/australia/what-we-know-bondi-shooting.html",
    "summary": "Two gunmen opened fire at dozens of people who were at a Jewish holiday event. At least 15 people were killed in the attack, and so was one of the shooters, the police said."
  },
  {
    "title": "Gunshots at Brown University, Then 12 Hours of Lockdown and Fear",
    "link": "https://www.nytimes.com/2025/12/14/us/gunshots-lockdown-brown-university.html",
    "summary": "As the shooter remained at large, students sheltered in place in classrooms and basements, waiting for the all clear."
  },
  {
    "title": "Hospitalized Brown Student Describes Hiding from Shooter",
    "link": "https://www.nytimes.com/2025/12/14/us/brown-shooting-witness-spencer-yang.html",
    "summary": "The student, in his first year at Brown, described helping others who were more seriously injured than him as they hid in their classroom."
  },
  {
    "title": "Zelensky Offers Compromise for New Round of Ukraine Peace Talks",
    "link": "https://www.nytimes.com/2025/12/14/world/europe/zelensky-ukraine-peace-talks.html",
    "summary": "Ukraine’s president met with U.S. negotiators about plans to end the war with Russia. He said he would give up hopes of joining NATO in exchange for security guarantees."
  },
  {
    "title": "The Army Made a Blind Black Soldier a Surrogate for Robert E. Lee",
    "link": "https://www.nytimes.com/2025/12/14/us/politics/army-base-fitz-lee.html",
    "summary": "For more than a century, this Black soldier from Virginia was remembered by nearly no one. Then this year, someone at the Pentagon found a use for him."
  },
  {
    "title": "The S.E.C. Was Tough on Crypto. It Pulled Back After Trump Returned to Office.",
    "link": "https://www.nytimes.com/2025/12/14/us/politics/sec-crypto-firms-trump-investigation.html",
    "summary": "An investigation by The Times found the administration’s change in enforcement benefited the industry, including companies that had ties to the president."
  },
  {
    "title": "Inside the Clintons’ Fight to Avoid Testifying in the House Epstein Inquiry",
    "link": "https://www.nytimes.com/2025/12/14/us/politics/clintons-epstein-inquiry.html",
    "summary": "Bill and Hillary Clinton have repeatedly offered to provide sworn statements, but Representative James R. Comer has threatened to hold them in contempt of Congress if they fail to appear."
  },
  {
    "title": "The Dark Side of the Global Surrogacy and Fertility Industry",
    "link": "https://www.nytimes.com/2025/12/14/magazine/fertility-surrogates-trafficking.html",
    "summary": "Eve was one of dozens of Thai women who traveled 4,000 miles — only to be trapped by the dark side of the global fertility industry."
  },
  {
    "title": "José Antonio Kast Elected President of Chile",
    "link": "https://www.nytimes.com/2025/12/14/world/americas/chile-election-kast.html",
    "summary": "José Antonio Kast won the race on Sunday after a contest marked by concerns over security and immigration."
  },
  {
    "title": "Chile Poised for Right-Wing Victory as Crime Fears Sweep Latin America",
    "link": "https://www.nytimes.com/2025/12/13/world/americas/chile-election-latin-america-crime.html",
    "summary": "Security has become a top concern for voters across the region who are calling for iron-fisted measures. In Chile, the issue is pushing the country to the right."
  },
  {
    "title": "Kenya Is Betting Its Economy on Women Willing to Risk It All",
    "link": "https://www.nytimes.com/2025/12/14/world/africa/kenya-saudi-arabia-worker-abuse.html",
    "summary": "We set out to investigate worker abuse in Saudi Arabia. We found a system that begins exploiting them before they ever leave home."
  },
  {
    "title": "His Job Is to Make the Subway Accessible. His Own Life Fuels His Work.",
    "link": "https://www.nytimes.com/2025/12/14/nyregion/q-arroyo-subway-accessible.html",
    "summary": "Quemuel Arroyo, the New York transit system’s chief accessibility officer, has used a wheelchair for half his life. He understands how difficult it is to navigate the subway."
  },
  {
    "title": "Soon He’ll Be Mayor Mamdani. To His Soccer Teammates, He Was Just Z.",
    "link": "https://www.nytimes.com/2025/12/12/nyregion/mamdani-soccer-talking-headers-brooklyn.html",
    "summary": "Zohran Mamdani isn’t just a superfan. Until recently, he was a key player on the Talking Headers, a rec-league team in Brooklyn."
  },
  {
    "title": "The Bondi Beach Shooting Is What ‘Globalize the Intifada’ Looks Like",
    "link": "https://www.nytimes.com/2025/12/14/opinion/bondi-beach-shooting.html",
    "summary": "When a slogan’s real meaning comes true."
  },
  {
    "title": "U.S. Military Plane and JetBlue Flight Nearly Collided Over Caribbean, Radio Traffic Shows",
    "link": "https://www.nytimes.com/2025/12/14/world/americas/jetblue-venezuela-midair-collision-us-air-force.html",
    "summary": "The Air Force refueling tanker was flying without its location transponder activated and could not be detected by air traffic control."
  },
  {
    "title": "Syrian Who Killed U.S. Soldiers Was Member of Security Forces, Officials Say",
    "link": "https://www.nytimes.com/2025/12/14/world/middleeast/syria-isis-attack.html",
    "summary": "The gunman who killed two U.S. soldiers and an American civilian interpreter had been set to be dismissed from the security forces over his extremist views, U.S. and Syrian officials said."
  },
  {
    "title": "New York City Gets Its First Big Snowfall of the Season",
    "link": "https://www.nytimes.com/2025/12/14/weather/snowstorm-nyc-weather.html",
    "summary": "The city has not seen this much snow this early in the season since 2018, the National Weather Service said."
  },
  {
    "title": "Rodney Brooks, the Godfather of Modern Robotics, Says the Field Has Lost Its Way",
    "link": "https://www.nytimes.com/2025/12/14/business/rodney-brooks-robots-roomba.html",
    "summary": "Rodney Brooks, famous for the Roomba, argues the humanoid robot craze in Silicon Valley is doomed to fail."
  }
]