[
  {
    "title": "Judge Halts U.S. Effort to Deport Guatemalan Children as Planes Sit on Tarmac",
    "link": "https://www.nytimes.com/2025/08/31/us/politics/trump-deportations-judge-guatemala-children.html",
    "summary": "The temporary block ended another last-minute flurry of legal action over the Trump administration’s immigration crackdown."
  },
  {
    "title": "Robert Mueller Has Parkinson’s Disease, Family Says",
    "link": "https://www.nytimes.com/2025/08/31/us/politics/robert-mueller-parkinsons-disease.html",
    "summary": "The former special counsel, who led the Russia investigation during President Trump’s first term, has had difficulty speaking in recent months. A congressional committee dropped a request for Mr. Mueller to testify this week."
  },
  {
    "title": "Already Pardoned by Trump, Jan. 6 Rioters Push for Compensation",
    "link": "https://www.nytimes.com/2025/08/31/us/politics/trump-jan-6-rioters-compensation.html",
    "summary": "One of the rioters’ lawyers wants to create a panel that would decide on financial damages for what the rioters believe were unfair prosecutions."
  },
  {
    "title": "Historians See Autocratic Playbook in Trump’s Attacks on Science",
    "link": "https://www.nytimes.com/2025/08/31/science/trump-science-autocrats.html",
    "summary": "Authoritarians have long feared and suppressed science as a rival for social influence. Experts see President Trump as borrowing some of their tactics."
  },
  {
    "title": "India Was the Economic Alternative to China. Trump Ended That.",
    "link": "https://www.nytimes.com/2025/09/01/business/india-china-trump-tariffs.html",
    "summary": "A lurch in policy has shaken the India-U.S. economic alliance against China, leaving India little choice but to consider reversing its own strategy."
  },
  {
    "title": "Xi Uses Summit, Parade and History to Flaunt China’s Global Pull",
    "link": "https://www.nytimes.com/2025/08/30/world/asia/xi-putin-modi-china-summit.html",
    "summary": "With the leaders of Russia and India visiting, China’s president will show how he can use statecraft, military might and history to push for global influence."
  },
  {
    "title": "Rudy Giuliani Is Hurt in Car Crash in New Hampshire",
    "link": "https://www.nytimes.com/2025/08/31/us/politics/rudy-giuliani-accident-car-crash-new-hampshire.html",
    "summary": "Mr. Giuliani, the former New York City mayor and lawyer for President Trump, suffered a fractured vertebra, his head of security said."
  },
  {
    "title": "Hundreds Dead After 6.0-Magnitude Earthquake Hits Afghanistan",
    "link": "https://www.nytimes.com/2025/08/31/world/asia/afghanistan-earthquake-jalalabad.html",
    "summary": "The quake, near Jalalabad in the nation’s east, left at least 250 people dead and injured more than 500, officials said. The death toll was expected to rise."
  },
  {
    "title": "U.S. Suspends Visas for Palestinian Passport Holders, Officials Say",
    "link": "https://www.nytimes.com/2025/08/31/world/middleeast/us-palestinian-visa-suspensions.html",
    "summary": "The move will stop, at least temporarily, travel for medical treatment, attending university, visiting relatives or conducting business."
  },
  {
    "title": "Houthis Vow Revenge After Israeli Attack Kills Senior Officials",
    "link": "https://www.nytimes.com/2025/08/31/world/middleeast/yemen-houthis-israel.html",
    "summary": "Israel’s assassination of top officials last week is likely to make the Iranian-backed militia even more hawkish, Yemen analysts say."
  },
  {
    "title": "Israel Says It Killed Abu Obeida, Spokesman for Hamas’s Armed Wing",
    "link": "https://www.nytimes.com/2025/08/31/world/middleeast/hamas-abu-obeida-israel-gaza-city.html",
    "summary": "Hamas did not immediately comment on the Israeli military’s claim that Abu Obeida, one of the armed group’s best-known officials in the Arab world, had been killed."
  },
  {
    "title": "Brazil Tightens Bolsonaro House Arrest Amid Escape Concerns",
    "link": "https://www.nytimes.com/2025/08/31/world/americas/brazil-bolsonaro-trial-restrictions.html",
    "summary": "Former President Jair Bolsonaro, who will stand trial on Tuesday, is being closely monitored by the Brazilian authorities, who fear he may try to flee."
  },
  {
    "title": "How Trump Administration Cuts Are Hurting National Parks",
    "link": "https://www.nytimes.com/2025/08/27/us/politics/trump-cuts-national-parks.html",
    "summary": "Amid deep cuts, more than 90 parks have reported problems like lost revenue and cuts to emergency services. One expert called this “a dangerous path.”"
  },
  {
    "title": "In the Hills of Puerto Rico, Feasting on a Very Smelly Fruit",
    "link": "https://www.nytimes.com/2025/08/31/us/puerto-rico-durian.html",
    "summary": "Every summer, superfans of durian converge on a remote farm in western Puerto Rico to devour one of the world’s most polarizing fruits."
  },
  {
    "title": "California’s High Potency Cannabis is Fueling a ‘Cali Weed’ Trend in the UK",
    "link": "https://www.nytimes.com/2025/09/01/world/europe/californias-potent-legal-weed-is-booming-in-britain-less-legally.html",
    "summary": "High-strength, California-grown marijuana is so popular in the U.K. that large quantities are being illegally smuggled on passenger flights, officials say."
  },
  {
    "title": "It’s Labor Day. And Trump Is the Most Anti-Union President in Decades.",
    "link": "https://www.nytimes.com/2025/09/01/opinion/trump-unions-labor.html",
    "summary": "Why the labor movement needs to act like its future is under grave threat."
  },
  {
    "title": "Lula Faced Down Trump. Now Comes His Biggest Challenge.",
    "link": "https://www.nytimes.com/2025/09/01/opinion/brazil-lula-trump-bolsonaro.html",
    "summary": "For President Luiz Inácio Lula da Silva of Brazil, the stakes ahead of next year’s election could not be higher."
  },
  {
    "title": "Anti-Immigrant Protests Attended by Neo-Nazis in Australia Worry Leaders",
    "link": "https://www.nytimes.com/2025/09/01/world/australia/australia-immigration-protests.html",
    "summary": "The government condemned the demonstrations, which drew tens of thousands of people. Some of the events included speakers tied to neo-Nazi groups."
  },
  {
    "title": "Man Found Dead at Burning Man, Prompting Homicide Investigation",
    "link": "https://www.nytimes.com/2025/08/31/us/burning-man-festival-dead.html",
    "summary": "The victim, whose identity was unknown, was found “lying in a pool of blood” on Saturday night, officials said."
  },
  {
    "title": "Northern Lights Could Put on a Show for Large Sections of U.S.",
    "link": "https://www.nytimes.com/2025/08/31/weather/northern-lights-aurora-tonight.html",
    "summary": "A dazzling display in the nighttime sky might be seen much farther south than usual, including parts of Iowa, Oregon and Pennsylvania, by Tuesday, forecasters said."
  },
  {
    "title": "Rikers Detainee Becomes Third Person to Die in N.Y.C. Custody in a Week",
    "link": "https://www.nytimes.com/2025/08/31/nyregion/rikers-jail-nyc-custody-death.html",
    "summary": "Days before the death of the man, Jimmy Avila, another detainee was pronounced dead in his cell at the troubled city jail complex, and a third died in police custody."
  }
]