[
  {
    "title": "Ukraine-Russia Talks End With Little Progress and Hints of Impasse",
    "link": "https://www.nytimes.com/2026/02/05/world/europe/russia-ukraine-peace-talks.html",
    "summary": "American negotiators trumpeted plans for a prisoner swap, but that was small recompense for months of diplomatic efforts by the Trump administration."
  },
  {
    "title": "TrumpRx Is Set to Go Live on Thursday",
    "link": "https://www.nytimes.com/2026/02/05/us/politics/trumprx-website.html",
    "summary": "The government website is meant to connect Americans with drug companies to buy prescriptions directly with their own money. It is not clear how many patients will save money."
  },
  {
    "title": "How Trump Brought the Fight Over American History to Philadelphia",
    "link": "https://www.nytimes.com/2026/02/05/arts/george-washington-slavery-trump-history.html",
    "summary": "The administration took a crowbar to a site that focused on George Washington and slavery. But can the contradictions of the Founding Era be erased?"
  },
  {
    "title": "Trump’s Migrant Detention Pipeline Extends From Minnesota to El Paso",
    "link": "https://www.nytimes.com/2026/02/05/us/minnesota-el-paso-ice-immigration.html",
    "summary": "Immigrants apprehended in Minnesota are being sent to a gigantic West Texas detention center where lawyers and detainees say conditions are deplorable, then released in El Paso to find their way home."
  },
  {
    "title": "Surge in Immigration Cases in Minnesota Pushes Prosecutors and Judges to Brink",
    "link": "https://www.nytimes.com/2026/02/05/us/politics/minnesota-immigration-crackdown.html",
    "summary": "Remarks by a prosecutor opened a revealing window onto how the courts in the state are buckling under the weight of a deluge of cases arising from the Trump administration’s campaign."
  },
  {
    "title": "What Restrictions Are Democrats Demanding for Immigration Agents?",
    "link": "https://www.nytimes.com/2026/02/05/us/politics/democrats-dhs-funding-immigration.html",
    "summary": "Democrats say they will not support a spending bill to keep the Homeland Security Department running without new restrictions on federal agents."
  },
  {
    "title": "Jessie Diggins is the Olympian Testing the Limits of Endurance",
    "link": "https://www.nytimes.com/2026/02/05/magazine/jessie-diggins-ski-winter-olympics-milan.html",
    "summary": "Jessie Diggins has become the best-ever American cross-country skier because of what she pushes her body through."
  },
  {
    "title": "2026 Winter Olympics Guide: How to Watch, Schedule, and Top Events",
    "link": "https://www.nytimes.com/2026/02/05/sports/winter-olympics-milan-how-to-watch.html",
    "summary": "The best athletes in the world on snow and ice get their quadrennial moment this month at the 2026 Winter Games in Italy."
  },
  {
    "title": "The G.O.P. Senator Who Can’t Stop Thinking About the Boy ICE Detained",
    "link": "https://www.nytimes.com/2026/02/05/us/politics/katie-britt-trump-immigration.html",
    "summary": "Katie Britt is uniquely positioned to reason with the Trump administration — when she chooses to speak up."
  },
  {
    "title": "LA Olympics Chief Keeps Low Profile in Milan Games After Appearing in Epstein Files",
    "link": "https://www.nytimes.com/2026/02/05/world/europe/la-olympic-games-wasserman-epstein-files.html",
    "summary": "Casey Wasserman, who is leading preparations for the 2028 Summer Games, has expressed “regret” after messages he exchanged with Ghislaine Maxwell decades ago surfaced."
  },
  {
    "title": "Starmer Apologizes for Ex-Ambassador Mandelson’s Epstein Ties",
    "link": "https://www.nytimes.com/2026/02/05/world/europe/epstein-files-mandelson-starmer-uk.html",
    "summary": "Newly released documents detailed connections between the convicted sex offender Jeffrey Epstein and Peter Mandelson, who was picked to be the U.S. envoy by the British prime minister, Keir Starmer."
  },
  {
    "title": "Epstein Often Gifted Luxury Fashion to Curry Favor, Files Show",
    "link": "https://www.nytimes.com/2026/02/05/style/esptein-files-luxury-brands-gifts-fashion.html",
    "summary": "Goyard wallets, Apple Watches and cashmere sweaters were just some of the items sent to friends and associates."
  },
  {
    "title": "Brad Karp Resigns as Paul Weiss Chairman Amid Epstein Fallout",
    "link": "https://www.nytimes.com/2026/02/04/business/brad-karp-paul-weiss-resigns-epstein.html",
    "summary": "The decision followed the release of a series of embarrassing emails between Mr. Karp and Jeffrey Epstein."
  },
  {
    "title": "Savannah Guthrie Addresses Mother’s Abductor: ‘We Are Ready to Talk’",
    "link": "https://www.nytimes.com/2026/02/04/us/savannah-guthrie-plea-statement.html",
    "summary": "Ms. Guthrie, the television anchor, and her siblings released a video on Wednesday night asking for proof that their mother, Nancy, is alive."
  },
  {
    "title": "What to Know About the Disappearance of Savannah Guthrie’s Mom, Nancy",
    "link": "https://www.nytimes.com/2026/02/03/us/savannah-guthrie-mom-missing.html",
    "summary": "Nancy Guthrie, 84, the “Today” show host’s mother, was last seen on Saturday night, the authorities said. The disappearance is being investigated as a possible kidnapping."
  },
  {
    "title": "‘It’s Collective Punishment’: Iran Exacts Heavy Price on Protest Supporters",
    "link": "https://www.nytimes.com/2026/02/05/world/middleeast/iran-protests-crackdown.html",
    "summary": "The authorities are making mass arrests, seizing assets and hunting down doctors who treated protesters. Some Iranians keep showing defiance anyway."
  },
  {
    "title": "Iranian Nobel Peace Laureate Starts New Hunger Strike in Prison",
    "link": "https://www.nytimes.com/2026/02/05/world/middleeast/iran-narges-mohammadi-prison-hunger-strike.html",
    "summary": "The rights activist Narges Mohammadi is protesting her continued detention, her family said. She was arrested again in December after being given leave from prison for medical treatment."
  },
  {
    "title": "To Win Back the House, Democrats Take the Fight to Deep-Red Areas",
    "link": "https://www.nytimes.com/2026/02/05/us/politics/democrats-house-candidates.html",
    "summary": "Democrats are tapping candidates with unusual résumés — a Tejano recording star, a smokejumper and a fourth-generation farmer — to compete in areas long seen as inhospitable."
  },
  {
    "title": "Los Angeles Civic Leader Austin Beutner Drops Out of Mayor’s Race",
    "link": "https://www.nytimes.com/2026/02/05/us/los-angeles-mayor-beutner.html",
    "summary": "Mr. Beutner, a former ally of Mayor Karen Bass, entered the contest in October. He is leaving the race weeks after the sudden death of his daughter."
  },
  {
    "title": "How Hochul Improved Her Prospects and Hurt an Adversary Along the Way",
    "link": "https://www.nytimes.com/2026/02/05/nyregion/hochul-democratic-convention-delgado.html",
    "summary": "Gov. Kathy Hochul of New York has warded off most challenges to her re-election, but still faces one from her own deputy, Lt. Gov. Antonio Delgado."
  },
  {
    "title": "Primary for New Jersey Seat Is First House Race in Pivotal Year",
    "link": "https://www.nytimes.com/2026/02/05/nyregion/new-jersey-special-election-congress.html",
    "summary": "Eleven candidates are running in a special primary election on Thursday to fill Gov. Mikie Sherrill’s former seat. They include a former member of Congress and the former lieutenant governor."
  },
  {
    "title": "Bad Bunny Means a Breakthrough for Puerto Rican Athletes, Too",
    "link": "https://www.nytimes.com/2026/02/05/arts/music/super-bowl-bad-bunny-puerto-rico-nfl.html",
    "summary": "Puerto Rican football players are thrilled that Spanish will resound at the Super Bowl. “The stage is bigger than the N.F.L. itself,” one lineman said."
  },
  {
    "title": "He Was Laid Off at The Washington Post After Working There 60 Years",
    "link": "https://www.nytimes.com/2026/02/05/business/media/washington-post-martin-weil-metro.html",
    "summary": "Martin Weil, one of hundreds being let go at The Post, has worked on local news there since 1965, witnessing the paper’s rise and now retrenchment."
  },
  {
    "title": "When the Cold Turns Deadly, What Should New York City Do?",
    "link": "https://www.nytimes.com/2026/02/05/nyregion/nyc-cold-homeless-deaths.html",
    "summary": "Seventeen New Yorkers have died after exposure to frigid temperatures since Jan. 24, raising questions about how Mayor Zohran Mamdani has managed the crisis."
  },
  {
    "title": "Dozens of Earthquakes Have Rattled San Ramon, California",
    "link": "https://www.nytimes.com/2026/02/05/us/san-ramon-california-earthquake-swarm.html",
    "summary": "San Ramon, Calif., has been rattled by dozens of small earthquakes in recent months. Even in a region used to regular shaking, it’s been a lot."
  },
  {
    "title": "Trump Brings Out the Worst in Everyone",
    "link": "https://www.nytimes.com/2026/02/05/opinion/trump-iran-ice-stephen-miller.html",
    "summary": "Us included."
  },
  {
    "title": "‘Melania’: Watching a First Lady Vanish in Plain Sight",
    "link": "https://www.nytimes.com/2026/02/05/opinion/melania-film-review.html",
    "summary": "Glamour, silence and a very big hat."
  },
  {
    "title": "The Epstein Files",
    "link": "https://www.nytimes.com/2026/02/05/briefing/the-epstein-files.html",
    "summary": "We look into the relationships powerful people had with the convicted sex offender."
  },
  {
    "title": "Woman Charged With Assaulting 3 Muslims in Brooklyn, Including Girl, 12",
    "link": "https://www.nytimes.com/2026/02/05/nyregion/hate-crimes-brooklyn-hijab.html",
    "summary": "A 34-year-old Staten Island woman has been arrested and charged with hate crimes in connection with attacks that happened in a span of 11 minutes."
  },
  {
    "title": "Doctors’ Group Endorses Restrictions on Gender-Related Surgery for Minors",
    "link": "https://www.nytimes.com/2026/02/04/health/gender-surgery-minors-ama.html",
    "summary": "The A.M.A.’s announcement followed a similar recommendation from the American Society of Plastic Surgeons. Other medical groups argued for a more personalized approach."
  },
  {
    "title": "The Louvre Thieves Dropped This Priceless Crown. Now It Looks Like This.",
    "link": "https://www.nytimes.com/2026/02/05/world/europe/louvre-heist-crown-damage-eugenie-empress.html",
    "summary": "Empress Eugénie’s crown was left lying on the sidewalk after the Louvre Museum heist in October. The museum has now released pictures of the damage."
  },
  {
    "title": "France’s Raid on X Escalates Trans-Atlantic Showdown Over Social Media",
    "link": "https://www.nytimes.com/2026/02/04/world/europe/social-media-free-speech.html",
    "summary": "The French investigation into Elon Musk’s X illustrated a fundamental divide between European and American leaders about how to regulate social media — or whether to restrict it at all."
  }
]