[
  {
    "title": "NYPD Officer Killed in NYC Shooting Was Part of Paid Detail Unit",
    "link": "https://www.nytimes.com/2025/07/29/nyregion/nypd-officer-nyc-shooting.html",
    "summary": "The Paid Detail Unit allows businesses that can afford it to pay for extra police protection."
  },
  {
    "title": "What We Know about the NYC Shooting in Midtown Manhattan",
    "link": "https://www.nytimes.com/2025/07/29/nyregion/nyc-shooting-midtown-gunman-victims.html",
    "summary": "Four people were killed, including an off-duty New York City police officer, when a gunman opened fire in an office tower before fatally shooting himself, officials said."
  },
  {
    "title": "Former Football Players With CTE Have Turned to Violence",
    "link": "https://www.nytimes.com/2025/07/29/business/nyc-shooting-note-cte-explained.html",
    "summary": "The gunman in the Manhattan office shooting said in a note that he believed he had C.T.E., a degenerative disease linked by studies to repeated hits to the head."
  },
  {
    "title": "Trump Is Winning His Trade War. What Will That Mean for the Economy?",
    "link": "https://www.nytimes.com/2025/07/29/business/economy/trump-tariffs-economy.html",
    "summary": "The president’s vision for reshaping global trade is falling into place, but he is embarking on an experiment that economists say could still produce damaging results."
  },
  {
    "title": "I.M.F. Raises Global Growth Outlook as U.S. Eases Some Tariffs",
    "link": "https://www.nytimes.com/2025/07/29/business/economy/imf-world-economic-outlook-trade-wars.html",
    "summary": "The International Monetary Fund warned that trade tension continued to be a risk for the global economy."
  },
  {
    "title": "Trump’s E.U. Trade Deal Comes With Impossible Energy Promises",
    "link": "https://www.nytimes.com/2025/07/29/climate/trump-trade-deal-europe-energy.html",
    "summary": "The European Union pledged to buy billions of dollars’ worth of energy resources from the United States. Experts say that’s unrealistic and could hurt Europe’s climate goals."
  },
  {
    "title": "Marjorie Taylor Greene Is First Republican Lawmaker to Call Gaza Crisis a ‘Genocide’",
    "link": "https://www.nytimes.com/2025/07/29/us/politics/marjorie-taylor-greene-gaza-genocide.html",
    "summary": "Ms. Greene is the first Republican in Congress to use the term to describe the dire humanitarian situation in Gaza, two years after she led the push to censure a Democrat for speaking out against conditions there."
  },
  {
    "title": "UK Will Recognize Palestinian Statehood In September, Unless Israel-Hamas Cease-Fire is Reached",
    "link": "https://www.nytimes.com/2025/07/29/world/europe/uk-palestine-state-starmer-gaza-israel.html",
    "summary": "Prime Minister Keir Starmer said his country would act unless there was a truce, citing the “intolerable” humanitarian crisis in Gaza."
  },
  {
    "title": "Israeli Settler Kills Palestinian Activist Included in Oscar-Winning Documentary",
    "link": "https://www.nytimes.com/2025/07/29/world/middleeast/israeli-settler-palestinian-killed.html",
    "summary": "Awdah Hathaleen, whose work was featured in the Oscar-winning documentary “No Other Land,” was shot dead. The suspect had been subject to U.S. sanctions, but President Trump lifted them."
  },
  {
    "title": "Israeli Far-Right Minister Promotes Plan for Jewish Resettlement in Gaza",
    "link": "https://www.nytimes.com/2025/07/29/world/middleeast/israel-gaza-jewish-resettlement.html",
    "summary": "Bezalel Smotrich described Gaza as an ‘inseparable part’ of Israel, even as the Netherlands announced a ban on him and another hard line Israeli minister."
  },
  {
    "title": "E.P.A. Plans to Revoke the Legal Basis for Tackling Climate Change",
    "link": "https://www.nytimes.com/2025/07/29/climate/epa-endangerment-finding-repeal-proposal.html",
    "summary": "The agency’s administrator said in a podcast that the move would be “the largest deregulatory action in the history of America.”"
  },
  {
    "title": "Coal Plants Emailed the E.P.A. to Avoid Clean-Air Rules",
    "link": "https://www.nytimes.com/2025/07/29/climate/epa-air-pollution-exemptions-emails.html",
    "summary": "Sites including at least 15 coal plants sought exemptions from environmental rules using a new Trump administration system to fast-track requests, documents show."
  },
  {
    "title": "The First Soda in Space: When NASA Got Caught Up in the Cola Wars",
    "link": "https://www.nytimes.com/2025/07/29/science/coke-pepsi-nasa-space-shuttle.html",
    "summary": "In the summer of 1985, NASA, the Reagan White House and seven talented astronauts were wrangled into an orbital battle over soft-drink supremacy."
  },
  {
    "title": "How Europe’s Leaders Coaxed Trump on Gaza and Ukraine",
    "link": "https://www.nytimes.com/2025/07/29/world/europe/trump-europe-ukraine-gaza.html",
    "summary": "A tactic of deference and praise, along with a studied attempt to avoid any public blowups, coaxed President Trump into changes on key issues like Gaza and Ukraine."
  },
  {
    "title": "Justice Dept. Seeks Censure of Judge Boasberg, Widening Fight With Judiciary",
    "link": "https://www.nytimes.com/2025/07/29/us/politics/judge-boasberg-misconduct-complaint-bondi.html",
    "summary": "A complaint said Judge James E. Boasberg, who has clashed with the Trump administration over deportation plans, made “improper public comments” about President Trump in a closed-door judicial conference."
  },
  {
    "title": "Powell Under Siege as Fed Plans to Stand Pat on Rate Cuts",
    "link": "https://www.nytimes.com/2025/07/29/business/powell-trump-fed-rate-cuts.html",
    "summary": "Jerome H. Powell, the Federal Reserve chair, is facing relentless attacks from the president, a lively campaign to replace him and divisions in his own ranks over when to cut interest rates."
  },
  {
    "title": "Shoppers Embrace ‘Christmas in July’ Amid Rising Costs and Tariff Limbo",
    "link": "https://www.nytimes.com/2025/07/29/business/economic-anxiety-christmas-in-july.html",
    "summary": "People are starting their holiday shopping earlier this year, using summer sales from retailers like Amazon and Walmart to save time and money."
  },
  {
    "title": "Union Pacific to Buy Norfolk Southern in $85 Billion Railroad Deal",
    "link": "https://www.nytimes.com/2025/07/29/business/union-pacific-norfolk-southern-merger.html",
    "summary": "The merger would create the United States’ first coast-to-coast rail network, spanning 50,000 miles and 43 states."
  },
  {
    "title": "Restaurant Review: Taquería Frontera in Los Angeles",
    "link": "https://www.nytimes.com/2025/07/29/dining/restaurant-review-taqueria-frontera-tacos-los-angeles.html",
    "summary": "At Taquería Frontera, the art of Tijuana-style tacos is on full display."
  },
  {
    "title": "Class and Identity in Hilton Head: The Gullah v. Wealthy Landowners",
    "link": "https://www.nytimes.com/2025/07/29/us/south-carolina-gullah.html",
    "summary": "A legal fight over access to burial grounds has pitted the Gullah Geechee against wealthy landowners around Hilton Head Island."
  },
  {
    "title": "How Netanyahu Played Trump for a Fool in Gaza",
    "link": "https://www.nytimes.com/2025/07/29/opinion/gaza-netanyahu-trump-israel-starvation.html",
    "summary": "This is the first Israeli-Palestinian war where the worst leaders on both sides are calling all the shots."
  },
  {
    "title": "Trump, Juan Crow and Who Gets to Be an American",
    "link": "https://www.nytimes.com/2025/07/29/opinion/trump-juan-crow-birther-race.html",
    "summary": "The rights conferred to all by the Constitution are now subject to a sliding scale of extralegal violability depending on race, ethnicity or assumed immigration status."
  },
  {
    "title": "Your Questions About Education",
    "link": "https://www.nytimes.com/2025/07/29/briefing/your-questions-about-education.html",
    "summary": "Our reporters address reader submissions."
  },
  {
    "title": "Novo Nordisk, Ozempic Drugmaker, Sees Stock Plunge 20% After Profit Warning",
    "link": "https://www.nytimes.com/2025/07/29/business/ozempic-novo-nordisk-stock-plunge.html",
    "summary": "Novo Nordisk slashed its financial forecasts as it struggled to fight off competition in the United States. It also named a new chief executive, who highlighted the “urgency” of the moment."
  },
  {
    "title": "‘Come With Me, Chuck E.’: Mouse Arrested on Credit Card Fraud Charges",
    "link": "https://www.nytimes.com/2025/07/29/us/chuck-e-cheese-costume-arrest-fraud.html",
    "summary": "At a Tallahassee, Fla., Chuck E. Cheese location, a police officer told children: “Chuck E.’s busy right now.”"
  },
  {
    "title": "Sean ‘Diddy’ Combs, Awaiting Sentencing, Asks Judge to Release Him From Jail",
    "link": "https://www.nytimes.com/2025/07/29/arts/music/sean-combs-diddy-bail-bond.html",
    "summary": "Lawyers for the music mogul, who is to be sentenced in October on prostitution charges, filed court papers saying he would sign a $50 million bond."
  },
  {
    "title": "Pets, Like Dogs and Cats, Have an Environmental Cost. Here’s How to Lessen It.",
    "link": "https://www.nytimes.com/2025/07/29/climate/dogs-cats-pets-environment-impact.html",
    "summary": "Some pets have wide-ranging effects on the planet. Here’s how to lessen them."
  }
]