[
  {
    "title": "Alex Jeffrey Pretti Knew He Wanted to Help Others",
    "link": "https://www.nytimes.com/2026/01/24/us/alex-jeffrey-pretti-was-an-icu-nurse-at-the-va-hospital.html",
    "summary": "Shot and killed by immigration agents on a Minneapolis street, he wanted to be a ‘force of good in the world.’"
  },
  {
    "title": "What We Know About a Second Fatal Shooting in Minneapolis",
    "link": "https://www.nytimes.com/2026/01/24/us/politics/second-ice-shooting-minneapolis.html",
    "summary": "Investigators believe at least two agents shot and killed a 37-year-old Minneapolis resident on Saturday, the city’s police chief said."
  },
  {
    "title": "Scenes From the Winter Storm",
    "link": "https://www.nytimes.com/2026/01/24/us/winter-storm-snow-photos-videos.html",
    "summary": "Images from across much of the country illuminate snow-covered streets and preparations for worse still to come."
  },
  {
    "title": "The Woman Who Stands Between Donald Trump and Greenland",
    "link": "https://www.nytimes.com/2026/01/25/world/europe/mette-frederiksen-denmark-greenland.html",
    "summary": "Mette Frederiksen, Denmark’s leader, has taken big risks standing up to Mr. Trump. It might just be working — for now."
  },
  {
    "title": "Trump Pushes A.I. Data Centers, but the G.O.P. Is Cool to One in Alabama",
    "link": "https://www.nytimes.com/2026/01/25/us/politics/trump-ai.html",
    "summary": "Residents also oppose a data center the size of 18 Walmarts that is set to be built in pristine woodland outside Bessemer, Ala. “All this will be gone,” one said."
  },
  {
    "title": "Xi’s Purge of China’s Military Brings Its Top General Down",
    "link": "https://www.nytimes.com/2026/01/24/world/asia/china-top-general-xi-military-purge.html",
    "summary": "The ouster of Gen. Zhang Youxia, who was second only to Xi Jinping in the military hierarchy, marks “the total annihilation of the high command,” one analyst said."
  },
  {
    "title": "How Iran Crushed a Citizen Uprising With Lethal Force",
    "link": "https://www.nytimes.com/2026/01/25/world/middleeast/iran-how-crackdown-was-done.html",
    "summary": "Protests erupted amid a communications blackout. But as video and witness accounts trickle out, the brutality of the regime’s crackdown is becoming clear."
  },
  {
    "title": "Amid Two-Week Internet Blackout, Some Iranians Are Getting Back Online",
    "link": "https://www.nytimes.com/2026/01/25/world/middleeast/iran-internet.html",
    "summary": "Many in Iran are gaining brief and unexplained windows of online connectivity, offering a widening glimpse of the extent of the government crackdown."
  },
  {
    "title": "Morris Katz Is 26 and Ready to Fix the Democrats’ Strategy",
    "link": "https://www.nytimes.com/2026/01/25/style/morris-katz-political-strategest-mamdani.html",
    "summary": "Part casting director, part media guru, Morris Katz is behind the biggest Democratic campaigns this cycle."
  },
  {
    "title": "Geese Gives ‘Saturday Night Live’ Viewers Something to Talk About",
    "link": "https://www.nytimes.com/2026/01/25/arts/music/geese-cameron-winter-saturday-night-live-snl.html",
    "summary": "The buzzy Brooklyn band brought its off-kilter aesthetic to network TV this weekend, with performances that were both confounding and audacious."
  },
  {
    "title": "S.N.L. Recap: Teyana Taylor Hosts, the First Trump Awards and More",
    "link": "https://www.nytimes.com/2026/01/25/arts/television/snl-trump-awards-teyana-taylor.html",
    "summary": "A covetous president grabbed up all the trophies on this week’s “Saturday Night Live” broadcast, hosted by Teyana Taylor, star of “One Battle After Another.”"
  },
  {
    "title": "Minneapolis and Gaza Now Share the Same Violent Language",
    "link": "https://www.nytimes.com/2026/01/25/opinion/minneapolis-gaza-masked-violence.html",
    "summary": "When ICE and Hamas start looking the same, we are all in trouble."
  },
  {
    "title": "How College Can Tear Us Apart",
    "link": "https://www.nytimes.com/2026/01/25/opinion/college-thinking-illiberalism.html",
    "summary": "If illiberalism is the problem, what is the cure?"
  },
  {
    "title": "In Venezuela, Families Search for Relatives Who Are Detained and Missing",
    "link": "https://www.nytimes.com/2026/01/25/world/americas/in-venezuela-families-search-for-relatives-who-are-detained-and-missing.html",
    "summary": "Even as dozens of political prisoners have been freed, at least 66 people taken by state authorities and never heard from again remain missing, relatives and rights groups say."
  },
  {
    "title": "Travel Math: When Flying Costs as Much as the Train, Who Wins?",
    "link": "https://www.nytimes.com/2026/01/24/us/politics/amtrak-dynamic-pricing-flying.html",
    "summary": "Amtrak says dynamic pricing has helped strengthen its finances, but travelers often grumble at the cost, especially for last-minute travel. Still, the train has a secret weapon: avoiding the airport."
  },
  {
    "title": "Alex Honnold Climbs Taipei 101 Skyscraper in Taiwan",
    "link": "https://www.nytimes.com/2026/01/23/world/asia/climbing-buildings-skyscrapers-alex-honnold.html",
    "summary": "Alex Honnold, who climbed a 1,667-foot-tall skyscraper in Taiwan on Sunday, is one of a dozen or so known skyscraper climbers worldwide."
  },
  {
    "title": "Pro-Israel Group Targets a Former Ally in an Early Congressional Race",
    "link": "https://www.nytimes.com/2026/01/25/nyregion/new-jersey-malinowski-israel-aipac.html",
    "summary": "A super PAC affiliated with the American Israel Public Affairs Committee is running ads against Tom Malinowski, who is hoping to replace Gov. Mikie Sherrill of New Jersey in the House."
  }
]