[
  {
    "title": "Trump Says He Is Firing Lisa Cook From Fed Board of Governors",
    "link": "https://www.nytimes.com/2025/08/25/us/politics/lisa-cook-fired-trump-fed.html",
    "summary": "President Trump told Lisa Cook that he had found sufficient cause “to remove you from your position.” Ms. Cook and her lawyer said they would fight the firing."
  },
  {
    "title": "Lisa Cook Says She Will Not Step Down From the Fed",
    "link": "https://www.nytimes.com/2025/08/26/us/politics/lisa-cook-fed-governor.html",
    "summary": "Ms. Cook said that she would not resign from the board of governors, hours after President Trump announced he was firing her."
  },
  {
    "title": "Can Trump Fire a Fed Governor? What to Know as He Moves to Remove Lisa Cook",
    "link": "https://www.nytimes.com/2025/08/22/us/politics/can-trump-fire-a-fed-governor.html",
    "summary": "The Supreme Court has indicated that there are distinctive reasons to shield the Federal Reserve from political interference."
  },
  {
    "title": "Lisa Cook Broke Ground at the Fed, Before Attack by Trump",
    "link": "https://www.nytimes.com/2025/08/23/business/lisa-cook-fed-trump.html",
    "summary": "The first Black woman to serve on the Federal Reserve board, Ms. Cook has long been a pathbreaker in a field dominated by white men."
  },
  {
    "title": "Crime Gone in a Week? The Politics Behind Trump’s Federal Crackdown.",
    "link": "https://www.nytimes.com/2025/08/25/us/politics/trump-crime-federal-crackdown-politics.html",
    "summary": "President Trump is using crime as a political weapon, proclaiming quick-fix solutions to deeply rooted challenges in cities led by Democrats."
  },
  {
    "title": "Trump Orders Major Expansion of National Guard’s Role in Law Enforcement",
    "link": "https://www.nytimes.com/2025/08/25/us/politics/trump-national-guard.html",
    "summary": "An executive order released on Monday directs the creation of specialized Guard units to quell civil disturbances in each state and seeks civilian volunteers to assist federal agents in Washington."
  },
  {
    "title": "Israeli Hospital Strike Kills 20 in Gaza, Including 5 Journalists",
    "link": "https://www.nytimes.com/2025/08/25/world/middleeast/gaza-hospital-journalists.html",
    "summary": "Five journalists, along with medical workers, were among the dead at Nasser Hospital. Prime Minister Benjamin Netanyahu said the military would investigate."
  },
  {
    "title": "Rabbis Emerge as Growing Voice of Criticism of Israel’s Tactics in Gaza",
    "link": "https://www.nytimes.com/2025/08/26/us/rabbis-gaza.html",
    "summary": "Among the recent public letters was one from dozens of Orthodox rabbis demanding “moral clarity” to what they called a humanitarian crisis."
  },
  {
    "title": "U.N. Peacekeepers in Lebanon Face Uncertain Future",
    "link": "https://www.nytimes.com/2025/08/25/world/europe/lebanon-israel-un-unifil-peacekeeping.html",
    "summary": "With its mission up for renewal, the U.N. force is under pressure to disband even as Israeli airstrikes continue along one of the world’s most volatile borders."
  },
  {
    "title": "Lawmakers Visit Syria to Push for Repealing Sanctions Law",
    "link": "https://www.nytimes.com/2025/08/25/us/politics/lawmakers-syria-repeal-sanctions-law.html",
    "summary": "A bipartisan pair of members of Congress made the first official U.S. visit there since the fall of the Assad government, arguing that it was time to permanently lift American sanctions."
  },
  {
    "title": "Australia Accuses Iran of Directing Antisemitic Arson Attacks",
    "link": "https://www.nytimes.com/2025/08/26/world/australia/australia-iran-antisemitic-attacks.html",
    "summary": "The government expelled Iran’s diplomats, saying the country was behind the attacks on a Melbourne synagogue and a Sydney restaurant last year."
  },
  {
    "title": "4 A.M. at a Beijing Labor Market: Jobs, and Hope, Are in Short Supply",
    "link": "https://www.nytimes.com/2025/08/26/world/asia/china-jobs-economy.html",
    "summary": "China’s economic slowdown has fallen especially hard on older migrant workers, who often don’t have the technical skills that employers are seeking."
  },
  {
    "title": "Trump Repeatedly Praises North Korea’s Dictator in Meeting With South’s President",
    "link": "https://www.nytimes.com/2025/08/25/us/politics/trump-north-south-korea.html",
    "summary": "In the Oval Office, President Trump met his South Korean counterpart as the relationship between their countries has been strained."
  },
  {
    "title": "Abrego Garcia Detained Again After Government Signaled It Would Re-Deport Him",
    "link": "https://www.nytimes.com/2025/08/25/us/politics/kilmar-abrego-garcia-arrested-ice-deportation.html",
    "summary": "A judge in Maryland barred the Trump administration from immediately deporting Kilmar Armando Abrego Garcia until he had a chance to challenge the move."
  },
  {
    "title": "House Republican Seeks Documents From Epstein Estate",
    "link": "https://www.nytimes.com/2025/08/25/us/politics/epstein-files-subpoena-comer.html",
    "summary": "Representative James E. Comer of Kentucky demanded financial records, video recordings and information on meetings with famous people."
  },
  {
    "title": "Epstein Accuser’s Family Takes Issue With Plans to Publish Her Memoir",
    "link": "https://www.nytimes.com/2025/08/25/books/review/virginia-roberts-giuffre-memoir-knopf.html",
    "summary": "Relatives of Virginia Roberts Giuffre, who died earlier this year, contend that the book underplays the abuse she suffered at the hands of her husband."
  },
  {
    "title": "After U.S. Takes Stake in Intel, Trump Pledges ‘Many More’ Deals",
    "link": "https://www.nytimes.com/2025/08/25/us/politics/trump-intel-economy-strategy.html",
    "summary": "The president said he hoped to “get as much as I can,” signaling a shift in the relationship between government and private business."
  },
  {
    "title": "The Backbone of the Global Auto Supply Chain Is at Risk From Trump’s Tariffs",
    "link": "https://www.nytimes.com/2025/08/26/business/trump-tariffs-auto-suppliers.html",
    "summary": "They are threatening smaller parts companies that are key to manufacturing and employ hundreds of thousands in Japan, South Korea and Germany."
  },
  {
    "title": "In Private Deal, the D.N.C. Covered $20 Million in Harris Bills Post-Election",
    "link": "https://www.nytimes.com/2025/08/25/us/politics/kamala-harris-dnc-fundraising.html",
    "summary": "The former vice president has been raising the funds to pay all of those expenses and to keep the party whole financially. But small donors making those contributions have been left in the dark."
  },
  {
    "title": "Maurice Tempelsman, Diamond Magnate and Jackie Onassis’s Companion, Dies at 95",
    "link": "https://www.nytimes.com/2025/08/25/business/maurice-tempelsman-dead.html",
    "summary": "A private and politically connected gem merchant, he was thrust into the public spotlight when his personal relationship with the former first lady became known in the late 1980s."
  },
  {
    "title": "Israel’s Gaza Campaign Is Making It a Pariah State",
    "link": "https://www.nytimes.com/2025/08/25/opinion/international-world/friedman-israel-gaza-hamas.html",
    "summary": "Israel is well on its way to making itself a pariah state — to the point that Israelis will think twice about speaking Hebrew when traveling abroad."
  },
  {
    "title": "Brazil, India and Other Countries Fight Back Against Trump’s Tariffs",
    "link": "https://www.nytimes.com/2025/08/26/opinion/trump-brazil-india-tariffs.html",
    "summary": "Brazil, India and other emerging countries are hedging their bets against the United States."
  },
  {
    "title": "Kennedy Center’s New Dance Director Criticized ‘Woke’ Ballet Culture",
    "link": "https://www.nytimes.com/2025/08/25/arts/dance/kennedy-center-stephen-nakagawa.html",
    "summary": "Stephen Nakagawa, a former dancer with the Washington Ballet, wrote a letter to the leader of the arts center complaining about “radical leftist ideologies in ballet.”"
  },
  {
    "title": "SpaceX Scrubs 10th Starship Test Launch Because of Lousy Weather",
    "link": "https://www.nytimes.com/2025/08/25/science/spacex-starship-launch.html",
    "summary": "Weather interfered on Monday night with the ability of Elon Musk’s company to show it could overcome setbacks faced by its Starship prototype."
  },
  {
    "title": "Phoenix Airport Grounds Flights After Dust Storms",
    "link": "https://www.nytimes.com/2025/08/25/weather/dust-storm-phoenix-arizona-airport.html",
    "summary": "The brief ground stop at Sky Harbor International Airport was lifted on Monday evening, but delays were expected as operations resumed."
  },
  {
    "title": "Babe Ruth (Not That One) Stole Baseball Players’ Identities, U.S. Says",
    "link": "https://www.nytimes.com/2025/08/25/us/babe-ruth-baseball-fraud.html",
    "summary": "George Herman Ruth, a Tennessee man with the same full name as the Yankees slugger, used the names of retired and dead players to commit fraud, prosecutors said."
  }
]