[
  {
    "title": "Musk Wades Back Into Politics, Slamming Trump’s Domestic Policy Bill",
    "link": "https://www.nytimes.com/2025/06/28/us/politics/musk-trump-bill.html",
    "summary": "Weeks after ending his war of words with President Trump, Elon Musk called the president’s bill “utterly insane and destructive.”"
  },
  {
    "title": "Why a G.O.P. Medicaid Requirement Could Set States Up for Failure",
    "link": "https://www.nytimes.com/2025/06/28/upshot/republicans-medicaid-work-requirement.html",
    "summary": "The Republicans’ big bill would require most states to build technology systems quickly and with little funding."
  },
  {
    "title": "How the Supreme Court’s Injunction Ruling Expands Trump’s Power",
    "link": "https://www.nytimes.com/2025/06/28/us/supreme-court-trump-executive-branch-power.html",
    "summary": "The court tied the hands of judges at a time when Congress has been cowed and internal executive branch constraints have been steamrolled."
  },
  {
    "title": "Courts Will Have to Grapple With New Limits on Their Power",
    "link": "https://www.nytimes.com/2025/06/28/us/politics/injunctions-what-comes-next.html",
    "summary": "The Supreme Court has set a new, higher bar for judges seeking to block Trump administration policies nationwide. But some legal routes remain open."
  },
  {
    "title": "Chief Justice Roberts Urges Political Leaders to Tone Down Rhetoric",
    "link": "https://www.nytimes.com/2025/06/28/us/chief-justice-roberts-threats.html",
    "summary": "At a conference with federal judges, the chief justice did not mention the court’s decision sharply limiting their power, focusing instead on the danger of threats to the judiciary."
  },
  {
    "title": "Israel and U.S. Smashed Iran Nuclear Site That Grew After Trump Quit 2015 Accord",
    "link": "https://www.nytimes.com/2025/06/28/science/iran-nuclear-uranium-metal.html",
    "summary": "Nuclear experts say the president’s rejection of the restrictive deal forced him to neutralize an Iranian threat of his own making."
  },
  {
    "title": "Iran Holds State Funeral for Military Commanders and Nuclear Scientists",
    "link": "https://www.nytimes.com/2025/06/28/world/middleeast/iran-funerals-israel-war.html",
    "summary": "A procession of marchers honored prominent figures killed during the 12-day war with Israel."
  },
  {
    "title": "Tim Walz Eulogizes Minnesota Rep. Melissa Hortman and Husband During Funeral",
    "link": "https://www.nytimes.com/2025/06/28/us/politics/minnesota-melissa-hortman-funeral.html",
    "summary": "Melissa Hortman was eulogized by Gov. Tim Walz as a compassionate leader in a service that former President Biden and former Vice President Harris also attended."
  },
  {
    "title": "Political Violence Is Part of the American Story. It Is Also Changing.",
    "link": "https://www.nytimes.com/2025/06/28/us/political-violence-minnesota-assassination.html",
    "summary": "Attacks, such as an assassination in Minnesota, are on the rise. Their motives are often hard to parse."
  },
  {
    "title": "Is Pope Leo a Man of Action on Sexual Abuse Cases? Or the Opposite?",
    "link": "https://www.nytimes.com/2025/06/28/world/americas/pope-leo-catholic-church-sexual-abuse-peru-bishop-prevost.html",
    "summary": "For some survivors, he was a hero. Others who reported abuse said he failed them."
  },
  {
    "title": "Takeaways From a Times Investigation of the Pope’s Legacy on Sex Abuse",
    "link": "https://www.nytimes.com/2025/06/28/world/americas/pope-leo-sex-abuse-investigation-takeaways.html",
    "summary": "As a bishop in Peru, Pope Leo XIV’s handling of two abuse cases was a study in contrasts, siding strongly with victims in one and accused of failing them in the other."
  },
  {
    "title": "Mark Zuckerberg and Priscilla Chan Narrow CZI’s Focus to Science Efforts",
    "link": "https://www.nytimes.com/2025/06/28/technology/mark-zuckerberg-priscilla-chan-czi.html",
    "summary": "The tech titan and his wife once had sprawling ambitions for their Chan Zuckerberg Initiative. Now their efforts in politics, education and housing have been cut back to focus on science."
  },
  {
    "title": "Zohran Mamdani Returns to Harlem to Make His Pitch to Black New Yorkers",
    "link": "https://www.nytimes.com/2025/06/28/nyregion/mamdani-harlem-black-voters.html",
    "summary": "The presumptive Democratic nominee for mayor, who has struggled to make inroads with the Black community, spoke at the Rev. Al Sharpton’s National Action Network on Saturday."
  },
  {
    "title": "The Times’s New Critic Reviews the View, the Revolving Times Square Restaurant",
    "link": "https://www.nytimes.com/2025/06/24/dining/revolving-restaurant-times-square-review.html",
    "summary": "In her first review as our new critic, Ligaya Mishan checks out the View, the revolving Times Square dining room with a nostalgic menu and a stunning panorama of the city."
  },
  {
    "title": "Is Mostafa Asal, Squash World Champion, Testing The Rules, or Cheating?",
    "link": "https://www.nytimes.com/2025/06/28/business/mostafa-asal-squash-cheating.html",
    "summary": "Even Mostafa Asal’s coach admits his player sometimes goes too far. But an anonymous YouTuber is crying foul play, with videos to make the point."
  },
  {
    "title": "Golden Arches in a War Zone: McDonald’s Thrives in Ukraine",
    "link": "https://www.nytimes.com/2025/06/28/world/europe/ukraine-mcdonalds.html",
    "summary": "The American fast-food giant plans to open about 10 new restaurants in Ukraine this year, a testament to the country’s rebounding economy and its enduring love of Big Macs."
  },
  {
    "title": "Obfuscating on Obliterating",
    "link": "https://www.nytimes.com/2025/06/28/opinion/trump-iran-ayatollah-khamenei.html",
    "summary": "Trump schools the Ayatollah on the fine art of truth telling."
  },
  {
    "title": "Belarus Is a Warning",
    "link": "https://www.nytimes.com/2025/06/28/opinion/belarus-democracy-lukashenko.html",
    "summary": "I’m going to tell you how the people in charge of my country made the truth a crime."
  },
  {
    "title": "Chinese Police Detain Dozens of Writers Over Gay Erotic Online Novels",
    "link": "https://www.nytimes.com/2025/06/28/world/asia/china-boys-love-women.html",
    "summary": "The genre known as Boys’ Love, stories written mostly by and for straight women, has been in the authorities’ sights for years."
  },
  {
    "title": "Democrats Cheer Hollywood Tax Breaks They Once Called ‘Corporate Welfare’",
    "link": "https://www.nytimes.com/2025/06/28/arts/california-film-tax-credits-democrats-newsom.html",
    "summary": "California politicians once derided a $50 million proposal by Arnold Schwarzenegger. With the support of unions, they’re now strongly backing a $750 million subsidy."
  },
  {
    "title": "At Bezos’ Venetian Wedding: Buzz, Bling and Backlash",
    "link": "https://www.nytimes.com/2025/06/28/world/europe/bezos-sanchez-venice-wedding.html",
    "summary": "The over-the-top party in the photogenic Italian city mixed Hollywood, Silicon Valley and political overtones."
  },
  {
    "title": "Dave Parker, Power Hitter for the Pittsburgh Pirates, Dies at 74",
    "link": "https://www.nytimes.com/2025/06/28/sports/dave-parker-dead.html",
    "summary": "Parker, a towering outfielder who helped propel the Pirates to the World Series in 1979, was elected to the Baseball Hall of Fame last year."
  }
]