[
  {
    "title": "Trump Takes America’s ‘Imperial Presidency’ to a New Level",
    "link": "https://www.nytimes.com/2025/12/21/us/politics/trump-imperial-presidency.html",
    "summary": "In his first year back in the White House, President Trump has greatly expanded executive power while embracing the trappings of royalty in ways not seen in the modern era."
  },
  {
    "title": "U.S. Coast Guard Boards Tanker Carrying Venezuelan Oil",
    "link": "https://www.nytimes.com/2025/12/20/us/politics/us-coast-guard-venezuela-oil-tanker.html",
    "summary": "Kristi Noem, the homeland security secretary, said a vessel had been “apprehended.” It was the second action this month against a tanker carrying Venezuelan oil."
  },
  {
    "title": "Immigration Crackdown Creates Fault Lines Among Baptists",
    "link": "https://www.nytimes.com/2025/12/21/us/southern-baptists-immigration-trump.html",
    "summary": "An increasingly loud contingent supports the Trump administration’s efforts to deport illegal immigrants."
  },
  {
    "title": "Epstein Files Photos Disappear From Government Website, Including One of Trump",
    "link": "https://www.nytimes.com/2025/12/20/us/politics/trump-epstein-files-government-website.html",
    "summary": "A total of 16 photos were taken down at some point on Saturday from the website that the Justice Department created. One featured an open drawer containing other photos, including at least one of President Trump."
  },
  {
    "title": "Bill Clinton Photos in Epstein Files Show He Can’t Escape Scandal",
    "link": "https://www.nytimes.com/2025/12/20/us/politics/bill-clinton-epstein-files-photos-scandal.html",
    "summary": "The Republican-led Justice Department’s release of photos of the former president with Jeffrey Epstein will introduce yet another generation to his flaws and controversies."
  },
  {
    "title": "Epstein and Maxwell Grand Jury Records Are Released",
    "link": "https://www.nytimes.com/2025/12/20/us/epstein-maxwell-grand-jury.html",
    "summary": "The transcripts and photos were part of Department of Justice files arising from investigations into the disgraced financier and his former girlfriend."
  },
  {
    "title": "When Something Goes Wrong With Your Flight, These People Take Charge",
    "link": "https://www.nytimes.com/2025/12/21/business/american-airlines-operations-hub.html",
    "summary": "Inside a tornado-hardened office in Texas, 1,700 American Airlines employees manage the carrier’s operations, responding to bad weather, plane trouble and ailing passengers."
  },
  {
    "title": "‘It’s Just Us’: The Firefighter, His Son and a Treacherous Choice",
    "link": "https://www.nytimes.com/2025/12/21/us/wildfires-firefighters-immigration.html",
    "summary": "For two decades, Luis Martinez has fought wildfires for the U.S. government. Now he’s facing down cancer, debt and the threat of separation from his 11-year-old."
  },
  {
    "title": "The Trump Vibe Shift Is Dead",
    "link": "https://www.nytimes.com/2025/12/21/opinion/trump-economy-vibe-shift.html",
    "summary": "What will come in its wake?"
  },
  {
    "title": "My Oldest Old Friend",
    "link": "https://www.nytimes.com/2025/12/21/opinion/friendship-old-age.html",
    "summary": "She was a great-grandmother, and I was a millennial. We could have talked forever."
  },
  {
    "title": "Michele Singer Reiner: A Life Rooted in Activism and Listening to Others",
    "link": "https://www.nytimes.com/2025/12/21/us/michele-singer-reiner.html",
    "summary": "Michele Singer Reiner was the guiding force in the lives of her family, stressing the need to help and respect one another."
  },
  {
    "title": "Freed From a Belarus Prison, a Nobel Peace Laureate Experiences ‘Oxygen Intoxication’",
    "link": "https://www.nytimes.com/2025/12/21/world/europe/belarus-sanctions-potash-ales-bialiatski.html",
    "summary": "Ales Bialiatski, who shared the Nobel in 2022, described long hours of backbreaking work and stints in solitary confinement."
  },
  {
    "title": "Turning Point’s Annual Gathering Turns Into a Gripefest",
    "link": "https://www.nytimes.com/2025/12/20/us/politics/turning-points-americafest-ben-shapiro.html",
    "summary": "At AmericaFest, conservative leaders insulted one another, revealing serious rifts over conspiracy theories, antisemitism and who belongs in America."
  },
  {
    "title": "At the Center of the Latest Mangione Hearings: A Battle Over a Backpack",
    "link": "https://www.nytimes.com/2025/12/21/nyregion/luigi-mangione-backpack-evidence.html",
    "summary": "For three weeks, defense lawyers argued that searches of Luigi Mangione’s bag were unconstitutional. But state prosecutors have other evidence — and a federal prosecution looms."
  }
]