[
  {
    "title": "For Spouses of U.S. Citizens, Green Card Interviews End in Handcuffs",
    "link": "https://www.nytimes.com/2025/11/26/us/trump-green-card-interview-arrests.html",
    "summary": "Agents are arresting foreign-born spouses when they report for the final step to obtain permanent residency, and charging them with visa violations that could result in deportation."
  },
  {
    "title": "Colorado Judge Tells Immigration Agents to Stop Arrests Without Warrants",
    "link": "https://www.nytimes.com/2025/11/26/us/politics/colorado-immigration-ruling.html",
    "summary": "The ruling that immigration agents are acting illegally is the latest to rebuke the Trump administration’s tactics, but earlier orders have been blocked on appeal."
  },
  {
    "title": "ICE Detains Mother of White House Press Secretary Karoline Leavitt’s Nephew",
    "link": "https://www.nytimes.com/2025/11/26/us/karoline-leavitt-ice-family-member-bruna-ferreira.html",
    "summary": "Bruna Caroline Ferreira, the mother of a nephew of the White House press secretary, Karoline Leavitt, was pulled over and arrested on her way to pick up her son from school, Ms. Ferreira’s lawyer said."
  },
  {
    "title": "U.S. to Press Europe and Other Allies on Immigration, Document Says",
    "link": "https://www.nytimes.com/2025/11/26/us/politics/trump-rubio-mass-migration.html",
    "summary": "American diplomats were told to raise U.S. concerns about “violent crimes associated with people of a migration background.”"
  },
  {
    "title": "‘In Triage Every Day’: A Beleaguered Speaker Says He’s Overwhelmed",
    "link": "https://www.nytimes.com/2025/11/26/us/politics/speaker-mike-johnson-beleagured.html",
    "summary": "In a podcast interview, Speaker Mike Johnson opened up about the crushing demands of a job that he joked was his in name only."
  },
  {
    "title": "Signs of Fatigue: Trump Faces Realities of Aging in Office",
    "link": "https://www.nytimes.com/2025/11/25/us/politics/trump-age-health.html",
    "summary": "President Trump has always used his stamina and energy as a political strength. But that image is getting harder for him to sustain."
  },
  {
    "title": "Trump Says South Africa Is Not Invited to G20 Summit in U.S. in 2026",
    "link": "https://www.nytimes.com/2025/11/26/world/africa/trump-south-africa-g20.html",
    "summary": "The president did not attend this year’s annual gathering in South Africa, which has been a frequent target of his attacks."
  },
  {
    "title": "North Carolina Can Use Republican-Friendly Congressional Map, Court Says",
    "link": "https://www.nytimes.com/2025/11/26/us/north-carolina-congressional-map-republicans.html",
    "summary": "The district court ruling means that the party is one step closer to securing another seat in the U.S. House and retaining its majority, at the urging of President Trump."
  },
  {
    "title": "What to Know About the Fire at a Hong Kong Apartment Complex",
    "link": "https://www.nytimes.com/2025/11/26/world/asia/hong-kong-fire-what-to-know.html",
    "summary": "Firefighters struggled to contain the blaze in the high-rise buildings. At least 36 people were killed, and many more were feared trapped inside the towers."
  },
  {
    "title": "Five-Ingredient, Easy Thanksgiving Recipes",
    "link": "https://cooking.nytimes.com/article/five-ingredient-thanksgiving-recipes",
    "summary": "Turkey, potatoes and dessert don’t need to be fussy. Keep the shopping and cooking simple so you can enjoy the day."
  },
  {
    "title": "What the Pentagon’s Attack Videos Reveal About the Boat Strikes at Sea",
    "link": "https://www.nytimes.com/2025/11/26/us/trump-boat-strike-videos.html",
    "summary": "The military has released 21 video clips of U.S. attacks on vessels it says are trafficking drugs. But they tell only part of the story."
  },
  {
    "title": "Marriages, Kids, Careers: For 44 Years, They’ve Been Talking It Out",
    "link": "https://www.nytimes.com/2025/11/26/nyregion/group-women-friendships-marriage-family.html",
    "summary": "Six women in their 70s, all married and all mothers and grandmothers, gather twice a month without fail. They credit their close-knit families to their longstanding friendships."
  },
  {
    "title": "U.S. Army Secretary’s Unusual Role in Ukraine Peace Negotiations",
    "link": "https://www.nytimes.com/2025/11/26/us/politics/ukraine-russia-peace-talks-daniel-driscoll.html",
    "summary": "Daniel Driscoll has met with Ukrainian and Russian officials during a whirlwind of trips as the Trump administration pushes its latest proposal."
  },
  {
    "title": "Top U.S. Negotiator Warned Europeans That Russia Is Stockpiling Missiles",
    "link": "https://www.nytimes.com/2025/11/26/world/europe/ukraine-peace-talks-russia-missiles.html",
    "summary": "Daniel P. Driscoll, the U.S. Army secretary, used the growing threat from Moscow as a way to sell a quick peace deal unfavorable to Ukraine."
  },
  {
    "title": "Differences Over Health Care and Ukraine Roil a Chaotic G.O.P. Congress",
    "link": "https://www.nytimes.com/2025/11/26/us/health-care-ukraine-congress-gop.html",
    "summary": "Republican lawmakers and the White House have unloaded on one another as post-shutdown tension over policy and performance spreads across Capitol Hill."
  },
  {
    "title": "Detroit Has Its Own Thanksgiving Parade. The City Gets Bigheaded About It.",
    "link": "https://www.nytimes.com/2025/11/26/us/detroit-michigan-thanksgiving-parade.html",
    "summary": "The march down Woodward Avenue, which endured through the city’s hardest years, features papier-mâché caricatures that are uniquely Detroit."
  },
  {
    "title": "Broadway Performers Rehearse for the Macy’s Thanksgiving Day Parade",
    "link": "https://www.nytimes.com/2025/11/26/theater/macys-thanksgiving-day-parade-broadway.html",
    "summary": "We tagged along to a late-night rehearsal for performers from “Just in Time,” “Buena Vista Social Club” and “Ragtime.”"
  },
  {
    "title": "How to Watch the 2025 Macy’s Thanksgiving Day Parade",
    "link": "https://www.nytimes.com/2025/11/26/nyregion/macys-thanksgiving-day-parade-how-to-watch.html",
    "summary": "The 99th edition of the New York parade will feature performances from Cynthia Erivo and Busta Rhymes, as well as dozens of floats and balloons."
  },
  {
    "title": "Did the Giant Heads of Easter Island Once Walk?",
    "link": "https://www.nytimes.com/2025/11/26/science/archaeology-easter-island-rapa-nui.html",
    "summary": "Scholars have long debated how the massive stone figures of Rapa Nui got to where they stand today. A new study offers one possible explanation."
  },
  {
    "title": "Disney’s ‘Zootopia 2’ Will Be a Test for Jared Bush",
    "link": "https://www.nytimes.com/2025/11/26/business/disney-zootopia-2-jared-bush.html",
    "summary": "Jared Bush is trying to make the heart of the media empire beat more consistently. “Zootopia 2” will be a test."
  },
  {
    "title": "‘Zootopia 2’ Review: Natural Habitats, Expanded",
    "link": "https://www.nytimes.com/2025/11/26/movies/zootopia-2-review.html",
    "summary": "A sequel to the 2016 hit, this movie about an animal metropolis takes on an even messier social allegory than the first one, while building out a wider (if bloated) universe."
  },
  {
    "title": "Larry Bushart Posted a Charlie Kirk Meme. He Went to Jail for 37 Days.",
    "link": "https://www.nytimes.com/2025/11/26/opinion/charlie-kirk-free-speech-bushart.html",
    "summary": "The best way to honor Charlie Kirk is not to criminalize speech."
  },
  {
    "title": "The Loneliness of Using a Faith-Based Chatbot",
    "link": "https://www.nytimes.com/2025/11/26/opinion/faith-bot-individualism.html",
    "summary": "Faith is not meant to be transactional or tailored to you."
  },
  {
    "title": "Dubrovnik, Known for Its Beauty, Faces a Mound of New Trash",
    "link": "https://www.nytimes.com/2025/11/26/world/europe/croatia-trash-dubrovnik-plastic.html",
    "summary": "Officials in Dubrovnik, Croatia, say the strong currents of the Adriatic Sea washed ashore a vast amount of garbage, mostly from Albania, during a recent storm."
  },
  {
    "title": "As Trade Talks Stall, Carney Moves to Shield Canada from Trump Tariffs",
    "link": "https://www.nytimes.com/2025/11/26/world/canada/trump-carney-canada-tariffs-trade.html",
    "summary": "Prime Minister Mark Carney announced curbs on steel imports, a new tariff and help with steel and lumber freight costs in a bid to aid Canadian industries."
  },
  {
    "title": "Thanksgiving Storm: Blizzard Warnings Across Upper Midwest Warn of Heavy Snow",
    "link": "https://www.nytimes.com/2025/11/25/weather/minnesota-wisconsin-snow-forecast.html",
    "summary": "At least one death was connected to the storm, which was expected to be unusually intense, even for areas used to heavy snow."
  },
  {
    "title": "David Lerner, a Mr. Fix-it of Apple Computers, Dies at 72",
    "link": "https://www.nytimes.com/2025/11/26/technology/personaltech/david-lerner-dead.html",
    "summary": "He and a partner founded Tekserve, a Manhattan emergency room for frozen hard drives, keyboards, screens and their confounded owners."
  }
]