[
  {
    "title": "Trump’s Base in Uproar Over His Openness to Joining Iran Fight",
    "link": "https://www.nytimes.com/2025/06/18/us/politics/trump-maga-base-iran-israel.html",
    "summary": "The president’s supporters are warring over two dueling campaign promises: to steer clear of foreign wars and to prevent Iran from acquiring a nuclear weapon."
  },
  {
    "title": "If Trump Joins Israel-Iran Conflict, U.S. Troops in Mideast Could Be Vulnerable",
    "link": "https://www.nytimes.com/2025/06/18/world/middleeast/us-troops-middle-east-iran.html",
    "summary": "Iran’s leader vowed that his country would respond to any U.S. involvement in the war with Israel."
  },
  {
    "title": "Sotomayor’s Dissent Criticizes Supreme Court Decision in Transgender Care Case",
    "link": "https://www.nytimes.com/2025/06/18/us/politics/sotomayor-transgender-care-dissent-scotus.html",
    "summary": "Justice Sotomayor also read her dissent from the bench, a move typically reserved to emphasize a justice’s extreme displeasure with a decision."
  },
  {
    "title": "How Dr. Phil and a Top Adams Aide Helped Ease ICE’s Path Into New York",
    "link": "https://www.nytimes.com/2025/06/18/nyregion/ice-kaz-adams-nyc-immigration.html",
    "summary": "Kaz Daughtry, a freewheeling deputy mayor, has emerged as a crucial ally for the Trump administration and its border czar. So has Dr. Phil."
  },
  {
    "title": "Images of Handcuffed Democrats Are Piling Up in Trump’s Immigration Crackdown",
    "link": "https://www.nytimes.com/2025/06/18/us/politics/democrats-arrested-lander-padilla-trump.html",
    "summary": "Federal agents have arrested a growing number of the party’s elected officials, fueling liberal outrage and conservative accusations that Democrats are carrying out publicity stunts."
  },
  {
    "title": "Trump Quizzes Workers at the White House: ‘Any Illegal Immigrants?’",
    "link": "https://www.nytimes.com/2025/06/18/us/politics/trump-flagpole-immigrants.html",
    "summary": "President Trump decided to check the immigration status of a work crew installing a new flagpole at the White House."
  },
  {
    "title": "Nippon Steel Completes Its Acquisition of U.S. Steel",
    "link": "https://www.nytimes.com/2025/06/18/business/us-steel-nippon-acquisition.html",
    "summary": "The deal gives the White House extraordinary control over U.S. Steel as part of a pact to alleviate national security concerns."
  },
  {
    "title": "Katie Miller’s Washington Rise Takes a Musk Detour",
    "link": "https://www.nytimes.com/2025/06/18/style/katie-miller-stephen-miller-trump-musk.html",
    "summary": "She is one half of a Trump-world power couple. But she’s on Team Elon. It’s gotten complicated."
  },
  {
    "title": "Real Risk to Youth Mental Health Is ‘Addictive Use,’ Not Screen Time Alone, Study Finds",
    "link": "https://www.nytimes.com/2025/06/18/health/youth-suicide-risk-phones.html",
    "summary": "Researchers found children with highly addictive use of phones, video games or social media were two to three times as likely to have thoughts of suicide or to harm themselves."
  },
  {
    "title": "BYD and Other Chinese Carmakers Expand Sales in Europe Despite Tariffs",
    "link": "https://www.nytimes.com/2025/06/18/business/china-byd-cars-europe.html",
    "summary": "BYD and other companies doubled their share of the car market after the European Union imposed higher tariffs on electric vehicles from China."
  },
  {
    "title": "Tesla’s Robotaxi, Long Promised by Elon Musk, Joins a Crowded Field",
    "link": "https://www.nytimes.com/2025/06/18/business/tesla-robotaxi-austin-elon-musk.html",
    "summary": "Mr. Musk says the driverless taxis could begin ferrying passengers on Sunday in Austin, Texas, where other companies already have similar cars on the road."
  },
  {
    "title": "When Humans Learned to Live Everywhere",
    "link": "https://www.nytimes.com/2025/06/18/science/ancient-human-adaptation-environments.html",
    "summary": "About 70,000 years ago in Africa, humans expanded into more extreme environments, a new study finds, setting the stage for our global migration."
  },
  {
    "title": "Bruce Springsteen on ‘Tracks II,’ His Box of Seven ‘Lost Albums’",
    "link": "https://www.nytimes.com/2025/06/18/arts/music/bruce-springsteen-tracks-ii-the-lost-albums-interview.html",
    "summary": "An album “is a record of who you are and where you were at that moment in your life,” he said. With “Tracks II,” he adds seven full ones to his catalog."
  },
  {
    "title": "Sarah Stogner Elected Prosecutor in Texas Oil Country",
    "link": "https://www.nytimes.com/2025/06/18/us/texas-prosecutor-sarah-stogner.html",
    "summary": "Sarah Stogner had never tried a criminal case before getting elected D.A. in an oil-rich area half the size of New Jersey. So far, it’s been a struggle."
  },
  {
    "title": "Texas Passed a Law Protecting Campus Speech. It’s on the Verge of Rolling It Back.",
    "link": "https://www.nytimes.com/2025/06/18/us/politics/texas-college-free-speech-law.html",
    "summary": "A bill would restrict “expressive activities” on campus — which could include what students wear and the hours and weeks they can protest."
  },
  {
    "title": "Food Network Chefs Pay Tribute to Anne Burrell",
    "link": "https://www.nytimes.com/2025/06/18/dining/anne-burrell-death-reactions-tributes.html",
    "summary": "Following news of the chef and TV personality’s death at age 55, remembrances poured in on social media."
  },
  {
    "title": "Anne Burrell, Chef and Food Network Star, Dies at 55",
    "link": "https://www.nytimes.com/2025/06/17/dining/anne-burrell-dead.html",
    "summary": "Her distinctive hairstyle and swagger in the kitchen made her one of America’s most recognizable Italian chefs."
  },
  {
    "title": "How the Peacock Chair Became a Hallmark of Black American Décor",
    "link": "https://www.nytimes.com/2025/06/18/realestate/peacock-chair-black-experience.html",
    "summary": "The regal seat continues to be part of Black American social traditions."
  },
  {
    "title": "Trump Might Get Us Into Another War. Where’s Congress?",
    "link": "https://www.nytimes.com/2025/06/18/opinion/trump-iran-war-congress.html",
    "summary": "It’s time for the legislative branch to step up."
  },
  {
    "title": "Well, You Certainly Wouldn’t Call It Presidential Underreach",
    "link": "https://www.nytimes.com/2025/06/18/opinion/trump-miller-immigration-ice.html",
    "summary": "Trump’s ambitious effort to impose his will on the country has only generated discontent and backlash."
  },
  {
    "title": "The War, Explained",
    "link": "https://www.nytimes.com/2025/06/18/briefing/israel-iran-war-explained.html",
    "summary": "We explain why Israel chose this moment to attack Iran."
  },
  {
    "title": "Boeing Keeps Low Profile at Paris Air Show as Airbus Announces Deals",
    "link": "https://www.nytimes.com/2025/06/18/business/boeing-airbus-paris-air-show.html",
    "summary": "Boeing had a more muted tone than its European rival. The show comes soon after a Boeing jet operated by Air India crashed."
  },
  {
    "title": "Austria Moves to Tighten Gun Laws After Deadly School Shooting",
    "link": "https://www.nytimes.com/2025/06/18/world/europe/austria-gun-laws-school-shooting.html",
    "summary": "The government announced proposals to make it harder to buy a firearm after a gunman killed nine students and a teacher."
  },
  {
    "title": "Lawsuit Accuses Tyler Perry of Sexual Assault",
    "link": "https://www.nytimes.com/2025/06/18/arts/tyler-perry-derek-dixon-sexual-assault-lawsuit.html",
    "summary": "Derek Dixon, an actor who worked with Mr. Perry, is suing him for $260 million for sexual harassment, assault and battery. A lawyer for Mr. Perry called the allegations a “scam.”"
  },
  {
    "title": "Kate Middleton Unexpectedly Pulls Out of Royal Ascot",
    "link": "https://www.nytimes.com/2025/06/18/world/europe/princess-kate-middleton-ascot-race-uk.html",
    "summary": "The princess canceled plans to attend the horse racing event on Wednesday as she tries to find the “right balance” in her recovery from cancer, Kensington Palace said."
  }
]