[
  {
    "title": "Inside the Pentagon’s Scramble to Deal With Boat Strike Survivors",
    "link": "https://www.nytimes.com/2025/12/09/us/politics/pentagon-boat-strike-survivors.html",
    "summary": "Officials initially weighed sending survivors of U.S. attacks on boats suspected of drug smuggling to a notorious prison in El Salvador, to keep them away from American courts."
  },
  {
    "title": "Democrats Say Hegseth Balked at Call for Full Video of Boat Strike",
    "link": "https://www.nytimes.com/2025/12/09/us/politics/hegseth-democrats-video-boat-strike.html",
    "summary": "Defense Secretary Pete Hegseth briefed congressional leaders on Tuesday about the monthslong military campaign targeting people suspected of being drug traffickers at sea."
  },
  {
    "title": "Machado Will Not Pick Up Peace Prize in Person, Organizers Say",
    "link": "https://www.nytimes.com/2025/12/10/world/europe/machado-nobel-venezuela-ceremony.html",
    "summary": "The Norwegian Nobel Institute said the Venezuelan opposition leader would not be at the ceremony to collect the award despite doing everything possible to attend."
  },
  {
    "title": "A Million Teenagers Just Got Barred From Social Media, and Trump Calls Affordability a ‘Hoax’",
    "link": "https://www.nytimes.com/2025/12/10/podcasts/the-headlines/teenagers-social-media-trump-affordability.html",
    "summary": "Plus, the travel influencers who aren’t actually real."
  },
  {
    "title": "The Challenges to Europe’s Security Go Beyond Trump’s Lack of Support",
    "link": "https://www.nytimes.com/2025/12/10/world/europe/europe-security-russia-us.html",
    "summary": "Europeans find themselves stranded between hostile powers, Russia and the United States, with key decisions looming over the future of Ukraine."
  },
  {
    "title": "Trump Says Americans Are Doing Great, Even as Views on the Economy Sour",
    "link": "https://www.nytimes.com/2025/12/09/us/politics/trump-affordability-economy-pennsylvania.html",
    "summary": "President Trump’s speech in Pennsylvania was meant to alleviate concerns about affordability. But he kept wandering off script and dwelling on his favorite targets, like immigration."
  },
  {
    "title": "At State Dept., a Typeface Falls Victim in the War Against Woke",
    "link": "https://www.nytimes.com/2025/12/09/us/politics/rubio-state-department-font.html",
    "summary": "Secretary of State Marco Rubio called the Biden-era move to the sans serif typeface “wasteful,” casting the return to Times New Roman as part of a push to stamp out diversity efforts."
  },
  {
    "title": "Stephen Miller’s Stock Sale Raises Questions, Ethics Experts Say",
    "link": "https://www.nytimes.com/2025/12/09/us/politics/stephen-miller-minerals-stake-ethics.html",
    "summary": "Mr. Miller, one of President Trump’s top advisers, sold shares in the mining company MP Materials following a lucrative deal between the company and the government."
  },
  {
    "title": "House Democrat Seeks to Impeach RFK Jr. for Undercutting Public Health",
    "link": "https://www.nytimes.com/2025/12/10/us/politics/haley-stevens-impeach-kennedy.html",
    "summary": "The move by Representative Haley Stevens, a Michigan Democrat who is running for Senate, does not have the support of her party’s leaders and is all but certain to fail."
  },
  {
    "title": "Fed Divisions Will Cloud Interest Rate Decision at Final 2025 Meeting",
    "link": "https://www.nytimes.com/2025/12/10/business/economy/fed-meeting-interest-rate-decision.html",
    "summary": "The central bank is poised to lower interest rates on Wednesday even as a growing chorus of officials urge caution."
  },
  {
    "title": "I.M.F. Prods China, Gently, on Its Weak Currency",
    "link": "https://www.nytimes.com/2025/12/10/business/imf-china-currency.html",
    "summary": "Caught between Beijing and the Trump administration, the International Monetary Fund offered mild criticism of China for relying too heavily on exports."
  },
  {
    "title": "Netflix and Paramount Battle for Warner Bros. — Have We Seen This Show Before?",
    "link": "https://www.nytimes.com/2025/12/09/business/media/netflix-paramount-warner-bros-barry-diller.html",
    "summary": "The tug of war for Warner Bros. Discovery echoes an earlier clash of media titans."
  },
  {
    "title": "The Battle for Warner Bros. Discovery",
    "link": "https://www.nytimes.com/video/business/media/100000010568344/the-battle-for-warner-bros-discovery.html",
    "summary": "Nicole Sperling, a Times reporter who covers Hollywood and the streaming revolution, breaks down the competing bids from Netflix and Paramount to buy Warner Bros. Discovery."
  },
  {
    "title": "Asserting a Personal Role in Warner Bros. Battle, Trump Seeks to Expand His Powers Again",
    "link": "https://www.nytimes.com/2025/12/09/us/politics/trump-warner-bros.html",
    "summary": "The move comes as the Supreme Court also appears poised to put antitrust enforcement by the Federal Trade Commission under his control."
  },
  {
    "title": "Trump Administration Rules Threaten Nobel Prizes Won by Immigrants",
    "link": "https://www.nytimes.com/2025/12/10/science/nobel-prize-immigrants-science.html",
    "summary": "As three immigrants claim Nobel Prizes in science for the United States this year, experts warn that immigration crackdowns could undo American innovation."
  },
  {
    "title": "Trump’s Speech on Economy Veers Into an Anti-Immigrant Tirade",
    "link": "https://www.nytimes.com/2025/12/09/us/politics/trump-somalis-immigrants.html",
    "summary": "President Trump vacillated between demonizing immigrants and assuring a crowd of his supporters that life was better than ever under his administration."
  },
  {
    "title": "Canada Plans to Fast-Track Immigration for US H1-B Visa Holders in New Talent Drive",
    "link": "https://www.nytimes.com/2025/12/09/world/canada/canada-usa-immigration-h1-b-visa-talent.html",
    "summary": "The government says it will fast-track immigration for U.S. H-1B visa holders and spend more than $1 billion to attract researchers from the United States and the rest of the world."
  },
  {
    "title": "Taiwan Invokes National Security Law to Protect TSMC Trade Secrets",
    "link": "https://www.nytimes.com/2025/12/10/business/taiwan-tsmc-trade-secrets.html",
    "summary": "An executive left TSMC for Intel. Taiwan’s government says that could threaten its national security."
  },
  {
    "title": "Chip Company Plotted to Send Technology to China, Ex-C.E.O. Says",
    "link": "https://www.nytimes.com/2025/12/10/world/asia/dutch-nexperia-zhang-ceo.html",
    "summary": "The former chief executive of Nexperia, a Dutch chipmaker, said Dutch officials had known for years that the company’s Chinese owner sought to move its technology to China."
  },
  {
    "title": "Trump’s Nvidia Chip Deal Reverses Decades of Technology Restrictions",
    "link": "https://www.nytimes.com/2025/12/09/us/politics/trump-nvidia-ai-chips-china.html",
    "summary": "President Trump’s decision to allow Nvidia to sell its chips to China has raised questions about whether he is prioritizing short-term economic gain over long-term American security interests."
  },
  {
    "title": "Utah Tries Relocating Beavers to Save Them, and Remake the Landscape",
    "link": "https://www.nytimes.com/2025/12/09/climate/utah-beaver-rescue.html",
    "summary": "Their dams cause floods, and that gets them in trouble with humans. But in the right place, more water can be a big help."
  },
  {
    "title": "Rod Paige, Education Secretary Who Defended ‘No Child Left Behind,’ Dies at 92",
    "link": "https://www.nytimes.com/2025/12/10/obituaries/rod-paige-dead.html",
    "summary": "He was both the first Black person and the first educator to hold the cabinet position, but resigned amid discord over George W. Bush’s No Child Left Behind."
  },
  {
    "title": "The Latest Trump Resistance Is Within the Indiana G.O.P.",
    "link": "https://www.nytimes.com/2025/12/10/us/indiana-redistricting-trump-republicans.html",
    "summary": "Some Republicans in the Indiana Senate have resisted a new congressional map despite lobbying from the White House and threats of political consequences."
  },
  {
    "title": "Democrats Make a Fresh Push to Win State Legislatures",
    "link": "https://www.nytimes.com/2025/12/10/us/politics/democrats-state-legislatures.html",
    "summary": "The arm of the party that focuses on statehouses is targeting hundreds of seats and more than 40 chambers, according to a strategy memo, reflecting Democrats’ new optimism."
  },
  {
    "title": "Democrats Press to Expand House Map, Targeting 5 New G.O.P. Seats",
    "link": "https://www.nytimes.com/2025/12/10/us/politics/democrats-target-5-new-house-seats.html",
    "summary": "Four of the additions are for districts where President Trump won handily, but Democrats are feeling emboldened by election outcomes this fall."
  },
  {
    "title": "Brad Lander Will Run for House Seat with Mamdani’s Support",
    "link": "https://www.nytimes.com/2025/12/10/nyregion/lander-goldman-mamdani-congress.html",
    "summary": "Brad Lander, the New York City comptroller, will run for a House seat in Brooklyn and Manhattan, challenging Representative Daniel Goldman in the Democratic primary."
  },
  {
    "title": "Ryan Coogler on ‘Sinners,’ Chadwick Boseman and Why He Declined to Join the Academy",
    "link": "https://www.nytimes.com/2025/12/10/movies/ryan-coogler-interview-sinners-black-panther.html",
    "summary": "The director on what he’s thinking of post-“Sinners,” how the loss of Chadwick Boseman affected him and why he turned down the invitation to join the academy."
  },
  {
    "title": "The Contradictions of Gavin Newsom",
    "link": "https://www.nytimes.com/2025/12/10/opinion/ezra-klein-podcast-gavin-newsom.html",
    "summary": "How the California governor became the 2028 Democratic front-runner."
  },
  {
    "title": "50 States, 50 Fixes",
    "link": "https://www.nytimes.com/2025/12/10/briefing/50-states-50-fixes.html",
    "summary": "We look at climate solutions across the country."
  },
  {
    "title": "Late Night Doesn’t Want to Sweat at the Airport",
    "link": "https://www.nytimes.com/2025/12/10/arts/television/late-night-airport-pullup-sean-duffy-rfk-jr.html",
    "summary": "Ronny Chieng dissed new fitness plans from the Trump administration for travelers in American airports: “We can’t even walk to the gate. They had to invent floors that walk for us.”"
  },
  {
    "title": "Supreme Court Hears Death Penalty Case on Intellectual Disability",
    "link": "https://www.nytimes.com/2025/12/10/us/politics/supreme-court-death-penalty-disability.html",
    "summary": "The case involves an Alabama man who challenged his death sentence after a murder conviction because of his varying results in a series of I.Q. tests."
  },
  {
    "title": "A New Governor Inherits a Misconduct Investigation Into the State Police",
    "link": "https://www.nytimes.com/2025/12/10/nyregion/mikie-sherrill-new-jersey-state-police-investigation.html",
    "summary": "A prolonged slowdown in traffic enforcement by New Jersey troopers coincided with an uptick in fatal crashes. The pattern remains under investigation as Mikie Sherrill prepares to take office."
  },
  {
    "title": "Democrat Eileen Higgins Wins Miami Runoff Election to Become City’s First Female Mayor",
    "link": "https://www.nytimes.com/2025/12/09/us/miami-mayor-eileen-higgins-election.html",
    "summary": "Eileen Higgins, a former Miami-Dade County commissioner, will also be the city’s first female mayor and the first non-Hispanic mayor since the 1990s."
  },
  {
    "title": "A Cinnabon Worker Was Fired for a Racist Slur. Her Supporters Have Raised $130,000.",
    "link": "https://www.nytimes.com/2025/12/10/us/cinnabon-fired-worker-video-racial-slur.html",
    "summary": "On a video that went viral, the worker, who is white, can be seen calling two Black customers an epithet. The campaign to give her money echoes the reaction to a similar incident this year."
  }
]