[
  {
    "title": "Europe Talks Big on Gaza but Struggles to Act",
    "link": "https://www.nytimes.com/2025/09/22/world/europe/europe-eu-gaza-israel.html",
    "summary": "Even as criticism of Israel ramps up and a growing number of countries say they’ll recognize a Palestinian state, concrete actions remain limited."
  },
  {
    "title": "For Arab Nations With Ties to Israel, Attacks on Qatar and Gaza City Raise Anxiety",
    "link": "https://www.nytimes.com/2025/09/22/world/middleeast/arab-israel-conflict-regional-palestinians.html",
    "summary": "The Middle Eastern states closest to Israel see the attack on Hamas officials in Qatar and the invasion of Gaza City as warning signs of potential threats to their own security."
  },
  {
    "title": "As U.N. General Assembly Gathers, Here’s What to Watch For",
    "link": "https://www.nytimes.com/2025/09/22/world/americas/un-general-assembly-highlights.html",
    "summary": "A look at major figures who will appear during the week and what they might talk about."
  },
  {
    "title": "It’s Gridlock Week in Manhattan as U.N. General Assembly Starts",
    "link": "https://www.nytimes.com/2025/09/21/nyregion/unga-traffic-manhattan-midtown.html",
    "summary": "With the United Nations session kicking off Monday, the city is closing some streets and stepping up police presence. It is usually one of the slowest weeks for traffic in Midtown."
  },
  {
    "title": "The U.N.’s Future, and the ‘Hamburger Helper Economy’",
    "link": "https://www.nytimes.com/2025/09/22/podcasts/the-headlines/future-un-hamburger-helper.html",
    "summary": "Plus, would you swim in the Chicago River?"
  },
  {
    "title": "Trump Remembers Kirk as a Martyr While Attacking Political Opponents",
    "link": "https://www.nytimes.com/2025/09/21/us/elections/trump-charlie-kirk-memorial-service.html",
    "summary": "President Trump oscillated between honoring Charlie Kirk’s life and promoting his own political agenda in his remarks at the conservative activist’s memorial in Arizona."
  },
  {
    "title": "Behind Charlie Kirk’s Spiritual Journey That Fused Christianity and Politics",
    "link": "https://www.nytimes.com/2025/09/22/us/charlie-kirk-christian-faith-politics.html",
    "summary": "Sunday’s memorial showcased how Mr. Kirk’s experience dovetailed with the broader story of American evangelicalism over the past decade."
  },
  {
    "title": "4 Takeaways From the Charlie Kirk Memorial",
    "link": "https://www.nytimes.com/2025/09/22/us/charlie-kirk-memorial-takeaways.html",
    "summary": "High-profile conservative speakers, including President Trump, addressed a packed stadium in Arizona. Erika Kirk forgave her husband’s killer."
  },
  {
    "title": "Trump Appointees Roll Back Enforcement of Fair Housing Laws",
    "link": "https://www.nytimes.com/2025/09/22/realestate/trump-fair-housing-laws.html",
    "summary": "Interviews and internal documents show that signature civil rights protections in housing are being dismissed as ideologically driven and D.E.I. in disguise."
  },
  {
    "title": "With New Plan, Hochul Fast-Tracks Housing Supply",
    "link": "https://www.nytimes.com/2025/09/22/realestate/hochul-modular-housing.html",
    "summary": "A new program will put manufactured homes at the center of a statewide effort to make housing more affordable."
  },
  {
    "title": "The Broadway Musical Is in Trouble",
    "link": "https://www.nytimes.com/2025/09/22/theater/broadway-musicals-finances.html",
    "summary": "With the cost of staging song-and-dance spectacles skyrocketing and audiences drawn to older hits, none of the musicals that opened last season has made a profit. Fewer are planned this season."
  },
  {
    "title": "Trump’s Tariffs Are Damaging America’s Biggest Foreign Source of Screws",
    "link": "https://www.nytimes.com/2025/09/22/business/taiwan-manufacturing-trump-tariffs.html",
    "summary": "Taiwan has long been the top provider of screws to the United States. But its factories are struggling to survive under tariffs on steel and aluminum."
  },
  {
    "title": "The H-1B Visa: Why Is Trump Adding a $100,000 Fee?",
    "link": "https://www.nytimes.com/2025/09/20/us/politics/h1b-visa-trump-immigration.html",
    "summary": "President Trump signed a proclamation on Friday adding a $100,000 fee to visas for skilled foreign workers. Immigration hard-liners have criticized the program for replacing American workers."
  },
  {
    "title": "Republican Redistricting Is Sowing Chaos in Houston",
    "link": "https://www.nytimes.com/2025/09/22/us/politics/texas-redistricting-houston.html",
    "summary": "Texas Republicans redrew the lines for House races in 2026. For one Houston district, that means two elections in the next few months using two different maps, with a generational fight to come."
  },
  {
    "title": "High-Tech Greenhouse Brings Fresh Produce to Canada’s Arctic",
    "link": "https://www.nytimes.com/2025/09/22/world/canada/gjoa-haven-canada-greenhouse-plants-produce.html",
    "summary": "A high-tech greenhouse brings fresh produce to Gjoa Haven, an Inuit hamlet in Canada’s Arctic whose residents have little experience growing plants."
  },
  {
    "title": "Can Google Avoid a Breakup Twice?",
    "link": "https://www.nytimes.com/2025/09/22/technology/google-second-antitrust-trial.html",
    "summary": "On Monday, the tech giant and the U.S. government face off in court over how to fix the company’s advertising technology monopoly."
  },
  {
    "title": "Amazon Faces Trial on F.T.C. Charges Related to Prime Service",
    "link": "https://www.nytimes.com/2025/09/22/technology/amazon-ftc-subscription-practices.html",
    "summary": "A trial in federal court in Seattle will determine if millions of customers signed up for Prime because it’s a great deal, or because they were duped."
  },
  {
    "title": "Mamdani Pushed to Cut 1,300 Officers From a ‘Racist’ N.Y.P.D. in 2022",
    "link": "https://www.nytimes.com/2025/09/22/nyregion/mamdani-nypd-officers-police.html",
    "summary": "Zohran Mamdani has said that critical remarks he made in 2020 about the police do not reflect his views. But as a state assemblyman in 2022, he still held anti-police positions."
  },
  {
    "title": "How Universal Child Care Could Change the Economy",
    "link": "https://www.nytimes.com/2025/09/22/business/universal-child-care-us-economy.html",
    "summary": "Zohran Mamdani, the Democratic nominee for New York City mayor, has proposed no-cost, universal child care, helping to reignite a national conversation."
  },
  {
    "title": "Super Typhoon Ragasa Hits the Philippines, Headed for Hong Kong",
    "link": "https://www.nytimes.com/2025/09/22/world/asia/super-typhoon-ragasa-hong-kong.html",
    "summary": "Thousands were evacuated and hundreds of flights have been canceled ahead of the major storm, equivalent in wind speed to a Category 5 hurricane."
  },
  {
    "title": "Can Jay Bhattacharya Save Science?",
    "link": "https://www.nytimes.com/2025/09/22/opinion/jay-bhattacharya-nih.html",
    "summary": "Can Jay Bhattacharya save science?"
  },
  {
    "title": "The Perils of Getting Too Personal in Foreign Policy",
    "link": "https://www.nytimes.com/2025/09/22/opinion/america-foreign-policy-clinton-trump.html",
    "summary": "Personality can open doors, but it cannot rewrite geopolitics."
  },
  {
    "title": "How Six World Leaders Are Confronting Climate Change",
    "link": "https://www.nytimes.com/2025/09/22/briefing/climate-change-world-leaders-kirk.html",
    "summary": "The leaders told us how they are facing a warming planet in a world where international collaboration on climate change is fraying."
  },
  {
    "title": "Russia’s Ban on I.B. Schools Deepens Its Rupture With the West",
    "link": "https://www.nytimes.com/2025/09/22/world/europe/russia-ban-international-baccalaureate-schools.html",
    "summary": "The Kremlin has infused education with nationalism and militarism. Outlawing the International Baccalaureate underlines that effort."
  },
  {
    "title": "7 Ways the Candidates for New Jersey Governor Would Differ on Day 1",
    "link": "https://www.nytimes.com/2025/09/22/nyregion/new-jersey-governors-race-issues.html",
    "summary": "The race has been heavily influenced by national politics. But in a debate on Sunday, the candidates, Jack Ciattarelli and Representative Mikie Sherrill, also outlined starkly different positions on statewide issues."
  },
  {
    "title": "Novo Nordisk’s Woes Are Slimming Denmark’s Economic Growth",
    "link": "https://www.nytimes.com/2025/09/22/business/novo-nordisk-denmark-economy.html",
    "summary": "Because of its size, the drugmaker has an outsize effect on the country. Now, as it sheds jobs, forecasts for Denmark’s growth are falling, too."
  },
  {
    "title": "Hillary Clinton Sees a Dangerous Moment for Women’s Rights, and Democracy",
    "link": "https://www.nytimes.com/2025/09/22/us/politics/hillary-clinton-womens-rights-trump.html",
    "summary": "With her rallying cry for gender equality turning 30 this year, Mrs. Clinton says President Trump and autocratic leaders abroad are steadily dismantling decades of progress."
  }
]