[
  {
    "title": "Wary of Investing in Venezuela, Big Oil Heads to the White House",
    "link": "https://www.nytimes.com/2026/01/09/business/energy-environment/venezuela-oil-trump.html",
    "summary": "The amounts of money, time and political uncertainty trouble executives at large Western oil companies, who plan to meet with President Trump on Friday."
  },
  {
    "title": "Why Many Republican Voters Support Trump’s Use of Force in Venezuela",
    "link": "https://www.nytimes.com/2026/01/09/us/politics/trump-venezuela-republican-voters.html",
    "summary": "They don’t like nation building, but they do want to project American power."
  },
  {
    "title": "Border Patrol Agents Shoot 2 in Oregon, and Trump Says, ‘I Don’t Need International Law’",
    "link": "https://www.nytimes.com/2026/01/09/podcasts/the-headlines/border-patrol-agents-shooting-oregon-trump-international-law.html",
    "summary": "Plus, your Friday news quiz."
  },
  {
    "title": "More Agents Head to Minnesota as U.S. Takes Over Shooting Investigation",
    "link": "https://www.nytimes.com/2026/01/08/us/minnesota-ice-shooting-news.html",
    "summary": "A day after an ICE agent fatally shot a 37-year-old woman in Minneapolis, the governor activated the state’s National Guard, and 100 more federal agents were also being deployed."
  },
  {
    "title": "What We Know About the Fatal ICE Shooting in Minneapolis",
    "link": "https://www.nytimes.com/2026/01/07/us/ice-shooting-minneapolis-renee-good.html",
    "summary": "Officials in Minnesota said that federal agencies had denied them access to evidence from the fatal shooting of a 37-year-old woman on Wednesday."
  },
  {
    "title": "Iran’s Supreme Leader Vows to ‘Not Back Down’ as Protests Swell",
    "link": "https://www.nytimes.com/2026/01/09/world/middleeast/iran-protests-ayatollah-khamenei.html",
    "summary": "After days of fierce protest, Ayatollah Ali Khamenei dismissed the demonstrations as wanton destruction and accused protesters of trying to “please” President Trump."
  },
  {
    "title": "Iran Is Cut Off From Internet as Protests Calling for Regime Change Intensify",
    "link": "https://www.nytimes.com/2026/01/08/world/middleeast/iran-protests-internet-shutdown.html",
    "summary": "As protests swelled around the country, Iran’s internet was shut down, and the heads of its judiciary and its security services warned of a harsh response amid calls for “freedom, freedom.”"
  },
  {
    "title": "Russia Says It Used Nuclear-Capable Missile to Strike Western Ukraine",
    "link": "https://www.nytimes.com/2026/01/08/world/europe/russia-ukraine-nuclear-capable-missile.html",
    "summary": "The attack seemed intended to send a message to Europe as it strongly backs Kyiv in the peace talks."
  },
  {
    "title": "The Next Phase of Trump’s Renovations: A New ‘Upper West Wing’",
    "link": "https://www.nytimes.com/2026/01/08/us/politics/trump-white-house-west-wing-renovation.html",
    "summary": "Besides changes to the White House, President Trump also said he planned to tear up the brick walkways in Lafayette Park and replace them with granite."
  },
  {
    "title": "The Many Faces of Trump: What We Saw When We Interviewed the President",
    "link": "https://www.nytimes.com/2026/01/08/us/politics/trump-oval-office-interview-scene.html",
    "summary": "He let reporters in on a call with Colombia’s president. He complained about Zohran Mamdani. He called JD Vance and Marco Rubio “kids.” Inside an unpredictable evening with President Trump."
  },
  {
    "title": "An Interview With the President",
    "link": "https://www.nytimes.com/2026/01/09/podcasts/the-daily/trump-interview.html",
    "summary": "Four New York Times reporters sat down with President Trump for a nearly two-hour interview."
  },
  {
    "title": "What to Know About the Latest Jobs Report",
    "link": "https://www.nytimes.com/2026/01/09/business/economy/business-economy-jobs-report-december.html",
    "summary": "Data on the labor market in December will be closely watched for clues on the state of the economy."
  },
  {
    "title": "For the Hero of the Bondi Beach Attack, a Whirlwind Visit to America",
    "link": "https://www.nytimes.com/2026/01/09/nyregion/bondi-beach-attack-hero-visits-america.html",
    "summary": "After the Hanukkah massacre in Australia, the rabbi and the Muslim hero who saved lives made a visit to New York that was part religious pilgrimage, part media outreach."
  },
  {
    "title": "Zohran Mamdani and Kathy Hochul Are Pals Right Now. Will It Last?",
    "link": "https://www.nytimes.com/2026/01/09/nyregion/zohran-mamdani-kathy-hochul.html",
    "summary": "The legislative session that began this week poses a significant test of the most closely watched collaboration in state and city politics."
  },
  {
    "title": "Amid Opening Sprint, Mamdani Paused to Socialize With Steven Spielberg",
    "link": "https://www.nytimes.com/2026/01/08/nyregion/steven-spielberg-zohran-mamdani-meeting.html",
    "summary": "Zohran Mamdani, the new mayor of New York, made a private visit to the billionaire film director’s Central Park West apartment this week."
  },
  {
    "title": "Inside Myanmar’s Gilded Capital, Empty Streets and Moldy Corners",
    "link": "https://www.nytimes.com/2026/01/09/world/asia/myanmar-capital-naypyidaw.html",
    "summary": "Myanmar’s junta created a capital to withstand an invasion. Now, the military struggles to project an image of control over a crumbling nation."
  },
  {
    "title": "‘The Pitt’ Asks: Is TV Better in Small Doses?",
    "link": "https://www.nytimes.com/2026/01/08/arts/television/the-pitt.html",
    "summary": "The hospital drama has become the champion of a return to old-fashioned weekly viewing habits. But honestly, it makes a pretty great binge watch."
  },
  {
    "title": "‘The Pitt’ Season 2 Premiere Recap: The Doctors Will See You Now",
    "link": "https://www.nytimes.com/2026/01/08/arts/television/the-pitt-recap-season-2-premiere.html",
    "summary": "Doctor Robby is back for one final shift before he goes on sabbatical. What could possibly go wrong?"
  },
  {
    "title": "Stars of ‘The Pitt’ Gathered At HBO’s Premiere Party to Toast Season 2",
    "link": "https://www.nytimes.com/2026/01/08/style/the-pitt-hbo-premiere-party-noah-wyle.html",
    "summary": "At the premiere of Season 2 in Los Angeles, the cast and crew of HBO Max’s hyper-realistic medical drama learned the show would be renewed."
  },
  {
    "title": "This Is Trump’s One Small Trick to Destroy American Democracy",
    "link": "https://www.nytimes.com/2026/01/09/opinion/venezuela-maduro-trump-oil.html",
    "summary": "The president is claiming borderless license to turn on his perceived enemies, both foreign and domestic."
  },
  {
    "title": "By Killing Renee Good, ICE Sent a Message to Us All",
    "link": "https://www.nytimes.com/2026/01/08/opinion/renee-good-minnesota-shooting-ice.html",
    "summary": "Not even citizens are safe in Trump’s America."
  },
  {
    "title": "House Passes Doomed Bill to Restore ACA Subsidies",
    "link": "https://www.nytimes.com/2026/01/08/us/politics/house-bill-aca-subsidies.html",
    "summary": "The passage of the bill was a triumph for Democrats, who drew substantial Republican backing. But it has no path forward, and an election-year compromise is a long shot."
  },
  {
    "title": "Runway Wall Caused All the Deaths in 2024 South Korean Plane Crash, Report Says",
    "link": "https://www.nytimes.com/2026/01/09/world/asia/korea-plane-crash-wall.html",
    "summary": "A computer simulation ordered by the government showed that everyone on board would have survived if the concrete berm had been made of materials that easily broke apart."
  },
  {
    "title": "The War Over the Weedkiller Roundup Might Be Headed to the Supreme Court",
    "link": "https://www.nytimes.com/2026/01/09/climate/supreme-court-weedkiller-roundup.html",
    "summary": "Bayer has asked the justices to decide whether federal law shields the company from lawsuits over its Roundup herbicide and cancer. Democrats and MAHA activists aren’t happy."
  },
  {
    "title": "RFK Jr. Weakens U.S. Preventive Services Task Force",
    "link": "https://www.nytimes.com/2026/01/09/well/rfk-jr-uspstf-task-force.html",
    "summary": "The group has significant influence over the medicines and screenings Americans get."
  }
]