[
  {
    "title": "America First? Some Trump Supporters Worry That’s No Longer the Case.",
    "link": "https://www.nytimes.com/2025/11/14/us/politics/trump-supporters-america-first-concerns.html",
    "summary": "President Trump has been dining with billionaires and has taken a keen interest in crises overseas, leading to fears that he is drifting away from his more populist stances."
  },
  {
    "title": "Trump Officials Prepare Tariff Exemptions, Seeking to Lower Food Prices",
    "link": "https://www.nytimes.com/2025/11/13/us/politics/trump-tariffs-food-prices.html",
    "summary": "If the proposal goes into effect, it would be the latest rollback of one of President Trump’s key economic policies over concerns about affordability."
  },
  {
    "title": "RFK Jr. Walks a Tightrope on Trump Deal for Obesity Drugs",
    "link": "https://www.nytimes.com/2025/11/14/health/rfkjr-obesity-drugs.html",
    "summary": "The weight loss medicines are proving to be a test case for Robert F. Kennedy Jr., the health secretary, in straddling divisions between his supporters and the president."
  },
  {
    "title": "A Major New Experiment in Voting, and the World’s Most Polluted Air",
    "link": "https://www.nytimes.com/2025/11/14/podcasts/the-headlines/voting-alaska-pollution-india.html",
    "summary": "Plus, your Friday news quiz."
  },
  {
    "title": "Zelensky’s Image Is Stained as Corruption Inquiry Shakes His Inner Circle",
    "link": "https://www.nytimes.com/2025/11/14/world/europe/zelensky-corruption-investigation.html",
    "summary": "The revelations are a remarkable reversal for the Ukrainian president, who once presented himself as a leader who would clean up the country’s politics."
  },
  {
    "title": "Justice Dept. Memo Blessing Boat Strikes Is Said to Rely on Trump’s Claims About Cartels",
    "link": "https://www.nytimes.com/2025/11/13/us/politics/boat-strikes-doj-memo-trump.html",
    "summary": "Accounts of a secret Justice Department memo offer a window into how administration lawyers approved the president’s desired course of action."
  },
  {
    "title": "Family of Fisherman Killed in U.S. Military Strike Says It Wants Justice",
    "link": "https://www.nytimes.com/2025/11/13/world/americas/trump-drug-boat-strikes-colombian-fisherman.html",
    "summary": "Colombia was a top U.S. ally in Latin America until the Trump administration began deadly strikes in international waters. Now, one family wants justice."
  },
  {
    "title": "U.S. Strike Kills 4 on Boat Trump Says Was Smuggling Drugs",
    "link": "https://www.nytimes.com/2025/11/13/us/politics/trump-drug-boat-strike-caribbean.html",
    "summary": "The strike in the Caribbean brings the death toll in the Trump administration’s lethal campaign to 80 since early September."
  },
  {
    "title": "Ken Burns’s ‘The American Revolution’ Speaks to Our Cultural Clashes",
    "link": "https://www.nytimes.com/2025/11/14/arts/television/what-the-american-revolution-says-about-our-cultural-battles.html",
    "summary": "In Ken Burns’s newest documentary, the war for independence was also a civil war. Amid a bitter fight over history, its timing feels urgent."
  },
  {
    "title": "The Shutdown Is Over. For Many SNAP Recipients, the Scars Remain.",
    "link": "https://www.nytimes.com/2025/11/14/us/shutdown-snap-food-stamps.html",
    "summary": "Some recipients have seen their benefits return but are worried they could still be taken away. Others wonder whether the funding could be stopped again at some point."
  },
  {
    "title": "Republicans Tried to Squelch the Epstein Furor. Instead, They Fed It.",
    "link": "https://www.nytimes.com/2025/11/13/us/politics/republicans-epstein-trump-house.html",
    "summary": "A House investigation that the G.O.P. has tried to use to deflect calls for more transparency has yielded striking revelations that have only fueled the Epstein saga."
  },
  {
    "title": "Conservative Media Picks an Epstein Story Line and Sticks to It",
    "link": "https://www.nytimes.com/2025/11/14/business/media/epstein-trump-emails-conservative-media.html",
    "summary": "Right-wing outlets have focused on a single redacted name in the 23,000 pages of correspondence related to Jeffrey Epstein that were released on Wednesday."
  },
  {
    "title": "Former Prince Andrew and Another Prominent Briton Come Up in the Epstein Emails",
    "link": "https://www.nytimes.com/2025/11/13/world/europe/epstein-files-mountbatten-windsor-mandelson.html",
    "summary": "Newly released files from Jeffrey Epstein include correspondence with Andrew Mountbatten-Windsor and Peter Mandelson, the former British ambassador to Washington."
  },
  {
    "title": "Trump Housing Official Invokes Family Legacy, to Some Relatives’ Dismay",
    "link": "https://www.nytimes.com/2025/11/14/business/bill-pulte-mobile-homes-fhfa.html",
    "summary": "Bill Pulte has called out prominent Democrats for issues with their mortgage documents. But he has a history of carefully choosing facts about his family and businesses to enhance his reputation."
  },
  {
    "title": "Swalwell Denies Allegations of Fraud and Says Trump is Targeting Him",
    "link": "https://www.nytimes.com/2025/11/14/us/politics/trump-mortgage-fraud-eric-swalwell.html",
    "summary": "Representative Eric Swalwell, a Democrat, said he would not back down from his criticism of President Trump, and denied wrongdoing."
  },
  {
    "title": "Kenyan Workers Get Abused Abroad. The President’s Family and Allies Profit.",
    "link": "https://www.nytimes.com/2025/11/14/world/europe/kenya-president-saudi-arabia-maids.html",
    "summary": "President William Ruto’s government acts as an arm of an industry whose leaders compare women to dogs and blame them for their own abuse, a Times investigation found."
  },
  {
    "title": "Kenya’s Key Export Used to Be Coffee. Now It’s Cheap Labor.",
    "link": "https://www.nytimes.com/2025/11/14/world/africa/kenya-exports-labor-saudi-arabia-economy.html",
    "summary": "There’s big money in sending poor workers abroad. Here’s how the economics work."
  },
  {
    "title": "25 Movies, Many Stars, 0 Hits: Hollywood Falls to New Lows",
    "link": "https://www.nytimes.com/2025/11/14/business/media/25-movies-many-stars-0-hits-hollywood-falls-to-new-lows.html",
    "summary": "It has been a brutal three months for dramas and comedies."
  },
  {
    "title": "While Asian Immigrants Work, Burglars Target Their Homes",
    "link": "https://www.nytimes.com/2025/11/14/world/asia/while-asian-immigrants-work-burglars-target-their-homes.html",
    "summary": "Some law enforcement officials say they think organized crime rings from South America, in particular from Colombia, are responsible for the crime sprees."
  },
  {
    "title": "Texas A&M Tightens Rules on Talking About Race and Gender in Classes",
    "link": "https://www.nytimes.com/2025/11/13/us/texas-am-gender-race-ideology-rules-classroom.html",
    "summary": "The university system will ban advocacy of “race or gender ideology, or topics related to sexual orientation or gender identity” without approval."
  },
  {
    "title": "Indiana Professor Removed From Class Over White Supremacy Lesson",
    "link": "https://www.nytimes.com/2025/11/13/us/indiana-university-professor-white-supremacy-lesson.html",
    "summary": "The professor will no longer be able to teach a class on diversity after she showed students a diagram that included the “Make America Great Again” slogan as an example of white supremacy."
  },
  {
    "title": "‘No Closure, No Transparency’: Harassment Victims Seek Resolution",
    "link": "https://www.nytimes.com/2025/11/14/business/workplace-sexual-harassment-south-korea.html",
    "summary": "Fewer women in South Korea are reporting workplace harassment, but those who do say their claims are often not taken seriously or handled sensitively."
  },
  {
    "title": "New York Lacked an Affordable Housing Portal. So These Teenagers Made One.",
    "link": "https://www.nytimes.com/2025/11/14/realestate/affordable-housing-rent-stabilized-website.html",
    "summary": "Two “children of the pandemic” did something the grown-ups who run the city have never managed to do."
  },
  {
    "title": "Trump Has Snatched the Power of the Purse. Congress Should Take It Back.",
    "link": "https://www.nytimes.com/2025/11/14/opinion/trump-congress-spending-power.html",
    "summary": "Trump’s actions should alarm anybody who shares the American founders’ suspicion of centralized power."
  },
  {
    "title": "Tucker Carlson, Nick Fuentes and the Right’s ‘Groyper’ Problem",
    "link": "https://www.nytimes.com/2025/11/14/opinion/ezra-klein-podcast-john-ganz.html",
    "summary": "The political writer John Ganz dissects the Republican Party’s internal battle over antisemitism."
  },
  {
    "title": "Hurricane Melissa Leaves Behind a Staggering Homelessness Toll in Jamaica",
    "link": "https://www.nytimes.com/2025/11/14/world/americas/hurricane-melissa-homeless-jamaica.html",
    "summary": "Two weeks after Hurricane Melissa wrecked western Jamaica, officials are beginning to grapple with the challenge of trying to find housing for thousands of families."
  },
  {
    "title": "What the U.S. Absence at COP30 Tells Us",
    "link": "https://www.nytimes.com/video/world/100000010519999/what-the-us-absence-at-cop30-tells-us.html",
    "summary": "World leaders are meeting at the COP30 this week to discuss climate. The U.S. was not part of this meeting. Somini Sengupta, our international climate reporter, discusses what this absence means."
  },
  {
    "title": "Sharon Camp, Mother of the ‘Plan B’ Contraceptive Pill, Dies at 81",
    "link": "https://www.nytimes.com/2025/11/14/health/policy/sharon-camp-dead.html",
    "summary": "An advocate for women’s reproductive health, she started one of the world’s smallest pharmaceutical companies to bring an emergency birth-control method to market."
  },
  {
    "title": "An Escape From India’s Air Pollution for Those Who Can Afford It",
    "link": "https://www.nytimes.com/2025/11/14/business/india-pollution-clean-air.html",
    "summary": "Companies are offering much-needed, but expensive, air purification systems to shelter from the smog in one of the world’s most polluted cities."
  },
  {
    "title": "Almost Everything About NASA’s ESCAPADE Mission to Mars Is Unusual",
    "link": "https://www.nytimes.com/2025/11/14/science/nasa-mars-escapade.html",
    "summary": "The ESCAPADE mission, which launched to space on a Blue Origin rocket on Thursday, breaks the mold of how planetary science missions typically come together."
  }
]