[
  {
    "title": "How George Santos Won His Freedom",
    "link": "https://www.nytimes.com/2025/10/18/nyregion/george-santos-prison-trump.html",
    "summary": "On Friday evening, President Trump commuted the sentence of former Representative George Santos. “Good luck George, have a great life!” the president said."
  },
  {
    "title": "Santos’s Release Frustrates His Former Colleagues and Constituents",
    "link": "https://www.nytimes.com/2025/10/18/nyregion/george-santos-released-reaction.html",
    "summary": "George Santos, the disgraced former Republican congressman, was freed from prison on Friday after President Trump commuted his sentence. On Long Island, in his former district, some people called the decision an outrage."
  },
  {
    "title": "Santos in His Own Words: Pleading for Mercy and Promising a Comeback",
    "link": "https://www.nytimes.com/2025/10/18/nyregion/george-santos-newspaper-columns.html",
    "summary": "George Santos, the disgraced former congressman who was released from federal prison on Friday, has been a columnist for a Long Island paper, including from behind bars."
  },
  {
    "title": "U.S. Is Repatriating Survivors of Its Strike on Suspected Drug Vessel",
    "link": "https://www.nytimes.com/2025/10/18/us/politics/boat-strike-survivors.html",
    "summary": "Two men rescued by the U.S. military after it attacked a boat in the Caribbean Sea were being sent to their home countries of Colombia and Ecuador, President Trump said."
  },
  {
    "title": "Venezuela Announces Sweeping Military Exercises as U.S. Escalates Pressure",
    "link": "https://www.nytimes.com/2025/10/18/world/americas/venezuela-military-us.html",
    "summary": "President Nicolás Maduro this week called on civilians to help the country defend itself, while his defense minister warned citizens to “prepare for the worst.”"
  },
  {
    "title": "The Shutdown Is Stretching On. Trump Doesn’t Seem to Mind.",
    "link": "https://www.nytimes.com/2025/10/18/us/politics/trump-democrats-shutdown-deal.html",
    "summary": "As the shutdown nears a fourth week, President Trump has pushed his political opponents to further dig in."
  },
  {
    "title": "Inside Israel’s Battle Over the Haredi Draft and Who Must Fight in Its Wars",
    "link": "https://www.nytimes.com/2025/10/18/magazine/israel-haredi-draft-netanyahu-war.html",
    "summary": "The conflict over compulsory service for the nation’s ultra-Orthodox has become a stand-in for a larger struggle over the country’s right-wing, religious turn — and could determine its future."
  },
  {
    "title": "Israeli Military Fires on Vehicle, Saying It Crossed Gaza Cease-Fire Line",
    "link": "https://www.nytimes.com/2025/10/18/world/middleeast/israel-military-gaza-strike-cease-fire.html",
    "summary": "Gaza’s rescue service said at least nine people, including several children, were killed in the strike in northern Gaza on Friday, underscoring the fragility of the week-old cease-fire."
  },
  {
    "title": "Jeffrey Epstein’s Angry Emails to Billionaire Leon Black",
    "link": "https://www.nytimes.com/2025/10/18/business/jeffrey-epstein-leon-black.html",
    "summary": "New emails show how Mr. Epstein pressured Leon Black, his longtime friend and patron, to fork over millions for financial services."
  },
  {
    "title": "For Prince Andrew, a Steady Fall From Grace Ends in a Hard Landing",
    "link": "https://www.nytimes.com/2025/10/18/world/europe/prince-andrew-britain-epstein.html",
    "summary": "A parade of scandals tarnished the prince’s reputation, long before he gave up using his title as Duke of York on Friday."
  },
  {
    "title": "Fraidy-Cat at the Pentagon",
    "link": "https://www.nytimes.com/2025/10/18/opinion/pentagon-journalists-news-hegseth.html",
    "summary": "Pete Hegseth can’t handle the truth."
  },
  {
    "title": "Here’s What Trump Could Unleash by Invoking the Insurrection Act",
    "link": "https://www.nytimes.com/2025/10/18/opinion/trump-insurrection-act.html",
    "summary": "Why Congress should take up Insurrection Act reform."
  },
  {
    "title": "Down Time",
    "link": "https://www.nytimes.com/2025/10/18/briefing/down-time.html",
    "summary": "A lazy day during which we do absolutely nothing sounds heavenly, but how much unstructured time can we comfortably abide?"
  },
  {
    "title": "Cuomo Tries to Tie Mamdani to Muslim Leader’s Anti-Gay Stance",
    "link": "https://www.nytimes.com/2025/10/18/nyregion/cuomo-mamdani-imam.html",
    "summary": "Andrew Cuomo, trailing in the New York City mayor’s race, sought to contrast his role in legalizing same-sex marriage with the views of some of Mr. Mamdani’s supporters."
  },
  {
    "title": "How Low-Cost Air Quality Sensors Are Making Air Pollution Data More Accessible",
    "link": "https://www.nytimes.com/2025/10/18/headway/air-quality-sensors-pollution-data.html",
    "summary": "The growing availability of low-cost air quality sensors is helping people across the world track air pollution."
  },
  {
    "title": "What Will Winter Bring? NOAA Outlook May Offer Some Clues.",
    "link": "https://www.nytimes.com/2025/10/18/weather/noaa-winter-weather-forecast-us.html",
    "summary": "Federal forecasters broke down the most likely scenarios around the United States this week."
  },
  {
    "title": "Alison Rose, The New Yorker’s Femme Fatale, Dies at 81",
    "link": "https://www.nytimes.com/2025/10/18/books/alison-rose-dead.html",
    "summary": "She started as the magazine’s glamorous receptionist and became one of its more singular writers. In one of her last articles, she memorialized her time (and lovers) there."
  }
]