[
  {
    "title": "Operation Allies Welcome, Gave Some Afghans Entry to the U.S.",
    "link": "https://www.nytimes.com/2025/11/26/us/operation-allies-welcome-dc-shooting.html",
    "summary": "The Biden administration set up the initiative after the Taliban retook power in Afghanistan in August 2021 for those who assisted U.S. troops."
  },
  {
    "title": "‘No Alarm Went Off’: Hong Kong Fire Survivor Recounts Harrowing Escape",
    "link": "https://www.nytimes.com/2025/11/27/world/asia/hong-kong-fire-survivors-escape.html",
    "summary": "Many windows were covered, preventing residents from seeing the fire and smoke, one survivor said."
  },
  {
    "title": "Hong Kong Arrests 3 Tied to Construction Company After Deadly Apartment Fire",
    "link": "https://www.nytimes.com/2025/11/26/world/asia/arrests-hong-kong-fire-manslaughter.html",
    "summary": "The police said that building materials used by the company for the work at Wang Fuk Court may not have been up to fire safety standards. The police did not identify the company or who was arrested."
  },
  {
    "title": "U.S. to Press Europe and Other Allies on Immigration, Document Says",
    "link": "https://www.nytimes.com/2025/11/26/us/politics/trump-rubio-mass-migration.html",
    "summary": "American diplomats were told to raise U.S. concerns about “violent crimes associated with people of a migration background.”"
  },
  {
    "title": "Where the Waters Are Rough, a Fishing Town Confronts Trump’s Priorities",
    "link": "https://www.nytimes.com/2025/11/27/us/politics/newport-oregon-ice.html",
    "summary": "First, Newport, Ore., lost its Coast Guard rescue chopper. Then came the swirl of rumors and evidence that Immigration and Customs Enforcement was coming to town."
  },
  {
    "title": "Heading to the Mideast, Pope Leo May Show ‘Who He Really Is’",
    "link": "https://www.nytimes.com/2025/11/27/world/middleeast/pope-leo-trip.html",
    "summary": "The pontiff begins a trip to Turkey and Lebanon on Thursday — the first foreign voyage of his papacy, and his biggest test yet."
  },
  {
    "title": "Pope Leo Lands in Turkey, Planning to Meet Erdogan With a Message of Outreach",
    "link": "https://www.nytimes.com/2025/11/27/world/middleeast/pope-first-foreign-trip-turkey-erdogan.html",
    "summary": "In the capital, Ankara, Leo XIV was received by President Recep Tayyip Erdogan on the opening leg of a trip that will also include Lebanon."
  },
  {
    "title": "When Is My Thanksgiving Turkey Done? and More Thanksgiving Questions Answered",
    "link": "https://cooking.nytimes.com/article/thanksgiving-turkey-internal-temperature-done",
    "summary": "This is your year to be the turkey expert: Here’s how to know when to baste, how to carve and serve and more."
  },
  {
    "title": "How to Watch the 2025 Macy’s Thanksgiving Day Parade",
    "link": "https://www.nytimes.com/2025/11/26/nyregion/macys-thanksgiving-day-parade-how-to-watch.html",
    "summary": "The 99th edition of the New York parade will feature performances from Cynthia Erivo and Busta Rhymes, as well as dozens of floats and balloons."
  },
  {
    "title": "Sean Duffy Longs for the ‘Golden Days’ of Air Travel. What Was That Like?",
    "link": "https://www.nytimes.com/2025/11/27/travel/air-travel-sean-duffy.html",
    "summary": "Back in the ’50s and ’60s, passengers (well-dressed, of course, and with perfect manners) could count on hot meals on china, plenty of legroom, the occasional piano bar, even wool blankets. Those days are gone."
  },
  {
    "title": "How Europe Lost Its Voice on Ukraine, Then Tried to Get It Back",
    "link": "https://www.nytimes.com/2025/11/27/world/europe/europe-ukraine-trump.html",
    "summary": "European leaders were blindsided by President Trump’s 28-point-plan to end the Ukraine war, setting off a dash for influence."
  },
  {
    "title": "Leaked Transcript of Witkoff Call Shows U.S. Deference to Russia",
    "link": "https://www.nytimes.com/2025/11/26/us/politics/witkoff-leaked-transcript-deference-russia.html",
    "summary": "The White House envoy’s conversation suggests that President Trump is determined to make a deal to end the war in Ukraine, even if it is mostly on Russia’s terms."
  },
  {
    "title": "U.S. Army Secretary’s Unusual Role in Ukraine Peace Negotiations",
    "link": "https://www.nytimes.com/2025/11/26/us/politics/ukraine-russia-peace-talks-daniel-driscoll.html",
    "summary": "Daniel Driscoll has met with Ukrainian and Russian officials during a whirlwind of trips as the Trump administration pushes its latest proposal."
  },
  {
    "title": "The Writer Who Dared Criticize Silicon Valley",
    "link": "https://www.nytimes.com/2025/11/27/technology/writer-silicon-valley-criticism.html",
    "summary": "Paulina Borsook’s “Cyberselfish,” which offered dire predictions about the tech world’s love for libertarianism, is finding fans. It only took 25 years."
  },
  {
    "title": "Beekeepers, Farmers and the Fight to Save a Century-Old Research Hub",
    "link": "https://www.nytimes.com/2025/11/27/us/politics/beekeepers-farmers-research-hub-barc.html",
    "summary": "Industry groups and scientists have urged the Trump administration to reconsider its plan to close a renowned Agriculture Department center in Maryland and disperse its work around the country."
  },
  {
    "title": "Gene Therapy Offer a Cure for Babies With the Deadly ‘Bubble Boy Disease’",
    "link": "https://www.nytimes.com/2025/11/27/well/bubble-boy-disease-gene-therapy.html",
    "summary": "“Bubble boy disease” was once a death sentence. A scientific breakthrough changed that."
  },
  {
    "title": "‘Stranger Things’ Cast Looks Back on the Show and How It Shaped Them",
    "link": "https://www.nytimes.com/2025/11/27/arts/television/stranger-things-cast-changes.html",
    "summary": "The first episodes of the final season just premiered on Netflix. In interviews, the young stars looked back on the show and how it shaped them."
  },
  {
    "title": "Time to Let My Brother Kevin Do the Carving",
    "link": "https://www.nytimes.com/2025/11/27/opinion/maureen-dowd-brother-thanksgiving-trump.html",
    "summary": "My brother takes a slice out of Trump and Mamdani."
  },
  {
    "title": "What Hunger Looks Like in America",
    "link": "https://www.nytimes.com/2025/11/27/opinion/hunger-food-insecurity-affordability.html",
    "summary": "We spoke with dozens of people living with hunger in the United States. These are their stories."
  },
  {
    "title": "This Thanksgiving, Everything Is Going to Be All Right",
    "link": "https://www.nytimes.com/2025/11/27/briefing/this-thanksgiving-everything-is-going-to-be-all-right.html",
    "summary": "A pep talk for the day."
  },
  {
    "title": "Jimmy Fallon Gets Into the Spirit of ‘Drinksgiving’",
    "link": "https://www.nytimes.com/2025/11/27/arts/television/jimmy-fallon-thanksgiving-drinksgiving.html",
    "summary": "“’Twas the night before Thanksgiving, and in your parents’ house, they put the Peloton in your old bedroom, so you’re sleeping on the couch,” Fallon mused."
  },
  {
    "title": "ABBA’s Popular Hologram Show Could Come to New York City",
    "link": "https://www.nytimes.com/2025/11/27/nyregion/abba-voyage-nyc.html",
    "summary": "ABBA Voyage, the popular London show, features holograph versions of the Swedish pop band when they were decades younger."
  },
  {
    "title": "Campbell’s Says Executive Accused of Offensive Remarks Has Left the Company",
    "link": "https://www.nytimes.com/2025/11/26/business/campbells-executive-insulting-audio.html",
    "summary": "The comments came to light after an audiotape was released, tied to a lawsuit filed by a former employee."
  },
  {
    "title": "Paul Ekman, Who Linked Facial Expressions to Universal Emotions, Dies at 91",
    "link": "https://www.nytimes.com/2025/11/26/science/paul-ekman-dead.html",
    "summary": "Often called the world’s most famous face reader, he inspired the TV show ‘Lie to Me.’ But some questioned his assumption that human expressions were ‘pan-cultural.’"
  },
  {
    "title": "Guinea-Bissau’s President Says He Has Been Deposed. The Opposition Says It’s a Trick.",
    "link": "https://www.nytimes.com/2025/11/26/world/africa/guinea-bissau-coup.html",
    "summary": "The military announced on Wednesday it had taken over the West African nation. Later, the opposition leader accused the incumbent president of staging the coup d’état to try to retain power."
  }
]