[
  {
    "title": "Chasing an Economic Boom, White House Dismisses Risks of A.I.",
    "link": "https://www.nytimes.com/2025/12/24/us/politics/trump-artificial-intelligence-economy-risks.html",
    "summary": "The administration has downplayed concerns — from mass job losses, to a potential financial bubble — as President Trump cheers soaring stock prices and faster growth."
  },
  {
    "title": "DOJ Releases Another Batch of Epstein Files: Key Takeaways",
    "link": "https://www.nytimes.com/2025/12/23/us/politics/epstein-files-trump-takeaways.html",
    "summary": "The new documents — nearly 30,000 in all — contain hundreds of references to President Trump and include different versions of Jeffrey Epstein’s will."
  },
  {
    "title": "Redacted Material in Some Epstein Files Is Easily Recovered",
    "link": "https://www.nytimes.com/2025/12/23/us/politics/epstein-files-redactions-doj.html",
    "summary": "The ease of recovering information that was not properly redacted digitally suggests that at least some of the documents released by the Justice Department were hastily censored."
  },
  {
    "title": "Pro-Trump Influencers Stay Conspicuously Quiet About Epstein Files",
    "link": "https://www.nytimes.com/2025/12/23/us/politics/pro-trump-influencers-epstein-files.html",
    "summary": "Their silence contrasted with the uproar made over the weekend when the Justice Department’s first release focused on former President Bill Clinton."
  },
  {
    "title": "Zelensky Opens Way to Demilitarized Zone in Eastern Ukraine to Reach Peace",
    "link": "https://www.nytimes.com/2025/12/24/world/europe/zelensky-demilitarized-zone-offer.html",
    "summary": "The offer was the closest Mr. Zelensky has come to addressing the thorny territorial disputes in Donetsk that have repeatedly derailed peace talks."
  },
  {
    "title": "Blast Kills Three in Moscow Near Site of General’s Car Bombing",
    "link": "https://www.nytimes.com/2025/12/24/world/europe/moscow-bomb-blast-police-officers.html",
    "summary": "Two police officers died in the explosion, the authorities said. Earlier this week a car bomb killed a military commander in the same area of Russia’s capital."
  },
  {
    "title": "A Father and Son’s $108 Billion Hostile Bid for Warner Bros. Discovery",
    "link": "https://www.nytimes.com/2025/12/24/business/media/larry-david-ellison-warner-bros-discovery-cbs.html",
    "summary": "Larry and David Ellison didn’t always have a close relationship. Now they’re one of the most intriguing partnerships in business."
  },
  {
    "title": "Pulled ’60 Minutes’ Report, Briefly Streamed in Canada, Is All Over the Internet Now",
    "link": "https://www.nytimes.com/2025/12/23/business/media/60-minutes-cbs-news.html",
    "summary": "At the last minute, CBS News held a segment about Venezuelan men who were deported by the Trump administration to a prison in El Salvador. It surfaced online anyway."
  },
  {
    "title": "Trump’s Tanker Crackdown Paralyzes Venezuelan Oil Exports",
    "link": "https://www.nytimes.com/2025/12/23/world/americas/trump-tankers-venezuela-oil-industry.html",
    "summary": "Oil exports, the country’s financial lifeblood, have plummeted after the United States took action against three ships that have been used to carry its crude."
  },
  {
    "title": "U.S. Is Adding to Its Military Buildup in the Caribbean",
    "link": "https://www.nytimes.com/2025/12/23/us/politics/military-cargo-planes-caribbean-venezuela.html",
    "summary": "Over the past week, C-17 heavy-lift cargo planes, which usually transport troops and equipment, flew to Puerto Rico at least 16 times, according to flight tracking data reviewed by The New York Times."
  },
  {
    "title": "The Deposed Assad Henchmen Plotting to Retake Syria",
    "link": "https://www.nytimes.com/2025/12/24/world/middleeast/assad-henchmen-retake-syria-plots.html",
    "summary": "Hacked communications and a social media analysis reveal how former regime leaders are trying to arm fighters and exert influence as far away as Washington."
  },
  {
    "title": "After the Assad Regime’s Fall, His Enforcers Are Lying Low and Living Large",
    "link": "https://www.nytimes.com/2025/12/22/world/middleeast/assad-syria-enforcers-lives-now.html",
    "summary": "A Times investigation into the whereabouts of top Syrian officials who fled after the regime’s fall shows many remain free — shielded by wealth and accommodating host nations."
  },
  {
    "title": "The Truce Is 2 Months Old. So Why Have Hundreds of Gazans Been Killed?",
    "link": "https://www.nytimes.com/2025/12/24/world/middleeast/gaza-killings-israel-cease-fire.html",
    "summary": "Since the cease-fire took effect, Israel says it has targeted only militants. But death can come for Gazans while on a family outing or sleeping in a tent."
  },
  {
    "title": "Suspect in Brown University Shooting Worked in Portugal After Leaving University",
    "link": "https://www.nytimes.com/2025/12/23/us/brown-university-shooting-suspect-portugal.html",
    "summary": "One friend said Claudio Neves Valente appeared to live a detached life, upset that “he couldn’t be the genius he thought he should be.”"
  },
  {
    "title": "ICE Sweeps Into Ohio, Stirring Fear Among Somalis and Other Immigrants",
    "link": "https://www.nytimes.com/2025/12/24/us/ice-columbus-ohio-somalis-immigrants.html",
    "summary": "After Mayor Andrew Ginther of Columbus said that its policy prohibited local cooperation on immigration enforcement, Elon Musk called him a “traitor.”"
  },
  {
    "title": "Palm Beach Rallies Behind a Restaurant Manager Held at ‘Alligator Alcatraz’",
    "link": "https://www.nytimes.com/2025/12/23/style/jose-gonzalez-alligator-alcatraz-palm-beach.html",
    "summary": "After nearly two weeks in detention, José Gonzalez, the popular host of an upscale restaurant, returns home."
  },
  {
    "title": "Lawmaker Returns to Migrant Center Where She Clashed With U.S. Agents",
    "link": "https://www.nytimes.com/2025/12/23/nyregion/lamonica-mciver-delaney-hall.html",
    "summary": "Representative LaMonica McIver, a New Jersey Democrat, called on immigration officials to close Delaney Hall in Newark, calling detainees’ food and medical care inadequate."
  },
  {
    "title": "Pennsylvania Nursing Home Explosion Kills 2",
    "link": "https://www.nytimes.com/2025/12/23/us/explosion-bristol-nursing-home.html",
    "summary": "A resident and an employee were killed after two explosions at the Bristol Health and Rehab Center resulted in a large fire and partial collapse of the building, officials said."
  },
  {
    "title": "Investors Warn of ‘Rot in Private Equity’ as Funds Strike Circular Deals",
    "link": "https://www.nytimes.com/2025/12/24/business/investors-warn-of-rot-in-private-equity-as-funds-strike-circular-deals.html",
    "summary": "Buyout firms have struggled to sell companies they own and have instead found a workaround to get cash back to clients: Selling the companies to themselves."
  },
  {
    "title": "$100 for a Cab to the Airport? It May Soon Get Worse.",
    "link": "https://www.nytimes.com/2025/12/24/nyregion/nyc-airports-taxi-ride-share-fee-hike.html",
    "summary": "The Port Authority is preparing to increase the charge for drivers to pick up and drop off passengers at the airports."
  },
  {
    "title": "Mamdani Names Fire Commissioner, but Comments From the Former One Linger",
    "link": "https://www.nytimes.com/2025/12/23/nyregion/zohran-mamdani-fire-commissioner.html",
    "summary": "Zohran Mamdani chose Lillian Bonsignore to be fire commissioner, weeks after the former commissioner, Robert S. Tucker, resigned, citing Mr. Mamdani’s views on Israel."
  },
  {
    "title": "A Democrat, a Republican and a Supermarket Baron Go to ‘Marty Supreme’",
    "link": "https://www.nytimes.com/2025/12/23/nyregion/hochul-blakeman-red-carpet.html",
    "summary": "A “Marty Supreme” showing took a political turn when John Catsimatidis, who has a small role in the movie, invited both Gov. Kathy Hochul and her Republican rival, Bruce Blakeman."
  },
  {
    "title": "‘Stranger Things’ Creators Break Down Their Latest Influences",
    "link": "https://www.nytimes.com/2025/12/24/arts/television/stranger-things-creators-break-down-their-latest-influences.html",
    "summary": "With a new batch of episodes arriving on Christmas Day, Matt and Ross Duffer discuss the sometimes obscure movie and video game references in the final season so far."
  },
  {
    "title": "The Year America Blew Up the Process",
    "link": "https://www.nytimes.com/2025/12/24/opinion/democracy-america-bureaucracy.html",
    "summary": "The 2025 revolt against process signaled the final collapse of a powerful idea that once promised to hold the country together."
  },
  {
    "title": "A Christmas Argument That Ended in Harmony",
    "link": "https://www.nytimes.com/2025/12/24/opinion/merry-christmas-happy-holidays-christianity.html",
    "summary": "Standing together on behalf of those who flee oppression is a very Christmas thing to do."
  },
  {
    "title": "Inside the Oval Office",
    "link": "https://www.nytimes.com/2025/12/24/briefing/inside-the-oval-office.html",
    "summary": "Today we take a look at President Trump’s interior design."
  },
  {
    "title": "China Is Shifting Its Nuclear Forces to Swifter Footing, Pentagon Says",
    "link": "https://www.nytimes.com/2025/12/24/world/asia/china-nuclear-forces-pentagon-report.html",
    "summary": "The country’s production of nuclear warheads has slowed, but its missiles may be poised to strike back fast in case of an attack, an annual assessment found."
  },
  {
    "title": "Australian State Passes ‘Extraordinary’ Gun and Protest Laws After Bondi Attack",
    "link": "https://www.nytimes.com/2025/12/24/world/australia/nsw-gun-protest-laws.html",
    "summary": "While the new restrictions on firearms have broad support, new police powers to crack down on some protests were criticized as limits on civil liberties."
  },
  {
    "title": "In Pursuit of the Monarch’s Magnetic Sense",
    "link": "https://www.nytimes.com/2025/12/23/science/neuroscience-monarch-butterflies-migration.html",
    "summary": "The magnetic compass is the last unknown sense in migrating animals. For some scientists, the monarch butterfly is leading the way."
  },
  {
    "title": "Thailand, Attacking Cambodia, Says Its Target Is the Scam Industry",
    "link": "https://www.nytimes.com/2025/12/24/world/asia/cambodia-scam-centers-refugees-thailand.html",
    "summary": "Thai warplanes have bombed compounds where people are forced to defraud others online. Rights activists say trafficking victims’ lives are at risk."
  }
]