[
  {
    "title": "Trump Announces Tariff Increase on Canada Over Reagan Ad Spat",
    "link": "https://www.nytimes.com/2025/10/25/world/canada/trump-tariffs-reagan-ad.html",
    "summary": "The ad, which will stop airing on Monday, used audio of a 1987 address by Ronald Reagan making a case against tariffs."
  },
  {
    "title": "Trump’s Asia Tour: Deals, Diplomacy and a Meeting With Xi",
    "link": "https://www.nytimes.com/2025/10/25/world/asia/trump-japan-korea-china.html",
    "summary": "From Kuala Lumpur to Gyeongju, President Trump is casting himself as a deal-maker and peace negotiator, while a wary region looks for tariff relief and steadier ties."
  },
  {
    "title": "In Trump, Families of Cambodian Troops Detained by Thailand See Hope",
    "link": "https://www.nytimes.com/2025/10/25/world/asia/trump-cambodia-thailand-peace.html",
    "summary": "They are expecting President Trump will do for their loved ones what he did for the hostages held by Hamas: set in motion a plan that leads to their release."
  },
  {
    "title": "Timothy Mellon Is Donor Who Gave $130 Million to Pay Troops During Shutdown",
    "link": "https://www.nytimes.com/2025/10/25/us/politics/timothy-mellon-donation-troops.html",
    "summary": "Timothy Mellon is a billionaire and a major financial backer of President Trump."
  },
  {
    "title": "As Vance Takes on a Forceful New Role, His Positions Are Shifting",
    "link": "https://www.nytimes.com/2025/10/25/us/politics/jd-vance-shifting-positions.html",
    "summary": "Vice President JD Vance has found himself defending or promoting positions that he once opposed, even as recently as the campaign."
  },
  {
    "title": "Did Cheating Accusations Have Anything to Do With the Death of a Daniel Naroditsky?",
    "link": "https://www.nytimes.com/2025/10/25/style/chess-cheating-death.html",
    "summary": "Daniel Naroditsky, a top American player with an online following, was found dead in Charlotte, N.C., after talking about being accused of cheating by a former world champion."
  },
  {
    "title": "Canada-U.S. Tensions Stay on Baseball Field During Blue Jays-Dodgers World Series",
    "link": "https://www.nytimes.com/2025/10/25/sports/baseball/blue-jays-dodgers-trump-canada-us.html",
    "summary": "At Game 1 of the World Series in Toronto on Friday, overt politics were absent. Unity between the two nations was on display before the first pitch."
  },
  {
    "title": "Burnin’ Down the House",
    "link": "https://www.nytimes.com/2025/10/25/opinion/trump-white-house-east-wing-demolition.html",
    "summary": "Demolition Man builds a monument to his wrecking-ball style."
  },
  {
    "title": "Trump’s Path of Destruction Is Far-Reaching",
    "link": "https://www.nytimes.com/2025/10/25/opinion/trump-venezuela-white-house-mamdani.html",
    "summary": "From Venezuela to the East Wing of the White House."
  },
  {
    "title": "Trump Backs Milei, But Argentina’s Elections Will Test His Popularity",
    "link": "https://www.nytimes.com/2025/10/25/world/americas/argentina-elections-milei.html",
    "summary": "President Javier Milei of Argentina has earned U.S. support, but he faces a critical legislative election at home amid voter anger over job losses and corruption scandals."
  },
  {
    "title": "June Lockhart, Beloved Television Mother, Dies at 100",
    "link": "https://www.nytimes.com/2025/10/25/arts/television/june-lockhart-dead.html",
    "summary": "She exuded earnest maternal wisdom and wistful contentment as a farm wife on “Lassie” and, later, as an interplanetary castaway on “Lost in Space.”"
  },
  {
    "title": "Honduran Man Struck and Killed On a Virginia Highway While Fleeing ICE",
    "link": "https://www.nytimes.com/2025/10/25/us/ice-honduran-killed-virginia.html",
    "summary": "ICE officers were in the process of detaining Josue Castro-Rivera, 24, of Honduras, before he ran onto a busy highway in Norfolk and was struck by a pickup truck, officials said."
  }
]