[
  {
    "title": "Obamacare Prices Become Public, Highlighting Big Increases",
    "link": "https://www.nytimes.com/2025/10/29/health/obamacare-prices-health-insurance.html",
    "summary": "The government website now shows consumers how much their health insurance costs will increase next year, as Congress remains at an impasse over the plans’ subsidies."
  },
  {
    "title": "In Utah, Trump’s Vision for Homelessness Begins to Take Shape",
    "link": "https://www.nytimes.com/2025/10/29/us/politics/utah-trump-homeless-campus.html",
    "summary": "State officials promise large-scale involuntary addiction and mental health treatment at Salt Lake City’s edge. Critics see “a prison, or a warehouse.”"
  },
  {
    "title": "When This Reporter Comes Calling, the White House Insults Go Flying",
    "link": "https://www.nytimes.com/2025/10/29/business/media/shirish-date-white-house-journalist-huffpost.html",
    "summary": "The administration often criticizes journalists, but the treatment of Shirish Dáte, a reporter for HuffPost, stands out."
  },
  {
    "title": "U.S. Manufacturing’s Mixed Picture in 4 Charts",
    "link": "https://www.nytimes.com/2025/10/29/business/mixed-picture-united-states-manufacturing-in-four-charts.html",
    "summary": "President Trump vowed to bring factories back. Is he succeeding?"
  },
  {
    "title": "Boeing Reports Big Quarterly Loss but Sales Improved",
    "link": "https://www.nytimes.com/2025/10/29/business/boeing-earnings-third-quarter.html",
    "summary": "The aerospace company was hurt by the delay of a new plane but made progress on increasing production of the 737 Max, its most popular aircraft."
  },
  {
    "title": "South Korea Says the United States Agreed to 15% Tariffs",
    "link": "https://www.nytimes.com/2025/10/29/us/politics/tariff-trump-south-korea-trade.html",
    "summary": "Seoul will invest $200 billion, or as much as $20 billion a year, and set aside another $150 billion to invest in its American shipbuilding operations, a South Korean official said."
  },
  {
    "title": "Feted as a Peacemaker in South Korea, Trump Vows to End Hostilities With North Korea",
    "link": "https://www.nytimes.com/2025/10/29/world/asia/trump-south-north-korea-kim.html",
    "summary": "President Trump lamented not being able to speak with Mr. Kim, the North Korean leader, but vowed to end the decades of hostilities between the two Koreas."
  },
  {
    "title": "As China and U.S. Split Over Energy, Korea Is Stuck in the Middle",
    "link": "https://www.nytimes.com/2025/10/29/climate/china-us-korea-clean-energy-tariffs.html",
    "summary": "It needs the United States for defense and has spent billions building factories in America. But a Trump trade deal this week with China could erase a Korean edge in the U.S. market."
  },
  {
    "title": "Toyota Says $10 Billion U.S. Investment Touted by Trump Isn’t New",
    "link": "https://www.nytimes.com/2025/10/29/business/trump-toyota-10-billion.html",
    "summary": "Japanese officials have called into question some elements of the flurry of big new investments announced by President Trump during his Japan visit."
  },
  {
    "title": "Israeli Strikes in Gaza Kill at Least 100, Local Health Officials Say",
    "link": "https://www.nytimes.com/2025/10/29/world/middleeast/gaza-israel-strikes-ceasefire.html",
    "summary": "After what appeared to be the deadliest day since a truce deal was agreed on this month, Israel said the cease-fire had resumed."
  },
  {
    "title": "U.S. Middle East Envoy Presses Lebanon to Disarm Hezbollah",
    "link": "https://www.nytimes.com/2025/10/29/world/middleeast/us-middle-east-envoy-presses-lebanon-to-disarm-hezbollah.html",
    "summary": "The visit by the envoy, Morgan Ortagus, coincided with a spike in Israeli attacks on Hezbollah in recent weeks that has stoked fears of a renewed conflict."
  },
  {
    "title": "Helen DeWitt’s New Novel Almost Drove Her To Despair",
    "link": "https://www.nytimes.com/2025/10/29/books/helen-dewitt-your-name-here.html",
    "summary": "Helen DeWitt’s bewildering co-written novel, “Your Name Here,” took almost 20 years to publish, a process that nearly drove her to despair."
  },
  {
    "title": "Hurricane Melissa Aftermath Photos and Video: Jamaica and the Caribbean",
    "link": "https://www.nytimes.com/2025/10/28/weather/hurricane-melissa-caribbean-photos-video.html",
    "summary": "The system made landfall in Jamaica on Tuesday afternoon, causing widespread flooding and destruction."
  },
  {
    "title": "Cuomo Blasts Mamdani for His Rent-Stabilized Unit. But He Had One, Too.",
    "link": "https://www.nytimes.com/2025/10/29/nyregion/cuomo-rent-stabilized-apartment.html",
    "summary": "Former Gov. Andrew M. Cuomo lived in what he once described as “a dump, just one long hallway.”"
  },
  {
    "title": "Mamdani Still Hasn’t Said Whether He Supports Ballot Housing Proposals",
    "link": "https://www.nytimes.com/2025/10/29/nyregion/zohran-mamdani-housing-ballot-measures.html",
    "summary": "Zohran Mamdani, the front-runner in the New York City mayor’s race, has dodged questions about his position on ballot measures that seek to address the housing crisis, a key issue."
  },
  {
    "title": "Street Battles Rage in Ukrainian City After Russian Troops Enter Stronghold",
    "link": "https://www.nytimes.com/2025/10/29/world/europe/ukraine-russia-street-battles-pokrovsk.html",
    "summary": "Moscow’s forces infiltrated Pokrovsk after months of attacks on the city, a strategic part of Ukraine’s eastern defenses."
  },
  {
    "title": "U.S. Says It Will Cut Troops in Eastern Europe",
    "link": "https://www.nytimes.com/2025/10/29/world/europe/us-troops-eastern-europe-romania.html",
    "summary": "About 700 troops are expected to be withdrawn as Trump administration officials shift resources to the Indo-Pacific region."
  },
  {
    "title": "Putin Announces Test of Tsunami-Making Nuclear Weapon",
    "link": "https://www.nytimes.com/2025/10/29/world/europe/russia-missile-poseidon-putin-nuclear-tests.html",
    "summary": "The test comes days after President Vladimir V. Putin announced the previous trial of another Russian nuclear weapon."
  },
  {
    "title": "Whole Foods, MAHA and the Battle Over Healthy Eating in America",
    "link": "https://www.nytimes.com/2025/10/29/dining/whole-foods.html",
    "summary": "As diet and wellness become increasingly politicized, one of the most recognizable grocery brands navigates the debate."
  },
  {
    "title": "Life Lessons from (Very Old) Bowhead Whales",
    "link": "https://www.nytimes.com/2025/10/29/science/genetics-bowhead-whales-longevity.html",
    "summary": "A gene that helped bowheads adapt to frigid Arctic waters also granted them extraordinary longevity. Could it help aging humans become more resilient?"
  },
  {
    "title": "The Best Ice Cream, Coffee and More ‘Little Treats’ in NYC",
    "link": "https://www.nytimes.com/2025/10/29/dining/coffee-ice-cream-candy-nyc-treats.html",
    "summary": "Cake slices, sundaes, morning buns, noodles and shakes — all $20 or under — for your immediate consumption."
  },
  {
    "title": "A Nazi Tattoo Exposes Democrats’ Greatest Weakness",
    "link": "https://www.nytimes.com/2025/10/29/opinion/nazi-tattoo-graham-platner-democrats.html",
    "summary": "Do Democrats know what the working class actually looks like?"
  },
  {
    "title": "Hurricane Melissa Has Arrived in Cuba",
    "link": "https://www.nytimes.com/2025/10/29/us/jamaica-melissa-destruction-cuba-hurricane.html",
    "summary": "The storm hit Jamaica as one of the strongest Atlantic hurricanes ever."
  },
  {
    "title": "Southern California Edison Offers Compensation to Los Angeles Fire Victims",
    "link": "https://www.nytimes.com/2025/10/29/us/los-angeles-eaton-fire-victims-settlement-offer.html",
    "summary": "The utility whose equipment has been linked to the devastating Eaton fire in January is offering to pay fire survivors. But if they accept, they would be giving up their right to sue."
  },
  {
    "title": "To Avert Crisis, Talladega College Sells Its Art Treasures",
    "link": "https://www.nytimes.com/2025/10/29/arts/design/talladega-college-sells-hale-woodruff-murals-hbcu.html",
    "summary": "An H.B.C.U.’s remarkable Hale Woodruff murals commemorating Black history have been bought by an art museum and two foundations. But the college says it is not completely letting go."
  },
  {
    "title": "Paramount to Lay Off 2,000 Employees",
    "link": "https://www.nytimes.com/2025/10/29/business/media/paramount-layoffs-skydance.html",
    "summary": "The job cuts are the result of a merger with Skydance, the Hollywood studio founded by David Ellison."
  },
  {
    "title": "Character.AI to Ban Children Under 18 From Using Its Chatbots",
    "link": "https://www.nytimes.com/2025/10/29/technology/characterai-underage-users.html",
    "summary": "The start-up, which creates A.I. companions, faces lawsuits from families who have accused Character.AI’s chatbots of leading teenagers to kill themselves."
  }
]