[
  {
    "title": "Thom Tillis, Republican Senator, Won’t Seek Re-election Amid Trump’s Primary Threats",
    "link": "https://www.nytimes.com/2025/06/29/us/politics/thom-tillis-retirement.html",
    "summary": "The day after President Trump castigated the North Carolina Republican senator Thom Tillis for opposing the bill carrying his domestic agenda, Mr. Tillis said he would not seek a third term."
  },
  {
    "title": "Senate Version of Trump’s Policy Bill Would Slash Medicaid Spending Even More",
    "link": "https://www.nytimes.com/2025/06/29/us/politics/trump-policy-bill-health-insurance-cuts.html",
    "summary": "Analysis from the nonpartisan Congressional Budget Office found that Republicans’ new version of the legislation would make far deeper cuts and lead to more people becoming uninsured than previous proposals."
  },
  {
    "title": "G.O.P. Bill Adds Surprise Tax That Could Cripple Wind and Solar Power",
    "link": "https://www.nytimes.com/2025/06/29/climate/gop-bill-adds-surprise-tax-that-could-cripple-wind-and-solar-power.html",
    "summary": "Wind and solar companies were already bracing for Congress to end federal subsidies. But the Senate bill goes even further and penalizes those industries."
  },
  {
    "title": "U.N. Inspector Says Iran Could Enrich Nuclear Fuel in ‘Matter of Months’",
    "link": "https://www.nytimes.com/2025/06/29/us/politics/un-iran-nuclear-program-enrichment.html",
    "summary": "The assessment widens the divide with President Trump, who has claimed that Tehran has given up its nuclear ambitions after a U.S. attack."
  },
  {
    "title": "Israel’s Attack on Evin Prison Killed 71, Iranian State Media Report",
    "link": "https://www.nytimes.com/2025/06/29/world/middleeast/evin-prison-iran.html",
    "summary": "The notorious detention facility in Tehran, where dissidents and political prisoners are held, came under attack on June 23."
  },
  {
    "title": "Appeals Court to Consider Trump’s Use of Alien Enemies Act in Mass Deportations",
    "link": "https://www.nytimes.com/2025/06/29/us/politics/appeal-trump-alien-enemies-act.html",
    "summary": "The case before one of the most conservative courts in the country is likely to be the first to reach the Supreme Court."
  },
  {
    "title": "Trump Says He’s Found Buyers for TikTok",
    "link": "https://www.nytimes.com/2025/06/29/us/politics/trump-tiktok-buyer.html",
    "summary": "He didn’t say who was interested in buying the app, just that it was “a group of very wealthy people.” But the Chinese government needs to approve any sale."
  },
  {
    "title": "How Zohran Mamdani Brought New Voters to the Polls",
    "link": "https://www.nytimes.com/2025/06/29/nyregion/zohran-mamdani-voters-strategy.html",
    "summary": "Mr. Mamdani, the likely winner of the Democratic primary for mayor of New York City, drew tens of thousands of new voters to the polls. Here’s how."
  },
  {
    "title": "We Shouldn’t Have Billionaires, Mamdani Says",
    "link": "https://www.nytimes.com/2025/06/29/nyregion/zohran-mamdani-nyc-affordability-billionaires.html",
    "summary": "Appearing on “Meet the Press” days after the mayoral primary, Zohran Mamdani defended his proposals to make New York City more affordable and to increase taxes on the wealthy."
  },
  {
    "title": "Police Responding to Shooting in Coeur d’Alene, Idaho",
    "link": "https://www.nytimes.com/2025/06/29/us/coeur-dalene-idaho-shooting-ambush.html",
    "summary": "Firefighters were responding to a fire call when the shooting erupted, a sheriff said, adding that it was not clear how many might be wounded."
  },
  {
    "title": "Europe Heat Wave Drives Record-High Temperatures, Prompting Health Alerts",
    "link": "https://www.nytimes.com/2025/06/29/world/europe/europe-heat-wave-record-temperatures.html",
    "summary": "Extreme heat has gripped Europe with record-high temperatures, health alerts and wildfires, from France and Spain to Greece."
  },
  {
    "title": "Baseball in the Everlasting Light of Fairbanks, Alaska",
    "link": "https://www.nytimes.com/2025/06/29/us/baseball-fairbanks-alaska-midnight-game.html",
    "summary": "For more than a century, baseball teams in Fairbanks have played at midnight on the summer solstice, illuminated only by the sun."
  },
  {
    "title": "A Reckless Judicial Nomination Puts the Senate to the Test",
    "link": "https://www.nytimes.com/2025/06/29/opinion/bove-trump-judges-confirmation.html",
    "summary": "Trump wants one of his lawyers to be one of his judges."
  },
  {
    "title": "Times Readers Open Up About the Real Cost of Motherhood",
    "link": "https://www.nytimes.com/2025/06/25/opinion/motherhood-penalty-career.html",
    "summary": "What’s the real cost of motherhood? Here’s what our readers said."
  },
  {
    "title": "NYPD Officers Protest NYC Pride After Being Barred From Marching With Guns",
    "link": "https://www.nytimes.com/2025/06/29/nyregion/gay-nypd-nyc-pride-march.html",
    "summary": "An L.G.B.T.Q. officers’ group had been barred from New York City’s Pride March since 2021. This year, organizers said they could participate only if they left their weapons at home."
  },
  {
    "title": "Russia Pounds Ukraine With Drones and Missiles in One of War’s Largest Attacks",
    "link": "https://www.nytimes.com/2025/06/29/world/europe/russia-ukraine-war.html",
    "summary": "The overnight attack was one of the largest on Ukraine and included strikes in the western part of the country, which is hit less often."
  },
  {
    "title": "D. Wayne Lukas, Horse Trainer Who Saddled Winners From Coast to Coast, Dies at 89",
    "link": "https://www.nytimes.com/2025/06/29/obituaries/d-wayne-lukas-dead.html",
    "summary": "He earned purses of more than $300 million in a Hall of Fame career that revolutionized thoroughbred racing with a modern-day corporate approach."
  }
]