[
  {
    "title": "The Harvard-Trained Lawyer Behind Trump’s Fight Against Top Universities",
    "link": "https://www.nytimes.com/2025/08/11/us/politics/harvard-trump-may-mailman.html",
    "summary": "May Mailman is credited as an animating force behind a strategy that has intimidated independent institutions and undercut years of medical and scientific research."
  },
  {
    "title": "This Ohio Farm Community Is a Mecca for the ‘MAHA Mom’",
    "link": "https://www.nytimes.com/2025/08/11/us/politics/ohio-maha-moms-farms.html",
    "summary": "In a neighborhood that appeals to people from both the right and the left, residents strive for a finely tuned state of political harmony."
  },
  {
    "title": "Kennedy’s Next Target: the Federal Vaccine Court",
    "link": "https://www.nytimes.com/2025/08/11/health/kennedy-vaccine-court.html",
    "summary": "The system for compensating people injured by vaccines needs significant reform. But the health secretary could alter it in ways that ultimately reduce vaccine access for everyone."
  },
  {
    "title": "Judge Will Not Unseal Grand Jury Papers in Epstein and Maxwell Cases",
    "link": "https://www.nytimes.com/2025/08/11/nyregion/jeffrey-epstein-ghislaine-maxwell-transcripts.html",
    "summary": "President Trump has tried to subdue criticism and conspiracy theories by pushing to disclose the transcripts from the cases of Jeffrey Epstein, who abused teenage girls, and Ghislaine Maxwell, who assisted him."
  },
  {
    "title": "How Epstein Mania Finally Let Democrats Talk (and Meme) Like the Right",
    "link": "https://www.nytimes.com/2025/08/06/magazine/epstein-democrats-memes-trolling.html",
    "summary": "Hoping to widen the rift between Trump and his supporters, a few Democrats are dabbling in the kind of messaging that usually punches left."
  },
  {
    "title": "How Rick Perry Became a Fervent Advocate for the Psychedelic Ibogaine",
    "link": "https://www.nytimes.com/2025/08/11/us/politics/rick-perry-drug-psychedelics-ibogaine.html",
    "summary": "The former Texas governor and Trump energy secretary has now dedicated his life to promoting the powerful psychedelic ibogaine."
  },
  {
    "title": "He Announced His Intention to Die. The Dinner Invitations Rolled In.",
    "link": "https://www.nytimes.com/2025/08/10/business/last-supper-joseph-awuah-darko.html",
    "summary": "On Instagram, the artist Joseph Awuah-Darko asked the world to invite him to dinner before he ended his life. More than 150 meals later, he is still going."
  },
  {
    "title": "Israel-Qatar Tensions Escalate After Israel Kills Al Jazeera Journalists",
    "link": "https://www.nytimes.com/2025/08/11/world/middleeast/israel-qatar-al-jazeera-killings.html",
    "summary": "Israel and Qatar, which backs Al Jazeera and has hosted Hamas leaders, have long had a relationship marked by both public hostility and quiet collaboration."
  },
  {
    "title": "Israel’s Plan for Gaza City Is Still Unclear",
    "link": "https://www.nytimes.com/2025/08/11/world/middleeast/israel-gaza-netanyahu.html",
    "summary": "There have been vague statements by Prime Minister Benjamin Netanyahu, but there is little clarity over the operation."
  },
  {
    "title": "Tariffs on China Set to Rise Sharply Tuesday if No Deal Is Reached",
    "link": "https://www.nytimes.com/2025/08/11/us/politics/us-china-trade-tariffs-deal.html",
    "summary": "President Trump has yet to formally sign off on an agreement to extend an economic cease-fire with China, which expires on Tuesday."
  },
  {
    "title": "Small Businesses Brace for the Punishing Side Effects of Trump’s Tariffs",
    "link": "https://www.nytimes.com/2025/08/11/business/economy/tariffs-small-businesses.html",
    "summary": "Large firms with big bank balances, workers already in jobs and households near the top of the income ladder will have an easier time navigating the economic waves."
  },
  {
    "title": "U.S. Government to Take Cut of Nvidia and AMD A.I. Chip Sales to China",
    "link": "https://www.nytimes.com/2025/08/10/technology/us-government-nvidia-amd-chips-china.html",
    "summary": "In a highly unusual arrangement with President Trump, the companies are expected to kick 15 percent of what they make in China to the U.S. government."
  },
  {
    "title": "What the Nvidia Chip Payoff Deal Says About Trump’s Trade War",
    "link": "https://www.nytimes.com/2025/08/11/business/dealbook/nvidia-amd-chip-payoff-trump.html",
    "summary": "A deal for Nvidia and AMD to give the Trump administration a cut of chip sales to China raises questions about national security and trade policy goals."
  },
  {
    "title": "A Sidelined Zelensky Warns That Russia Will Try to Deceive the U.S.",
    "link": "https://www.nytimes.com/2025/08/11/world/europe/ukraine-russia-putin-zelensky-alaska-talks.html",
    "summary": "Ukraine fears that the Kremlin will try to convince President Trump at U.S.-Russian talks in Alaska that Ukraine, not Russia, is the obstacle to peace."
  },
  {
    "title": "Why A.I. Should Make Parents Rethink Posting Photos of Their Children Online",
    "link": "https://www.nytimes.com/2025/08/11/technology/personaltech/ai-kids-photos.html",
    "summary": "Artificial intelligence apps generating fake nudes, amid other privacy concerns, make “sharenting” far riskier than it was just a few years ago."
  },
  {
    "title": "I Never Understood Our Data-Saturated Life Until a Hurricane Shut It Down",
    "link": "https://www.nytimes.com/2025/08/11/magazine/hurricane-disaster-information-media-blackout.html",
    "summary": "When Helene disconnected my part of North Carolina for weeks, my neighbors and I had to relearn old ways of knowing what was happening — and what wasn’t."
  },
  {
    "title": "America’s Clean Hydrogen Dreams Are Fading, Again",
    "link": "https://www.nytimes.com/2025/08/11/business/energy-environment/hydrogen-clean-energy.html",
    "summary": "The market for the clean-burning fuel remains nascent, costs are rising, and Congress just put a lucrative tax credit out of reach for many companies."
  },
  {
    "title": "Ford Rejigs E.V. Plans After Suffering Billions in Losses",
    "link": "https://www.nytimes.com/2025/08/11/business/ford-electric-vehicles.html",
    "summary": "Ford, which once had a lead on other established automakers, said on Monday that it will use new materials and methods to lower the costs of electric vehicles."
  },
  {
    "title": "As Trump Curbs Wind Farms, Orsted Plans $9.4 Billion Share Offering",
    "link": "https://www.nytimes.com/2025/08/11/business/trump-wind-farm-orsted.html",
    "summary": "Shares of the Danish renewable energy developer tumbled after it said it would issue more stock to raise funds instead of divesting a stake in a wind farm off the U.S. coast."
  },
  {
    "title": "A Haven for English in the Most French of North American Cities",
    "link": "https://www.nytimes.com/2025/08/11/world/canada/quebec-city-morrin-centre.html",
    "summary": "For Quebec City’s tiny English-speaking community, a former jail turned library serves as an essential sanctuary in a metropolis where the domination of French is enshrined in law."
  },
  {
    "title": "How Short-Term Thinking Is Destroying America",
    "link": "https://www.nytimes.com/2025/08/11/opinion/america-short-term-thinking.html",
    "summary": "Trump may be able to escape the consequences of his actions; the rest of us cannot."
  },
  {
    "title": "Trump Got It Right When He Killed the De Minimis Trade Provision",
    "link": "https://www.nytimes.com/2025/08/11/opinion/trump-trade-deminimis-china.html",
    "summary": "The de minimis policy let China benefit at our expense."
  },
  {
    "title": "North Korea’s Next Leader?",
    "link": "https://www.nytimes.com/2025/08/11/briefing/north-koreas-succession-kim-jong-un.html",
    "summary": "Kim Jong-un’s daughter, Kim Ju-ae, is perhaps being primed to take control of the regime one day."
  },
  {
    "title": "At Least One Dead in U.S. Steel Plant Explosion in Pennsylvania, Authorities Say",
    "link": "https://www.nytimes.com/2025/08/11/us/us-steel-explosion-pennsylvania.html",
    "summary": "Dozens of people were injured and some were trapped in rubble at a coke plant in Clairton, Pa., near Pittsburgh, rescue workers said."
  },
  {
    "title": "Miguel Uribe, Colombian Senator Shot at Campaign Event, Dies at 39",
    "link": "https://www.nytimes.com/2025/08/11/world/americas/miguel-uribe-turbay-dead-colombia-assassination.html",
    "summary": "Mr. Uribe, a presidential hopeful, was shot in June at a campaign rally in Bogotá in an attack that shocked the nation."
  },
  {
    "title": "Finland Charges Ship’s Crew Members in Slashing of Undersea Cables",
    "link": "https://www.nytimes.com/2025/08/11/world/europe/finland-cable-severing-charges-russia-shadow-fleet.html",
    "summary": "The tanker, the Eagle S, was detained last December."
  },
  {
    "title": "Netflix Signs New, Looser Deal With Prince Harry and Meghan Markle",
    "link": "https://www.nytimes.com/2025/08/11/business/media/netflix-prince-harry-meghan-markle-deal.html",
    "summary": "The streaming giant signed a new deal with the production company for the Duke and Duchess of Sussex that is much less extensive than an earlier arrangement."
  }
]