[
  {
    "title": "Trump and Mamdani Strike Optimistic Tone, Sidestepping Past Critiques",
    "link": "https://www.nytimes.com/2025/11/21/us/politics/trump-mamdani-white-house-meeting.html",
    "summary": "The meeting between President Trump and the incoming mayor of New York City was strikingly warm for two men who had expressed deep concerns about each other’s leadership."
  },
  {
    "title": "‘Fascist’? ‘Communist’? For an Afternoon, Trump and Mamdani Were Just 2 Guys From Queens.",
    "link": "https://www.nytimes.com/2025/11/21/us/politics/trump-mamdani-scene.html",
    "summary": "Acid insults were set aside as New York’s mayor-elect and the president promoted their shared goals."
  },
  {
    "title": "Trump and Mamdani’s News Conference: Read the Transcript",
    "link": "https://www.nytimes.com/2025/11/22/nyregion/trump-mamdani-meeting-press-conference-transcript.html",
    "summary": "President Trump and Zohran Mamdani, the mayor-elect of New York City, spoke to the news media after their first face-to-face meeting."
  },
  {
    "title": "The Trump-Mamdani Buddy Movie? It’s Getting Mixed Reviews.",
    "link": "https://www.nytimes.com/2025/11/21/nyregion/mamdani-trump-reaction-meeting.html",
    "summary": "Zohran Mamdani and President Trump seemed to cast aside their months of traded insults, a development that seemed good for New York City but odd to some followers."
  },
  {
    "title": "Marjorie Taylor Greene Says She Will Resign in January, After Break From Trump",
    "link": "https://www.nytimes.com/2025/11/21/us/politics/marjorie-taylor-greene-resigns.html",
    "summary": "Ms. Greene, who was elected in 2020, had positioned herself as a die-hard Trump supporter until a series of recent ruptures with the president, who recently unendorsed her."
  },
  {
    "title": "Supreme Court, For Now, Keeps in Place Texas Republican-Friendly Congressional Map",
    "link": "https://www.nytimes.com/2025/11/21/us/politics/supreme-court-texas-congressional-map.html",
    "summary": "State officials have asked the justices to allow it to use a newly redrawn map for the 2026 midterms, part of a nationwide redistricting push by President Trump."
  },
  {
    "title": "RFK Jr. Says He Instructed CDC to Change Vaccines and Autism Language on Website",
    "link": "https://www.nytimes.com/2025/11/21/us/politics/rfk-jr-cdc-vaccines-autism-website.html",
    "summary": "In an interview, Health Secretary Robert F. Kennedy Jr. cited gaps in vaccine safety research. His critics say he is ignoring a larger point: Vaccines save lives."
  },
  {
    "title": "Sean Duffy Asks Travelers to ‘Bring Civility Back’ to Airports in New PSA",
    "link": "https://www.nytimes.com/2025/11/21/travel/sean-duffy-airlines-manners-video.html",
    "summary": "The secretary of transportation kicked off a new civility campaign on Wednesday called “The Golden Age of Travel Starts With You.”"
  },
  {
    "title": "What Is Trump’s 28-Point Plan to End Russia’s War in Ukraine?",
    "link": "https://www.nytimes.com/2025/11/22/world/europe/trump-russia-ukraine-peace-plan.html",
    "summary": "President Trump is pressing Kyiv to accept an outcome that yields to President Vladimir V. Putin’s demands."
  },
  {
    "title": "Russian Exiles See Europe Visa Rule as Blow Against Them, Not Putin",
    "link": "https://www.nytimes.com/2025/11/22/world/europe/russia-visas-ukraine.html",
    "summary": "The European Union said the decision was prompted by sabotage attacks in Europe, but Russians living abroad say Europe is punishing ordinary people."
  },
  {
    "title": "As Trump Pushes on Russia-Ukraine Peace Plan, Zelensky’s Options Are Narrowing",
    "link": "https://www.nytimes.com/2025/11/21/world/europe/ukraine-russia-us-peace-plan.html",
    "summary": "The Ukrainian president’s options are narrowing as he is confronted with a 28-point proposal drafted by American and Russian envoys."
  },
  {
    "title": "Lawrence Krauss, Martin Nowak: The Professors Who Stayed Close With Epstein",
    "link": "https://www.nytimes.com/2025/11/21/us/professors-jeffrey-epstein-relationships.html",
    "summary": "Even as the disgraced financier’s crimes were revealed, newly released emails show how academics at top universities stuck by Jeffrey Epstein, often seeking his help and offering it in return."
  },
  {
    "title": "How Olivia Nuzzi and Ryan Lizza Became Main Characters on Social Media",
    "link": "https://www.nytimes.com/2025/11/21/style/olivia-nuzzi-ryan-lizza-rfk-jr-affair.html",
    "summary": "Love, politics and ethics collided as Olivia Nuzzi and Ryan Lizza went at it in a media sphere that rewards private revelations."
  },
  {
    "title": "Vanity Fair Is Reviewing Its Ties to Olivia Nuzzi",
    "link": "https://www.nytimes.com/2025/11/21/style/vanity-fair-olivia-nuzzi.html",
    "summary": "The magazine, which recently hired the journalist, said it had been “taken by surprise” by new claims in an essay by her former fiancé, Ryan Lizza."
  },
  {
    "title": "Texas Gov. Greg Abbott Moves to Restrict Muslims, Leaving Some Concerned",
    "link": "https://www.nytimes.com/2025/11/21/us/abbott-texas-muslim-investigation.html",
    "summary": "Two decisions by the Texas governor this week, including directing authorities to investigate an Islamic organization, come as the state sees an increase in anti-Muslim rhetoric."
  },
  {
    "title": "Texas A&M Wrong to Fire Professor Melissa McCoul Over Gender Lesson, Panel Rules",
    "link": "https://www.nytimes.com/2025/11/21/us/texas-am-professor-gender-lesson-panel-ruling.html",
    "summary": "The firing put the school at the center of national debates over gender identity and academic freedom. A faculty panel ruled unanimously against the termination."
  },
  {
    "title": "U.S. Defends Decision to Seek Death Penalty for Luigi Mangione",
    "link": "https://www.nytimes.com/2025/11/22/nyregion/luigi-mangione-death-penalty.html",
    "summary": "Prosecutors argue that Mr. Mangione can receive a fair trial, despite his lawyers’ concerns about “damaging” statements from the attorney general about the murder case."
  },
  {
    "title": "Eli Lilly, Drug Maker of Zepbound and Mounjaro, Reaches $1 Trillion in Value",
    "link": "https://www.nytimes.com/2025/11/21/health/eli-lilly-one-trillion-value-pharmaceuticals.html",
    "summary": "The 150-year-old drugmaker is the first company in health care to hit the milestone."
  },
  {
    "title": "Watch a ‘Wonderful’ Moment From ‘Wicked: For Good’",
    "link": "https://www.nytimes.com/2025/11/21/movies/wicked-for-good-clip.html",
    "summary": "The director Jon M. Chu narrates a sequence from his film featuring Ariana Grande, Cynthia Erivo and Jeff Goldblum performing the song “Wonderful.”"
  },
  {
    "title": "What to Know: Trump Labels Nigeria’s Christian Violence a ‘Genocide’",
    "link": "https://www.nytimes.com/2025/11/21/world/africa/nigeria-trump-genocide-claims.html",
    "summary": "There are widespread attacks across the country affecting many religious and ethnic groups. Many of them defy a simple explanation."
  },
  {
    "title": "At Least 52 Kidnapped From Nigeria School in Second Mass Abduction This Week",
    "link": "https://www.nytimes.com/2025/11/21/world/africa/nigeria-school-abduction.html",
    "summary": "Students and teachers were taken captive from a Catholic school in the latest in a wave of such attacks in the country."
  },
  {
    "title": "The Moon Was an Inside Job",
    "link": "https://www.nytimes.com/2025/11/20/science/moon-collision-earth-theia.html",
    "summary": "New research suggests that Theia, the object whose collision with Earth is theorized to have caused the formation of the moon, came from closer to the sun."
  },
  {
    "title": "Saturn’s Rings Seem as if They’re About to Disappear: Here’s Why",
    "link": "https://www.nytimes.com/2025/11/21/science/saturn-rings-disappear.html",
    "summary": "During the weekend, the orbits of Earth and Saturn will combine to create an interplanetary optical illusion for anyone with a good telescope and clear skies."
  },
  {
    "title": "Mamdani’s Surreal Meeting With Trump Is the Latest in a Pragmatic Month",
    "link": "https://www.nytimes.com/2025/11/21/opinion/zohran-mamdani-trump-meeting-white-house.html",
    "summary": "Since his election, Zohran Mamdani has made some surprisingly pragmatic or traditional choices — including his surreal meeting with President Trump."
  },
  {
    "title": "America Is Setting a Trap for Itself",
    "link": "https://www.nytimes.com/2025/11/21/opinion/america-china-trump-g20.html",
    "summary": "The United States, not China, seems determined to upend the global order."
  },
  {
    "title": "Tyson Foods to Shut Major Beef Facility in Nebraska",
    "link": "https://www.nytimes.com/2025/11/21/business/tyson-lexington-nebraska-closing.html",
    "summary": "The processing plant, in Lexington, employs more than 3,000 workers. It is expected to close in January."
  },
  {
    "title": "How Newsom and Trump Have Made California the Unlikely Center of 2025 Politics",
    "link": "https://www.nytimes.com/2025/11/21/us/politics/newsom-trump-california-politics.html",
    "summary": "Thanks to Newsom, Trump and redistricting, the deep-blue state is in the thick of national politics."
  },
  {
    "title": "A Colossal, Hidden Pile of Trash Ignites Outcry in Britain",
    "link": "https://www.nytimes.com/2025/11/21/world/europe/trash-britain-illegal-dumping.html",
    "summary": "The discovery of a mountain of garbage near a highway is the latest example of what experts say is a growing problem of criminal organizations profiting from illegal dumping."
  },
  {
    "title": "3 Children Are Injured in Grizzly Bear Attack in British Columbia",
    "link": "https://www.nytimes.com/2025/11/21/world/canada/canada-bear-attack-children.html",
    "summary": "The children were among 11 people who were hurt when a grizzly attacked a school group in a remote part of British Columbia, the authorities said."
  }
]