[
  {
    "title": "Man Tackled and Disarmed One of the Bondi Beach Gunmen, Video Shows",
    "link": "https://www.nytimes.com/2025/12/14/world/australia/bondi-beach-gunman-tackled-video.html",
    "summary": "The video, verified by The New York Times, shows a man sneaking up on one of the shooters who targeted a Hanukkah celebration in Sydney on Sunday."
  },
  {
    "title": "What We Know About the Bondi Beach Shooting in Australia",
    "link": "https://www.nytimes.com/2025/12/14/world/australia/what-we-know-bondi-shooting.html",
    "summary": "Two gunmen opened fire at dozens of people who were at a Jewish holiday event. At least 15 people were killed in the attack, and so was one of the shooters, the police said."
  },
  {
    "title": "Gunshots at Brown University, Then 12 Hours of Lockdown and Fear",
    "link": "https://www.nytimes.com/2025/12/14/us/gunshots-lockdown-brown-university.html",
    "summary": "Students sheltered in place in classrooms and basements, waiting for the all clear."
  },
  {
    "title": "Hospitalized Brown Student Describes Hiding from Shooter",
    "link": "https://www.nytimes.com/2025/12/14/us/brown-shooting-witness-spencer-yang.html",
    "summary": "The student, in his first year at Brown, described helping others who were more seriously injured than he was as they hid in their classroom."
  },
  {
    "title": "Rob Reiner, Actor Who Went on to Direct Classic Films, Dies at 78",
    "link": "https://www.nytimes.com/2025/12/15/movies/rob-reiner-dead.html",
    "summary": "Mr. Reiner, who was in “All in the Family,” directed films including “This Is Spinal Tap,” “When Harry Met Sally …,” “The Princess Bride” and “A Few Good Men.”"
  },
  {
    "title": "Zelensky Offers Compromise for New Round of Ukraine Peace Talks",
    "link": "https://www.nytimes.com/2025/12/14/world/europe/zelensky-ukraine-peace-talks.html",
    "summary": "Ukraine’s president met with U.S. negotiators about plans to end the war with Russia. He said he would give up hopes of joining NATO in exchange for security guarantees."
  },
  {
    "title": "California Hires Former C.D.C. Officials Who Criticized Trump Administration",
    "link": "https://www.nytimes.com/2025/12/14/us/california-newsom-cdc-trump.html",
    "summary": "A former director of the Centers for Disease Control and Prevention and a former chief medical officer of the agency will advise the state on public health issues."
  },
  {
    "title": "Inside the Clintons’ Fight to Avoid Testifying in the House Epstein Inquiry",
    "link": "https://www.nytimes.com/2025/12/14/us/politics/clintons-epstein-inquiry.html",
    "summary": "Bill and Hillary Clinton have repeatedly offered to provide sworn statements, but Representative James R. Comer has threatened to hold them in contempt of Congress if they fail to appear."
  },
  {
    "title": "Jimmy Lai’s Life, in Photos and Video",
    "link": "https://www.nytimes.com/2025/12/14/world/asia/jimmy-lai-photos-video.html",
    "summary": "He attributed his rags-to-riches ascent to the freedoms of Hong Kong, and has paid a hefty price for defending them."
  },
  {
    "title": "José Antonio Kast Elected President of Chile",
    "link": "https://www.nytimes.com/2025/12/14/world/americas/chile-election-kast.html",
    "summary": "José Antonio Kast has promised to reverse Chile’s recent surge in violent crime. He also says he will deport undocumented migrants."
  },
  {
    "title": "Chile Poised for Right-Wing Victory as Crime Fears Sweep Latin America",
    "link": "https://www.nytimes.com/2025/12/13/world/americas/chile-election-latin-america-crime.html",
    "summary": "Security has become a top concern for voters across the region who are calling for iron-fisted measures. In Chile, the issue is pushing the country to the right."
  },
  {
    "title": "His Job Is to Make the Subway Accessible. His Own Life Fuels His Work.",
    "link": "https://www.nytimes.com/2025/12/14/nyregion/q-arroyo-subway-accessible.html",
    "summary": "Quemuel Arroyo, the New York transit system’s chief accessibility officer, has used a wheelchair for half his life. He understands how difficult it is to navigate the subway."
  },
  {
    "title": "Kenya Is Betting Its Economy on Women Willing to Risk It All",
    "link": "https://www.nytimes.com/2025/12/14/world/africa/kenya-saudi-arabia-worker-abuse.html",
    "summary": "We set out to investigate worker abuse in Saudi Arabia. We found a system that begins exploiting them before they ever leave home."
  },
  {
    "title": "The Bondi Beach Shooting Is What ‘Globalize the Intifada’ Looks Like",
    "link": "https://www.nytimes.com/2025/12/14/opinion/bondi-beach-shooting.html",
    "summary": "When a slogan’s real meaning comes true."
  },
  {
    "title": "Trump Said It Would Be Easy to Free Jimmy Lai. He Should Prove It.",
    "link": "https://www.nytimes.com/2025/12/14/opinion/china-hong-kong-jimmy-lai.html",
    "summary": "The Hong Kong publisher’s fate will reveal whether democracies still have the resolve to defend their own values."
  },
  {
    "title": "U.S. Military Plane and JetBlue Flight Nearly Collided Over Caribbean, Radio Traffic Shows",
    "link": "https://www.nytimes.com/2025/12/14/world/americas/jetblue-venezuela-midair-collision-us-air-force.html",
    "summary": "The Air Force refueling tanker was flying without its location transponder activated and could not be detected by air traffic control."
  },
  {
    "title": "Syrian Who Killed U.S. Soldiers Was Member of Security Forces, Officials Say",
    "link": "https://www.nytimes.com/2025/12/14/world/middleeast/syria-isis-attack.html",
    "summary": "The gunman who killed two U.S. soldiers and an American civilian interpreter had been set to be dismissed from the security forces over his extremist views, U.S. and Syrian officials said."
  },
  {
    "title": "New York City Gets Its First Big Snowfall of the Season",
    "link": "https://www.nytimes.com/2025/12/14/weather/snowstorm-nyc-weather.html",
    "summary": "The city has not seen this much snow this early in the season since 2018, the National Weather Service said."
  },
  {
    "title": "Jeanette Winter, Who Told Children About Artists’ Lives, Dies at 86",
    "link": "https://www.nytimes.com/2025/12/14/obituaries/jeanette-winter-dead.html",
    "summary": "Her picture books found models of perseverance and imagination in figures like Emily Dickinson, Georgia O’Keeffe and Benny Goodman."
  }
]