[
  {
    "title": "Trump Predicts More Indictments After Comey and Claims It’s Not Revenge",
    "link": "https://www.nytimes.com/2025/09/26/us/politics/trump-comey-revenge.html",
    "summary": "President Trump has made clear that he expects the Justice Department to mete out punishment to his perceived enemies."
  },
  {
    "title": "Trump’s Repeated Attacks May Undercut Case Against Comey",
    "link": "https://www.nytimes.com/2025/09/27/us/politics/trump-comey-vindictive-prosecution.html",
    "summary": "The president’s voluble vitriol could provide defense lawyers with an avenue to protect the very people he most wants to punish."
  },
  {
    "title": "Justice Dept. Seeks Information on Fani Willis, Georgia D.A. Who Prosecuted Trump",
    "link": "https://www.nytimes.com/2025/09/26/us/justice-department-fani-willis-trump.html",
    "summary": "Federal investigators have subpoenaed records related to travel they believe Fani Willis took around the time of last year’s election, but it was not immediately clear why."
  },
  {
    "title": "Trump Fired a U.S. Attorney Who Insisted on Following a Court Order",
    "link": "https://www.nytimes.com/2025/09/26/us/trump-fires-us-attorney-california-immigration.html",
    "summary": "The top federal prosecutor in Sacramento was fired hours after she reminded a Border Patrol chief to abide by court-ordered restrictions on immigration raids."
  },
  {
    "title": "Trump Says He Has Ordered Troops to Portland, Oregon, to Protect ICE Facilities",
    "link": "https://www.nytimes.com/2025/09/27/us/politics/trump-portland-troops.html",
    "summary": "The president characterized Immigration and Customs Enforcement facilities as being under siege from domestic terrorists."
  },
  {
    "title": "Give In or Fight Back? Colleges Are Torn on How to Respond to Trump.",
    "link": "https://www.nytimes.com/2025/09/27/us/trump-university-california-berkeley-tactics.html",
    "summary": "The University of California, one of the Trump administration’s biggest targets so far, is in an uproar over how to respond to the president’s attacks. So is the rest of higher education."
  },
  {
    "title": "FBI Fires Agents Seen Kneeling During 2020 Racial Justice Protests",
    "link": "https://www.nytimes.com/2025/09/27/us/politics/kash-patel-fbi-firing.html",
    "summary": "Agents group says the latest dismissals are part of a “dangerous pattern” of weakening the nation’s top law enforcement agency."
  },
  {
    "title": "Netanyahu’s Defiant U.N. Speech Aimed at Home as Well as the World",
    "link": "https://www.nytimes.com/2025/09/27/world/middleeast/israel-netanyahu-united-nations.html",
    "summary": "The Israeli prime minister faced walkouts and protests at the United Nations, but signaled that resisting Palestinian statehood could become the core of his appeal to Israeli voters."
  },
  {
    "title": "Doctors Without Borders Closes in Gaza City as Israel Intensifies Offensive",
    "link": "https://www.nytimes.com/2025/09/27/world/middleeast/gaza-hospitals-doctors-without-borders.html",
    "summary": "Doctors Without Borders pulled its staff from Gaza City as the medical system buckled. The U.N. has warned that more hospitals may have to close."
  },
  {
    "title": "Trump Displays Little Interest in Fostering Unity Amid Political Violence",
    "link": "https://www.nytimes.com/2025/09/27/us/politics/political-violence-kirk-trump.html",
    "summary": "After an assassination attempt, Gov. George Wallace, the segregationist, got a surprise visitor: Shirley Chisholm, the first Black woman elected to Congress. Could this happen today?"
  },
  {
    "title": "Onstage, Chappell Roan Is a Powerhouse. And Exactly Where She Wants to Be.",
    "link": "https://www.nytimes.com/2025/09/27/arts/music/chappell-roan-damsels-dangerous-things-tour.html",
    "summary": "The singer’s Visions of Damsels & Other Dangerous Things Tour highlights how she continues to deviate from the rising pop star’s expected playbook."
  },
  {
    "title": "New Retail Leaders Confront Trump’s Tariffs, Policy Shifts and Weak Spending",
    "link": "https://www.nytimes.com/2025/09/27/business/trump-tariffs-policies-economy-retail.html",
    "summary": "New retail C.E.O.s are facing unexpected challenges, like tariffs and worried shoppers, as they try to address existing ones."
  },
  {
    "title": "Oura Heath’s C.E.O. Knows the Secret to Better Sleep",
    "link": "https://www.nytimes.com/2025/09/27/business/oura-ring-tom-hale.html",
    "summary": "Oura Health makes a pricey smart ring that busy executives, celebrities and others use to track health measures like their sleep patterns. It expects $1 billion in sales this year."
  },
  {
    "title": "Des Moines Schools Superintendent Ian Roberts Detained by ICE, Officials Say",
    "link": "https://www.nytimes.com/2025/09/26/us/des-moines-schools-ice-immigration.html",
    "summary": "Federal immigration officials said the superintendent had received a deportation order in May 2024 and fled from agents when they approached him on Friday."
  },
  {
    "title": "His Parents Disappeared. In a TV Studio, He Confessed to Killing Them.",
    "link": "https://www.nytimes.com/2025/09/27/nyregion/albany-parent-murders-interview.html",
    "summary": "After investigators came looking, Lorenz Kraus told a reporter he had strangled Franz and Theresia Kraus eight years ago. Two bodies were buried in their backyard."
  },
  {
    "title": "Frida Kahlo’s Prequel: A New Museum Shows Her Family Roots",
    "link": "https://www.nytimes.com/2025/09/27/arts/design/frida-kahlo-museum-mexico-city.html",
    "summary": "In a former residence in Mexico City, passed down through the Kahlo family, it presents an intimate side of the Mexican painter’s life."
  },
  {
    "title": "Iowa Matters Less Than Ever for Democrats, but They Can’t Quit It",
    "link": "https://www.nytimes.com/2025/09/27/us/politics/iowa-democrats-president.html",
    "summary": "The state no longer goes first for the party’s presidential nomination process, but ambitious politicians with an eye toward 2028 keep showing up. It’s “the gravitational pull,” as one Iowa Democrat put it."
  },
  {
    "title": "Why Comey Should Not Have Been Indicted, According to Trump",
    "link": "https://www.nytimes.com/2025/09/27/opinion/james-comey-indictment.html",
    "summary": "The best case against indicting James Comey is the one the president made for firing him."
  },
  {
    "title": "We’re All Going to Die — Soonish!",
    "link": "https://www.nytimes.com/2025/09/27/opinion/grok-ai-companions-x.html",
    "summary": "Even with big blue eyes or amazing pecs, A.I.’s allure can be deadly."
  },
  {
    "title": "Banner Year",
    "link": "https://www.nytimes.com/2025/09/27/briefing/banner-year.html",
    "summary": "Milestone birthdays occasion consideration of what we’ve done with our lives, and what we want to do with the time to come."
  },
  {
    "title": "Do You Use A.I. Chatbots for Health Advice?",
    "link": "https://www.nytimes.com/2025/09/25/well/ai-chatbots-health.html",
    "summary": "We want to hear about it."
  },
  {
    "title": "For Want of a Ferryman, a Two-Century U.S.-Canada Link Is Severed",
    "link": "https://www.nytimes.com/2025/09/27/world/canada/horne-ferry-ontario-canada-new-york.html",
    "summary": "With the closing of a crossing between a sleepy Ontario island and a village in New York State, islanders face modest inconvenience — and the end of an era."
  },
  {
    "title": "‘Biometric Exit’ Quietly Expands Across U.S. Airports, Unnerving Some",
    "link": "https://www.nytimes.com/2025/09/26/travel/airports-biometric-exit-program.html",
    "summary": "The program, in which federal officers take departing international passengers’ photos, is set to grow, raising privacy concerns."
  },
  {
    "title": "Hawaiian Village Rebuilds With Modular Tiny Homes After Maui Wildfire Destruction",
    "link": "https://www.nytimes.com/2025/09/27/headway/lahaina-hawaii-modular-homes-wildfires.html",
    "summary": "After Lahaina burned in August 2023, the state invested in a modular home development, hoping to nurture community and leave behind permanent infrastructure."
  },
  {
    "title": "Get Ready for Higher Health Insurance Premiums Next Year",
    "link": "https://www.nytimes.com/2025/09/26/your-money/health-insurance-premiums-increase.html",
    "summary": "Employers say they are facing the biggest increase in health costs in more than a decade — almost 9 percent on average. Workers’ best option, experts say, is to carefully weigh various plans."
  }
]