[
  {
    "title": "The Forces Behind Nepal’s Explosive Gen Z Protests: What to Know",
    "link": "https://www.nytimes.com/2025/09/09/world/asia/nepal-protests-gen-z-social-media.html",
    "summary": "A recent ban on social media brought young people to the streets, but they came filled with grievances that have built up over years."
  },
  {
    "title": "Protests Against Nepal’s Social Media Ban Show Resistance to a Global Censorship Trend",
    "link": "https://www.nytimes.com/2025/09/09/world/asia/nepal-protests-social-media-ban-censorship.html",
    "summary": "Nepal’s recent social media ban, part of a global censorship trend, helped set off widespread unrest, forcing the government to reverse course."
  },
  {
    "title": "Inside Epstein’s ‘Birthday Book’ Apparently Signed by Trump",
    "link": "https://www.nytimes.com/2025/09/09/business/jeffrey-epstein-birthday-book.html",
    "summary": "The book containing 50th birthday tributes to Jeffrey Epstein was released on Monday by the House Oversight Committee."
  },
  {
    "title": "Trump Denies Epstein Birthday Drawing, but Signature Matches Personal Letters",
    "link": "https://www.nytimes.com/2025/09/08/us/politics/trump-signature-epstein-letter.html",
    "summary": "Donald Trump’s signature has evolved over the years, but when signing just his first name, he often includes the same flourish at the end."
  },
  {
    "title": "Israel Targeted Hamas Leadership in Qatar Strike",
    "link": "https://www.nytimes.com/2025/09/09/world/middleeast/israel-hamas-doha-qatar-strike.html",
    "summary": "The Gulf nation of Qatar has been trying to negotiate a cease-fire in the conflict. The attack threatened to destabilize those peace efforts."
  },
  {
    "title": "Israel Orders Total Evacuation of Gaza City, Threatening Full Invasion",
    "link": "https://www.nytimes.com/2025/09/09/world/middleeast/israel-gaza-city-evacuation.html",
    "summary": "Hundreds of thousands will have to decide whether to risk staying put or fleeing to ruined and overcrowded areas in the south as Israel looks set to launch an operation to take over the entire city."
  },
  {
    "title": "Iran and U.N. Watchdog Meet to Discuss Resuming Nuclear Inspections",
    "link": "https://www.nytimes.com/2025/09/09/world/europe/iran-iaea-nuclear-inspections.html",
    "summary": "Iran has not allowed inspections since its nuclear sites were bombed by Israel and the United States in June, but it hopes to stave off Western economic sanctions."
  },
  {
    "title": "Job Growth Revised Down by Nearly a Million, Updated BLS Data Shows",
    "link": "https://www.nytimes.com/2025/09/09/business/jobs-revisions-economy-fed.html",
    "summary": "Preliminary annual revisions could add to political pressure on the agency that produces the data."
  },
  {
    "title": "Gabbard Retracted Intelligence Report on Venezuela",
    "link": "https://www.nytimes.com/2025/09/09/us/politics/gabbard-intelligence-report-venezuela.html",
    "summary": "The report, which remains classified, described work by Richard Grenell, a former top intelligence official in the Trump administration."
  },
  {
    "title": "In New Book, Think Tank Behind Project 2025 Takes On the Constitution",
    "link": "https://www.nytimes.com/2025/09/09/us/politics/heritage-foundation-constitution-book.html",
    "summary": "The Heritage Foundation’s clause-by-clause analysis, to be published next month, is an originalist manifesto and a showcase for aspiring Supreme Court nominees."
  },
  {
    "title": "The Lone G.O.P. Governor Opposing Trump’s War on Offshore Wind",
    "link": "https://www.nytimes.com/2025/09/09/climate/youngkin-virginia-offshore-wind-trump.html",
    "summary": "Gov. Glenn Youngkin, Republican of Virginia, has championed a wind farm under construction off the coast of his state. He’s trying to persuade President Trump to leave it alone."
  },
  {
    "title": "Nick Fuentes: A White Nationalist Problem for the Right",
    "link": "https://www.nytimes.com/2025/09/09/us/politics/nick-fuentes-trump.html",
    "summary": "For years, conservatives hoped that the notorious white nationalist would go away. Instead, Mr. Fuentes has gained more traction, even while opposing the president."
  },
  {
    "title": "Damar Hamlin Nearly Died on the Football Field. He Had a Plan B.",
    "link": "https://www.nytimes.com/2025/09/09/nyregion/damar-hamlin-buffalo-bills-cardiac-arrest.html",
    "summary": "Damar Hamlin’s heart stopped beating after a tackle on “Monday Night Football” in 2023. He wants to be known for more than that."
  },
  {
    "title": "A Man From China Pursued U.S. Asylum. Deportation Sent Him Home Again",
    "link": "https://www.nytimes.com/2025/09/09/world/asia/china-deportation-us-asylum.html",
    "summary": "A Chinese man crossed dangerous jungles to enter the United States, in a failed bid for asylum. After being deported home in 2023, he faced a choice: stay or try to leave again?"
  },
  {
    "title": "Who Is Lachlan Murdoch, the Media Prince Who Would Be King",
    "link": "https://www.nytimes.com/2025/09/09/business/media/lachlan-murdoch-fox-news-corp.html",
    "summary": "A new deal gives him control of his family’s media empire, including Fox News, for probably decades to come."
  },
  {
    "title": "Mamdani Holds Huge Lead in Mayor’s Race, Times/Siena Poll Finds",
    "link": "https://www.nytimes.com/2025/09/09/nyregion/mayor-poll-mamdani-cuomo.html",
    "summary": "Zohran Mamdani, the Democratic nominee in the New York City mayoral race, is way ahead of his three rivals, but his lead would diminish considerably if the field shrank to a two-man race."
  },
  {
    "title": "Mamdani Leads Cuomo Head-to-Head, With a Turnout Twist",
    "link": "https://www.nytimes.com/2025/09/09/upshot/poll-nyc-mamdani-cuomo.html",
    "summary": "The Times/Siena poll shows Mamdani would have an edge among likely voters, but Cuomo would lead among all registered voters."
  },
  {
    "title": "To Shrink Mamdani’s Lead, Cuomo Seeks to Broaden His Campaign Team",
    "link": "https://www.nytimes.com/2025/09/09/nyregion/cuomo-campaign-manager-goldner.html",
    "summary": "Former Gov. Andrew M. Cuomo is hiring new top aides for his independent bid for mayor, including a campaign manager who worked for Rahm Emanuel in Chicago."
  },
  {
    "title": "The Starbucks C.E.O. Trying Hard to Deliver Your Drink Right, and Fast",
    "link": "https://www.nytimes.com/2025/09/09/business/starbucks-turnaround-brian-niccol.html",
    "summary": "Improved service, better seating and heartfelt messages are at the heart of Brian Niccol’s turnaround plan, but baristas say they’re under pressure."
  },
  {
    "title": "U.S. Wildfire Fighters to Mask Up After Decades-Long Ban on Smoke Protections",
    "link": "https://www.nytimes.com/2025/09/09/us/wildfires-masks-firefighters.html",
    "summary": "The Forest Service is changing course as it faces growing pressure over firefighters who are falling ill with cancer and other smoke-related illnesses."
  },
  {
    "title": "Wildfire Fighters, Unmasked in Toxic Smoke, Are Getting Sick and Dying",
    "link": "https://www.nytimes.com/2025/08/17/us/wildfire-firefighters-masks-smoke.html",
    "summary": "The U.S. Forest Service has fought decades of efforts to better protect its crews — sending them into smoke without masks or warnings about the risks."
  },
  {
    "title": "Macron Has No Good Options After Repeat Collapse of French Government",
    "link": "https://www.nytimes.com/2025/09/09/world/europe/macron-options-analysis.html",
    "summary": "The president, thwarted at home, has become increasingly frustrated and weakened at a critical moment for his country and Europe."
  },
  {
    "title": "‘The Off-Season Is Now Its Own Season’: Fall Travel Comes Into Its Own",
    "link": "https://www.nytimes.com/2025/09/08/travel/fall-travel.html",
    "summary": "No longer the secret of savvy travelers, autumn is becoming the season of choice for people looking to escape summer heat and overtourism. Hotels and tour companies are taking note."
  },
  {
    "title": "Experiencing Japan’s Fiery Autumnal Foliage",
    "link": "https://www.nytimes.com/2025/09/08/travel/japan-momijigari-autumn-foliage.html",
    "summary": "“Momijigari” means hunting autumn leaves and people consult forecasts and follow predictions to find the most beautiful displays. This itinerary adds history and a sense of spirituality to the colors."
  },
  {
    "title": "This Is What Criticism of the President Cost Me",
    "link": "https://www.nytimes.com/2025/09/09/opinion/poet-air-force-academy-cancellation.html",
    "summary": "As a civilian humanist, my presence might — for some attendees — invalidate my arguments; I wouldn’t be heard because of what I represent to the right."
  },
  {
    "title": "How MAHA Influencers Spread Conspiracies About Health Care",
    "link": "https://www.nytimes.com/2025/09/09/opinion/maha-health-wellness-influencers.html",
    "summary": "How does MAHA turn some health-conscious people against all health care? We found out."
  },
  {
    "title": "How States are Clashing on Abortion",
    "link": "https://www.nytimes.com/2025/09/09/briefing/how-states-are-clashing-on-abortion.html",
    "summary": "We explain the latest fight over reproductive rights."
  },
  {
    "title": "Late Night Misses the Defense Department Already",
    "link": "https://www.nytimes.com/2025/09/09/arts/television/late-night-department-of-war.html",
    "summary": "President Trump has renamed it the Department of War, “which is what people call the clearance section at TJ Maxx,” Jimmy Fallon said."
  },
  {
    "title": "Police Seek Suspect After Firefighters Find Dead Couple, One in Chains",
    "link": "https://www.nytimes.com/2025/09/09/nyregion/queens-couple-arson-homicide.html",
    "summary": "Rescuers who came to a burning house in Queens found a man, 77, bound in the basement and a woman, 78, dead on the first floor."
  },
  {
    "title": "The New Symbol of the Brazilian Right: the American Flag",
    "link": "https://www.nytimes.com/2025/09/09/world/americas/brazil-american-flag-nfl.html",
    "summary": "In a nod to President Trump, Brazil’s nationalist movement has adopted the stars and stripes. Now one flag could be the focus of an investigation involving the N.F.L."
  },
  {
    "title": "Russian Bomb Hits Crowd of Retirees, Killing at Least 23, Ukraine Says",
    "link": "https://www.nytimes.com/2025/09/09/world/europe/ukraine-bombing-donetsk-pensioners.html",
    "summary": "President Volodymyr Zelensky said that the strike on older people picking up their pensions should prompt a global response."
  },
  {
    "title": "12th Grade Reading Skills Hit a New Low",
    "link": "https://www.nytimes.com/2025/09/09/us/12th-grade-reading-skills-low-naep.html",
    "summary": "High school seniors had the worst reading scores since 1992 on a national test, a loss probably related to increases in screen time and the pandemic. Their math scores fell as well."
  }
]