[
  {
    "title": "Trump Organization Is Said to Be in Talks on a Saudi Government Real Estate Deal",
    "link": "https://www.nytimes.com/2025/11/15/world/middleeast/trump-organization-saudi-development-deal.html",
    "summary": "The chief executive of a Saudi firm says a Trump-branded project is “just a matter of time.” The Trump Organization’s major foreign partner is also signaling new Saudi deals."
  },
  {
    "title": "Dar Global Is the Trump Organization’s Key Foreign Partner",
    "link": "https://www.nytimes.com/2025/11/15/world/middleeast/dar-global-trump-org-saudi-mbs-business-deal-real-estate-licensing.html",
    "summary": "Dar Global bet big on the Trump name. It is now an essential foreign partner for the Trump Organization."
  },
  {
    "title": "Seven Days of Paralysis: Inside the BBC Crisis Over a Trump Documentary",
    "link": "https://www.nytimes.com/2025/11/15/world/europe/uk-bbc-crisis.html",
    "summary": "With board members and executives deadlocked over how to respond, the news organization kept silent for days, allowing a controversy to snowball."
  },
  {
    "title": "Gallego Pitches Demoralized Democrats on a Midterm Message",
    "link": "https://www.nytimes.com/2025/11/15/us/politics/ruben-gallego-democrats-midterms.html",
    "summary": "At a health care town hall in his swing state, Senator Ruben Gallego, Democrat of Arizona, test-drove his party’s new political pitch to an audience disappointed in the outcome of the shutdown."
  },
  {
    "title": "Fetterman Is Released From the Hospital After a Fall",
    "link": "https://www.nytimes.com/2025/11/15/us/john-fetterman-fall-hospital-released.html",
    "summary": "The Pennsylvania senator was hospitalized on Thursday after he fell during a morning walk near his home in Braddock, Pa. He required 20 stitches."
  },
  {
    "title": "Once He Was ‘Just Asking Questions.’ Now Tucker Carlson Is the Question.",
    "link": "https://www.nytimes.com/2025/11/15/us/politics/tucker-carlson-fuentes.html",
    "summary": "The conservative commentator has further fractured the right with his anti-Israel rhetoric and sympathy for a white nationalist. He’s not in the mood to apologize."
  },
  {
    "title": "Storm Pounds Southern California With Heavy Rains and Some Flooding",
    "link": "https://www.nytimes.com/2025/11/14/weather/california-rain-flood-storm-los-angeles-forecast.html",
    "summary": "An unusually powerful storm unleashed heavy rain, prompting concerns about mudslides and debris flows in wildfire burn scars. At least two deaths were linked to the storm."
  },
  {
    "title": "Epstein, Fuentes and Trump’s Political Erosion",
    "link": "https://www.nytimes.com/2025/11/15/opinion/epstein-trump-gop-fuentes.html",
    "summary": "In the Epstein saga, Trump is his own worst enemy."
  },
  {
    "title": "Trump Is Wrong About Fentanyl in Almost Every Way",
    "link": "https://www.nytimes.com/2025/11/15/opinion/fentanyl-trump-drug-war.html",
    "summary": "Everything the Trump administration is doing to stop the flow of drugs is just making the problem worse."
  },
  {
    "title": "Displaced Gazans Face More Misery as Torrential Rain Lashes Enclave",
    "link": "https://www.nytimes.com/2025/11/15/world/middleeast/gazan-winter-tent-camps.html",
    "summary": "Heavy rainfall and chilling winds have added to the challenges facing people still forced to live in tents in the devastated territory."
  },
  {
    "title": "4 Dead After Suspected Migrant Boat Overturns Near a San Diego Area Beach",
    "link": "https://www.nytimes.com/2025/11/15/us/panga-boat-capsizes-imperial-beach.html",
    "summary": "The boat capsized off the coast, officials said. Four people were taken to a hospital and one person was taken into custody."
  },
  {
    "title": "Todd Snider, Folk Singer With a Wry Wit, Dies at 59",
    "link": "https://www.nytimes.com/2025/11/15/arts/music/todd-snider-dead.html",
    "summary": "Mentored by the likes of Jimmy Buffett and John Prine, his big-hearted ballads told of heartache even as his humor revealed a steadfast optimism."
  }
]