[
  {
    "title": "U.S. Races to Sell Venezuelan Oil, Transforming Ties With Former Foe",
    "link": "https://www.nytimes.com/2026/01/14/world/americas/venezuela-oil-us-deal.html",
    "summary": "U.S. officials brokered the sale of hundreds of millions of dollars worth of Venezuelan oil to stabilize the country’s economy after capturing its president."
  },
  {
    "title": "U.S. Moves Some Personnel From Qatar Air Base as Trump Weighs Military Response to Iran",
    "link": "https://www.nytimes.com/2026/01/14/us/politics/us-base-qatar-iran.html",
    "summary": "Nonessential personnel were moved from Al Udeid Air Base in Qatar, an American site that could be a target of Iran if President Trump ordered an attack on the country."
  },
  {
    "title": "What are Trump’s Options in Iran?",
    "link": "https://www.nytimes.com/video/world/middleeast/100000010640541/what-are-trumps-options-in-iran.html",
    "summary": "President Trump has said that “help is on the way” for Iranian protesters. Amid reports that thousands of the protesters have been killed, our national security correspondent David E. Sanger describes what some of Mr. Trump’s options might be."
  },
  {
    "title": "Trump’s Gulf Allies Do Not Want Him to Bomb Iran",
    "link": "https://www.nytimes.com/2026/01/14/world/middleeast/gulf-trump-iran.html",
    "summary": "While several of the Gulf Arab countries harbor little love for Iran, they worry that the consequences of rising tensions could blow back on them."
  },
  {
    "title": "Iran Postpones Execution of Protester as Trump Threatens ‘Strong Action’",
    "link": "https://www.nytimes.com/2026/01/14/world/middleeast/iran-protests-soltani-execution-trump.html",
    "summary": "Iran had planned to put a 26-year-old protester to death amid the wave of unrest in the country, but apparently stood down for now."
  },
  {
    "title": "Congress Is Spurning Many of Trump’s Proposed Spending Cuts",
    "link": "https://www.nytimes.com/2026/01/14/us/politics/congress-trump-spending-cuts.html",
    "summary": "Months after the partisan clash that led to the longest shutdown in history, lawmakers have agreed on spending bills that look far different from what the president wanted."
  },
  {
    "title": "Food Prices Keep Climbing, Rattling Consumers and Trump",
    "link": "https://www.nytimes.com/2026/01/14/business/food-prices-tariffs-trump.html",
    "summary": "Weather, supply, tariffs, labor and changing consumer habits continue to drive up the cost of groceries. President Trump falsely claims prices are falling."
  },
  {
    "title": "Trump Administration to Halt Immigrant Visa Processing for 75 Countries",
    "link": "https://www.nytimes.com/2026/01/14/us/politics/trump-suspends-visa-75-countries.html",
    "summary": "Federal officials said the move was meant to discourage immigration by people whom they deemed likely to rely on public benefits."
  },
  {
    "title": "Trump Cuts $2 Billion in Federal Funding for Mental Health and Substance Abuse Services",
    "link": "https://www.nytimes.com/2026/01/14/health/samhsa-funding-cuts.html",
    "summary": "Notices went out late Tuesday to more than 2,000 programs nationwide that will be affected by budget slashing at the Substance Abuse and Mental Health Services Administration."
  },
  {
    "title": "Denmark Has ‘Fundamental’ Differences With U.S. Over Greenland, Diplomat Says",
    "link": "https://www.nytimes.com/2026/01/14/world/europe/trump-greenland-rubio-vance-white-house.html",
    "summary": "Denmark’s foreign minister said that the three governments had a “frank” but “constructive” discussion about President Trump’s wish to get Greenland. It was their first meeting on the subject."
  },
  {
    "title": "Why Greenland Matters for a Warming World",
    "link": "https://www.nytimes.com/2026/01/14/world/europe/greenland-climate.html",
    "summary": "The fate of the world’s largest island has outsize importance for billions of people on the planet, because as the climate warms, Greenland is losing ice. That has consequences."
  },
  {
    "title": "‘We’re Not Stupid’: What Greenlanders Would Say to Trump",
    "link": "https://www.nytimes.com/2026/01/14/world/americas/greenland-fear-trump-us-takeover.html",
    "summary": "A visit to Greenland reveals a swirl of feelings as people nervously await talks with the Trump administration about the island’s future."
  },
  {
    "title": "Trump’s Threats to Greenland Raise Serious Questions for NATO",
    "link": "https://www.nytimes.com/2026/01/14/world/europe/trump-greenland-nato.html",
    "summary": "The treaty that created NATO did not contemplate an attack by one ally on another. A seizure of Greenland by President Trump would test the endurance of the mutual-defense pact."
  },
  {
    "title": "Jodie Foster: An American Oscar-Winner in Paris",
    "link": "https://www.nytimes.com/2026/01/14/movies/jodie-foster-interview-a-private-life.html",
    "summary": "In “A Private Life,” the actress takes on her first solo lead role in which she speaks fluent French, but her French connection goes all the way back to childhood."
  },
  {
    "title": "Will the U.S. Inherit Venezuela’s Oil Curse?",
    "link": "https://www.nytimes.com/2026/01/14/magazine/venezuela-oil-maduro-trump.html",
    "summary": "The country’s biggest problem may not be President Trump."
  },
  {
    "title": "Federal Judges Uphold California’s New Congressional Maps",
    "link": "https://www.nytimes.com/2026/01/14/us/politics/federal-court-california-redistricting-decision.html",
    "summary": "A panel in Los Angeles sided with Gov. Gavin Newsom in a decision that will help Democrats counter Republican gerrymandering in Texas. Republicans are expected to appeal."
  },
  {
    "title": "Supreme Court Sides With Conservative Congressman in Illinois Election Rules Challenge",
    "link": "https://www.nytimes.com/2026/01/14/us/politics/supreme-court-illinois-mail-ballot-rules.html",
    "summary": "The question in the case was not a mail-in ballot rule itself but whether political candidates have the right to challenge the rules governing the vote count in their election."
  },
  {
    "title": "Gallup: Independents Reach Record High as Democrats Make Voter Gains",
    "link": "https://www.nytimes.com/2026/01/14/polls/gallup-independent-voters.html",
    "summary": "New data from Gallup shows overall gains for Democrats even though 45 percent of Americans do not identify with either political party."
  },
  {
    "title": "Lawyers for Renee Good’s Family Plan to Investigate Minnesota ICE Shooting",
    "link": "https://www.nytimes.com/2026/01/14/us/minnesota-ice-lawsuit.html",
    "summary": "Ms. Good was killed by an ICE agent last week. Separately, a federal judge put off ruling on a request by the state to block the surge of immigration agents to the Minneapolis area."
  },
  {
    "title": "Can the ICE Agent Who Shot Renee Good in Minneapolis Be Prosecuted?",
    "link": "https://www.nytimes.com/2026/01/14/us/renee-good-ice-shooting-prosecution.html",
    "summary": "The Trump administration is unlikely to bring a federal case, and any criminal case would face high hurdles. But charges are not out of the question."
  },
  {
    "title": "Analysis: Trump Supports Protesters in Iran, but Not in Minneapolis",
    "link": "https://www.nytimes.com/2026/01/13/us/politics/trump-protesters-iran-minnesota.html",
    "summary": "The split-screen television images of mass demonstrations in Minneapolis and Tehran have highlighted the president’s disparate views of democracy and popular dissent."
  },
  {
    "title": "If You Think This Instrument Is Hard to Play, Try Building One",
    "link": "https://www.nytimes.com/2026/01/14/arts/music/oboe-laubin-jim-phelan.html",
    "summary": "The oboe has 500 parts. Turning a profit is a killer. But Jim Phelan is bent on reviving one of the great names in classical music."
  },
  {
    "title": "Tony Dokoupil’s Road Trip on CBS News Hits a Rough Patch",
    "link": "https://www.nytimes.com/2026/01/14/arts/television/cbs-news-tony-dokoupil.html",
    "summary": "A stretch of big news revealed growing pains for CBS’s new evening anchor and problems with its Bari Weiss-era philosophy."
  },
  {
    "title": "Newsom Says California Will Not Extradite Abortion Provider to Louisiana",
    "link": "https://www.nytimes.com/2026/01/14/us/california-louisiana-extradite-abortion-doctor.html",
    "summary": "The case, escalating the interstate battle over abortion, is the second time Louisiana has criminally charged out-of-state doctors with sending abortion pills to Louisiana residents."
  },
  {
    "title": "NASA Begins Astronaut Space Station Medical Evacuation: What to Know",
    "link": "https://www.nytimes.com/2026/01/14/science/nasa-astronauts-iss-return.html",
    "summary": "Four astronauts departed from the I.S.S. about a month earlier than scheduled because a crew member, who was not identified, has an undisclosed medical issue."
  },
  {
    "title": "Harper Lee Expanded on Her View of the South in Letters to a Friend",
    "link": "https://www.nytimes.com/2026/01/14/arts/harper-lee-letters-opinions-civil-rights-movement.html",
    "summary": "In decades of correspondence, the author gave her friend, JoBeth McDaniel, a mix of opinions, advice on writing and insight into the impact of the Civil Rights movement."
  },
  {
    "title": "Life, Liberty and the Pursuit of Unhappiness",
    "link": "https://www.nytimes.com/2026/01/14/opinion/america-quality-of-life.html",
    "summary": "One reason for the toxicity of American politics may be that our quality of life is slipping behind our peers’."
  },
  {
    "title": "Renee Good’s Family Should Be Able to Sue the Officer Who Killed Her",
    "link": "https://www.nytimes.com/2026/01/14/opinion/renee-good-civil-rights-constitution.html",
    "summary": "An ICE killing in Minneapolis can be the impetus for finally closing a gaping hole in our constitutional protections."
  },
  {
    "title": "The U.S. Moves Personnel Out of Qatar as Tensions Rise With Iran",
    "link": "https://www.nytimes.com/2026/01/14/briefing/us-iran-tensions-greenland-trump.html",
    "summary": "Also, the U.S. and Denmark clash over Greenland. Here’s the latest at the end of Wednesday."
  },
  {
    "title": "As N.Y.C. Nurses’ Strike Continues, Both Sides Prepare for a Long Fight",
    "link": "https://www.nytimes.com/2026/01/14/nyregion/nyc-nurses-striking-again-different.html",
    "summary": "Hospital administrators and union officials appear to be digging in for an extended battle over staffing levels and pay."
  },
  {
    "title": "Kaiser Permanente Agrees to Pay $556 Million to Settle Medicare Overbilling Claims",
    "link": "https://www.nytimes.com/2026/01/14/health/medicare-advantage-kaiser-overbilling-fraud.html",
    "summary": "The Justice Department and whistle-blowers accused the major health insurer of overbilling the government for about $1 billion under the private plans."
  },
  {
    "title": "Prosecutors Say Officer Who Hurled Cooler Was Not Trying to Save Lives",
    "link": "https://www.nytimes.com/2026/01/14/nyregion/erik-duran-trial.html",
    "summary": "Lawyers for Sgt. Erik Duran said he had to make a “life-or-death” decision when he struck Eric Duprey as he rode a motorbike recklessly down a sidewalk. Mr. Duprey died almost immediately."
  },
  {
    "title": "Quebec Premier François Legault Resigns Ahead of Elections",
    "link": "https://www.nytimes.com/2026/01/14/world/americas/quebec-leader-resignation.html",
    "summary": "Premier François Legault became Canada’s most popular provincial leader during the pandemic thanks to his reassuring, avuncular persona. But missteps sank his hopes for a third term."
  }
]