[
  {
    "title": "Venezuelan Boat Suspected of Drug Smuggling Is Said to Have Turned Before U.S. Strike",
    "link": "https://www.nytimes.com/2025/09/10/us/trump-drug-boat-venezuela-strike.html",
    "summary": "The Trump administration has argued that the summary killing of 11 people it accused of running drugs was legal under the laws of war."
  },
  {
    "title": "Trump White House Exerts Enormous Influence Over FBI, Lawsuit Says",
    "link": "https://www.nytimes.com/2025/09/10/us/politics/trump-fbi-lawsuit.html",
    "summary": "A sprawling suit by three fired F.B.I. officials provides a disturbing account of efforts by top Trump aides to strip the bureau of its independence."
  },
  {
    "title": "NATO Says It Scrambled Fighter Jets to Shoot Down Russian Drones Over Poland",
    "link": "https://www.nytimes.com/2025/09/10/world/europe/poland-russia-drones-ukraine-attack.html",
    "summary": "The incursion was the first time alliance planes had engaged enemy targets in NATO airspace. Poland’s leader called it “a large-scale provocation.”"
  },
  {
    "title": "Putin’s Message to Ukraine, Europe and Trump: I Won’t Back Down",
    "link": "https://www.nytimes.com/2025/09/10/world/europe/russia-ukraine-putin-trump-europe.html",
    "summary": "With escalating airstrikes, the Russian leader appears determined to demonstrate that he will dictate the terms for any end to the war."
  },
  {
    "title": "Poland Has Invoked NATO’s Article 4. What Comes Next?",
    "link": "https://www.nytimes.com/2025/09/10/world/europe/what-is-nato-article-4.html",
    "summary": "Article 4 allows member states to start a formal discussion within the alliance about threats to their security. It does not commit the alliance to military action."
  },
  {
    "title": "Cuts to the Food Safety System Threaten Americans’ Health",
    "link": "https://www.nytimes.com/2025/09/10/well/cdc-foodnet.html",
    "summary": "Public health experts worry that downsizing the sprawling FoodNet surveillance system could make it harder to prevent food-borne illnesses."
  },
  {
    "title": "Vaccines and CDC Chaos Expose Tensions Between Trump and RFK Jr.",
    "link": "https://www.nytimes.com/2025/09/10/us/politics/trump-rfk-vaccines-cdc.html",
    "summary": "While there is no evidence of a break between them, Health Secretary Robert F. Kennedy Jr. has caused consternation among President Trump and some of his aides."
  },
  {
    "title": "Trump Administration to Appeal Ruling That Allows Lisa Cook to Remain at Fed",
    "link": "https://www.nytimes.com/2025/09/10/us/politics/trump-lisa-cook-fed-governor-appeal.html",
    "summary": "The administration contested a preliminary injunction, issued late Tuesday, that temporarily blocked President Trump from firing her."
  },
  {
    "title": "Republicans Race to Advance Stephen Miran, Trump’s Fed Pick, Despite White House Ties",
    "link": "https://www.nytimes.com/2025/09/10/business/trump-fed-stephen-miran.html",
    "summary": "Stephen Miran, a top economic adviser to the president, cleared a key Senate hurdle on Wednesday, putting him one step closer to a seat on the Federal Reserve."
  },
  {
    "title": "Our Favorite Restaurants and Industry Trends of 2025",
    "link": "https://www.nytimes.com/2025/09/09/dining/staff-favorite-restaurants-trends.html",
    "summary": "What we’ve noticed, what we’d like to see more of and a few things we would rather see the end of."
  },
  {
    "title": "Israel’s Attack on Qatari Soil Leads Gulf Powers to Question U.S. Protection",
    "link": "https://www.nytimes.com/2025/09/10/world/middleeast/israel-strike-qatar-us.html",
    "summary": "The brazen attempt to kill the political leaders of Hamas in Doha could upend the foundations of an American-led order in the Middle East."
  },
  {
    "title": "After Qatar, Israel Fires on Yemen: ‘Whoever Attacks Us, We Will Reach Them’",
    "link": "https://www.nytimes.com/2025/09/10/world/middleeast/israel-houthi-yemen-strikes-qatar.html",
    "summary": "Israel’s military launched multiple attacks on Houthi sites in northern Yemen, a day after its widely-criticized airstrike against Hamas officials on Qatari soil."
  },
  {
    "title": "CBS News Weighs Major Role for Bari Weiss as Part of Deal to Buy The Free Press",
    "link": "https://www.nytimes.com/2025/09/10/business/media/cbs-news-bari-weiss-free-press.html",
    "summary": "The talks with Ms. Weiss, a founder of The Free Press, are the strongest sign yet that the new owner of CBS News intends to make major changes."
  },
  {
    "title": "The Moment Nepal’s Gen Z Protesters Felt the Vibe Change",
    "link": "https://www.nytimes.com/2025/09/10/world/asia/nepal-gen-z-protesters.html",
    "summary": "Before the destruction began, the Gen Z demonstrators had planned to look good while promoting democracy and sweeping away an entrenched leadership."
  },
  {
    "title": "Happy 10th Birthday to the Laser Interferometer Gravitational-Wave Observatory. Now Drop Dead.",
    "link": "https://www.nytimes.com/2025/09/10/science/gravitational-waves-ligo-black-holes.html",
    "summary": "Ten years ago, astronomers made an epic discovery with the Laser Interferometer Gravitational-Wave Observatory. Cosmology hasn’t been the same since, and it might not stay that way much longer."
  },
  {
    "title": "They Created a Streetwear Line From Scratch. In High School.",
    "link": "https://www.nytimes.com/2025/09/10/nyregion/high-school-students-bronx-streetwear-clothing.html",
    "summary": "At a school with a basketball-themed curriculum, students were “dreaming big.” But could they find a buyer?"
  },
  {
    "title": "Should Harris Have Told Biden Not to Run? ‘Perhaps,’ She Writes in New Book",
    "link": "https://www.nytimes.com/2025/09/10/us/politics/kamala-harris-book-biden-107-days.html",
    "summary": "Former Vice President Kamala Harris also accused White House aides, without naming names, of not defending her from right-wing attacks about her competence."
  },
  {
    "title": "Texas Professor Fired After Accusations of Teaching ‘Gender Ideology’",
    "link": "https://www.nytimes.com/2025/09/10/us/texas-professor-fired-gender-ideology.html",
    "summary": "Two administrators also lost their posts at Texas A&amp;M, an example of how Republican policies meant to curb liberal ideas are reaching into university classrooms."
  },
  {
    "title": "France Braces for Protests",
    "link": "https://www.nytimes.com/2025/09/10/world/europe/france-protests-lecornu-prime-minister.html",
    "summary": "Protesters blocked roads, roundabouts and tram lines across the country as Sébastien Lecornu took office."
  },
  {
    "title": "Who Is France’s New Prime Minister, Sébastien Lecornu?",
    "link": "https://www.nytimes.com/2025/09/10/world/europe/france-prime-minister-sebastien-lecornu-macron.html",
    "summary": "Sébastien Lecornu had been defense minister. He is one of President Emmanuel Macron’s most loyal and enduring allies."
  },
  {
    "title": "Gaza War Turns New Yorkers Against Israel, With Mayor’s Race as Backdrop",
    "link": "https://www.nytimes.com/2025/09/10/nyregion/israel-gaza-poll-nyc-mayor.html",
    "summary": "More New Yorkers say their sympathies lie with Palestinians rather than Israel in the long-running conflict in Gaza, according to a New York Times/Siena poll."
  },
  {
    "title": "New Yorkers Support Free Buses, but They Don’t Think It Should Happen",
    "link": "https://www.nytimes.com/2025/09/10/upshot/polling-experiment-free-buses.html",
    "summary": "A polling experiment shows how a small change in wording can make a big difference."
  },
  {
    "title": "How a Group of Students in the Pacific Islands Reshaped Global Climate Law",
    "link": "https://www.nytimes.com/2025/09/10/magazine/global-climate-law-students.html",
    "summary": "They watched climate change ravage their home countries as rich, polluting nations did nothing. Then they had an idea."
  },
  {
    "title": "Prince Harry Reunites With King Charles for First Time in Over a Year",
    "link": "https://www.nytimes.com/2025/09/10/world/europe/prince-harry-king-charles-reunion.html",
    "summary": "Harry and Charles had tea at Clarence House, the king’s London residence, on Wednesday afternoon, a palace official confirmed."
  },
  {
    "title": "German Court Convicts Syrian National for Stabbing Attack That Killed 3",
    "link": "https://www.nytimes.com/2025/09/10/world/europe/german-stabbing-attack.html",
    "summary": "Issa al Hasan was found guilty of murder in the Islamic State-inspired rampage last year that spurred a national debate about refugees and migration."
  },
  {
    "title": "Polly Holliday, a Sassy Waitress on the Sitcom ‘Alice,’ Dies at 88",
    "link": "https://www.nytimes.com/2025/09/10/arts/television/polly-holiday-dead.html",
    "summary": "“Kiss my grits,” her character, Flo, was known to say. But that high-profile role was just one facet of a long, busy stage and screen career."
  },
  {
    "title": "British Courts Service Destroys Banksy Mural Depicting Attack by Judge",
    "link": "https://www.nytimes.com/2025/09/10/arts/design/banksy-destroyed.html",
    "summary": "The work, painted onto the walls of one of Britain’s most important court buildings, showed a judge attacking a demonstrator with a gavel."
  }
]