[
  {
    "title": "Trump’s ‘Superstar’ Appellate Judges Have Voted 133 to 12 in His Favor",
    "link": "https://www.nytimes.com/2026/01/11/us/politics/trumps-appeals-court-judges.html",
    "summary": "President Trump promised to fill the appeals courts with “my judges.” They have formed a nearly united phalanx to defend his agenda from legal challenges."
  },
  {
    "title": "Smithsonian Removes Label Noting Trump Impeachments",
    "link": "https://www.nytimes.com/2026/01/10/arts/smithsonian-trump-impeachment-portrait-gallery.html",
    "summary": "When the National Portrait Gallery replaced a portrait of President Trump this week, it took down a biography of his first term."
  },
  {
    "title": "U.S. Launches Major Strikes on Islamic State Targets in Syria",
    "link": "https://www.nytimes.com/2026/01/10/us/politics/us-strikes-islamic-state-syria.html",
    "summary": "The airstrikes followed an even larger attack in December to avenge the killing of three Americans last year."
  },
  {
    "title": "Trump Is Briefed on Options for Striking Iran as Protests Continue",
    "link": "https://www.nytimes.com/2026/01/10/us/politics/trump-iran-strikes.html",
    "summary": "The president has said he will be “hitting them very hard” if Iranian leaders kill protesters amid widespread demonstrations calling for wholesale changes in the country."
  },
  {
    "title": "Death Toll Grows as Nationwide Protests Rock Iran for a Third Night",
    "link": "https://www.nytimes.com/2026/01/10/world/middleeast/iran-protests-death-toll.html",
    "summary": "Antigovernment unrest that began two weeks ago has intensified in recent days, as has violence."
  },
  {
    "title": "Why Are Iranians Protesting? What to Know About the Unrest.",
    "link": "https://www.nytimes.com/article/iran-protests-inflation-currency.html",
    "summary": "Demonstrations that began as outrage at the state of the economy have spread to cities across the country, amid an escalating crackdown by the authorities."
  },
  {
    "title": "Trump Shakes up Latin American Politics",
    "link": "https://www.nytimes.com/2026/01/11/world/americas/trump-is-the-political-earthquake-shaking-latin-america.html",
    "summary": "The U.S. capture of Nicolás Maduro has divided the region. But every nation wants to avoid being next."
  },
  {
    "title": "Prosecutors’ Vivid Accusations Against Maduro Belie a Complex Case",
    "link": "https://www.nytimes.com/2026/01/11/nyregion/maduro-new-york-legal-case.html",
    "summary": "The government will have to navigate difficult legal issues and use testimony about incidents clouded by time. But conspiracy laws are powerful tools for prosecutors."
  },
  {
    "title": "Bob Weir, Guitarist and Founding Member of The Grateful Dead, Dies at 78",
    "link": "https://www.nytimes.com/2026/01/10/obituaries/bob-weir-dead-grateful-dead.html",
    "summary": "His songwriting and rhythm guitar playing helped shape the San Francisco band’s sound as it became an American institution."
  },
  {
    "title": "Bob Weir: 10 Essential Songs",
    "link": "https://www.nytimes.com/2026/01/10/arts/music/bob-weir-grateful-dead-songs.html",
    "summary": "The guitarist, singer and songwriter, who died at 78, cut his own path among his elders in the Grateful Dead, and beyond."
  },
  {
    "title": "How Wagner Moura Stayed True to Himself and Earned a Golden Globe Nomination",
    "link": "https://www.nytimes.com/2026/01/10/movies/wagner-moura-the-secret-agent-golden-globes.html",
    "summary": "The Brazilian star of “The Secret Agent” is a major Oscar contender, though some at home turned against him for criticizing the right-wing government."
  },
  {
    "title": "Golden Globe 2026 Nominees: Full List Including ‘One Battle After Another’",
    "link": "https://www.nytimes.com/2025/12/08/movies/golden-globes-nominees-2026-list.html",
    "summary": "The movies and TV series competing for the 83rd Golden Globes. The ceremony will air on Jan. 11."
  },
  {
    "title": "How to Watch the Golden Globes 2026: Date, Time and Streaming",
    "link": "https://www.nytimes.com/2026/01/11/movies/golden-globes-how-to-watch.html",
    "summary": "Nikki Glaser is back as host, there’s a new podcast category and “One Battle After Another” looks to have a big night."
  },
  {
    "title": "Why on Earth Have I Seen the Same Broadway Show 13 Times? An Investigation.",
    "link": "https://www.nytimes.com/2026/01/11/magazine/operation-mincemeat-obsession-broadway.html",
    "summary": "As a journalist, I thought I’d never join the ranks of obsessive superfans — until I suddenly became one."
  },
  {
    "title": "Trump and Vance Are Fanning the Flames. Again.",
    "link": "https://www.nytimes.com/2026/01/11/opinion/renee-good-trump-ice-minneapolis.html",
    "summary": "Renee Good was not a “domestic terrorist.”"
  },
  {
    "title": "Where Does Candidate Mamdani End and Mayor Mamdani Begin?",
    "link": "https://www.nytimes.com/2026/01/11/nyregion/new-york-mayor-zohran-mamdani-week-one.html",
    "summary": "In his first week as mayor of New York City, Zohran Mamdani tried to bridge the political theater of his campaign with the much harder work of governing."
  },
  {
    "title": "India’s Ties With Bangladesh Fray as Elections Loom",
    "link": "https://www.nytimes.com/2026/01/11/world/asia/india-bangladesh-tensions.html",
    "summary": "A simmering dispute between the neighbors, who share one of the largest land borders in the world, has escalated with diplomatic protests and a sports boycott."
  },
  {
    "title": "Supreme Court to Hear Case on Louisiana’s Eroding Coast",
    "link": "https://www.nytimes.com/2026/01/11/climate/supreme-court-to-hear-case-on-louisianas-eroding-coast.html",
    "summary": "Local governments are suing oil companies over environmental damage. The companies want the suits moved out of state courts, to friendlier venues."
  },
  {
    "title": "Will Stock Markets Sizzle Into 2026?",
    "link": "https://www.nytimes.com/2026/01/09/business/stock-market-investing-returns.html",
    "summary": "Returns have been fabulous but consider the potential for setbacks in this already hazardous year, our columnist says."
  }
]