[
  {
    "title": "Trump Picks a Side on Entering the War in Iran, for Now",
    "link": "https://www.nytimes.com/2025/06/22/us/politics/trump-iran-maga-rift-isolationists-hawks.html",
    "summary": "Even as he announced the strikes on Iran, President Trump appeared to be rapidly trying to get himself back to the middle by insisting the operation was a one-off."
  },
  {
    "title": "Is the U.S. at War With Iran? What to Know About Trump, Congress and War Powers",
    "link": "https://www.nytimes.com/2025/06/22/us/politics/trump-strikes-war-iran.html",
    "summary": "President Trump avoided asking Congress for permission before striking Iran, despite the Constitution saying only the legislature can declare war."
  },
  {
    "title": "Missteps, Confusion and ‘Viral Waste’: The 14 Days That Doomed U.S.A.I.D.",
    "link": "https://www.nytimes.com/2025/06/22/us/politics/usaid-cuts-doge.html",
    "summary": "The rapid dismantling of the global aid agency remains one of the most consequential outcomes of President Trump’s efforts to overhaul the federal government, showing his willingness to tear down institutions in defiance of the courts."
  },
  {
    "title": "‘An Existential Threat’: Food Banks Brace for Fallout From Trump Cuts",
    "link": "https://www.nytimes.com/2025/06/22/nyregion/nyc-food-banks-cuts.html",
    "summary": "New York City food banks aren’t sure how they will survive the administration’s funding cuts, which could also affect the programs they turn to for help."
  },
  {
    "title": "Mahmoud Khalil Discusses 3-Month Detention in First Interview Since Release",
    "link": "https://www.nytimes.com/2025/06/22/nyregion/mahmoud-khalil-interview-trump.html",
    "summary": "The Columbia graduate and pro-Palestinian activist returned to New York after more than three months in detention. The Trump administration is seeking to deport him."
  },
  {
    "title": "3 Dead in Central New York After Severe Storms Lash the Area",
    "link": "https://www.nytimes.com/2025/06/22/nyregion/ny-storm-flood-deaths.html",
    "summary": "Three people, including 6-year-old sisters, were killed after trees fell on homes during severe weather that struck early on Sunday, officials said."
  },
  {
    "title": "Dangerous Heat Wave Expands Over Central and Eastern United States",
    "link": "https://www.nytimes.com/2025/06/22/weather/heat-wave-temperatures.html",
    "summary": "A multiday heat wave is bringing high temperatures and health risks from the Midwest to the Northeast, prompting warnings and emergency measures."
  },
  {
    "title": "Revisiting the Hunt: First-Time Buyers Share What Went Wrong and Right",
    "link": "https://www.nytimes.com/2025/06/21/realestate/the-hunt-first-time-homeowners.html",
    "summary": "Being a new homeowner comes with a steep learning curve, especially in New York City."
  },
  {
    "title": "Palm Beach, Never Richer, Is a Draw for Young MAGA. Locals Aren’t Pleased.",
    "link": "https://www.nytimes.com/2025/06/22/business/palm-beach-trump-maga.html",
    "summary": "Donald Trump’s presidency has turned this Florida island into the nightlife headquarters of MAGA, but the town’s old guard — much of it Republican — doesn’t love the new vibe."
  },
  {
    "title": "Bill Clinton Endorses Andrew Cuomo for NYC Mayor",
    "link": "https://www.nytimes.com/2025/06/22/nyregion/bill-clinton-endorse-cuomo-mayor.html",
    "summary": "The former president’s endorsement is the latest example of how establishment Democrats seem to prefer Andrew M. Cuomo to his prime rival in the New York City mayor’s race, Zohran Mamdani."
  },
  {
    "title": "An Actor, a Bookseller and a Chef Walk Into a Voting Booth",
    "link": "https://www.nytimes.com/2025/06/22/nyregion/celebrity-ballots-mayor-nyc.html",
    "summary": "We asked scores of well-known New Yorkers from a broad spectrum of the city to give us their ranked-choice ballots for mayor. Here’s what some told us."
  },
  {
    "title": "As Tariffs Make Weddings Costlier, David’s Bridal Tries to Adapt",
    "link": "https://www.nytimes.com/2025/06/22/business/davids-bridal-kelly-cook-tariffs.html",
    "summary": "Most wedding dresses are made in China, so tariffs are a new worry for brides. At David’s Bridal, the largest seller of gowns in the United States, its chief executive, Kelly Cook, is trying to do something about it."
  },
  {
    "title": "How the Attacks on Iran Are Part of a Much Bigger Global Struggle",
    "link": "https://www.nytimes.com/2025/06/22/opinion/iran-israel-attack-global-struggle.html",
    "summary": "Putin and the ayatollahs want the same kind of world."
  },
  {
    "title": "What Iran Does Next",
    "link": "https://www.nytimes.com/2025/06/22/opinion/iran-nuclear-strike-israel-war.html",
    "summary": "Among the most likely options are asymmetric or terrorist attacks, although the time frame is impossible to gauge."
  },
  {
    "title": "Syria Church Bombing Kills at Least 20 in Damascus",
    "link": "https://www.nytimes.com/2025/06/22/world/middleeast/damascus-church-bombing.html",
    "summary": "The attack on a Greek Orthodox service made clear the challenges facing Syria’s new government in a country long pitted by sectarian divides."
  },
  {
    "title": "Michigan Church Shooting Leaves at Least 1 Injured and Gunman Dead, Police Say",
    "link": "https://www.nytimes.com/2025/06/22/us/shooting-church-wayne-michigan.html",
    "summary": "One church employee was injured in the shooting on Sunday in Wayne, Mich., the police said. The church, which was hosting its Vacation Bible School, was filled with children at the time."
  },
  {
    "title": "Fred Smith, Billionaire Founder of FedEx, Is Dead at 80",
    "link": "https://www.nytimes.com/2025/06/22/obituaries/fred-smith-billionaire-founder-of-fedex-is-dead-at-80.html",
    "summary": "His vision for how to ship packages overnight led to not just a new company, but also a new sector of the world economy and a now-familiar English verb."
  },
  {
    "title": "With ‘Elio,’ Pixar Has Its Worst Box Office Opening Ever",
    "link": "https://www.nytimes.com/2025/06/22/business/elio-pixar-box-office.html",
    "summary": "The original space adventure sold about $21 million in tickets at domestic theaters from Thursday night through Sunday, putting new pressure on the once-unstoppable studio."
  }
]