[
  {
    "title": "Witnesses Recount Fire That Killed 40 in Switzerland",
    "link": "https://www.nytimes.com/2026/01/01/world/europe/switzerland-fire-scene.html",
    "summary": "It was a haven for the young, where they could find hot chocolate when they wanted quiet and affordable drinks when they did not. Then it turned into a place of death."
  },
  {
    "title": "There Was Probably a Flashover in the Swiss Bar Fire. Here’s What That Means.",
    "link": "https://www.nytimes.com/2026/01/02/world/europe/switzerland-resort-bar-fire-flashover.html",
    "summary": "A flashover is an event where an entire room is rapidly engulfed in flames."
  },
  {
    "title": "Swiss Alps Ski Resort Fire: What We Know",
    "link": "https://www.nytimes.com/2026/01/01/world/europe/what-happened-fire-switzerland-ski-resort.html",
    "summary": "A fast-moving fire at a bar in a popular ski resort killed more than 40 people and injured more than 100, officials said. The cause was still unknown."
  },
  {
    "title": "Dozens Killed in New Year’s Fire, and Trump Abandons National Guard Push in 3 Major Cities",
    "link": "https://www.nytimes.com/2026/01/02/podcasts/the-headlines/switzerland-new-years-fire-trump-national-guard.html",
    "summary": "Plus, your Friday news quiz."
  },
  {
    "title": "Mamdani Lays Out Agenda of ‘Affordability and Abundance’ on First Day in Office",
    "link": "https://www.nytimes.com/2026/01/01/nyregion/mamdani-inauguration-takeaways.html",
    "summary": "Mayor Zohran Mamdani acknowledged skeptics of his plans while reiterating that he would focus on working-class New Yorkers."
  },
  {
    "title": "Images From the Dawn of the Mamdani Era",
    "link": "https://www.nytimes.com/2026/01/01/nyregion/images-from-the-dawn-of-the-mamdani-era.html",
    "summary": "Thousands of New Yorkers packed the plaza ouside City Hall and the streets of Lower Manhattan to see Mayor Zohran Mamdani take office."
  },
  {
    "title": "Mamdani Revokes Executive Orders That Adams Signed to Support Israel",
    "link": "https://www.nytimes.com/2026/01/02/nyregion/mamdani-executive-orders-adams-israel.html",
    "summary": "Former Mayor Eric Adams and some conservative-leaning Jewish leaders criticized the revocation of his executive orders, one of which he signed just last month."
  },
  {
    "title": "New York Magazine Put Mamdani’s Team on Its Cover. One Aide Was Erased.",
    "link": "https://www.nytimes.com/2026/01/01/nyregion/new-york-magazine-cover-mamdani-aide-da-costa.html",
    "summary": "Catherine Almonte Da Costa was part of a photo shoot on the mayor-elect’s inner circle. The next day she resigned amid an uproar over antisemitic statements she had posted on social media years earlier."
  },
  {
    "title": "Tech Giants Are Racing to Embed A.I. in Schools Around the Globe",
    "link": "https://www.nytimes.com/2026/01/02/technology/school-ai-chatgpt-estonia-iceland.html",
    "summary": "More governments are rolling out chatbots in schools. Some experts warn the tools could erode teaching and learning."
  },
  {
    "title": "In China, A.I. Finds Pancreatic Cancer That Doctors May Miss",
    "link": "https://www.nytimes.com/2026/01/02/world/asia/china-ai-cancer-pancreatic.html",
    "summary": "A tool for spotting pancreatic cancer in routine CT scans has had promising results, one example of how China is racing to apply A.I. to medicine’s tough problems."
  },
  {
    "title": "After Watergate, the Presidency Was Tamed. Trump Is Unleashing It.",
    "link": "https://www.nytimes.com/2026/01/02/us/politics/president-trump-powers-watergate.html",
    "summary": "In the 1970s, Congress passed a raft of laws to hold the White House accountable. President Trump has decided they don’t apply to him."
  },
  {
    "title": "Welcome to the Office. Now Take Off Your Shoes.",
    "link": "https://www.nytimes.com/2026/01/02/business/welcome-to-the-office-now-take-off-your-shoes.html",
    "summary": "Some start-ups, blurring the lines between home and office, are embracing a “no shoes” policy."
  },
  {
    "title": "With Obamacare’s Higher Premiums Come Difficult Decisions",
    "link": "https://www.nytimes.com/2026/01/02/health/obamacare-subsidies-higher-premiums.html",
    "summary": "As enhanced subsidies expire, many Americans covered under the Affordable Care Act are having trouble paying for insurance."
  },
  {
    "title": "Trump Says U.S. Is ‘Locked and Loaded’ if Iran Kills Protesters",
    "link": "https://www.nytimes.com/2026/01/02/world/middleeast/trump-iran-protests.html",
    "summary": "Mr. Trump’s remarks that he was ready to come to the protesters’ “rescue” are a sharp escalation as protests over economic hardship turned deadly."
  },
  {
    "title": "Why a Nuclear Plant Is a Big Sticking Point in the Ukraine Peace Plan",
    "link": "https://www.nytimes.com/2026/01/02/world/europe/ukraine-peace-plan-zaporizhzhia-nuclear-plant.html",
    "summary": "The Zaporizhzhia plant, occupied by Russia, would be crucial to powering Ukraine’s postwar recovery."
  },
  {
    "title": "Can the Most Indebted Team in Global Soccer Fix Its Finances?",
    "link": "https://www.nytimes.com/2026/01/02/world/europe/barcelona-debt-soccer.html",
    "summary": "F.C. Barcelona’s liabilities have reached 2.5 billion euros, the result of financial mismanagement and vaulting ambition."
  },
  {
    "title": "Bacterial Vaginosis Is No Longer Thought to Affect Only Women",
    "link": "https://www.nytimes.com/2025/12/30/health/bacterial-vaginosis-sexually-transmitted-infection.html",
    "summary": "Gynecologists long viewed bacterial vaginosis as solely a women’s issue — until a study that treated their male partners, too, proved otherwise."
  },
  {
    "title": "So You Have Bacterial Vaginosis. What Do You Do Now?",
    "link": "https://www.nytimes.com/2025/12/30/health/bacterial-vaginosis-what-to-do.html",
    "summary": "Now that the condition is known to spread sexually, there are steps you and your partner can take to prevent it."
  },
  {
    "title": "In the Arctic, Drones Help Identify Deadly Virus in Whales",
    "link": "https://www.nytimes.com/2026/01/02/science/arctic-drones-whales-virus.html",
    "summary": "Scientists took samples from whale blow, identifying possible disease risks for marine mammals in northern seas."
  },
  {
    "title": "Trump Is the Jan. 6 President",
    "link": "https://www.nytimes.com/2025/12/31/opinion/jan-6-anniversary-trump-politics.html",
    "summary": "Tragically, America is still living in a political era that began on Jan. 6, 2021."
  },
  {
    "title": "The Unseen Human Workers Behind Self-Driving Cars",
    "link": "https://www.nytimes.com/2026/01/02/opinion/ai-self-driving-cars-workers.html",
    "summary": "The unseen workers who help train self-driving cars to see."
  },
  {
    "title": "Five Laws Going Into Effect for New York in 2026",
    "link": "https://www.nytimes.com/2026/01/02/nyregion/2026-new-laws-new-york-state.html",
    "summary": "Among them, benefits for minimum wage workers, cancer patients and parents of young children. Also, a change to child abuse reporting."
  },
  {
    "title": "Search Is Suspended for Passenger Who Went Overboard From Cruise Ship",
    "link": "https://www.nytimes.com/2026/01/01/world/americas/passenger-overboard-holland-america-cruise.html",
    "summary": "The U.S. Coast Guard said on Thursday that it halted its hourslong search for a 77-year-old woman who went overboard from a Holland America Line cruise ship near Cuba."
  },
  {
    "title": "Janet Fish, Painter of Luminous Still Lifes, Dies at 87",
    "link": "https://www.nytimes.com/2026/01/01/arts/design/janet-fish-dead.html",
    "summary": "From her student days, she stubbornly refused to follow popular artistic trends. Instead, she spent decades exploring the effects of light on glass."
  }
]