[
  {
    "title": "Netflix Backs Out of Bid for Warner Bros., Paving Way for Paramount Takeover",
    "link": "https://www.nytimes.com/2026/02/26/business/warner-bros-discovery-paramount-deal-netflix.html",
    "summary": "The move was a stunning development in the long-running corporate battle for the storied media giant."
  },
  {
    "title": "Justice Department Exposed Cooperating Witnesses in Epstein Files",
    "link": "https://www.nytimes.com/2026/02/26/nyregion/epstein-cooperating-witnesses-redaction-error.html",
    "summary": "The disclosure is the latest example of how the urgent push to release the files led to the government publicizing information it would normally keep under wraps."
  },
  {
    "title": "How a Close Associate of Epstein’s Found Career Redemption in Japan",
    "link": "https://www.nytimes.com/2026/02/26/business/jeffrey-epstein-joichi-ito-japan.html",
    "summary": "Top Japanese officials are backing a tech and entrepreneurship initiative led by Joichi Ito, whose involvement with Jeffrey Epstein may endanger efforts to get the project off the ground."
  },
  {
    "title": "World Economic Forum Chief Resigns Over Epstein Ties",
    "link": "https://www.nytimes.com/2026/02/26/business/world-economic-forum-davos-epstein-brende.html",
    "summary": "Borge Brende, a former foreign minister of Norway, had maintained contact with the convicted sex offender."
  },
  {
    "title": "Trump Declared Victory in Minneapolis. But What Did He Accomplish?",
    "link": "https://www.nytimes.com/2026/02/26/us/politics/trump-minneapolis-ice-immigration.html",
    "summary": "The Trump administration came under fire for an operation that turned lethal and politically toxic. But the show of force may also have had a bigger purpose: to serve as a warning."
  },
  {
    "title": "Columbia Student Arrested by ICE in a University Building Is Released",
    "link": "https://www.nytimes.com/2026/02/26/nyregion/columbia-university-ice-student.html",
    "summary": "Federal officials had misrepresented themselves to gain access, according to the university. Mayor Zohran Mamdani said President Trump had told him the student would be let go."
  },
  {
    "title": "Mamdani Meets Again With Trump, Emerging With Two Unexpected Victories",
    "link": "https://www.nytimes.com/2026/02/26/nyregion/mamdani-trump-meeting.html",
    "summary": "Mayor Zohran Mamdani said he and President Trump discussed building housing in New York City, and he appeared to secure the release of a Columbia student detained by ICE on Thursday."
  },
  {
    "title": "Testimony Offers New Details on Justice Dept. Role in Abrego Garcia Prosecution",
    "link": "https://www.nytimes.com/2026/02/26/us/kilmar-abrego-garcia-justice-department-trump.html",
    "summary": "A top prosecutor, Robert E. McGuire, painted an extraordinary picture of senior Justice Department leaders peering over his shoulder and hurrying him along."
  },
  {
    "title": "U.S. Mortgage Rates Fall Below 6% for First Time in Years",
    "link": "https://www.nytimes.com/2026/02/26/business/mortgage-rates-30-year.html",
    "summary": "The evidence is patchy on whether lower rates have meaningfully spurred more activity, as the Trump administration floats measures it says will make housing more affordable."
  },
  {
    "title": "What Your DNA Reveals About the Sex Life of Neanderthals",
    "link": "https://www.nytimes.com/2026/02/26/science/human-evolution-neanderthal-sex.html",
    "summary": "Most people alive today carry fragments of Neanderthal DNA in their genome. Now scientists are gaining a more intimate understanding of the ancient encounters that put it there."
  },
  {
    "title": "What We Know About the Gun Battle Off the Coast of Cuba",
    "link": "https://www.nytimes.com/2026/02/26/us/cuba-speedboat-florida-shooting-killed.html",
    "summary": "Four armed Cubans aboard a Florida-based speedboat died in a gunfight with Cuban border troops on Wednesday, officials said."
  },
  {
    "title": "What to Know About U.S.-Iran Nuclear Talks Amid Trump Threats",
    "link": "https://www.nytimes.com/2026/02/26/world/middleeast/iran-us-nuclear-talks.html",
    "summary": "President Trump has kept up a steady drumbeat of threats and built up U.S. troops in the region. Iran’s task is to give him a win but also preserve some semblance of nuclear enrichment."
  },
  {
    "title": "A.I. Dating Apps Complicate China’s Efforts to Boost Birthrate",
    "link": "https://www.nytimes.com/2026/02/26/technology/china-ai-dating-apps.html",
    "summary": "As China grapples with a shrinking population and historically low birthrate, people are finding romance with chatbots instead."
  },
  {
    "title": "Anthropic Says It Cannot ‘Accede’ to Pentagon in Talks Over A.I.",
    "link": "https://www.nytimes.com/2026/02/26/technology/anthropic-pentagon-talks-ai.html",
    "summary": "Anthropic said it was standing firm on not having its A.I. used in certain scenarios by the Pentagon, which has imposed a Friday deadline on the company to give unfettered access to its technology."
  },
  {
    "title": "After F.B.I. Raid, Los Angeles School Board Will Discuss Superintendent",
    "link": "https://www.nytimes.com/2026/02/26/us/los-angeles-school-board-meeting-superintendent-fbi-raid.html",
    "summary": "Board members will meet Thursday after agents raided the home and office of Alberto Carvalho, the Los Angeles Unified School District superintendent. The F.B.I. also searched the Florida home of a consultant with ties to the schools chief."
  },
  {
    "title": "Why Are So Many Democrats Running for California Governor?",
    "link": "https://www.nytimes.com/2026/02/26/us/california-governor-democratic-political-machine.html",
    "summary": "With California’s political machine on the wane, nobody has emerged as a clear front-runner. Democrats worry that nine of their candidates could split the vote and hand Republicans a win."
  },
  {
    "title": "In Texas, Crenshaw faces primary challenger, a test for MAGA",
    "link": "https://www.nytimes.com/2026/02/26/us/politics/crenshaw-texas-republicans-maga-trump-primary.html",
    "summary": "Representative Dan Crenshaw, who has at times clashed with President Trump and his allies, is facing a conservative challenger in Tuesday’s primary."
  },
  {
    "title": "Why Are So Many Teen Girls Still Tearing Their A.C.L.s?",
    "link": "https://www.nytimes.com/2026/02/26/magazine/acl-tear-women-girl-sports.html",
    "summary": "For years, ligament tears have been a crisis among young athletes — even though a few simple exercises can prevent them."
  },
  {
    "title": "Jesse Jackson Memorials Begin in Chicago",
    "link": "https://www.nytimes.com/2026/02/26/us/jesse-jackson-chicago-repose-rainbow-push.html",
    "summary": "Mourners lined up outside Rainbow PUSH, the organization Mr. Jackson founded decades ago. He died last week at 84."
  },
  {
    "title": "He Hopes to Turn the Island of Nevis Into a Libertarian Paradise, With Crypto",
    "link": "https://www.nytimes.com/2026/02/26/business/st-kitts-nevis-destiny-olivier-janssens-crypto-libertarian.html",
    "summary": "A Bitcoin baron wants to build a libertarian paradise on the island of Nevis. Democracy is getting in the way."
  },
  {
    "title": "They Helped Women Fight Online Abuse. They Were Barred From the U.S.",
    "link": "https://www.nytimes.com/2026/02/26/technology/hateaid-online-abuse-free-speech-europe.html",
    "summary": "The founders of HateAid, a German human-rights group that helps victims of online attacks, were accused by the Trump administration of being part of a “global censorship-industrial complex.”"
  },
  {
    "title": "Bird Losses Are Accelerating, New Study Finds",
    "link": "https://www.nytimes.com/2026/02/26/climate/bird-declines.html",
    "summary": "Scientists studying data collected over more than three decades found accelerating losses. Their research offers clues about the causes."
  },
  {
    "title": "‘We’re Going to the Moon and Mars’",
    "link": "https://www.nytimes.com/2026/02/26/opinion/space-nasa-elon-musk.html",
    "summary": "The new head of NASA predicts a manned mission to Mars in 10 years."
  },
  {
    "title": "Mexico’s Cartel Fight Is a Terrifying High-Wire Act",
    "link": "https://www.nytimes.com/2026/02/26/opinion/international-world/mexico-cartel-violence.html",
    "summary": "As drug gangs have become more deeply embedded in Mexico, narco blockades have become a way for them to visibly assert their power."
  },
  {
    "title": "War or a Deal? U.S. and Iran Discuss What’s Next",
    "link": "https://www.nytimes.com/2026/02/26/briefing/us-iran-talks-hillary-clinton-epstein.html",
    "summary": "Also, mortgage rates fall below 6 percent. Here’s the latest at the end of Thursday."
  },
  {
    "title": "Venezuela’s Capital, Laid Low by Misrule, Is Stirring Back to Life",
    "link": "https://www.nytimes.com/2026/02/26/world/americas/caracas-venezuela-economy.html",
    "summary": "New restaurants are popping up in Caracas. Nightclubs are bursting at the seams. The streets are eerily safe — with big exceptions. Could a revival be on the horizon?"
  },
  {
    "title": "In Landmark Trial, Plaintiff Says Social Media Harm Started at Age 6",
    "link": "https://www.nytimes.com/2026/02/26/technology/social-media-addiction-testimony.html",
    "summary": "The plaintiff, a 20-year-old identified only as K.G.M., took the stand to testify against Meta and Instagram in a bellwether case over tech addiction."
  },
  {
    "title": "N.Y. Man With China Ties Charged With Marijuana Trafficking in Oklahoma",
    "link": "https://www.nytimes.com/2026/02/26/nyregion/nyc-china-hometown-oklahoma-marijuana.html",
    "summary": "Sin Tung Chan was a member of a prominent hometown association in the city, one of hundreds of social clubs that often maintain close ties with the Chinese government."
  }
]