[
  {
    "title": "Trump Demands That Bondi Move ‘Now’ to Prosecute Foes",
    "link": "https://www.nytimes.com/2025/09/20/us/politics/trump-justice-department-us-attorneys.html",
    "summary": "His demand came a day after he ousted the federal prosecutor who failed to charge two of his most-reviled adversaries, Letitia James and James B. Comey."
  },
  {
    "title": "Trump Justice Dept. Closed Investigation Into Tom Homan for Accepting Bag of Cash",
    "link": "https://www.nytimes.com/2025/09/20/us/politics/tom-homan-fbi-trump.html",
    "summary": "Mr. Homan came under scrutiny after he was said to be recorded last year taking $50,000 in cash from undercover F.B.I. agents."
  },
  {
    "title": "California Bars ICE Agents From Wearing Masks in the State",
    "link": "https://www.nytimes.com/2025/09/20/us/california-ice-agents-masks-law.html",
    "summary": "Gov. Gavin Newsom signed a bill to prevent federal agents from concealing their identities with masks. The law is expected to face a legal challenge."
  },
  {
    "title": "Top Democratic Leaders Ask Trump for Meeting to Avert a Shutdown",
    "link": "https://www.nytimes.com/2025/09/20/us/politics/jeffries-schumer-trump.html",
    "summary": "After a Republican plan to keep funding flowing foundered in the Senate, Representative Hakeem Jeffries and Senator Chuck Schumer accused the president of standing in the way of a solution."
  },
  {
    "title": "With Calls for Retribution Over Kirk, Some See Rise of a ‘Woke Right’",
    "link": "https://www.nytimes.com/2025/09/19/us/charlie-kirk-free-speech-republicans.html",
    "summary": "Conservatives have pressed for consequences for those who make negative comments about Charlie Kirk. But a few on the right say they worry about limits on speech."
  },
  {
    "title": "Trump Escalates Attack on Free Speech",
    "link": "https://www.nytimes.com/video/us/politics/100000010409626/trump-escalates-attack-on-free-speech.html",
    "summary": "Zolan Kanno-Youngs, a White House correspondent for The New York Times, describes how the Trump administration’s pressuring of ABC to take action against Jimmy Kimmel is part of a broader crackdown by the administration since the assassination of Charlie Kirk."
  },
  {
    "title": "Thousands Flock to Phoenix for Charlie Kirk’s Memorial Service",
    "link": "https://www.nytimes.com/2025/09/20/us/politics/charlie-kirk-memorial-phoenix.html",
    "summary": "On Saturday a steady stream of people, many who had traveled from other cities, made a pilgrimage to Kirk’s Turning Point USA office and the mortuary where his body lay."
  },
  {
    "title": "What to Know About Charlie Kirk’s Funeral: Time, How to Watch and Speakers",
    "link": "https://www.nytimes.com/2025/09/20/us/charlie-kirk-funeral-memorial-time-guests.html",
    "summary": "The conservative activist will be honored in a public program on Sunday, with President Trump and several top administration officials expected to speak."
  },
  {
    "title": "Arrest in Arizona Before Charlie Kirk Memorial Heightens Security Concerns",
    "link": "https://www.nytimes.com/2025/09/20/us/charlie-kirk-memorial-security-arizona.html",
    "summary": "After a man was charged with impersonating a police officer, a spokesman for the group Charlie Kirk founded said the man had been providing advance security for a guest."
  },
  {
    "title": "Trump’s $100,000 H1-B Visa Fee Spurs Confusion and Chaos for Companies",
    "link": "https://www.nytimes.com/2025/09/20/business/trump-h1b-visas-fee-employees.html",
    "summary": "The White House sought to clarify the proclamation on Saturday, but many companies remained cautious. “We are still flying in somewhat foggy conditions,” one attorney said."
  },
  {
    "title": "The H-1B Visa: Why Is Trump Adding a $100,000 Fee?",
    "link": "https://www.nytimes.com/2025/09/20/us/politics/h1b-visa-trump-immigration.html",
    "summary": "President Trump signed a proclamation on Friday adding a $100,000 fee to visas for skilled foreign workers. Immigration hard-liners have criticized the program for replacing American workers."
  },
  {
    "title": "White House Outlines a TikTok Deal With a U.S. Board",
    "link": "https://www.nytimes.com/2025/09/20/technology/white-house-tiktok-deal.html",
    "summary": "A potential deal to reduce TikTok’s ties to China would give the app a new board with six American directors out of seven, the White House press secretary said."
  },
  {
    "title": "Seeing Through the Reality of Meta’s Smart Glasses",
    "link": "https://www.nytimes.com/2025/09/20/technology/personaltech/meta-smart-glasses-mark-zuckerberg.html",
    "summary": "Mark Zuckerberg’s glitch-filled unveiling of computerized glasses revealed a company that may struggle to deliver on its promise for the future of computing."
  },
  {
    "title": "Nepal Uprising Is Latest Challenge to India’s Backyard Diplomacy",
    "link": "https://www.nytimes.com/2025/09/21/world/asia/india-nepal-diplomacy-asia.html",
    "summary": "The overthrow of Nepal’s government is the latest in a series of uprisings among India’s neighbors, creating a political churn that complicates its ties."
  },
  {
    "title": "They Helped Oust a Dictator. Now the New Regime Is Coming for Them.",
    "link": "https://www.nytimes.com/2025/09/20/world/americas/nicaragua-ortega-arrests.html",
    "summary": "President Daniel Ortega of Nicaragua and his wife, who is co-president, have been arresting longtime loyalists, in an apparent quest to ensure no one outside the family rises to power."
  },
  {
    "title": "They Were Promised a Taste of America. They Got Abuse and Exploitation.",
    "link": "https://www.nytimes.com/2025/09/20/nyregion/j1-visa-foreign-workers.html",
    "summary": "Every year, tens of thousands of young people are sent on visas to toil as farmworkers, housekeepers and office interns, all in the name of cultural exchange."
  },
  {
    "title": "4 Takeaways From the Times Investigation Into the J-1 Visa Program",
    "link": "https://www.nytimes.com/2025/09/20/nyregion/j-1-visa-investigation-takeaways.html",
    "summary": "Some American companies have used the cultural exchange program as a supply of cheap, exploitable labor, records and interviews show."
  },
  {
    "title": "Marian Burros, 92, Dies; Food Writer Famed for Her Plum Torte and More",
    "link": "https://www.nytimes.com/2025/09/20/dining/marian-burros-dead.html",
    "summary": "At The Times and elsewhere, she combined recipe writing with reporting on topics like consumer protection and food safety. Her torte was a longtime fan favorite."
  },
  {
    "title": "Combs Sentencing Focuses Attention on Prostitution Law From 1910",
    "link": "https://www.nytimes.com/2025/09/19/arts/music/sean-combs-diddy-sentencing-mann-act.html",
    "summary": "Acquitted of more serious charges, Sean Combs was found guilty of violating a law enacted during a panic over “white slavery” that is now a common tool in sex crimes prosecutions."
  },
  {
    "title": "I Look at This Country and I See a Stranger",
    "link": "https://www.nytimes.com/2025/09/21/opinion/trump-kirk-trans-people-russia.html",
    "summary": "This is one of those moments in history."
  },
  {
    "title": "The Aid Cuts Are Trump’s Most Lethal Policy",
    "link": "https://www.nytimes.com/2025/09/20/opinion/trump-usaid-cuts.html",
    "summary": "In desperate villages in southwestern Uganda, not only are aid cuts killing children every day, but the death toll is accelerating."
  },
  {
    "title": "One Dead in Shooting at New Hampshire Country Club",
    "link": "https://www.nytimes.com/2025/09/20/us/new-hampshire-country-club-shooting.html",
    "summary": "A suspect was detained after the shooting at the Sky Meadow Country Club in Nashua left one person dead and several others injured, the police said."
  },
  {
    "title": "Justice Alito, in Rome, Says Religious Liberty Is Under Siege",
    "link": "https://www.nytimes.com/2025/09/20/world/europe/justice-alito-rome-religious-liberty.html",
    "summary": "Justice Samuel A. Alito Jr., a conservative Catholic, has visited Rome for decades, often teaching or participating in academic conferences."
  },
  {
    "title": "Five-Alarm Fire on Brooklyn Waterfront Devastates Artists’ Warehouse",
    "link": "https://www.nytimes.com/2025/09/20/nyregion/red-hook-warehouse-fire.html",
    "summary": "A row of converted 19th-century buildings filled with artists in the 1990s and transformed Red Hook. Now the work of more than 500 artists may be lost."
  },
  {
    "title": "Diane Martel, Inventive Director of Music Videos, Dies at 63",
    "link": "https://www.nytimes.com/2025/09/20/arts/diane-martel-dead.html",
    "summary": "Over three decades, she worked with superstars such as Jennifer Lopez and Mariah Carey, and faced claims of misogyny with her video for Robin Thicke’s “Blurred Lines.”"
  }
]