[
  {
    "title": "John Bolton Indicted Over Handling of Classified Information",
    "link": "https://www.nytimes.com/2025/10/16/us/politics/john-bolton-indictment-trump.html",
    "summary": "Mr. Bolton, a Trump aide turned critic, is part of a string of presidential foes to become prosecutorial targets. But his case gained momentum in the Biden administration."
  },
  {
    "title": "How the Bolton Indictment Compares to Trump’s Classified Documents Case",
    "link": "https://www.nytimes.com/2025/10/16/us/politics/trump-bolton-indictment-documents.html",
    "summary": "Some charges against the onetime national security adviser resemble the dropped case against President Trump, but there are also differences."
  },
  {
    "title": "7 Takeaways From the First N.Y.C. Mayoral Debate",
    "link": "https://www.nytimes.com/2025/10/16/nyregion/nyc-mayor-debate-mamdani-cuomo-takeaways.html",
    "summary": "Zohran Mamdani, Andrew Cuomo and Curtis Sliwa sparred over serious topics like the Israel-Hamas war and President Trump, and more curious subjects like parade attendance."
  },
  {
    "title": "The Top Zingers of the Mayoral Debate",
    "link": "https://www.nytimes.com/2025/10/16/nyregion/mamdani-cuomo-sliwa-debate.html",
    "summary": "The two-hour slugfest produced some memorable one-liners, on subjects ranging from the candidates’ parents to imaginary sports championships."
  },
  {
    "title": "Military Commander Overseeing Escalating Attacks Off Venezuela Coast Is Stepping Down, Officials Say",
    "link": "https://www.nytimes.com/2025/10/16/us/politics/southern-command-head-stepping-down.html",
    "summary": "Adm. Alvin Holsey is leaving less than a year into his tenure, and as the Pentagon escalates attacks against boats in the Caribbean Sea."
  },
  {
    "title": "U.S. Military Killed Venezuelan Fisherman in Suspected Drug Boat Attack, Family Says",
    "link": "https://www.nytimes.com/2025/10/16/world/americas/trinidad-us-military-venezuela-boats.html",
    "summary": "For the first time, one of the 27 people killed in U.S. airstrikes on suspected drug vessels has been publicly identified."
  },
  {
    "title": "U.S. B-52s and Helicopters Fly Near Venezuela in Show of Threats",
    "link": "https://www.nytimes.com/2025/10/16/us/politics/trump-administration-helicopters-venezuela-military-pressure.html",
    "summary": "The Trump administration is sharply increasing U.S. military pressure on the government of Nicolás Maduro."
  },
  {
    "title": "Trump’s Unilateral Spending Cuts Complicate Shutdown Deal",
    "link": "https://www.nytimes.com/2025/10/16/us/politics/trump-unilateral-spending-cuts-shutdown.html",
    "summary": "Democrats want guarantees that President Trump will not continue to claw back spending, ignoring any agreement they strike. But he has promised to keep defying Congress."
  },
  {
    "title": "Trump Refiles $15 Billion Lawsuit Against The New York Times",
    "link": "https://www.nytimes.com/2025/10/17/business/media/trump-lawsuit-new-york-times.html",
    "summary": "A federal judge had previously dismissed the complaint as unnecessarily lengthy and digressive. The president claims that The Times sought to defame him during the 2024 election."
  },
  {
    "title": "Trump Plans to Meet With Putin to Talk About a Cease-Fire in Ukraine",
    "link": "https://www.nytimes.com/2025/10/16/us/politics/trump-putin-cease-fire-ukraine.html",
    "summary": "A day ahead of his meeting with Ukraine’s leader at the White House to discuss an arms package, President Trump suggested that Russia might be open to a diplomatic solution to the war it started."
  },
  {
    "title": "Russia Is Arming Drones With North Korean Cluster Weapons, Report Says",
    "link": "https://www.nytimes.com/2025/10/16/us/politics/russia-north-korean-cluster-weapons.html",
    "summary": "Though Pyongyang has largely pulled its soldiers off the front lines in Ukraine, it is expanding the types of ammunition it supplies to Russia."
  },
  {
    "title": "Ace Frehley, Kiss Guitarist and Founding Member, Is Dead at 74",
    "link": "https://www.nytimes.com/2025/10/16/arts/music/ace-frehley-dead.html",
    "summary": "A consummate showman, he was known for playing guitars rigged with pyrotechnic effects and for his distinctive stage persona."
  },
  {
    "title": "Salesforce Offers Its Services to Boost Trump’s Immigration Force",
    "link": "https://www.nytimes.com/2025/10/16/us/salesforce-benioff-ice.html",
    "summary": "The San Francisco-based firm has told ICE that it could use A.I. to help the agency nearly triple its staff. The company’s C.E.O., once a progressive tech titan, has embraced President Trump."
  },
  {
    "title": "Appeals Court Maintains Block on Trump’s Troop Deployment to Illinois",
    "link": "https://www.nytimes.com/2025/10/16/us/appeals-trump-national-guard-troops-illinois.html",
    "summary": "“Political opposition is not rebellion,” wrote a Seventh Circuit panel, rejecting an attempt by the Trump administration to remove an order by a trial court judge."
  },
  {
    "title": "Wisconsin Man Used TikTok to Call for the Killing of ICE Agents, U.S. Says",
    "link": "https://www.nytimes.com/2025/10/16/us/wisconsin-man-tiktok-threats-ice.html",
    "summary": "Andrew Stanton, 38, was charged with threatening federal law enforcement officers, whom he said should be shot. He pleaded not guilty and remains in custody."
  },
  {
    "title": "Trump Warns Hamas of Strikes if Violence in Gaza Continues",
    "link": "https://www.nytimes.com/2025/10/16/us/politics/trump-hamas-warnings-gaza-strikes.html",
    "summary": "The president later clarified that the United States would not be involved in such an action."
  },
  {
    "title": "What’s Next for the Gaza Cease-Fire Plan",
    "link": "https://www.nytimes.com/video/world/middleeast/100000010458240/whats-next-for-the-gaza-cease-fire-plan.html",
    "summary": "Israel and Hamas have reached a cease-fire deal in Gaza, but the hard part starts now. David Sanger of The New York Times describes the major obstacles to further agreement about Gaza’s immediate future."
  },
  {
    "title": "Yemen’s Houthis Confirm Killing of Top Military Official",
    "link": "https://www.nytimes.com/2025/10/16/world/middleeast/houthis-top-general-killed-yemen.html",
    "summary": "It was unclear when Maj. Gen. Mohammed al-Ghomari was killed, or by whom, but Israel appeared to claim the killing."
  },
  {
    "title": "Tomiichi Murayama, Japanese Leader Who Gave War Apology, Dies at 101",
    "link": "https://www.nytimes.com/2025/10/17/world/asia/tomiichi-murayama-dead.html",
    "summary": "His televised address as prime minister delivered 50 years to the day after Japan announced its surrender set a marker for his country’s “deep remorse” over wartime atrocities."
  },
  {
    "title": "Parties Brace for a Political Future Without the Voting Rights Act",
    "link": "https://www.nytimes.com/2025/10/16/us/politics/democrats-republicans-voting-rights.html",
    "summary": "After the Supreme Court appeared poised to weaken a key provision of the landmark civil rights law, both parties began to reckon with an uncertain future."
  },
  {
    "title": "Book Review: ‘Nobody’s Girl,’ by Virginia Roberts Giuffre",
    "link": "https://www.nytimes.com/2025/10/16/books/review/virginia-roberts-giuffre-nobodys-girl-memoir.html",
    "summary": "Virginia Roberts Giuffre’s posthumous “Nobody’s Girl” doesn’t break political news, but might break your heart."
  },
  {
    "title": "Little Fliers Everywhere",
    "link": "https://www.nytimes.com/2025/10/16/style/fliers-memes-instagram.html",
    "summary": "They’re not just for missing pets or yard sales. Fliers these days are for internet memes, self-promotion and extremely esoteric messages."
  },
  {
    "title": "The Real Trump Factor in the Gaza Deal",
    "link": "https://www.nytimes.com/2025/10/17/opinion/trump-netanyahu-gaza-israel-deal.html",
    "summary": "The secret of Donald Trump’s success with the Israeli prime minister was offering carrots on domestic politics — not sticks on foreign policy."
  },
  {
    "title": "Amy Coney Barrett Is Looking Beyond the Trump Era",
    "link": "https://www.nytimes.com/2025/10/16/opinion/amy-coney-barrett-interesting-times-podcast.html",
    "summary": "The Supreme Court justice isn’t making decisions based on public opinion."
  },
  {
    "title": "After Racist Texts, New York G.O.P. Is Set to Disband Young Republicans",
    "link": "https://www.nytimes.com/2025/10/16/nyregion/ny-young-republicans-racist-texts.html",
    "summary": "State party leaders are expected to eliminate the charter of the Young Republicans group, allowing them to reconstitute the organization with new leaders."
  },
  {
    "title": "Jeffrey Meldrum, Scholar Who Stalked Bigfoot, Dies at 67",
    "link": "https://www.nytimes.com/2025/10/16/science/jeffrey-meldrum-dead.html",
    "summary": "His willingness to bring scientific rigor to Sasquatch studies earned him the gratitude of enthusiasts and the withering scorn of debunkers."
  },
  {
    "title": "Police Warn Against Pranking People With A.I. Images of Homeless Intruder",
    "link": "https://www.nytimes.com/2025/10/16/us/police-prank-ai-homeless-tiktok.html",
    "summary": "Law enforcement departments in several states said that an online trend in which people are tricked into believing a homeless man is in their homes could have dangerous consequences."
  }
]