[
  {
    "title": "Why Now? The Lost Chances to Reach a Hostage Deal, and a Cease-Fire, Months Ago",
    "link": "https://www.nytimes.com/2025/10/12/us/politics/lost-chances-hostage-deal-gaza-israel.html",
    "summary": "On Gaza, President Trump put few, if any, guardrails on Israel’s offensive, bucking international demands for a cease-fire. Then he changed course."
  },
  {
    "title": "Israel and Hamas Were Not Ready for a Comprehensive Peace Deal, Mediator Says",
    "link": "https://www.nytimes.com/2025/10/12/world/middleeast/israel-hamas-peace-deal.html",
    "summary": "The Qatari prime minister told The New York Times that Gaza war mediators decided to delay talks on more difficult issues so a hostage-prisoner swap could be concluded quickly."
  },
  {
    "title": "How Trump’s Chicago Immigration Crackdown Escalated, in 10 Videos",
    "link": "https://www.nytimes.com/2025/10/12/us/chicago-immigration-crackdown-videos.html",
    "summary": "Week by week, the federal campaign to ramp up immigration enforcement in the Chicago area has created fear and inflamed tensions."
  },
  {
    "title": "Asia Markets Fall After Trump Threatens New Tariffs on China",
    "link": "https://www.nytimes.com/2025/10/12/business/trump-china-tariffs-global-markets.html",
    "summary": "Investors reacted to a pledge from the president on Friday to impose a “massive” new tariff on Chinese imports."
  },
  {
    "title": "Trump Has Not Ruled Out Invoking Insurrection Act to Deploy National Guard, Vance Says",
    "link": "https://www.nytimes.com/2025/10/12/us/politics/jd-vance-trump-insurrection-act.html",
    "summary": "Vice President JD Vance asserted in an interview on NBC News’ “Meet the Press” that crime was “out of control” in major U.S. cities."
  },
  {
    "title": "Cars to Fighter Jets: China’s New Export Curbs May Level a Heavy Blow Worldwide",
    "link": "https://www.nytimes.com/2025/10/12/business/china-rare-earth-export-controls.html",
    "summary": "Broad restrictions could cause supply interruptions for arms makers, as well as manufacturers in the semiconductor, automotive and other sectors."
  },
  {
    "title": "Orban’s ‘Propaganda State’ in Hungary Is Starting to Show Cracks",
    "link": "https://www.nytimes.com/2025/10/12/world/europe/orban-hungary-media-propaganda-magyar.html",
    "summary": "The Hungarian leader has secured power by keeping control over the news media. Now, a political opponent is starting to show the limits of his tactics."
  },
  {
    "title": "The Surprising Power of Diane Keaton’s Emotional Transparency",
    "link": "https://www.nytimes.com/2025/10/12/movies/diane-keaton-the-godfather.html",
    "summary": "Earlier roles in “The Godfather” and later roles in “Something’s Gotta Give” showed the depth and nuance of the actress whom we met in “Annie Hall.”"
  },
  {
    "title": "Diane Keaton in ‘Reds’: A Remarkable Performance but Also a Returning Point",
    "link": "https://www.nytimes.com/2025/10/12/movies/diane-keaton-reds.html",
    "summary": "Her character, an early-20th-century journalist, undergoes the most dramatic transformation of the film in ways that the actress was especially suited for."
  },
  {
    "title": "Diane Keaton Was the Definition of a Style Icon",
    "link": "https://www.nytimes.com/2025/10/12/style/diane-keaton-style-icon.html",
    "summary": "Her legacy will include the ways she shaped fashion, rather than allowing fashion to shape her."
  },
  {
    "title": "Inside the Closed-Door Meetings of the N.F.L.’s Billionaire Owners",
    "link": "https://www.nytimes.com/2025/10/12/business/nfl-owners-trump.html",
    "summary": "Every three months, closed-door meetings of the billionaires who own N.F.L. teams become displays of status, beefs and sometimes Trump-induced headaches."
  },
  {
    "title": "What’s the Deal With All Those FanDuel Ads?",
    "link": "https://www.nytimes.com/2025/10/12/business/fanduel-flutter-sports-betting-gambling.html",
    "summary": "Peter Jackson, the chief executive of Flutter Entertainment, FanDuel’s parent company, is fighting for attention as online gambling spreads across the United States."
  },
  {
    "title": "How China Powers Its Electric Cars and High-Speed Trains",
    "link": "https://www.nytimes.com/2025/10/11/business/china-electric-grid.html",
    "summary": "China is building a network of ultrahigh-voltage power lines to carry solar and wind energy hundreds and even thousands of miles as few citizens dare to protest."
  },
  {
    "title": "Why China Built 162 Square Miles of Solar Panels on the World’s Highest Plateau",
    "link": "https://www.nytimes.com/2025/10/10/business/china-solar-tibetan-plateau.html",
    "summary": "China is using the high-altitude expanse for immense solar panel farms and wind turbines and has begun work on the world’s largest hydroelectric dams."
  },
  {
    "title": "A Tennessee Sheriff Becomes the Face of Grief After Plant Explosion",
    "link": "https://www.nytimes.com/2025/10/12/us/tennessee-sheriff-plant-explosion-tears.html",
    "summary": "The blast that killed 16 people has left area residents reeling, including Sheriff Chris Davis of Humphreys County, who has fought back tears in his public briefings."
  },
  {
    "title": "Nor’easter Brings Heavy Rain and Flooding as It Moves Up East Coast",
    "link": "https://www.nytimes.com/2025/10/12/us/noreaster-storm-forecast-damage.html",
    "summary": "The Mid-Atlantic and Northeast will bear the brunt of the storm, which will usher in beach erosion and flooding, Monday into Tuesday, forecasters said."
  },
  {
    "title": "Dozens Rescued in Remote Alaskan Villages in Storm That Swept Away Homes",
    "link": "https://www.nytimes.com/2025/10/13/us/alaska-flooding-rescues.html",
    "summary": "The Coast Guard and the Alaska National Guard were conducting search-and-rescue operations in two villages along the Bering Sea on Sunday."
  },
  {
    "title": "How Las Vegas Sands Helped Get the N.B.A. Back Into China",
    "link": "https://www.nytimes.com/2025/10/11/world/asia/las-vegas-sands-nba-china-macau-casino-dumont-games.html",
    "summary": "Las Vegas Sands, owned by the Adelson family, was under pressure in Macau, with billions at stake. That created an opportunity."
  },
  {
    "title": "N.B.A. Head Criticizes Chinese Party Paper Over LeBron James ‘Op-Ed’",
    "link": "https://www.nytimes.com/2025/10/11/world/asia/china-nba-lebron.html",
    "summary": "The People’s Daily newspaper put the star player’s name on an opinion article, an example of the political perils the N.B.A. could face in China."
  },
  {
    "title": "The Destructive Legacy of California’s Zombie Fires",
    "link": "https://www.nytimes.com/2025/10/12/us/palisades-zombie-fires.html",
    "summary": "Blazes that firefighters thought had died but then later came roaring back to life have become increasingly common, heightening scrutiny of how first-responders put out wildfires."
  },
  {
    "title": "California Orders Insurers to Pay More for Wildfire Victims’ Lost Items",
    "link": "https://www.nytimes.com/2025/10/12/realestate/california-doubles-wildfire-payouts.html",
    "summary": "After years of fires that left families tallying every burned toothbrush, a new law is requiring insurers to ease a grueling burden."
  },
  {
    "title": "How ‘TBPN’ Became Silicon Valley’s Newest Obsession",
    "link": "https://www.nytimes.com/2025/10/11/technology/tbpn-silicon-valley.html",
    "summary": "Silicon Valley is obsessed with “TBPN,” a streaming show on which no career move is too trivial to document."
  },
  {
    "title": "Hope Didn’t End With Foreign Aid Cuts",
    "link": "https://www.nytimes.com/2025/10/13/opinion/aid-cuts-new-model.html",
    "summary": "Developing countries have started taking greater responsibility for their own welfare, leveraging private investment to create economic opportunity."
  },
  {
    "title": "What Ted Lasso, the Bhargava Gita and Derrida Can Teach Us About Ourselves",
    "link": "https://www.nytimes.com/2025/10/12/opinion/derrida-trump-ted-lasso-binaries.html",
    "summary": "Our culture is amok with binaries. We have two major parties, just two, and they are forever opposed."
  },
  {
    "title": "How the Young Lords Took Over Lincoln Hospital in the Bronx — Twice",
    "link": "https://www.nytimes.com/2025/10/10/us/young-lords-lincoln-hospital-addiction.html",
    "summary": "In 1970, the Young Lords, a Puerto Rican civil rights group, seized a hospital in the Bronx — twice."
  },
  {
    "title": "John Searle, Philosopher Who Wrestled With A.I., Dies at 93",
    "link": "https://www.nytimes.com/2025/10/12/books/john-searle-dead.html",
    "summary": "His blunt debating and imaginative theorizing about artificial intelligence and the human mind made him a leading scholar. But sexual-harassment allegations ended his career."
  },
  {
    "title": "2 Dead After Small Plane Crashes Into Semitrailers Near Texas Airfield",
    "link": "https://www.nytimes.com/2025/10/12/us/fort-worth-plane-crash-hicks-field.html",
    "summary": "It was unknown what led up to the crash on Sunday afternoon near Hicks Airfield outside of Fort Worth."
  }
]