[
  {
    "title": "Trump Fired a U.S. Attorney Who Insisted on Following a Court Order",
    "link": "https://www.nytimes.com/2025/09/26/us/trump-fires-us-attorney-california-immigration.html",
    "summary": "The top federal prosecutor in Sacramento was fired hours after she reminded a Border Patrol chief to abide by court-ordered restrictions on immigration raids."
  },
  {
    "title": "Supreme Court Allows Trump to Withhold $4 Billion in Foreign Aid Funding",
    "link": "https://www.nytimes.com/2025/09/26/us/politics/supreme-court-trump-foreign-aid.html",
    "summary": "The court’s conservative majority allowed the president to cut the funding in part because it said his flexibility to engage in foreign affairs outweighed “the potential harm” faced by aid recipients."
  },
  {
    "title": "Texas Tech Moves to Limit Academic Discussion to 2 Genders",
    "link": "https://www.nytimes.com/2025/09/26/us/politics/texas-tech-gender.html",
    "summary": "The university system said faculty must comply with President Trump’s order recognizing only two genders, possibly a first for a major public institution of higher education."
  },
  {
    "title": "Summoned U.S. Military Officers Are Expected to Hear a ‘Rally the Troops’ Message",
    "link": "https://www.nytimes.com/2025/09/26/us/politics/hegseth-military-summit.html",
    "summary": "Several generals and admirals said the unusual meeting in the Washington area called by Defense Secretary Pete Hegseth would be both disruptive and expensive."
  },
  {
    "title": "Despite False Claims, Trump Funnels Millions Into Credible Autism Research",
    "link": "https://www.nytimes.com/2025/09/26/health/autism-research-trump-kennedy.html",
    "summary": "Many scientists were pleased to learn that N.I.H. funding will go to leading experts examining complex new theories, not only fears over vaccines."
  },
  {
    "title": "Des Moines Schools Superintendent Ian Roberts Detained by ICE, Officials Say",
    "link": "https://www.nytimes.com/2025/09/26/us/des-moines-schools-ice-immigration.html",
    "summary": "Federal immigration officials said the superintendent had received a deportation order in May 2024 and fled from agents when they approached him on Friday."
  },
  {
    "title": "Dallas ICE Shooting Victim, a Detainee, Is Now Fighting for His Life",
    "link": "https://www.nytimes.com/2025/09/26/us/politics/victims-dallas-ice.html",
    "summary": "Miguel Ángel García is one of two detainees critically injured by a Dallas gunman who killed another detainee. Officials have not identified the victims, but families are coming forward."
  },
  {
    "title": "ICE Officer ‘Relieved of His Duties’ After Pushing Woman to Floor",
    "link": "https://www.nytimes.com/2025/09/26/nyregion/ice-officer-investigation-woman-shoved.html",
    "summary": "The Department of Homeland Security said it was investigating an officer’s action during an altercation at a New York City immigration courthouse."
  },
  {
    "title": "Trump Believes ‘We Have a Deal’ on Gaza. But a Host of Obstacles Remain.",
    "link": "https://www.nytimes.com/2025/09/26/us/politics/trump-gaza-deal.html",
    "summary": "Whether President Trump can help bring the war to an end will probably depend on how much he is willing to push Benjamin Netanyahu."
  },
  {
    "title": "Defiant Netanyahu Denounces Palestine Recognition, to a Mostly Empty U.N. Hall",
    "link": "https://www.nytimes.com/2025/09/26/world/middleeast/netanyahu-speech-united-nations.html",
    "summary": "A Palestinian state would be “national suicide” for Israel, Prime Minister Benjamin Netanyahu said, but many of the diplomats and leaders at the assembly boycotted his remarks."
  },
  {
    "title": "As Witkoff Pitched Mideast Peace, His Son Pitched Mideast Investors",
    "link": "https://www.nytimes.com/2025/09/26/business/witkoff-son-qatar-gaza.html",
    "summary": "Steve Witkoff’s son recently sought money from Gulf states including Qatar, which has previously invested in Witkoff family projects to win favor with President Trump."
  },
  {
    "title": "Gunman in NYC Shooting at NFL Headquarters Had CTE",
    "link": "https://www.nytimes.com/2025/09/26/us/cte-football-tamura-gunman.html",
    "summary": "Shane Tamura, a former high school football player, shot himself and left a note that said his motive was anger at the N.F.L."
  },
  {
    "title": "In ‘Punch’ on Broadway, Trying to Summon Empathy for the Unforgivable",
    "link": "https://www.nytimes.com/2025/09/26/theater/punch-broadway-restorative-justice.html",
    "summary": "The Broadway play “Punch” retells the true story of a fatal blow and how restorative justice brought healing to the parents and to the young man who threw the punch."
  },
  {
    "title": "Trump Expands Tariffs Beyond Supreme Court’s Reach",
    "link": "https://www.nytimes.com/2025/09/26/us/politics/trump-tariffs-supreme-court.html",
    "summary": "The president’s tariffs on foreign drugs and furniture rely on national security laws outside the scope of current lawsuits."
  },
  {
    "title": "How Trump’s Latest Tariffs May Affect Your Medicines",
    "link": "https://www.nytimes.com/2025/09/26/health/trump-drug-tariffs-prescription-costs.html",
    "summary": "The president said he would impose a tariff of 100 percent on certain brand-name drugs. Here’s what we know so far."
  },
  {
    "title": "Sinclair and Nexstar End Jimmy Kimmel Boycott on Local ABC Stations",
    "link": "https://www.nytimes.com/2025/09/26/business/media/sinclair-jimmy-kimmel-boycott.html",
    "summary": "Sinclair and Nexstar have been pre-empting Mr. Kimmel’s show since he returned this week."
  },
  {
    "title": "Judge Rejects Lawsuit Claiming Art Had Lost Its ‘Oomph’",
    "link": "https://www.nytimes.com/2025/09/26/arts/design/ronald-perelman-cy-twombly-oomph-lawsuit.html",
    "summary": "The collector’s holding companies had sued his insurers for $400 million to cover paintings that they say had been damaged in a fire. The insurers said they had survived untouched."
  },
  {
    "title": "Robert B. Barnett, Washington Master of the Book World Megadeal, Dies at 79",
    "link": "https://www.nytimes.com/2025/09/26/books/robert-barnett-dead.html",
    "summary": "A powerhouse Washington lawyer, he negotiated blockbuster contracts for A-list clients, including the Clintons, the Obamas and the Bushes, while often acting as their consigliere."
  },
  {
    "title": "5 Dairy Myths Experts Want to Correct",
    "link": "https://www.nytimes.com/2025/09/26/well/eat/health-myths-dairy.html",
    "summary": "We surveyed leading nutrition experts to reveal the truth about raw milk, lactose intolerance, low-fat dairy and more."
  },
  {
    "title": "New Treatment Shows Promise for Huntington’s Disease",
    "link": "https://www.nytimes.com/2025/09/26/well/huntingtons-disease-treatment.html",
    "summary": "A gene therapy injected into patients’ brains slowed progression of the disease by 75 percent, preliminary findings reported."
  },
  {
    "title": "Polish Skier Climbs Everest and Skis Down Without Extra Oxygen",
    "link": "https://www.nytimes.com/2025/09/26/sports/andrzej-bargiel-mount-everest-oxygen-skiing.html",
    "summary": "Andrzej Bargiel, 37, became the first person to complete the feat."
  },
  {
    "title": "The Comey Indictment Plunges the Country Into a Grave New Period",
    "link": "https://www.nytimes.com/2025/09/26/opinion/comey-indictment-justice-department.html",
    "summary": "As despots have done for centuries, Trump is persecuting people he considers his enemies, with little justification other than raw political power."
  },
  {
    "title": "Trump Can’t Be the One to Pick Who’s Indicted",
    "link": "https://www.nytimes.com/2025/09/26/opinion/james-comey-indicted-trump.html",
    "summary": "The Justice Department and the attorney general are supposed to keep a distance from the president, not be his personal score settlers."
  },
  {
    "title": "Netanyahu Was Defiant at the U.N.",
    "link": "https://www.nytimes.com/2025/09/26/briefing/netanyahu-un-comey-trump-indicted.html",
    "summary": "Also, what’s next after James Comey’s indictment. Here’s the latest at the end of Friday."
  },
  {
    "title": "Argentina’s President Vowed to Fix Its Economy. Then Came a Crisis.",
    "link": "https://www.nytimes.com/2025/09/26/world/americas/milei-argentina-economy.html",
    "summary": "President Javier Milei slashed inflation and spending, but it wasn’t enough to stave off an economic crisis. President Trump has offered him a lifeline."
  },
  {
    "title": "Jared Kushner’s Firm Is Said to Be Part of $50 Billion Buyout of Electronic Arts",
    "link": "https://www.nytimes.com/2025/09/26/business/electronic-arts-buyout-jared-kushner.html",
    "summary": "Mr. Kushner’s private equity firm, Affinity Partners, is said to be in talks with the Saudi sovereign wealth fund and Silver Lake to buy out the video game giant."
  },
  {
    "title": "Assata Shakur Dies at 78; Convicted Revolutionary Found Refuge in Cuba",
    "link": "https://www.nytimes.com/2025/09/26/obituaries/assata-shakur-dead.html",
    "summary": "A member of a Black militant group, she was found guilty in the 1973 murder of a New Jersey state trooper, escaped from prison and fled to Cuba, where she taught and wrote."
  },
  {
    "title": "Brutal Murder of 3 Women, Broadcast On Instagram, Shocks Argentina",
    "link": "https://www.nytimes.com/2025/09/26/world/americas/argentina-women-murder-instagram.html",
    "summary": "The live streamed torture and killing of three young women in Buenos Aires has stunned the country, setting off worries about the increasing presence of drug cartels."
  }
]