[
  {
    "title": "Binance Employees Find $1.7 Billion in Crypto Was Sent to Iranian Entities",
    "link": "https://www.nytimes.com/2026/02/23/technology/binance-employees-iran-firings.html",
    "summary": "Binance pledged to crack down on crime. But internal investigators at the world’s largest crypto exchange continued to find evidence of potential legal violations on the platform."
  },
  {
    "title": "Drug Lord ‘El Mencho’ Was Killed in Mexico. What’s Next for the Cartel He Led?",
    "link": "https://www.nytimes.com/2026/02/23/world/americas/el-mencho-killed-mexico-cartel.html",
    "summary": "The death of Nemesio Oseguera Cervantes dealt a major blow to the Jalisco New Generation Cartel, but few believe it spells the end for the powerful group."
  },
  {
    "title": "What to Know About the Killing of ‘El Mencho’",
    "link": "https://www.nytimes.com/2026/02/22/world/americas/el-mencho-mexico-what-we-know.html",
    "summary": "The Mexican government has killed Nemesio Oseguera Cervantes, the longtime leader of one of Mexico’s most powerful gangs, the Jalisco New Generation Cartel."
  },
  {
    "title": "Witness Who Disputed ICE Account of Ruben Ray Martinez Shooting Dies in Car Accident",
    "link": "https://www.nytimes.com/2026/02/23/us/ice-shooting-texas-witness-dead.html",
    "summary": "A passenger in the car with Ruben Ray Martinez wrote that the men were trying to comply with authorities before Mr. Martinez was shot. The passenger, Joshua Orta, died in a car accident on Saturday."
  },
  {
    "title": "Border Patrol Shoots Armed Person Near Canadian Border, Authorities Say",
    "link": "https://www.nytimes.com/2026/02/23/us/politics/border-patrol-shooting-new-hampshire.html",
    "summary": "The F.B.I. said that the person, who was not killed, “allegedly fired at” a Border Patrol agent in Pittsburg, N.H., around 1 a.m. on Sunday."
  },
  {
    "title": "Pizzoccheri Was Prominent at Winter Olympics in Italy",
    "link": "https://www.nytimes.com/2026/02/23/dining/olympics-pizzoccheri-italy-valtellina.html",
    "summary": "Pizzoccheri, a hearty buckwheat pasta, graced restaurant menus and the athletes’ cafeterias. A chef hopes it can put a spotlight on the valley where it comes from."
  },
  {
    "title": "The European Union Hits Pause on Its U.S. Trade Deal",
    "link": "https://www.nytimes.com/2026/02/23/world/europe/eu-us-trade-deal-pause-tariffs.html",
    "summary": "The E.U. isn’t throwing out the deal it agreed with the United States before President Trump’s tariffs were overruled, but European officials want more clarity first."
  },
  {
    "title": "Why the Supreme Court Struck Down Trump’s Tariffs",
    "link": "https://www.nytimes.com/video/us/100000010726142/why-the-supreme-court-struck-down-trumps-tariffs.html",
    "summary": "Our reporter Ann E. Marimow describes the rationale of the Supreme Court’s 6-to-3 ruling to strike down President Trump’s sweeping tariffs."
  },
  {
    "title": "Trump’s Challenge to Free Market Capitalism",
    "link": "https://www.nytimes.com/2026/02/22/business/economy/trump-republicans-economy-capitalism.html",
    "summary": "Stakes in private companies. Handshake deals with chief executives. The president’s economic policy has drifted far from principles that long defined the Republican Party. Is it capitalism at all?"
  },
  {
    "title": "Trump Administration Scrambles to Pick Up the Pieces of Broken Tariffs",
    "link": "https://www.nytimes.com/2026/02/23/us/politics/trump-tariffs-supreme-court.html",
    "summary": "President Trump is already working to piece his tariff program back together, after a Supreme Court ruling ruptured a centerpiece of his economic agenda."
  },
  {
    "title": "What’s Happened Since the Supreme Court’s Tariff Ruling",
    "link": "https://www.nytimes.com/2026/02/23/business/supreme-court-trump-tariffs-updates.html",
    "summary": "After the Trump administration’s punishing tariffs were invalidated, the president said he would impose new tariffs using a different authority. It’s been a whirlwind."
  },
  {
    "title": "Judge Bars Release of Special Counsel Report on Trump’s Mishandling of Documents",
    "link": "https://www.nytimes.com/2026/02/23/us/politics/trump-jack-smith-classified-documents-aileen-cannon.html",
    "summary": "Judge Aileen Cannon, a Trump-appointed federal judge in Florida, slammed the former special counsel, Jack Smith, for drafting the report even after she had dismissed the case."
  },
  {
    "title": "Fact-Check: Trump’s Latest Claims on Jobs, Inflation and Crime",
    "link": "https://www.nytimes.com/2026/02/23/us/politics/trump-economy-fact-check.html",
    "summary": "Trends on jobs, inflation and crime that began before Donald Trump retook office continued, largely unabated, in his first year back."
  },
  {
    "title": "Trump Says He Brought Down Inflation, Yet Many Still Feel the Pinch",
    "link": "https://www.nytimes.com/2026/02/23/us/trump-affordability-inflation-families.html",
    "summary": "President Trump says that he has brought down inflation, but families are still struggling to pay bills and plan for the future."
  },
  {
    "title": "Judges Grow Angry Over Trump Administration Violating Their Orders",
    "link": "https://www.nytimes.com/2026/02/23/us/politics/judges-contempt-immigration-trump.html",
    "summary": "At least 35 times since August, federal judges have ordered the administration to explain why it should not be punished for violating their orders in immigration cases."
  },
  {
    "title": "U.K. Police Arrest Ex-Ambassador Peter Mandelson Amid Epstein Accusations",
    "link": "https://www.nytimes.com/2026/02/23/world/europe/peter-mandelson-epstein-uk.html",
    "summary": "Peter Mandelson is being investigated over accusations of “misconduct in public office” amid his dealings with Jeffrey Epstein, the sex offender."
  },
  {
    "title": "Architecture Prize Responds After Tom Pritzker’s Epstein Ties Surface",
    "link": "https://www.nytimes.com/2026/02/23/arts/design/pritzker-prize-epstein-architecture.html",
    "summary": "A Pritzker Prize statement cited the award’s independence after Mr. Pritzker, who directs the foundation behind the award, resigned as chairman of the Hyatt Corporation."
  },
  {
    "title": "‘Survivor’ Is America",
    "link": "https://www.nytimes.com/2026/02/23/arts/television/survivor-season-50.html",
    "summary": "It’s our greatest game and our truest mirror. And in its tiki-torch-festooned way, it’s captured our society as an ever-changing collection of tribes."
  },
  {
    "title": "For Iran’s Rulers, Refusing U.S. Demands Is a Risk Worth Taking",
    "link": "https://www.nytimes.com/2026/02/23/world/middleeast/iran-us-nuclear-talks-war.html",
    "summary": "The government in Tehran sees capitulating to Washington’s demands on uranium enrichment and ballistic missiles as riskier to its survival than going to war, analysts say."
  },
  {
    "title": "The Next Conflict",
    "link": "https://www.nytimes.com/2026/02/23/briefing/potential-conflict-iran.html",
    "summary": "We’re looking at the potential for a U.S. attack on Iran."
  },
  {
    "title": "Backed by Anthropic, a Super PAC Group Begins an Ad Blitz in Support of A.I. Regulation",
    "link": "https://www.nytimes.com/2026/02/23/technology/ai-pac-ad-blitz.html",
    "summary": "The ads by Public First Action, which started airing on Monday, are part of an escalating political war over artificial intelligence before the midterm elections."
  },
  {
    "title": "Supreme Court to Weigh Oil-Industry Effort to End a Major Climate Suit",
    "link": "https://www.nytimes.com/2026/02/23/climate/supreme-court-boulder-climate-lawsuit.html",
    "summary": "The case could have significant bearing on a range of other lawsuits brought against the fossil fuel industry by cities and states across the country."
  },
  {
    "title": "Supreme Court Considers Fate of Docks and Other Assets Seized by Cuba in 1960",
    "link": "https://www.nytimes.com/2026/02/23/us/politics/supreme-court-cuba-cruise-docks.html",
    "summary": "Amid rising tensions with Cuba, the Trump administration is backing lawsuits that would allow Americans to get compensation for property confiscated by Fidel Castro’s regime."
  },
  {
    "title": "The Zero Units Fought for the C.I.A. in Afghanistan. In the U.S., They’re Living in Fear.",
    "link": "https://www.nytimes.com/2026/02/23/magazine/zero-units-cia-afghanistan.html",
    "summary": "A shooting in Washington, D.C., threw their immigration status into jeopardy — and brought attention to a long-hidden dimension of America’s war."
  },
  {
    "title": "BAFTAs Guest With Tourettes Shouts Racial Slur During Michael B. Jordan and Delroy Lindo’s Appearance",
    "link": "https://www.nytimes.com/2026/02/23/movies/baftas-tourettes.html",
    "summary": "A racist slur, shouted involuntarily while Michael B. Jordan and Delroy Lindo were presenting an award, raised questions about how the show’s host and the BBC responded."
  },
  {
    "title": "BAFTAs 2026: The Best and Worst Moments",
    "link": "https://www.nytimes.com/2026/02/23/movies/baftas-best-worst-moments.html",
    "summary": "Alan Cumming forced fishy British snacks onto movie stars. Paddington Bear presented an award. And a racist slur and swearing."
  },
  {
    "title": "Prince William and Kate Made a Pointed Appearance at BAFTA",
    "link": "https://www.nytimes.com/2026/02/23/style/catherine-william-princess-of-wales-bafta-dress.html",
    "summary": "After Andrew Mountbatten-Windsor’s arrest, the Prince and Princess of Wales made a pointed BAFTA appearance."
  },
  {
    "title": "The Human Cost of the Trump Administration’s War on Science",
    "link": "https://www.nytimes.com/2026/02/23/opinion/doge-hiv-funding.html",
    "summary": "The ripple effects of cutting H.I.V. research funding."
  },
  {
    "title": "What We Don’t Understand About Nick Reiner",
    "link": "https://www.nytimes.com/2026/02/23/opinion/nick-reiner-arraignment-psychology.html",
    "summary": "We feel compassion for his parents — but often not for Nick Reiner himself. His suffering, too, must have been terrible; it must be terrible right now."
  },
  {
    "title": "Nick Reiner Pleads Not Guilty in the Killing of His Parents",
    "link": "https://www.nytimes.com/2026/02/23/arts/nick-reiner-plea.html",
    "summary": "Mr. Reiner, 32, was charged with murdering his parents, the Hollywood director Rob Reiner and Michele Singer Reiner, last year."
  },
  {
    "title": "The Ukrainian Bureaucrat Working to Squeeze Russia’s War Machine",
    "link": "https://www.nytimes.com/2026/02/23/world/europe/ukraine-russia-sanctions.html",
    "summary": "Vladyslav Vlasiuk has spent the past four years pressing Western allies to squeeze the Russian economy through more sanctions. He hopes that 2026 will be the tipping point."
  },
  {
    "title": "France Summons U.S. Ambassador Over Comments on Activist’s Killing",
    "link": "https://www.nytimes.com/2026/02/23/world/europe/france-us-ambassador-kushner-activist-killing.html",
    "summary": "Charles Kushner, President Trump’s envoy to Paris, was called in after the State Department cited “violent radical leftism” in the beating death of Quentin Deranque, 23."
  },
  {
    "title": "Democrats Consider Breaking a Taboo in Washington State: A Millionaires Tax",
    "link": "https://www.nytimes.com/2026/02/23/us/politics/washington-democrats-millionaires-tax.html",
    "summary": "The state where Jeff Bezos and Bill Gates made fortunes might have progressive social policies, but its resistance to an income tax is similar to conservative states. That might change."
  }
]