[
  {
    "title": "Texas Flood Victims: What We Know",
    "link": "https://www.nytimes.com/2025/07/05/us/texas-flood-victims.html",
    "summary": "Child and adult campers and a camp director were among at least 51 people who have died in the flooding in Central Texas."
  },
  {
    "title": "Khamenei Appears in Public for First Time Since Israel War Began",
    "link": "https://www.nytimes.com/2025/07/05/world/middleeast/ayatollah-khamenei-iran-israel.html",
    "summary": "The long absence of Iran’s supreme leader, Ayatollah Ali Khamenei, from public life had fueled speculation about his health and threats to his life."
  },
  {
    "title": "The Cost of Victory: Israel Overpowered Its Foes, but Deepened Its Isolation",
    "link": "https://www.nytimes.com/2025/07/05/world/middleeast/israel-cost-of-victory.html",
    "summary": "It is more secure from threats than at any time since its founding. But the war in Gaza, and attacks on Iran and Lebanon, have undercut Israel’s standing among the world’s democracies."
  },
  {
    "title": "Israel to Send Delegation to Qatar for Talks on Gaza Truce",
    "link": "https://www.nytimes.com/2025/07/05/world/middleeast/israeli-ministers-hamas-gaza-ceasefire.html",
    "summary": "The decision came after Hamas said it had responded positively to an American-backed cease-fire proposal. President Trump says he hopes for a truce as soon as next week."
  },
  {
    "title": "U.S. Turns Eight Migrants Over to South Sudan, Ending Weeks of Legal Limbo",
    "link": "https://www.nytimes.com/2025/07/05/us/politics/migrants-djibouti-south-sudan.html",
    "summary": "Courts blocked the handover after lawyers raised concerns of torture. Then the Supreme Court intervened to allow the Trump administration’s plan to move forward."
  },
  {
    "title": "Virginia Has Become a Hotbed for Immigration Arrests",
    "link": "https://www.nytimes.com/2025/07/05/us/virginia-immigration-arrests.html",
    "summary": "Lawyers and advocates have theories as to why immigration arrests have accelerated in Virginia at a rate more than that of almost any other state."
  },
  {
    "title": "Trump Says He Will Start Talks With China on TikTok Deal",
    "link": "https://www.nytimes.com/2025/07/05/us/politics/trump-china-tiktok.html",
    "summary": "President Trump has declined to enforce a statutory ban of the popular social media app while his administration negotiates a deal for an American company to acquire it."
  },
  {
    "title": "Justice Ketanji Brown Jackson Makes Herself Heard, Prompting a Rebuke",
    "link": "https://www.nytimes.com/2025/07/05/us/supreme-court-ketanji-brown-jackson.html",
    "summary": "In solo dissents this term, the justice accused the conservative majority of lawless bias. On the term’s last day, Justice Amy Coney Barrett fired back."
  },
  {
    "title": "How Many Dates Should You Go On Before You Start Talking About Money?",
    "link": "https://www.nytimes.com/2025/07/05/business/dating-relationships-salary.html",
    "summary": "Couples tend to dance around discussing how much they earn or owe early in a relationship. But experts agree that talking about money sooner is better than later."
  },
  {
    "title": "A Lifetime After Fleeing the Nazis, They Tell Their Stories",
    "link": "https://www.nytimes.com/2025/07/05/world/europe/kindertransport-holocaust-survivors.html",
    "summary": "Thousands of Jewish children fled to Britain and other European countries in the 1938-39 rescue mission known as the Kindertransport. Seven recall their journeys, and what came next."
  },
  {
    "title": "The Royal Box: Who’s in Wimbledon’s Most Exclusive Seats?",
    "link": "https://www.nytimes.com/2025/07/05/sports/tennis/wimbledon-royal-box-who.html",
    "summary": "The event’s most coveted seats are available only through invitation, reserved for celebrities and dignitaries. Here’s a look at who’s sitting in them."
  },
  {
    "title": "A Napoleon From Long Island Meets His Waterloo",
    "link": "https://www.nytimes.com/2025/07/05/world/europe/waterloo-reenactment-american-napoleon.html",
    "summary": "An American war re-enactor earned the job of Napoleon for the 210th anniversary of the battle,  despite his accent."
  },
  {
    "title": "Oasis Live Review: The Gallaghers Reunite, Their Songs Still Stomping and Wounds Still Healing",
    "link": "https://www.nytimes.com/2025/07/05/arts/music/oasis-reunion-tour-review.html",
    "summary": "The British band, a showcase for the intoxicating but toxic chemistry of the brothers Liam and Noel Gallagher, performed for the first time in 16 years."
  },
  {
    "title": "YouTube Pirates Are Cashing In on Hollywood’s Summer Blockbusters",
    "link": "https://www.nytimes.com/2025/07/05/technology/youtube-piracy-movies-copyright.html",
    "summary": "More than a decade after the platform cracked down on copyright infringement, thousands of unlicensed movies, TV shows and live sports are available."
  },
  {
    "title": "Girls in Africa Aren’t Asking for Pity. They’re Asking for a Chance.",
    "link": "https://www.nytimes.com/2025/07/05/opinion/africa-women-feminism.html",
    "summary": "I went to West Africa to report on girls’ education. I left convinced that the Western feminist movement has grown far too comfortable fighting only for itself."
  },
  {
    "title": "A Road Map for Undoing the Damage of the Big, Awful Bill",
    "link": "https://www.nytimes.com/2025/07/05/opinion/democrats-budget-bill-trump.html",
    "summary": "The big, beautiful bill is a horror. It’s also an opportunity."
  },
  {
    "title": "As a Tourist Influx Makes Prices Soar, Hundreds Protest in Mexico City",
    "link": "https://www.nytimes.com/2025/07/05/world/americas/mexico-city-protest-gentrification.html",
    "summary": "The outrage reflects the growing difficulty of affording a city that has become a hot spot for Western immigrants."
  },
  {
    "title": "Elon Musk Says He Will Start a New Political Party",
    "link": "https://www.nytimes.com/2025/07/05/us/politics/elon-musk-third-party.html",
    "summary": "The tech billionaire, who has publicly feuded with President Trump, wrote on social media that he would be creating “the America Party,” though he hadn’t yet filed paperwork."
  },
  {
    "title": "Julian McMahon, ‘Nip/Tuck’ and ‘Fantastic Four’ Star, Dies at 56",
    "link": "https://www.nytimes.com/2025/07/05/arts/television/julian-mcmahon-dead.html",
    "summary": "He played the half-human, half-demon Cole Turner in the WB supernatural series “Charmed” and a self-destructive playboy in the FX series “Nip/Tuck.”"
  },
  {
    "title": "Canada’s Indigenous Groups Demand a Say in Carney’s Race to Build",
    "link": "https://www.nytimes.com/2025/07/05/world/canada/carney-projects-indigenous-opposition.html",
    "summary": "Prime Minister Mark Carney wants to fast-track nation-building projects to remake Canada’s economy. Indigenous groups want a seat at the table."
  }
]