[
  {
    "title": "Trump Bets on Diplomacy Without Diplomats",
    "link": "https://www.nytimes.com/2026/02/17/us/politics/trump-witkoff-kushner-diplomacy.html",
    "summary": "President Trump’s most trusted envoys, Steve Witkoff and Jared Kushner, are at the center of the Iran and Ukraine negotiations."
  },
  {
    "title": "U.S. and Iran Make ‘Good Progress’ in Geneva Talks, Foreign Minister Says",
    "link": "https://www.nytimes.com/2026/02/17/us/politics/us-iran-nuclear-talks.html",
    "summary": "The Iranian minister, Abbas Araghchi, said both sides had agreed on a “set of guiding principles.” President Trump has called on Iran to make an immediate accord or face a possible U.S. attack."
  },
  {
    "title": "Talks on Russia-Ukraine War Enter 2nd Day in Geneva",
    "link": "https://www.nytimes.com/2026/02/18/world/europe/russia-ukraine-us-talks-war.html",
    "summary": "The talks in Geneva, Switzerland, were expected to focus on Ukrainian-held territory in the east that Russia wants to control as the price of peace. Kyiv has said that demand is a nonstarter."
  },
  {
    "title": "Mamdani Threatens 9.5% Property Tax Increase if Wealth Tax Is Not Passed",
    "link": "https://www.nytimes.com/2026/02/17/nyregion/budget-mamdani-property-taxes.html",
    "summary": "Mayor Zohran Mamdani said his proposal to raise New York City property taxes was a “last resort” to close a budget gap."
  },
  {
    "title": "Mamdani Ushers in a New Tradition: Ramadan in City Hall",
    "link": "https://www.nytimes.com/2026/02/17/nyregion/mamdani-ramadan-muslim.html",
    "summary": "Zohran Mamdani, New York City’s first Muslim mayor, will observe Ramadan as he runs the nation’s largest city, blending his faith into his public life."
  },
  {
    "title": "Colbert Slams Trump Administration After CBS Pulls Talarico Interview",
    "link": "https://www.nytimes.com/2026/02/17/business/media/colbert-cbs-fcc-talarico-carr.html",
    "summary": "Stephen Colbert said he had to drop an interview with James Talarico from his Monday broadcast because of new F.C.C. guidance that targeted political interviews on late-night shows."
  },
  {
    "title": "Jesse Jackson’s Death Arrives at a Crucial Moment for Black Political Power",
    "link": "https://www.nytimes.com/2026/02/17/us/politics/jesse-jackson-black-voters-voting-rights-act.html",
    "summary": "There are more Black senators than ever before, but a major Supreme Court ruling could reduce Black representation in the House."
  },
  {
    "title": "How a Stray Quote of Jesse Jackson’s Led to a Rupture Between Black and Jewish Voters",
    "link": "https://www.nytimes.com/2026/02/17/us/jesse-jackson-1984-presidential-campaign.html",
    "summary": "The candidate’s reference to New York as “Hymietown” helped tank his 1984 presidential campaign and eroded a longstanding alliance."
  },
  {
    "title": "Jackson’s ‘Keep Hope Alive’ Speech in 1988 Was a Call for Social Justice and Unity",
    "link": "https://www.nytimes.com/2026/02/17/us/politics/jesse-jackson-keep-hope-alive-speech.html",
    "summary": "Though he didn’t win the Democratic nomination for president in either year, Jesse Jackson’s moving speeches at the conventions called on the party to care more about the marginalized."
  },
  {
    "title": "Jesse Jackson, Charismatic Champion of Civil Rights, Dies at 84",
    "link": "https://www.nytimes.com/2026/02/17/us/jesse-jackson-dead.html",
    "summary": "An impassioned orator, he was a moral and political force, forming a “rainbow coalition” of poor and working-class people and seeking the presidency. His mission, he said, was “to transform the mind of America.”"
  },
  {
    "title": "Six of 16 Skiers Caught in California Avalanche Near Lake Tahoe Are Rescued",
    "link": "https://www.nytimes.com/2026/02/17/weather/california-rain-snow-forecast.html",
    "summary": "Rescuers pulled six survivors from a remote California site where 16 backcountry skiers were caught in an avalanche, the authorities said. Ten others were still missing."
  },
  {
    "title": "4 Dead in Colorado Crash as Strong Winds Kick Up Wildfire Warnings",
    "link": "https://www.nytimes.com/2026/02/17/weather/fire-winds-oklahoma-kansas-colorado.html",
    "summary": "High winds were fueling the risk of wildfires across the Southwest and the Plains, and an Oklahoma town faced a mandatory evacuation. Officials said the weather had caused a deadly pileup in Colorado."
  },
  {
    "title": "The Sleepy Market for Japanese Government Bonds Is Now a ‘Battlefield’",
    "link": "https://www.nytimes.com/2026/02/18/business/jgb-trade-excitement.html",
    "summary": "Trading of Japanese government bonds, long considered moribund, is roaring back to life as fears of the country’s debt have sent yields surging."
  },
  {
    "title": "Trump Hails Japan’s First Batch of U.S. Investments",
    "link": "https://www.nytimes.com/2026/02/17/business/japan-trump-investments.html",
    "summary": "The deals, totaling $36 billion, were the first step in a $550 billion investment pledge aimed at securing tariff relief and sustaining U.S. relations."
  },
  {
    "title": "White House Shrugs Off Lutnick’s Epstein Ties",
    "link": "https://www.nytimes.com/2026/02/17/us/politics/trump-howard-lutnick-epstein.html",
    "summary": "Commerce Secretary Howard Lutnick has acknowledged traveling to Jeffrey Epstein’s island and meeting him on another occasion."
  },
  {
    "title": "A Road Trip from Kandahar to Kabul on Highway 1 in Afghanistan",
    "link": "https://www.nytimes.com/2026/02/18/world/asia/afghanistan-highway-taliban-security.html",
    "summary": "Life and business are back along a road once defined by war damage. But even with improved security, Afghans are desperate for jobs and development."
  },
  {
    "title": "Daniel Radcliffe on Returning to Broadway in ‘Every Brilliant Thing’",
    "link": "https://www.nytimes.com/2026/02/17/theater/daniel-radcliffe-every-brilliant-thing.html",
    "summary": "The Tony winner returns to the stage in “Every Brilliant Thing,” an interactive monologue with a message of hope “that might be vital for somebody to hear.”"
  },
  {
    "title": "Alberto Tomba Was an ’80s Icon. The Olympics Have Brought Him Back.",
    "link": "https://www.nytimes.com/2026/02/18/world/europe/alberto-tomba-was-an-80s-icon-the-olympics-have-brought-him-back.html",
    "summary": "Nicknamed “Tomba la Bomba,” the Italian skier was a global superstar before he drifted from the limelight. Decades later, the Winter Games have given him a new platform."
  },
  {
    "title": "California Wealth Tax Opponents Intensify Efforts Before Bernie Sanders Visit",
    "link": "https://www.nytimes.com/2026/02/17/us/california-wealth-tax-opposition-bernie-sanders.html",
    "summary": "The opponents’ latest moves include online ads tied to Gov. Gavin Newsom, a crypto-related push to raise money and competing ballot measures."
  },
  {
    "title": "Potomac Sewage Spill Becomes Ecological Disaster and Political Fight",
    "link": "https://www.nytimes.com/2026/02/17/climate/potomac-river-trump-moore.html",
    "summary": "A D.C. utility had been working for weeks to repair a collapsed sewer line when the president blamed Maryland’s governor for the contamination on Monday."
  },
  {
    "title": "Height Surgery for Men Can Add Inches But Has Risks",
    "link": "https://www.nytimes.com/2026/02/17/us/height-surgery-limb-lengthening-men-health.html",
    "summary": "Limb-lengthening can add inches to a person’s stature. But its risks have made it controversial."
  },
  {
    "title": "Boneless Wings Are Still Wings, Judge Rules",
    "link": "https://www.nytimes.com/2026/02/17/us/boneless-chicken-wings-lawsuit-ruling.html",
    "summary": "A Chicago man filed a lawsuit in 2023 against Buffalo Wild Wings, arguing that it had engaged in false advertising of its boneless wings. A judge said the claim “has no meat on its bones.”"
  },
  {
    "title": "Netanyahu Plays Trump and American Jews for Fools — Again",
    "link": "https://www.nytimes.com/2026/02/17/opinion/israel-iran-netanyahu.html",
    "summary": "Netanyahu has gotten Trump to focus on Iran and ignore the destructive things Bibi is doing in Gaza, in the West Bank and inside Israel."
  },
  {
    "title": "What the American Right Wants From Europe",
    "link": "https://www.nytimes.com/2026/02/17/opinion/rubio-munich-security-conference.html",
    "summary": "The tensions in Marco Rubio’s trans-Atlantic vision."
  },
  {
    "title": "Manhattan Hospital Ends Medical Treatment for Transgender Youth",
    "link": "https://www.nytimes.com/2026/02/17/nyregion/nyu-hospital-transgender-youth.html",
    "summary": "NYU Langone Health cited the “current regulatory environment” in its decision to discontinue its gender medicine program for minors."
  },
  {
    "title": "It’s Mardi Gras in New Orleans. This Year, the Party Might Be a Bit Greener.",
    "link": "https://www.nytimes.com/2026/02/17/climate/mardi-gras-carnival-beads-environment.html",
    "summary": "Carnival can generate more than 1,000 tons of trash every year. A coalition of nonprofit groups, city officials and scientists has a plan to clean it up."
  },
  {
    "title": "Shia LaBeouf Charged With Battery in New Orleans",
    "link": "https://www.nytimes.com/2026/02/17/movies/shia-labeouf-arrested-new-orleans.html",
    "summary": "The actor, known for his roles in “Transformers” and “Megalopolis,” was arrested early Tuesday after reportedly assaulting two people, the authorities said."
  },
  {
    "title": "Peru Votes to Impeach President José Jerí",
    "link": "https://www.nytimes.com/2026/02/17/world/americas/peru-president-jose-jeri-impeachment.html",
    "summary": "Peru’s Congress voted to impeach President José Jerí, four months after he replaced Dina Boluarte, who had also been removed from the presidency."
  }
]