[
  {
    "title": "RFK Jr.’s New Advisers Rescind Recommendations for Some Flu Vaccines",
    "link": "https://www.nytimes.com/2025/06/26/health/rfk-jr-vaccines-acip-cdc.html",
    "summary": "Critics saw in the move the beginnings of a more restrictive approach to providing vaccines to Americans."
  },
  {
    "title": "C.D.C. Committee Votes Against Flu Shots With the Preservative Thimerosal",
    "link": "https://www.nytimes.com/2025/06/26/well/thimerosal-vaccines-risks.html",
    "summary": "A C.D.C. advisory committee on Thursday voted against flu shots that contain the ingredient."
  },
  {
    "title": "Trump Administration Tells Congress to Kill ‘Revenge Tax’ From Policy Bill",
    "link": "https://www.nytimes.com/2025/06/26/business/trump-congress-tax-corporations-global-minimum.html",
    "summary": "Treasury Secretary Scott Bessent said the Group of 7 had agreed that penalties related to a 2021 “global minimum tax” deal would not apply to American companies."
  },
  {
    "title": "Trump Justice Dept. Pressuring University of Virginia President to Resign",
    "link": "https://www.nytimes.com/2025/06/26/us/politics/university-of-virginia-president-trump.html",
    "summary": "The Justice Department has demanded that James E. Ryan step down to help resolve a civil rights investigation into the school, three people familiar with the matter said."
  },
  {
    "title": "How the Republican Agenda Could Hit Johns Hopkins University",
    "link": "https://www.nytimes.com/2025/06/26/us/johns-hopkins-university-federal-funding-cuts.html",
    "summary": "The university is not a direct target of the Trump administration but faces some of the biggest cuts, as Republicans seek to trim government spending."
  },
  {
    "title": "Fate of Iran’s Enriched Uranium Is a Mystery",
    "link": "https://www.nytimes.com/2025/06/26/us/politics/iran-nuclear-program-uranium.html",
    "summary": "U.S. intelligence agencies had long assessed that, faced with the possibility of an attack on its nuclear facilities, Iran would try to move its stockpile."
  },
  {
    "title": "What We Know About the Fate of Iran’s Nuclear Program",
    "link": "https://www.nytimes.com/2025/06/26/world/middleeast/iran-nuclear-program-israeli-us-attacks.html",
    "summary": "President Trump’s claimed Iran’s capabilities were “obliterated.” The full extent of the damage is still emerging."
  },
  {
    "title": "Bill Moyers, Presidential Aide and Veteran of Public TV, Dies at 91",
    "link": "https://www.nytimes.com/2025/06/26/business/media/bill-moyers-dead.html",
    "summary": "Before becoming known as an unusual breed of television correspondent and commentator, he had a long association with President Lyndon B. Johnson."
  },
  {
    "title": "Justice Department Says the Trump Administration Plans to Re-Deport Abrego Garcia",
    "link": "https://www.nytimes.com/2025/06/26/us/politics/justice-department-deport-abrego-garcia.html",
    "summary": "The assertion raised questions about how seriously the administration takes the criminal charges filed against the migrant. A White House official reiterated support for prosecuting him in America."
  },
  {
    "title": "In NATO Visit, Trump Casts Himself as a Global Peacemaker",
    "link": "https://www.nytimes.com/2025/06/26/us/politics/trump-nato-visit-nobel-prize.html",
    "summary": "The president’s trip to NATO offered a glimpse into how he sees himself — and wants to be seen — on the world stage."
  },
  {
    "title": "As Mamdani Rises, Anti-Muslim Attacks Roll In From the Right",
    "link": "https://www.nytimes.com/2025/06/26/nyregion/mamdani-muslim-attacks.html",
    "summary": "Republican members of Congress and Trump administration officials have targeted Zohran Mamdani, who would be New York City’s first Muslim mayor."
  },
  {
    "title": "The Parents Who Helped Shape Zohran Mamdani’s Politics",
    "link": "https://www.nytimes.com/2025/06/26/nyregion/zohran-mamdani-parents-mira-nair.html",
    "summary": "Zohran Mamdani’s parents, a filmmaker and a professor, gave him the foundation for his run for mayor of New York. But their own political views may open him up to attacks."
  },
  {
    "title": "‘Re-elect Eric’: Adams Kicks Off Bid to Oppose Mamdani for Mayor",
    "link": "https://www.nytimes.com/2025/06/26/nyregion/eric-adams-mayor-campaign.html",
    "summary": "Just a few months ago, it appeared unlikely that Mayor Eric Adams of New York, who was facing federal corruption charges, would be in a position to seek a second term."
  },
  {
    "title": "Israel-Backed Aid Sites In Gaza Pose Lethal Risk for Palestinians Amid Deadly Fighting",
    "link": "https://www.nytimes.com/2025/06/26/world/middleeast/gaza-aid-violence.html",
    "summary": "Hundreds of Palestinians have been killed over the past month near aid hubs set up under a new Israel-backed system, according to Gaza health officials."
  },
  {
    "title": "Sean ‘Diddy’ Combs Trial: Takeaways From Prosecution’s Closing Argument",
    "link": "https://www.nytimes.com/2025/06/26/arts/music/sean-diddy-combs-trial-prosecution-closing-argument.html",
    "summary": "After seven weeks of testimony, the government detailed to jurors why it says the mogul is guilty of sex trafficking and racketeering."
  },
  {
    "title": "Luke Littler May Be Darts’ First Global Superstar",
    "link": "https://www.nytimes.com/2025/06/26/magazine/luke-littler-darts.html",
    "summary": "Luke Littler, the world’s best pro darts player, is just 18 — and he’s helping put his sport on the map."
  },
  {
    "title": "Carolyn McCarthy, Who Turned a Gunman’s Massacre Into a Crusade, Dies at 81",
    "link": "https://www.nytimes.com/2025/06/26/nyregion/carolyn-mccarthy-dead.html",
    "summary": "After a deranged shooter killed her husband and wounded her son on a Long Island commuter train in 1993, she went to Congress on a mission to curb gun violence."
  },
  {
    "title": "75 Years After a Deadly Plane Crash, the Search for Its Wreckage Ends",
    "link": "https://www.nytimes.com/2025/06/26/us/michigan-plane-crash-1950.html",
    "summary": "In 2004, explorers began a search for a plane that crashed into Lake Michigan in 1950, killing 58 people. They didn’t find it, but they revived the history of what once was the country’s deadliest aviation accident."
  },
  {
    "title": "He Searched for His Past in Children’s Books. He Found His Wife’s.",
    "link": "https://www.nytimes.com/2025/06/26/world/europe/uk-book-collector-wife.html",
    "summary": "Steve Mills has been collecting secondhand books in England to reawaken lost memories. His search revealed more about his family’s past than he thought possible."
  },
  {
    "title": "I Detest Netanyahu, but on Some Things He’s Actually Right",
    "link": "https://www.nytimes.com/2025/06/26/opinion/netanyahu-trump-iran.html",
    "summary": "On the broader issue of the Iranian threat, Netanyahu and Trump have been forces for good."
  },
  {
    "title": "Peter Thiel and the Antichrist",
    "link": "https://www.nytimes.com/2025/06/26/opinion/peter-thiel-antichrist-ross-douthat.html",
    "summary": "The original tech right power player on A.I., Mars and immortality."
  },
  {
    "title": "Intelligence Agencies Race to Evaluate Iran’s Nuclear Program",
    "link": "https://www.nytimes.com/2025/06/26/briefing/iran-nuclear-program-sean-combs-trial.html",
    "summary": "Also, violence has frequently erupted near aid sites in Gaza. Here’s the latest at the end of Thursday."
  },
  {
    "title": "Anna Wintour Cedes Vogue Editor in Chief Title But Will Retain Editorial Control",
    "link": "https://www.nytimes.com/2025/06/26/business/media/anna-wintour-vogue-conde-nast.html",
    "summary": "American Vogue will create a new role, “head of editorial content,” beneath Ms. Wintour, who is giving up her editor in chief title. She’s not leaving, though."
  },
  {
    "title": "Tanner Martin Announces His Own Death",
    "link": "https://www.nytimes.com/2025/06/26/us/tanner-martin-dead-cancer-tiktok.html",
    "summary": "Tanner Martin has documented his fight against colon cancer for hundreds of thousands of followers. His death was announced in a recorded video."
  },
  {
    "title": "Florida Boaters Capture Twin Waterspouts Up Close on Video",
    "link": "https://www.nytimes.com/2025/06/26/us/florida-water-spouts-video.html",
    "summary": "A family was heading back to dry land when two of the funnel formations suddenly sprung up. “It looked like something from a movie,” one of them said."
  }
]