[
  {
    "title": "Trump Officials Hint at Possible Concessions by Putin",
    "link": "https://www.nytimes.com/2025/08/17/us/politics/trump-witkoff-ukraine-putin-concessions.html",
    "summary": "Secretary of State Marco Rubio and Steve Witkoff, an envoy for President Trump, suggested that a peace deal was still distant."
  },
  {
    "title": "Trump and Putin Find Common Ground on One Issue: Biden",
    "link": "https://www.nytimes.com/2025/08/17/us/politics/trump-putin-common-ground-biden.html",
    "summary": "The Alaska summit between the U.S. and Russian leaders showcased their mutual animosity for the former president."
  },
  {
    "title": "Trump’s Selective Stance on Justice: Redemption for Some, Scorn for Others",
    "link": "https://www.nytimes.com/2025/08/17/us/politics/trump-dc-criminals-justice.html",
    "summary": "President Trump, himself a felon, has shown particular leniency to criminals he seems to identify with — people who are white or wealthy, or who rioted in his name on Jan. 6, 2021."
  },
  {
    "title": "Pence Welcomes Trump’s D.C. Deployment of the National Guard",
    "link": "https://www.nytimes.com/2025/08/17/us/politics/pence-trump-dc-national-guard.html",
    "summary": "Former Vice President Mike Pence said he wished President Trump “would have done more” on Jan. 6, but supported the recent decision to deploy troops to Washington."
  },
  {
    "title": "For a Few Hours, a Party Drowns Out the Tensions in D.C.",
    "link": "https://www.nytimes.com/2025/08/16/us/politics/washington-concert-chuck-brown.html",
    "summary": "At Fort Dupont Park, thousands gathered to honor a local music legend, creating a brief refuge from the conflict."
  },
  {
    "title": "Israel Says Iranian Agents Recruited Dozens of Its Citizens",
    "link": "https://www.nytimes.com/2025/08/17/world/middleeast/israel-says-iranian-agents-recruited-dozens-of-its-citizens.html",
    "summary": "The agents cajoled people into acts of sabotage and even assassination plots. The cases have raised questions about greed, gullibility and loyalty."
  },
  {
    "title": "Israelis Join Nationwide Rallies to Call for Release of Hostages",
    "link": "https://www.nytimes.com/2025/08/17/world/middleeast/israel-rallies-labor-strike.html",
    "summary": "Thousands turned out for the day of protest, which was expected to culminate with a large evening demonstration."
  },
  {
    "title": "Penn & Teller’s Secret to a 50-Year Partnership",
    "link": "https://www.nytimes.com/2025/08/17/arts/television/penn-teller-magicians-50-years.html",
    "summary": "As their magic act hits 50 years, they’re bigger than ever. They say their secret is not to socialize. But misdirection is also their love language."
  },
  {
    "title": "Redistricting Push Would Further Divide a Polarized Congress",
    "link": "https://www.nytimes.com/2025/08/17/us/politics/redistricting-polarization-congress.html",
    "summary": "Many state delegations are already under single-party control. New maps could tighten the partisan grip while decreasing the importance of general elections."
  },
  {
    "title": "Gang-Related Attack Kills 3 in Shootout at a Brooklyn Bar",
    "link": "https://www.nytimes.com/2025/08/17/nyregion/brooklyn-shooting-nightclub.html",
    "summary": "Nine others were treated for injuries after the early-morning shooting in the Crown Heights neighborhood, the police said."
  },
  {
    "title": "North Carolina Confederate Monument Goes Too Far, Lawsuit Says",
    "link": "https://www.nytimes.com/2025/08/17/us/trump-confederate-monuments-south-carolina.html",
    "summary": "A long battle over the pro-slavery words on a Tyrrell County statue intensifies as the Trump administration reclaims Confederate imagery."
  },
  {
    "title": "Terence Stamp, Luminary of 1960s British Cinema, Dies at 87",
    "link": "https://www.nytimes.com/2025/08/17/movies/terence-stamp-dead.html",
    "summary": "Known for his “heartbreak blue eyes,” he starred in “Billy Budd” and “The Collector,” and had a memorable role in “Superman” and “Superman II.”"
  },
  {
    "title": "They’re Stuffed Animals. They’re Also A.I. Chatbots.",
    "link": "https://www.nytimes.com/2025/08/15/arts/ai-toys-curio-grem.html",
    "summary": "New types of cuddly toys, some for children as young as 3, are being sold as an alternative to screen time — and to parental attention."
  },
  {
    "title": "The C.E.O. of Duolingo Wants to Have a Conversation About A.I.",
    "link": "https://www.nytimes.com/2025/08/17/business/duolingo-luis-von-ahn.html",
    "summary": "The language-learning app with more than 100 million users has embraced artificial intelligence but has also faced consumer backlash for it."
  },
  {
    "title": "Sure, These Comics Can Make You Laugh. But Can They Hit a Jump Shot?",
    "link": "https://www.nytimes.com/2025/08/17/nyregion/comedians-basketball-adam-sandler.html",
    "summary": "A weekly pickup basketball game in Manhattan is populated almost entirely by professional funny people from all corners of the comedy landscape — stand-up comedians on their way up, comics past their primes and even industry A-listers."
  },
  {
    "title": "Boy Crisis of 2025, Meet the ‘Boy Problem’ of the 1900s",
    "link": "https://www.nytimes.com/2025/08/15/opinion/men-boys-crisis-progressive-era.html",
    "summary": "It takes a village to raise a child. But some of the villagers must be men."
  },
  {
    "title": "Is it Actually Fine to Look at Your Phone Before Bed?",
    "link": "https://www.nytimes.com/2025/08/17/briefing/is-it-actually-fine-to-look-at-your-phone-before-bed.html",
    "summary": "Scientists offer some surprising answers."
  },
  {
    "title": "Air Canada Flight Attendants Say They Will Defy Back-to-Work Order",
    "link": "https://www.nytimes.com/2025/08/17/world/canada/air-canada-strike.html",
    "summary": "The decision by the union representing the 10,000 workers means that travel chaos will most likely continue for at least a second day."
  },
  {
    "title": "What to Know About Bolivia’s Presidential Election",
    "link": "https://www.nytimes.com/2025/08/17/world/americas/bolivia-presidential-election-explained.html",
    "summary": "An economic crisis and political infighting among the country’s long-dominant socialist party could pave the way for the first right-wing president in decades."
  },
  {
    "title": "Brighty the Burro, Beloved Grand Canyon Statue, Is Rescued From Dragon Bravo Fire",
    "link": "https://www.nytimes.com/2025/08/17/us/brighty-burro-grand-canyon-fire.html",
    "summary": "The statue was missing an ear and two front legs, but it was mostly intact when crews recovered it from the Dragon Bravo fire."
  }
]