[
  {
    "title": "A Case Against 6 Democrats Lacked Urgency. Then Came a Swift Bid for an Indictment.",
    "link": "https://www.nytimes.com/2026/02/18/us/politics/pirro-inquiry-video-democratic-lawmakers.html",
    "summary": "Prosecutors have been repeatedly caught between the president’s insistence that they undertake weak or baseless cases and the necessity of having to go to court."
  },
  {
    "title": "Republicans, Braced for Losses, Push More Voting Restrictions in Congress",
    "link": "https://www.nytimes.com/2026/02/17/us/politics/republicans-vote-fraud-id-midterms.html",
    "summary": "Legislation that would require proof of citizenship to register to vote was only the beginning as the G.O.P. presses to sharply limit voting in line with President Trump’s false claims of widespread fraud."
  },
  {
    "title": "An Architect of Virginia’s Redistricting Will Run for a New Seat Himself",
    "link": "https://www.nytimes.com/2026/02/18/us/politics/dan-helmer-congress-redistricting-virginia.html",
    "summary": "Dan Helmer, a Democratic state lawmaker, played a key role in putting redrawn congressional maps before state voters."
  },
  {
    "title": "Colorado Democrats Push to Rip Up 2028 House Map for an Extra Edge",
    "link": "https://www.nytimes.com/2026/02/18/us/politics/colorado-redistricting-house-map-2028.html",
    "summary": "A proposed ballot measure to give Democrats more seats for the 2028 and 2030 elections signals that the nation’s gerrymandering fight is likely to persist for years."
  },
  {
    "title": "F.D.A. Reverses Decision and Agrees to Review Moderna’s Flu Vaccine",
    "link": "https://www.nytimes.com/2026/02/18/health/fda-moderna-flu-vaccine-mrna.html",
    "summary": "Moderna held further discussions with regulators and announced that the agency would accept the company’s application for approval of its flu vaccine that uses mRNA technology."
  },
  {
    "title": "N.I.H. Director Will Temporarily Run C.D.C. in Leadership Shake-Up",
    "link": "https://www.nytimes.com/2026/02/18/us/politics/bhattacharya-kennedy-cdc-director.html",
    "summary": "Dr. Jay Bhattacharya will serve as acting director of the Centers for Disease Control and Prevention until President Trump appoints a permanent director."
  },
  {
    "title": "What to Know About mRNA Vaccines",
    "link": "https://www.nytimes.com/2025/05/08/well/mrna-vaccines-safety.html",
    "summary": "We asked experts about how the technology works, its safety and its potential in medicine."
  },
  {
    "title": "Billy Preston’s Music Was ‘Pure Joy.’ But His Life Ended in Tragedy.",
    "link": "https://www.nytimes.com/2026/02/18/arts/music/billy-preston-documentary-thats-the-way-god-planned-it.html",
    "summary": "The Beatles’ beloved collaborator died at 59 in 2006. A new documentary, “That’s the Way God Planned It,” explores what he long kept hidden."
  },
  {
    "title": "‘Billy Preston’ Review: A Unique and Tortured Talent",
    "link": "https://www.nytimes.com/2026/02/18/movies/billy-preston-thats-the-way-god-planned-it-review.html",
    "summary": "The Beatles, the Stones and Clapton shared the stage with him. He made solo hits, too. A documentary by Paris Barclay explores his success and his difficult life."
  },
  {
    "title": "Russia’s Exile From World Sports Will End Next Month at Paralympics",
    "link": "https://www.nytimes.com/2026/02/18/world/europe/russia-paralympics-italy.html",
    "summary": "Six Russian athletes and four Belarusians will be allowed to represent their nations, officials said. The decision could pave the way for a Russian team to compete at the 2028 Summer Games in Los Angeles."
  },
  {
    "title": "As Trump Obliterates Climate Efforts, States Try to Fill the Gap",
    "link": "https://www.nytimes.com/2026/02/18/climate/trump-climate-policies-states.html",
    "summary": "Across the country, Democratic-led states are accelerating their initiatives to cut greenhouse gas emissions. Their role just became much more important."
  },
  {
    "title": "E.P.A. Faces First Lawsuit Over Its Killing of Major Climate Rule",
    "link": "https://www.nytimes.com/2026/02/18/climate/epa-endangerment-finding-lawsuit.html",
    "summary": "Environmental and health groups sued the E.P.A. over its elimination of the endangerment finding. The matter is likely to end up before the Supreme Court."
  },
  {
    "title": "Can Love Be Addictive? Many Say Yes — and It’s Changing Our Idea of Romance.",
    "link": "https://www.nytimes.com/2026/02/18/magazine/love-addiction-disorder-explained.html",
    "summary": "Poems and songs say love should be world-shattering. The logic of love addiction suggests that it shouldn’t."
  },
  {
    "title": "The Behind the Scenes Search for Compromise on Territory in Ukraine Talks",
    "link": "https://www.nytimes.com/2026/02/18/world/europe/ukraine-russia-peace-talks-demilitarized-zone.html",
    "summary": "The latest round of talks ended with no indication of progress, but negotiators are bargaining over who will control land in eastern Ukraine if they reach a settlement."
  },
  {
    "title": "Talks on Russia-Ukraine War Enter 2nd Day in Geneva",
    "link": "https://www.nytimes.com/2026/02/18/world/europe/russia-ukraine-us-talks-war.html",
    "summary": "The discussions in Geneva were expected to focus on territorial issues, a major sticking point, but the short duration suggests major progress was not made."
  },
  {
    "title": "Viral Videos Helped Mamdani Win. Can They Help Him Govern?",
    "link": "https://www.nytimes.com/2026/02/18/nyregion/mamdani-social-media.html",
    "summary": "Mayor Zohran Mamdani, who won over voters with his approach to social media, is using the same strategy to try to connect City Hall to all New Yorkers."
  },
  {
    "title": "Mamdani Fills Out Housing Board in Push to Freeze Rent",
    "link": "https://www.nytimes.com/2026/02/18/nyregion/zohran-mamdani-rent-guidelines-board-freeze.html",
    "summary": "Mayor Zohran Mamdani appointed six members to the Rent Guidelines Board, which decides whether rents can go up in nearly one million rent-stabilized apartments."
  },
  {
    "title": "Mamdani to Reinstitute Homeless Encampment Sweeps",
    "link": "https://www.nytimes.com/2026/02/18/nyregion/homeless-encampment-mamdani-nyc.html",
    "summary": "Mayor Zohran Mamdani will place the Department of Homeless Services in charge of the sweeps, replacing the Police Department as lead of the interagency effort."
  },
  {
    "title": "How Jesse Jackson Took King’s Civil Rights Movement to Company Doorsteps",
    "link": "https://www.nytimes.com/2026/02/18/us/martin-luther-king-jesse-jackson.html",
    "summary": "Mr. Jackson was critical to Martin Luther King Jr.’s quest to transform a fight for equality in the South to a national movement for economic and social justice."
  },
  {
    "title": "The Social Media Addiction Trials: What to Know",
    "link": "https://www.nytimes.com/2026/01/27/technology/what-to-know-about-the-social-media-addiction-trials.html",
    "summary": "Landmark trials will test a new legal strategy claiming that Meta, TikTok, Snap and YouTube caused personal injury through addictive products."
  },
  {
    "title": "Elon Musk’s xAI Gets $3 Billion Investment From Saudi-Backed A.I. Firm",
    "link": "https://www.nytimes.com/2026/02/18/business/xai-humain-saudi-musk-spacex.html",
    "summary": "Humain, which was created by Crown Prince Mohammed bin Salman last year, said it made the investment just before xAI was acquired by SpaceX, Mr. Musk’s rocket company."
  },
  {
    "title": "Power Shift in Syria Upends an Archipelago for ISIS Prisoners",
    "link": "https://www.nytimes.com/2026/02/18/world/middleeast/syria-prisons-isis.html",
    "summary": "America’s Kurdish allies oversaw two dozen sites holding thousands of members of the terrorist group and their families. Their withdrawal has left the system in chaos."
  },
  {
    "title": "At These Gaza Schools, ‘Peace Building’ Is Part of the Curriculum",
    "link": "https://www.nytimes.com/2026/02/18/world/middleeast/gaza-schools-peace-curriculum.html",
    "summary": "A fast-growing network of private schools, the brainchild of a North Carolina neurosurgeon, is teaching 9,000 war orphans and other needy Palestinian youngsters."
  },
  {
    "title": "A New Concern About Weight Loss Drugs: What if They Work Too Well?",
    "link": "https://www.nytimes.com/2026/02/18/well/weight-loss-drugs-retatrutide.html",
    "summary": "Some patients in a clinical trial of one new drug lost so much weight that they became concerned and dropped out."
  },
  {
    "title": "One Man Stole $660 Million. He’ll Never Pay It Back.",
    "link": "https://www.nytimes.com/2026/02/18/opinion/corruption-trump-accountability.html",
    "summary": "Ordinary citizens have a range of legal tools to hold the rich and politically connected accountable."
  },
  {
    "title": "The A.I. Disruption Has Arrived, and It Sure Is Fun",
    "link": "https://www.nytimes.com/2026/02/18/opinion/ai-software.html",
    "summary": "We’re entering a new renaissance of software development. We should all be excited, despite the uncertainties that lie ahead."
  },
  {
    "title": "Remembering Jesse Jackson",
    "link": "https://www.nytimes.com/2026/02/18/briefing/remembering-jesse-jackson.html",
    "summary": "We look back at the life and legacy of an American who helped shape our politics and our culture."
  },
  {
    "title": "A Road Trip from Kandahar to Kabul on Highway 1 in Afghanistan",
    "link": "https://www.nytimes.com/2026/02/18/world/asia/afghanistan-highway-taliban-security.html",
    "summary": "Life and business are back along a road once defined by war damage. But even with improved security, Afghans are desperate for jobs and development."
  },
  {
    "title": "Botswana’s ‘Corn Lady’ Finds Fame With Food Stands",
    "link": "https://www.nytimes.com/2026/02/18/world/africa/botswana-food-stand-corn.html",
    "summary": "Tshephiso Marumo has had success selling traditional village food in Botswana. But as she has risen, she has become more outspoken, inviting backlash."
  },
  {
    "title": "California Wealth Tax Opponents Intensify Efforts Before Bernie Sanders Visit",
    "link": "https://www.nytimes.com/2026/02/17/us/california-wealth-tax-opposition-bernie-sanders.html",
    "summary": "The opponents’ latest moves include online ads tied to Gov. Gavin Newsom, a crypto-related push to raise money and competing ballot measures."
  },
  {
    "title": "Methane Hunters Track Swamp Gas That Is Driving Climate Warming",
    "link": "https://www.nytimes.com/2026/02/18/climate/methane-gas-swamp-climate-warming.html",
    "summary": "Methane emissions from wetlands are rising faster than those from industrial sources, prompting concerns about a climate feedback loop."
  }
]