[
  {
    "title": "Justice Dept. Official Pushes Prosecutors to Investigate George Soros’s Foundation",
    "link": "https://www.nytimes.com/2025/09/25/us/politics/justice-trump-george-soros-foundation.html",
    "summary": "The directive suggests department leaders are following orders from the president, a major break from decades of past practice meant to insulate the agency from political interference."
  },
  {
    "title": "Hegseth Is Said to Have Summoned U.S. Military Brass From Around the Globe",
    "link": "https://www.nytimes.com/2025/09/25/us/politics/hegseth-generals-admirals-summoned.html",
    "summary": "The unusual directive, without a stated reason, came after the defense secretary fired several top officers and ordered a reduction in four-star officers."
  },
  {
    "title": "White House Threat of Federal Layoffs Only Deepens Shutdown Impasse",
    "link": "https://www.nytimes.com/2025/09/25/us/politics/democrats-government-shutdown-layoffs-threats.html",
    "summary": "Democratic leaders said the administration’s plan to fire government workers in the event of a shutdown would not prompt them to drop their demands in their spending standoff with the G.O.P."
  },
  {
    "title": "Trump May Try to Force Drugmakers to Match European Prices",
    "link": "https://www.nytimes.com/2025/09/25/health/drug-prices-trump.html",
    "summary": "A federal website notice, deleted and then reposted by the administration, provides a hint that more aggressive pricing policies may be coming."
  },
  {
    "title": "Trump Clears Way for American-Owned TikTok Valued at $14 Billion",
    "link": "https://www.nytimes.com/2025/09/25/technology/trump-tiktok-ban-deal.html",
    "summary": "The administration has been working for months to find non-Chinese investors for a U.S. version of the app."
  },
  {
    "title": "Amazon to Pay $2.5 Billion in Prime Membership Settlement",
    "link": "https://www.nytimes.com/2025/09/25/technology/amazon-ftc-settlement.html",
    "summary": "The settlement is one of the largest in the history of the Federal Trade Commission, which sued Amazon two years ago."
  },
  {
    "title": "Trump Wades Into Bailout Politics in Offering a Lifeline to Argentina",
    "link": "https://www.nytimes.com/2025/09/25/us/politics/trump-argentina-milei-bailout.html",
    "summary": "A $20 billion loan to support Argentina’s president, Javier Milei, could come with economic and political risks."
  },
  {
    "title": "Trump Says He Won’t Allow Israel to Annex the West Bank",
    "link": "https://www.nytimes.com/2025/09/25/world/middleeast/trump-annexation-west-bank.html",
    "summary": "After more countries recognized a Palestinian state this week, President Trump said on Thursday that he would not permit Israel to take over the territory."
  },
  {
    "title": "Kennedy Says U.S. Rejects Global Health Goals",
    "link": "https://www.nytimes.com/2025/09/25/health/rfk-jr-un-chronic-disease.html",
    "summary": "The nation’s top federal health official said the United States could not support W.H.O. policies that he claimed promoted abortion and “radical gender ideology.”"
  },
  {
    "title": "Countries Consider A.I.’s Dangers and Benefits at U.N.",
    "link": "https://www.nytimes.com/2025/09/25/business/un-artificial-intelligence.html",
    "summary": "The United Nations announced a new “global dialogue on artificial intelligence governance,” and a new global A.I. panel on the technology’s risks and rewards."
  },
  {
    "title": "‘One Battle After Another’ Review: Paul Thomas Anderson’s Rallying Cry",
    "link": "https://www.nytimes.com/2025/09/25/movies/one-battle-after-another-review-paul-thomas-anderson.html",
    "summary": "The director, at the height of his powers, delivers a startling, present-day American epic, with Leonardo DiCaprio as a washed-up radical and doting dad."
  },
  {
    "title": "The Battle to Make ‘One Battle After Another’",
    "link": "https://www.nytimes.com/2025/09/08/movies/one-battle-after-another-leo-dicaprio.html",
    "summary": "Leonardo DiCaprio, Sean Penn, Regina Hall and the rest of the cast talk about filming a politically charged movie in a fraught year."
  },
  {
    "title": "What’s Behind Nexstar and Sinclair Boycotting Jimmy Kimmel?",
    "link": "https://www.nytimes.com/2025/09/25/business/media/jimmy-kimmel-boycotts-nexstar-sinclair.html",
    "summary": "Nexstar and Sinclair say their boycott of the late-night host is all about what he said. But both are exploring deals for their sprawling networks of local TV stations."
  },
  {
    "title": "How One Man Is Working to Solve Los Angeles’s Homelessness Problem on His Own",
    "link": "https://www.nytimes.com/2025/09/25/us/john-alle-los-angeles-homeless-hotline.html",
    "summary": "For years, John Alle complained to Los Angeles officials about homelessness. Now, fed up, he’s trying to make a dent in the problem on his own."
  },
  {
    "title": "Soybeans Were America’s Biggest Export to China. Now, Sales Are Down to Zero.",
    "link": "https://www.nytimes.com/2025/09/25/business/china-soybean-sales-farmers.html",
    "summary": "China stopped buying soybeans from America in May, placing a retaliatory tariff on the bumper crop after President Trump increased levies on goods from China."
  },
  {
    "title": "Trump Says He Wants to Give Aid to Struggling Farmers",
    "link": "https://www.nytimes.com/2025/09/25/business/trump-farmer-bailout.html",
    "summary": "The president said some revenue from tariffs would go to crop farmers, but the agriculture secretary said a plan wasn’t yet ready."
  },
  {
    "title": "Attack on Dallas ICE Was ‘Very Definition of Terrorism,’ Prosecutor Says",
    "link": "https://www.nytimes.com/2025/09/25/us/politics/dallas-ice-shooting.html",
    "summary": "Federal officials said the gunman intended to shoot immigration agents, calling it a “tragic irony” that three detainees were struck, one fatally."
  },
  {
    "title": "Federal Agent Pushes Woman to Floor in U.S. Courthouse Confrontation",
    "link": "https://www.nytimes.com/2025/09/25/nyregion/ice-push-woman-nyc.html",
    "summary": "In a scene caught on video, the woman and a young girl were clinging to a man who was being detained. Agents pulled their hair, then one shoved the woman after she touched his chest."
  },
  {
    "title": "Ryan Walters, Oklahoma Education Chief Who Promoted Bibles in Schools, to Resign",
    "link": "https://www.nytimes.com/2025/09/25/us/ryan-walters-oklahoma-resign.html",
    "summary": "Ryan Walters had drawn criticism from liberals and conservatives alike over his push to place Bibles in classrooms and bring more prayer into public schools."
  },
  {
    "title": "3 School Districts to Lose $65 Million Over Gender and D.E.I. Policies",
    "link": "https://www.nytimes.com/2025/09/25/nyregion/trump-dei-schools-federal-money.html",
    "summary": "The federal Education Department accused New York, Chicago and Fairfax, Va., of discrimination and said it would pull federal funds from their magnet schools."
  },
  {
    "title": "L.A. Wildfire Evacuations Were Slowed by System Weaknesses, New Report Finds",
    "link": "https://www.nytimes.com/2025/09/25/us/los-angeles-fires-evacuations-report.html",
    "summary": "An independent report on the January disaster found that emergency alerts were hampered by flawed policies, aging equipment and high winds."
  },
  {
    "title": "Sara Jane Moore, Would-Be Assassin of President Ford, Dies at 95",
    "link": "https://www.nytimes.com/2025/09/25/us/sara-jane-moore-dead.html",
    "summary": "A mother of four on the fringes of radical leftist movements, she fired at the president outside a San Francisco hotel in 1975. She had hoped to spark a revolution, she said."
  },
  {
    "title": "The Grand Strategy Behind Trump’s Crackdown on Academia",
    "link": "https://www.nytimes.com/2025/09/25/opinion/trump-academia-victim-may-mailman.html",
    "summary": "Ending the “culture of victimhood” on campus."
  },
  {
    "title": "The Justice Dept. Is Taking Aim at Trump’s Foes",
    "link": "https://www.nytimes.com/2025/09/25/briefing/justice-department-george-soros-us-argentina-bailout.html",
    "summary": "Also, Trump waded into bailout politics by offering a lifeline to Argentina. Here’s the latest at the end of Thursday."
  },
  {
    "title": "Canada Orders Postal Service to End Door-to-Door Mail Delivery",
    "link": "https://www.nytimes.com/2025/09/25/world/americas/canada-postal-service-door-mail-delivery.html",
    "summary": "The government’s previous attempts at postal service cuts were politically unpopular, but Canada Post’s dire financial situation has expedited them."
  },
  {
    "title": "13-Year-Old Shot in the Head While Walking to School Dies Days Later",
    "link": "https://www.nytimes.com/2025/09/25/nyregion/queens-teen-killing.html",
    "summary": "Sanjay Samuel, who had recently started ninth grade, was shot in Queens in what authorities said was gang-related violence. The police are seeking a 16-year-old suspect."
  },
  {
    "title": "Sean ‘Diddy’ Combs Makes a Final Push to Reverse His Conviction Before Sentencing",
    "link": "https://www.nytimes.com/2025/09/25/arts/music/sean-combs-diddy-court-fight-conviction.html",
    "summary": "The music mogul arrived in court on Thursday in jail clothes. His lawyers argued that his conviction rests on an unjust use of the Mann Act."
  },
  {
    "title": "Maxine Clair, Writer Who Came to Her Craft in Middle Age, Dies at 86",
    "link": "https://www.nytimes.com/2025/09/25/books/maxine-clair-dead.html",
    "summary": "She published her first book of poems at 49 and her first work of prose, the acclaimed novel “Rattlebone,” six years later."
  }
]