[
  {
    "title": "Here’s a Look at Everything (and Everyone) Trump Targeted at Davos",
    "link": "https://www.nytimes.com/2026/01/21/us/politics/trump-davos-speech-takeaways.html",
    "summary": "President Trump’s verbal broadsides drew gasps and nervous laughter at the annual gathering of political and business leaders."
  },
  {
    "title": "Did the U.S. Ever Own Greenland? Fact-Checking Trump’s Davos Speech.",
    "link": "https://www.nytimes.com/2026/01/21/us/politics/fact-check-trump-davos-speech.html",
    "summary": "The president gave misleading accounts of the U.S. role in Greenland’s history and the North Atlantic Treaty Organization, among other claims."
  },
  {
    "title": "At Davos, a Clash Between Trump’s World and the Old World",
    "link": "https://www.nytimes.com/2026/01/21/us/politics/davos-trump-speech-greenland-deal.html",
    "summary": "For decades, leaders have gathered in Davos to discuss a shared economic and political future. On Wednesday, President Trump turned the forum into a bracing clash between his worldview and theirs."
  },
  {
    "title": "Supreme Court Seems Poised to Reject Trump’s Attempt to Immediately Fire a Fed Governor",
    "link": "https://www.nytimes.com/2026/01/21/us/politics/supreme-court-trump-fed-cook.html",
    "summary": "During arguments, key justices appeared concerned that the president’s efforts to oust Lisa Cook could imperil the central bank’s independence."
  },
  {
    "title": "Supreme Court Hearing Reveals Unease Over Threats to Fed Independence",
    "link": "https://www.nytimes.com/2026/01/21/us/politics/supreme-court-trump-fed-independence.html",
    "summary": "As the justices weighed the consequences of allowing President Trump to fire a Federal Reserve official, the president reprised his pressure campaign on the central bank."
  },
  {
    "title": "Appeals Court Stays Restrictions on Federal Tactics in Minnesota",
    "link": "https://www.nytimes.com/2026/01/21/us/minnesota-injunction-protest-appeal.html",
    "summary": "The Eighth Circuit granted the Trump administration’s request to block, at least for now, a lower court’s injunction limiting how federal agents interact with protesters in the state."
  },
  {
    "title": "Trump Administration Starts Immigration Operation in Maine",
    "link": "https://www.nytimes.com/2026/01/21/us/politics/maine-somali-immigration-enforcement.html",
    "summary": "A similar operation that unfolded in Minnesota became a flashpoint between protesters and immigration authorities."
  },
  {
    "title": "Federal Agent Fires Gun During Immigration Operation in L.A. Area, Officials Say",
    "link": "https://www.nytimes.com/2026/01/21/us/los-angeles-shooting-ice.html",
    "summary": "The authorities said an agent fired his weapon at a man in Compton, Calif., who was being pursued over a human smuggling operation. The man was not struck."
  },
  {
    "title": "Military Police Troops Put on Alert for Possible Deployment to Minnesota",
    "link": "https://www.nytimes.com/2026/01/21/us/politics/military-police-alert-minneapolis.html",
    "summary": "The move was described as precautionary in the event that President Trump invokes the Insurrection Act in response to protests."
  },
  {
    "title": "Widespread Winter Storm Is Forecast to Bring Heavy Snow to Central and Eastern US",
    "link": "https://www.nytimes.com/2026/01/21/weather/winter-storm-ice-snow-forecast.html",
    "summary": "People across a large section of the central and eastern United States are facing predictions of heavy snow and ice starting Friday."
  },
  {
    "title": "Snow Maps and More: Everything You Could Want to Know About This Winter Storm",
    "link": "https://www.nytimes.com/2026/01/21/weather/winter-storm-forecast.html",
    "summary": "Here’s a look at the latest forecasts, and how to prepare."
  },
  {
    "title": "Trump’s ‘Board of Peace’ Would Have Global Scope but One Man in Charge",
    "link": "https://www.nytimes.com/2026/01/21/us/politics/trump-board-peace-united-nations.html",
    "summary": "The initiative is the latest example of the president dismantling the post-World War II international system and building a new one, with himself at the center."
  },
  {
    "title": "Judge Blocks Government From Reviewing Seized Washington Post Devices",
    "link": "https://www.nytimes.com/2026/01/21/business/media/washington-post-reporter-search-first-amendment.html",
    "summary": "The Post, in its first legal filing since the government searched the home of a reporter last week, had demanded the return of the seized materials."
  },
  {
    "title": "House Panel Votes to Hold Clintons in Contempt in Epstein Inquiry",
    "link": "https://www.nytimes.com/2026/01/21/us/politics/house-clintons-contempt-epstein.html",
    "summary": "The votes by the Oversight panel were bipartisan, though many Democrats said the charges were extreme given Bill and Hillary Clinton’s willingness to answer questions."
  },
  {
    "title": "Iran’s Protests Have Been Completely Squashed, Government Says",
    "link": "https://www.nytimes.com/2026/01/21/world/middleeast/iran-protests-crushed.html",
    "summary": "After a crackdown that killed thousands, Iran’s prosecutor general said on Wednesday that “the sedition is over now,”  vowing to punish those responsible for the protests."
  },
  {
    "title": "She’s a Billionaire. He’s a Socialist. Can They Get Along?",
    "link": "https://www.nytimes.com/2026/01/21/nyregion/zohran-mamdani-jessica-tisch-nypd.html",
    "summary": "Mayor Zohran Mamdani and Police Commissioner Jessica Tisch have little in common. But both their political futures hinge on the safety of the city."
  },
  {
    "title": "U.S. Pivot in Syria Leaves an Old Ally in the Lurch",
    "link": "https://www.nytimes.com/2026/01/21/world/middleeast/us-pivot-in-syria-leaves-an-old-ally-in-the-lurch.html",
    "summary": "A Kurdish force that helped defeat the Islamic State is collapsing as the Trump administration turns to back the new Syrian government."
  },
  {
    "title": "Israeli Strikes in Gaza Kill 11, Including Three Journalists",
    "link": "https://www.nytimes.com/2026/01/21/world/middleeast/israel-gaza-strikes-journalists.html",
    "summary": "The three journalists were operating a drone near the town of Al-Zahra."
  },
  {
    "title": "At Yosemite National Park, Staffing Cuts Mean Visitors Have Gone Wild",
    "link": "https://www.nytimes.com/2026/01/19/us/politics/yosemite-national-park-california-staffing-cuts.html",
    "summary": "After the Trump administration’s cuts, workers at the national park are spread too thin to stop people from littering, flying drones and cliff-diving."
  },
  {
    "title": "Rahm Emanuel Calls for Age Limit of 75 for President, Congress and Judges",
    "link": "https://www.nytimes.com/2026/01/21/us/politics/rahm-emanuel-age-limit-75.html",
    "summary": "The former Chicago mayor, who is trying to shape the Democratic Party’s future and might run for president, said that “across all three branches of government, 75 years — you’re out.”"
  },
  {
    "title": "Michelle Obama and Gretchen Whitmer Disagree on America’s Readiness for a Female President",
    "link": "https://www.nytimes.com/2026/01/21/us/politics/michelle-obama-gretchen-whitmer-female-president.html",
    "summary": "As Mrs. Obama defended her remarks from November that the country wasn’t ready for a woman as president, Gov. Gretchen Whitmer of Michigan offered a different view."
  },
  {
    "title": "Michele Tafoya Announces Senate Run in Minnesota",
    "link": "https://www.nytimes.com/2026/01/21/us/politics/michele-tafoya-senate-minnesota.html",
    "summary": "Ms. Tafoya, once a sideline reporter for N.F.L. games, has more recently turned her focus to Republican politics. She is seeking an open seat now held by a Democrat."
  },
  {
    "title": "Judge Rules for Democrats in Push to Redraw N.Y.C. House District",
    "link": "https://www.nytimes.com/2026/01/21/nyregion/redistricting-congress-new-york.html",
    "summary": "The ruling, which is expected to be appealed, allows the state to change the boundary lines of a district held by a Staten Island Republican since 2021."
  },
  {
    "title": "Job Applicants Sue A.I. Recruitment Tool Company",
    "link": "https://www.nytimes.com/2026/01/21/business/ai-hiring-tools-lawsuit-eightfold-fcra.html",
    "summary": "A recently filed lawsuit claims the ratings assigned by A.I. screening software are similar to those of a credit agency and should be subject to the same laws."
  },
  {
    "title": "How ‘Wine Moms’ Became an Insult for Anti-ICE Protesters",
    "link": "https://www.nytimes.com/2026/01/21/dining/drinks/wine-moms-ice-protests.html",
    "summary": "The insult wielded against protesters taps into a long tradition of casting wine drinkers as out-of-touch elitists."
  },
  {
    "title": "Months After Daniel Naroditsky’s Death, the Chess World Remains Divided",
    "link": "https://www.nytimes.com/2026/01/21/arts/chess-online-naroditsky-kramnik.html",
    "summary": "The death of Daniel Naroditsky exposed the conflicts between the game’s traditional wing and its many online stars."
  },
  {
    "title": "Hollywood’s Woke Era Is Over. Now It’s Turning the Culture War Into Camp.",
    "link": "https://www.nytimes.com/2026/01/21/magazine/culture-war-camp-landman-hunting-wives.html",
    "summary": "The industry seemed penned in by our political debates — until it started channeling them into wild caricatures and frothy drama."
  },
  {
    "title": "In Davos, Trump Brings a Spirit of Fear",
    "link": "https://www.nytimes.com/2026/01/21/opinion/trump-davos-speech-nato.html",
    "summary": "Trump’s speech could have been ghostwritten by Mario Puzo."
  },
  {
    "title": "The American Threat: Three Words I Never Imagined Typing",
    "link": "https://www.nytimes.com/2026/01/21/opinion/trump-europe-greenland.html",
    "summary": "We don’t want our children patrolling hostile streets in Greenland or Canada any more than in Iraq and Afghanistan."
  },
  {
    "title": "Trump Said He Reached a Deal Over the Future of Greenland",
    "link": "https://www.nytimes.com/2026/01/21/briefing/trump-greenland-davos-supreme-court-fed.html",
    "summary": "Also, the Supreme Court seems skeptical of Trump’s attempt to fire a Fed governor. Here’s the latest at the end of Wednesday."
  },
  {
    "title": "How Has Being Perpetually Single Affected Your Life as a Man?",
    "link": "https://www.nytimes.com/2026/01/21/magazine/forever-single-men-relationships-submissions.html",
    "summary": "We want to hear from men over the age of 30 who feel as if they have not yet had a meaningful romantic relationship for a New York Times Magazine feature."
  },
  {
    "title": "Heart Disease and Stroke Still Leading Causes of Death in U.S.",
    "link": "https://www.nytimes.com/2026/01/21/well/us-leading-death-cause-stroke-heart-disease.html",
    "summary": "Deaths from both causes are down, but they still eclipse all other causes, according to new statistics."
  },
  {
    "title": "Parents Sue Residential Home Over Abuse of Their Autistic Son",
    "link": "https://www.nytimes.com/2026/01/21/nyregion/anderson-autism-center-suit.html",
    "summary": "Anil and Shalini Babbar said they would not have known about the abuse their teenager was enduring at the home in upstate New York if a whistle-blower had not sent footage of an assault."
  },
  {
    "title": "Barbara Aronstein Black, a First as a Law School Dean, Dies at 92",
    "link": "https://www.nytimes.com/2026/01/21/us/barbara-aronstein-black-dead.html",
    "summary": "A legal historian, she broke a gender barrier as the first woman to lead an Ivy League law school, serving as dean of Columbia Law from 1986 to 1991."
  },
  {
    "title": "Austin Thompson Pleads Guilty in North Carolina Shooting That Left 5 Dead",
    "link": "https://www.nytimes.com/2026/01/21/us/austin-thompson-shooting-guilty-plea.html",
    "summary": "It is highly uncommon for mass shooters to plead guilty in a country where such attacks seem all too frequent. The man’s lawyers said he wanted to spare the community from further trauma."
  }
]