[
  {
    "title": "How Washington Became a Testing Ground for ICE",
    "link": "https://www.nytimes.com/2025/10/01/us/politics/washington-dc-ice.html",
    "summary": "A series of arrests captured on video reveal how immigration officers have worked with other law enforcement agencies to identify migrants during stops for minor infractions."
  },
  {
    "title": "The Dodgers United Los Angeles. Then the ICE Raids Began.",
    "link": "https://www.nytimes.com/2025/10/01/magazine/los-angeles-dodgers-trump-latinos.html",
    "summary": "For decades, the Dodgers have been the pride of L.A.’s Latino community. Trump’s immigration raids are testing that."
  },
  {
    "title": "How Government Shutdowns Got More Severe and Further Reaching",
    "link": "https://www.nytimes.com/2025/10/01/us/past-government-shutdowns-length.html",
    "summary": "Shutdowns started having significant effects after an attorney general in the 1980s argued that it was illegal for the government to spend money without congressional appropriations."
  },
  {
    "title": "Shutdown Puts a Divided Fed in a Perilous Position",
    "link": "https://www.nytimes.com/2025/10/01/business/federal-reserve-shutdown.html",
    "summary": "Some policymakers at the central bank are in a rush to lower interest rates after the Federal Reserve’s first cut this year, while others are urging caution."
  },
  {
    "title": "Supreme Court Allows Lisa Cook to Remain at Fed, for Now",
    "link": "https://www.nytimes.com/2025/10/01/us/politics/supreme-court-lisa-cook-fed.html",
    "summary": "The justices deferred a decision on the president’s efforts to oust Ms. Cook and instead set oral arguments in the case for January."
  },
  {
    "title": "Trump Administration to Withhold $18 Billion for N.Y.C. Infrastructure",
    "link": "https://www.nytimes.com/2025/10/01/nyregion/trump-nyc-subway-gateway-infrastructure-funding.html",
    "summary": "The transportation secretary said previously awarded funds for two major projects, the expansion of the Second Avenue subway and the construction of train tunnels under the Hudson River, would not be distributed."
  },
  {
    "title": "Trump Gave the Military’s Brass a Rehashed Speech. Until Minute 44.",
    "link": "https://www.nytimes.com/2025/09/30/us/politics/trump-military-brass-speech.html",
    "summary": "On an almost daily basis, thousands of words pour forth from the president’s mouth. Sometimes, he tucks in a wildly revealing insight about the direction he is taking the country."
  },
  {
    "title": "Tony Blair, Tapped by Trump for Gaza Plan, Brings Peace Expertise and Baggage",
    "link": "https://www.nytimes.com/2025/10/01/world/middleeast/tony-blair-gaza-peace-plan.html",
    "summary": "After helping negotiate peace in Northern Ireland, the former prime minister’s reputation was tarnished by his role in the U.S.-led invasion of Iraq. Is he stepping into another diplomatic quagmire?"
  },
  {
    "title": "The Global Sumud Flotilla Is Approaching Gaza. Here’s What to Know.",
    "link": "https://www.nytimes.com/2025/10/01/world/middleeast/gaza-flotilla-aid-global-sumud-israel.html",
    "summary": "Israel’s government has said it will do whatever is necessary to keep the Global Sumud Flotilla from reaching the Gaza Strip."
  },
  {
    "title": "Trump Promises to Defend Qatar, a Reassurance After Israel’s Strike",
    "link": "https://www.nytimes.com/2025/10/01/world/middleeast/qatar-trump-executive-order.html",
    "summary": "An executive order says an attack on Qatar would be treated as a threat to the U.S., bolstering security commitments to a key Gulf ally after Israel’s strike on Doha last month."
  },
  {
    "title": "The $400 Million Restaurant Man",
    "link": "https://www.nytimes.com/2025/09/30/dining/stephen-starr-restaurants.html",
    "summary": "Stephen Starr has become one of America’s most successful restaurateurs, making and replicating dining magic at places like Pastis and Osteria Mozza."
  },
  {
    "title": "After Kirk’s Death, Turning Point Vows to Go On. That May Be Easier Said Than Done.",
    "link": "https://www.nytimes.com/2025/10/01/us/politics/charlie-kirk.html",
    "summary": "Despite a surge in new campus chapters, there is a void left by Charlie Kirk’s murder that has implications for the entire MAGA movement."
  },
  {
    "title": "Spencer Pratt Lost His House in the Palisades Fire and Thinks Gavin Newsom Should Take the Blame",
    "link": "https://www.nytimes.com/2025/10/01/business/economy/spencer-pratt-palisades-fire-gavin-newsom.html",
    "summary": "After losing his house in the Palisades fire, Spencer Pratt has gone from the archetype of celebrity emptiness to community activist — and become a magnet for Republican politicians."
  },
  {
    "title": "Spam and Scams Proliferate in Facebook’s Political Ads",
    "link": "https://www.nytimes.com/2025/10/01/technology/facebooks-political-ads-deepfakes-scams.html",
    "summary": "A new analysis of political advertisers found that the platform profits from ads that include deepfakes and other content prohibited by its own policies."
  },
  {
    "title": "Should the Autism Spectrum Be Split Apart?",
    "link": "https://www.nytimes.com/2025/10/01/health/autism-spectrum-neurodiversity-kennedy.html",
    "summary": "Families of people with severe autism say the repeated expansion of the diagnosis pushed them to the sidelines. A new focus on the disorder has opened the way for them to argue their cause."
  },
  {
    "title": "Did a Green Beret Unit Commit One of the Worst U.S. War Crimes in Decades?",
    "link": "https://www.nytimes.com/2025/09/30/magazine/2012-green-beret-killings-nerkh-war-crimes.html",
    "summary": "In 2012, after a team member was nearly killed, a Special Forces unit went on a rampage that might have been one of the worst war crimes in recent U.S. history."
  },
  {
    "title": "Inside the U.S. Special Forces: 5 Takeaways on a Culture of Lawlessness in Afghanistan",
    "link": "https://www.nytimes.com/2025/09/30/magazine/afghanistan-war-green-berets-trump-hegseth.html",
    "summary": "Until now, many of the troubling events that took place during the war in Afghanistan have been shrouded in secrecy."
  },
  {
    "title": "The Race to Figure Out Why More Young People Are Getting Cancer",
    "link": "https://www.nytimes.com/2025/10/01/well/cancer-young-people.html",
    "summary": "In the last decade, more than a dozen types of cancer have risen among people under 50. Scientists don’t have all of the answers, but research is starting to offer clues."
  },
  {
    "title": "Tell us about your experience with early-onset cancer.",
    "link": "https://www.nytimes.com/2025/10/01/well/tell-us-about-your-experience-with-early-onset-cancer.html",
    "summary": "We want to hear your stories of living with cancer as a younger adult."
  },
  {
    "title": "How 106 People Got Together to Stop a School Shooting Before It Happened",
    "link": "https://www.nytimes.com/2025/09/27/nyregion/mass-shooting-prevention.html",
    "summary": "A threat on a school bus from an alienated young man united dozens of agencies to answer a single question: Is it possible to stop potential mass shooters before they commit a crime?"
  },
  {
    "title": "Did the Yankees Try to Keep Red Sox Fans Out of the Bronx?",
    "link": "https://www.nytimes.com/2025/10/01/nyregion/yankees-red-sox-wild-card-bronx.html",
    "summary": "Not exactly, but to the thousands of Boston fans who attended the first game of the Wild Card series at Yankee Stadium, it was a welcome reason to root against the home team."
  },
  {
    "title": "Mary Tyler Moore Tossed This Hat. Where Will It Land?",
    "link": "https://www.nytimes.com/2025/10/01/style/mary-tyler-moore-hat-clothes.html",
    "summary": "Hidden out of sight for decades, Mary Tyler Moore’s piece of television history seeks a permanent home."
  },
  {
    "title": "The Real Stakes of the Shutdown",
    "link": "https://www.nytimes.com/2025/10/01/opinion/government-shutdown-health-care-democrats.html",
    "summary": "President Trump is seeking to deprive millions of Americans of their health insurance. Senate Democrats are refusing to acquiesce."
  },
  {
    "title": "Is James Talarico the Answer to Democratic Prayers?",
    "link": "https://www.nytimes.com/2025/10/01/opinion/james-talarico-religious-left.html",
    "summary": "James Talarico sees a spiritual void at the center of our society."
  },
  {
    "title": "The Federal Government Shut Down Overnight",
    "link": "https://www.nytimes.com/2025/10/01/briefing/the-federal-government-shut-down-overnight.html",
    "summary": "We also look at a gathering of generals in Washington."
  },
  {
    "title": "How Would a Government Shutdown Affect You?",
    "link": "https://www.nytimes.com/2025/09/30/us/government-shutdown-callout.html",
    "summary": "Shutdowns are complicated and could have wide-ranging consequences. Your input can help steer our coverage."
  },
  {
    "title": "Bronx Building Partially Collapses in Public Housing Complex",
    "link": "https://www.nytimes.com/2025/10/01/nyregion/bronx-explosion-building-collapse.html",
    "summary": "Fire officials said an incinerator shaft in a building on Alexander Avenue had fallen in after reports of an explosion. No injuries were reported."
  },
  {
    "title": "I Interviewed a Doctor in Sudan. Days Later, He Was Killed.",
    "link": "https://www.nytimes.com/2025/10/01/world/africa/sudan-el-fasher-war-doctor-rsf-killed.html",
    "summary": "Dr. Omar Selik’s raw, urgent testimony from a besieged city cut through the fog of war and crystallized the depravity of the conflict. And then he was gone."
  },
  {
    "title": "‘Rampant’ Book Bans Are Now Taken for Granted, Free Speech Group Warns",
    "link": "https://www.nytimes.com/2025/10/01/books/book-bans-pen-america.html",
    "summary": "A new report from PEN America tracks restrictions on school books across 45 states."
  },
  {
    "title": "In the Philippines, Search Teams Look for Survivors of Deadly Earthquake",
    "link": "https://www.nytimes.com/2025/10/01/world/asia/philippines-earthquake-cebu.html",
    "summary": "The earthquake killed at least 69 people, including residents of a village of “disaster-resilient homes” built for people who survived Super Typhoon Haiyan in 2013."
  }
]