[
  {
    "title": "Why Now? The Lost Chances to Reach a Hostage Deal, and a Cease-Fire, Months Ago",
    "link": "https://www.nytimes.com/2025/10/12/us/politics/lost-chances-hostage-deal-gaza-israel.html",
    "summary": "On Gaza, President Trump put few, if any, guardrails on Israel’s offensive, bucking international demands for a cease-fire. Then he changed course."
  },
  {
    "title": "Israel and Hamas Were Not Ready for a Comprehensive Peace Deal, Mediator Says",
    "link": "https://www.nytimes.com/2025/10/12/world/middleeast/israel-hamas-peace-deal.html",
    "summary": "The Qatari prime minister told The New York Times that Gaza war mediators decided to delay talks on more difficult issues so a hostage-prisoner swap could be concluded quickly."
  },
  {
    "title": "Trump Heads to Israel and Then Egypt as Hostage-Prisoner Swap Nears",
    "link": "https://www.nytimes.com/2025/10/12/us/politics/trump-leaves-for-a-visit-to-israel-and-will-later-co-chair-a-meeting-in-egypt-on-the-gaza-peace-plan.html",
    "summary": "In Israel, he plans to meet with hostage families and address the Knesset, and in Egypt, he will help lead a summit with more than 20 countries to discuss the peace process in Gaza."
  },
  {
    "title": "What We Know About the Deal Between Israel and Hamas",
    "link": "https://www.nytimes.com/2025/10/09/world/middleeast/israel-hamas-deal-what-to-know.html",
    "summary": "Hostages in Gaza are set to be swapped for Palestinian prisoners in Israel. The releases are expected to begin early on Monday morning."
  },
  {
    "title": "How Trump’s Chicago Immigration Crackdown Escalated, in 10 Videos",
    "link": "https://www.nytimes.com/2025/10/12/us/chicago-immigration-crackdown-videos.html",
    "summary": "Week by week, the federal campaign to ramp up immigration enforcement in the Chicago area has created fear and inflamed tensions."
  },
  {
    "title": "These Students Are Scared. Friends and Teachers Are Their Protectors.",
    "link": "https://www.nytimes.com/2025/10/11/nyregion/schools-immigrant-children-deportation.html",
    "summary": "Sometimes, they offer a place to stay to immigrant children. Other times, they provide help navigating the legal system. They have become part of the resistance."
  },
  {
    "title": "Trump Has Not Ruled Out Invoking Insurrection Act to Deploy National Guard, Vance Says",
    "link": "https://www.nytimes.com/2025/10/12/us/politics/jd-vance-trump-insurrection-act.html",
    "summary": "Vice President JD Vance asserted in an interview on NBC News’ “Meet the Press” that crime was “out of control” in major U.S. cities."
  },
  {
    "title": "Cars to Fighter Jets: China’s New Export Curbs May Level a Heavy Blow Worldwide",
    "link": "https://www.nytimes.com/2025/10/12/business/china-rare-earth-export-controls.html",
    "summary": "Broad restrictions could cause supply interruptions for arms makers, as well as manufacturers in the semiconductor, automotive and other sectors."
  },
  {
    "title": "How Las Vegas Sands Helped Get the N.B.A. Back Into China",
    "link": "https://www.nytimes.com/2025/10/11/world/asia/las-vegas-sands-nba-china-macau-casino-dumont-games.html",
    "summary": "Las Vegas Sands, owned by the Adelson family, was under pressure in Macau, with billions at stake. That created an opportunity."
  },
  {
    "title": "N.B.A. Head Criticizes Chinese Party Paper Over LeBron James ‘Op-Ed’",
    "link": "https://www.nytimes.com/2025/10/11/world/asia/china-nba-lebron.html",
    "summary": "The People’s Daily newspaper put the star player’s name on an opinion article, an example of the political perils the N.B.A. could face in China."
  },
  {
    "title": "The Destructive Legacy of California’s Zombie Fires",
    "link": "https://www.nytimes.com/2025/10/12/us/palisades-zombie-fires.html",
    "summary": "Blazes that firefighters thought had died but then later came roaring back to life have become increasingly common, heightening scrutiny of how first-responders put out wildfires."
  },
  {
    "title": "California Orders Insurers to Pay More for Wildfire Victims’ Lost Items",
    "link": "https://www.nytimes.com/2025/10/12/realestate/california-doubles-wildfire-payouts.html",
    "summary": "After years of fires that left families tallying every burned toothbrush, a new law is requiring insurers to ease a grueling burden."
  },
  {
    "title": "The Surprising Power of Diane Keaton’s Emotional Transparency",
    "link": "https://www.nytimes.com/2025/10/12/movies/diane-keaton-the-godfather.html",
    "summary": "Earlier roles in “The Godfather” and later roles in “Something’s Gotta Give” showed the depth and nuance of the actress whom we met in “Annie Hall.”"
  },
  {
    "title": "Diane Keaton in ‘Reds’: A Remarkable Performance but Also a Returning Point",
    "link": "https://www.nytimes.com/2025/10/12/movies/diane-keaton-reds.html",
    "summary": "Her character, an early-20th-century journalist, undergoes the most dramatic transformation of the film in ways that the actress was especially suited for."
  },
  {
    "title": "Diane Keaton Was the Definition of a Style Icon",
    "link": "https://www.nytimes.com/2025/10/12/style/diane-keaton-style-icon.html",
    "summary": "Her legacy will include the ways she shaped fashion, rather than allowing fashion to shape her."
  },
  {
    "title": "Orban’s ‘Propaganda State’ in Hungary Is Starting to Show Cracks",
    "link": "https://www.nytimes.com/2025/10/12/world/europe/orban-hungary-media-propaganda-magyar.html",
    "summary": "The Hungarian leader has secured power by keeping control over the news media. Now, a political opponent is starting to show the limits of his tactics."
  },
  {
    "title": "Inside the Closed-Door Meetings of the N.F.L.’s Billionaire Owners",
    "link": "https://www.nytimes.com/2025/10/12/business/nfl-owners-trump.html",
    "summary": "Every three months, closed-door meetings of the billionaires who own N.F.L. teams become displays of status, beefs and sometimes Trump-induced headaches."
  },
  {
    "title": "What’s the Deal With All Those FanDuel Ads?",
    "link": "https://www.nytimes.com/2025/10/12/business/fanduel-flutter-sports-betting-gambling.html",
    "summary": "Peter Jackson, the chief executive of Flutter Entertainment, FanDuel’s parent company, is fighting for attention as online gambling spreads across the United States."
  },
  {
    "title": "Nor’easter Brings Heavy Rain and Flooding as It Moves Up East Coast",
    "link": "https://www.nytimes.com/2025/10/12/us/noreaster-storm-forecast-damage.html",
    "summary": "The Mid-Atlantic and Northeast will bear the brunt of the storm, which will usher in beach erosion and flooding, Monday into Tuesday, forecasters said."
  },
  {
    "title": "How ‘TBPN’ Became Silicon Valley’s Newest Obsession",
    "link": "https://www.nytimes.com/2025/10/11/technology/tbpn-silicon-valley.html",
    "summary": "Silicon Valley is obsessed with “TBPN,” a streaming show on which no career move is too trivial to document."
  },
  {
    "title": "How the Young Lords Took Over Lincoln Hospital in the Bronx — Twice",
    "link": "https://www.nytimes.com/2025/10/10/us/young-lords-lincoln-hospital-addiction.html",
    "summary": "In 1970, the Young Lords, a Puerto Rican civil rights group, seized a hospital in the Bronx — twice."
  },
  {
    "title": "How a Trump Judge Exposed the Trump Con",
    "link": "https://www.nytimes.com/2025/10/12/opinion/trump-judge-immergut-portland-national-guard.html",
    "summary": "Dishonest presidents should be entitled to no deference at all."
  },
  {
    "title": "What Ted Lasso, the Bhargava Gita and Derrida Can Teach Us About Ourselves",
    "link": "https://www.nytimes.com/2025/10/12/opinion/derrida-trump-ted-lasso-binaries.html",
    "summary": "Our culture is amok with binaries. We have two major parties, just two, and they are forever opposed."
  },
  {
    "title": "South Carolina Bar Shooting Leaves at Least 4 Dead, Sheriff Says",
    "link": "https://www.nytimes.com/2025/10/12/us/south-carolina-st-helena-shooting-bar.html",
    "summary": "Four people were in critical condition after an early-morning shooting that left 12 other people injured on Sunday in St. Helena, S.C., according to the Beaufort County Sheriff’s Office."
  },
  {
    "title": "John Searle, Philosopher Who Wrestled With A.I., Dies at 93",
    "link": "https://www.nytimes.com/2025/10/12/books/john-searle-dead.html",
    "summary": "His blunt debating and imaginative theorizing about artificial intelligence and the human mind made him a leading scholar. But sexual-harassment allegations ended his career."
  },
  {
    "title": "2 Dead After Small Plane Crashes Into Semitrailers Near Texas Airfield",
    "link": "https://www.nytimes.com/2025/10/12/us/fort-worth-plane-crash-hicks-field.html",
    "summary": "It was unknown what led up to the crash on Sunday afternoon near Hicks Airfield outside of Fort Worth."
  }
]