[
  {
    "title": "Iran Has Its Back Against the Wall",
    "link": "https://www.nytimes.com/2025/06/19/world/middleeast/iran-islamic-republic-regime.html",
    "summary": "The Iranian regime finds itself in its most difficult position 46 years after the revolution that brought it to power. But does it mean the end?"
  },
  {
    "title": "Will Israel’s Interceptors Outlast Iran’s Missiles? The Answer May Shape the War.",
    "link": "https://www.nytimes.com/2025/06/19/world/middleeast/israel-interceptors-iran-missiles-war-length.html",
    "summary": "Israel has a world-leading missile interception system but its bank of interceptors is finite."
  },
  {
    "title": "Trump, Iran and the Specter of Iraq: ‘We Bought All the Happy Talk’",
    "link": "https://www.nytimes.com/2025/06/18/us/politics/trump-iran-iraq.html",
    "summary": "President Trump is pondering swift military action in Iran. There were similar expectations that the war in Iraq would be quick and triumphant."
  },
  {
    "title": "The MAGA Fight Over Iran, and a Critical Ruling on Transgender Youth Care",
    "link": "https://www.nytimes.com/2025/06/19/podcasts/the-headlines/iran-israel-transgender-care.html",
    "summary": "Plus, a bidding frenzy over David Lynch’s espresso machine."
  },
  {
    "title": "Trying to Satisfy Trump, NATO Is Running Into Difficulties",
    "link": "https://www.nytimes.com/2025/06/19/world/europe/nato-spending-russia-trump.html",
    "summary": "A plan to increase military spending at the level President Trump wants is becoming clearer, as are its shortcomings."
  },
  {
    "title": "William G. Young, a Reagan-Appointed Judge, Is Fast-Tracking Trump to Trial",
    "link": "https://www.nytimes.com/2025/06/18/us/politics/judge-william-g-young-trump.html",
    "summary": "Judge William G. Young’s long career has been punctuated by high-profile cases and outspoken advocacy for the judiciary’s value and fact-finding power."
  },
  {
    "title": "U.S. to Review Social Media Posts of Student and Scholar Visa Applicants",
    "link": "https://www.nytimes.com/2025/06/18/us/politics/student-visa-applications.html",
    "summary": "The State Department is restarting the processing of visa applications from students and visiting scholars, but is screening for  “hostility” toward the United States."
  },
  {
    "title": "Trump Travel Restrictions Bar Residents Needed at U.S. Hospitals",
    "link": "https://www.nytimes.com/2025/06/18/health/medical-residents-travel-ban.html",
    "summary": "Limits on travel and visa appointments have delayed or prevented foreign doctors from entering the country for jobs set to begin in weeks."
  },
  {
    "title": "U.S. v. Skrmetti: How the Transgender Rights Movement Bet on the Supreme Court and Lost",
    "link": "https://www.nytimes.com/2025/06/19/magazine/scotus-transgender-care-tennessee-skrmetti.html",
    "summary": "The inside story of the case that could set the movement back a generation."
  },
  {
    "title": "What to Know About United States v. Skrmetti",
    "link": "https://www.nytimes.com/2025/06/19/magazine/transgender-supreme-court-skrmetti-takeaways.html",
    "summary": "A Times examination shows how a landmark case about gender-affirming care for minors was built on flawed politics and uncertain science."
  },
  {
    "title": "Court Leaves States to Decide on Trans Treatments for Minors",
    "link": "https://www.nytimes.com/2025/06/19/us/states-trans-treatments-minors-supreme-court.html",
    "summary": "The Supreme Court decision upholding a Tennessee ban on gender transition care for trans youths means a state-by-state patchwork of policies will remain."
  },
  {
    "title": "China Is Hacking Russia to Steal War Secrets",
    "link": "https://www.nytimes.com/2025/06/19/world/europe/china-hackers-russia-war-ukraine.html",
    "summary": "Since the war in Ukraine began, analysts have monitored a series of intrusions aimed at stealing information about weaponry and warfighting."
  },
  {
    "title": "No Sting, No Mercedes: A Russian Expo Shows Cost of Divorce With the West",
    "link": "https://www.nytimes.com/2025/06/19/world/europe/russia-ukraine-economic-forum-st-petersburg.html",
    "summary": "The annual economic forum in St. Petersburg used to host multibillion-dollar deals and performances by global music stars. With the war in Ukraine still raging, the mood has shifted."
  },
  {
    "title": "On Juneteenth, This Williamsburg Schoolhouse Finds a New Life",
    "link": "https://www.nytimes.com/2025/06/19/us/bray-school-virginia-juneteenth.html",
    "summary": "Beginning on Juneteenth, a restored Virginia schoolhouse where enslaved and free Black students were taught to read is on view in Colonial Williamsburg."
  },
  {
    "title": "Quietly, Pakistan Wages a Deadly Drone Campaign Inside Its Own Borders",
    "link": "https://www.nytimes.com/2025/06/19/world/asia/pakistan-drones-militants.html",
    "summary": "As it strikes militants, the country’s security services are adopting a tactic that Pakistan once criticized the United States for using."
  },
  {
    "title": "Brad Lander Tried to Escort Immigrants Facing Arrest. He’s Not Alone.",
    "link": "https://www.nytimes.com/2025/06/19/nyregion/ice-immigrants-volunteer-escorts-courthouse.html",
    "summary": "A growing army of volunteers has mustered at immigration courts during a month-old campaign to detain people showing up for routine hearings."
  },
  {
    "title": "Mamdani’s Comment on ‘Intifada’ Motto Fuels Tension in Mayor’s Race",
    "link": "https://www.nytimes.com/2025/06/19/nyregion/mamdani-globalize-intifada.html",
    "summary": "Andrew Cuomo, a leading candidate for mayor, criticized Zohran Mamdani’s discussion of the phrase “globalize the intifada,” and Mr. Mamdani accused him of neglecting Muslim New Yorkers."
  },
  {
    "title": "N.Y. Lawmakers Target Prison Reform and A.I. in Frantic End of Session",
    "link": "https://www.nytimes.com/2025/06/19/nyregion/new-york-legislature-ai-prison-reform.html",
    "summary": "We take a closer look at five of the more than 600 bills passed in June by the State Legislature."
  },
  {
    "title": "Hurricane Erick Nears Mexico as a Category 4 Storm",
    "link": "https://www.nytimes.com/2025/06/19/world/americas/hurricane-erick-mexico-landfall.html",
    "summary": "Erick set off flash floods in the states of Oaxaca and Guerrero. A stretch of the Pacific coastline, including Acapulco, was under a hurricane warning."
  },
  {
    "title": "U.S. Heat Wave Forecast: When High Temperatures Will Affect You",
    "link": "https://www.nytimes.com/2025/06/19/weather/us-heat-wave-midwest-northeast-forecast.html",
    "summary": "Friday is the first day of summer. And boy, will it feel like it."
  },
  {
    "title": "A Trump Executive Order Could Affect Ukrainian Refugees in Iowa",
    "link": "https://www.nytimes.com/2025/06/19/us/ukrainian-refugees-iowa-trump.html",
    "summary": "The Trump administration suspended a temporary humanitarian program for Ukrainians. Now many are losing their ability to work, and fear deportation."
  },
  {
    "title": "This Oregon Native Went to Kyiv as a Volunteer. He Died in a Russian Attack.",
    "link": "https://www.nytimes.com/2025/06/19/world/europe/ukraine-russia-war-american-fred-grandy.html",
    "summary": "Fred Grandy was upset by the United States’ reversal in its support for Ukraine, his family said. This week, he was among the 28 people killed in a drone and missile assault."
  },
  {
    "title": "For Food Network Fans, Anne Burrell Was the Fun-Loving Aunt",
    "link": "https://www.nytimes.com/2025/06/18/dining/anne-burrell-food-network.html",
    "summary": "The chef, who died Tuesday, built her stardom on a big, down-to-earth personality in which viewers could see themselves."
  },
  {
    "title": "Belgian Nonprofit Papy Boom Is Helping Retirement-Home Residents Hit the Clubs",
    "link": "https://www.nytimes.com/2025/06/19/world/europe/papy-booom-brussels-seniors-nightclub-loneliness.html",
    "summary": "A group of Brussels retirement-home residents grooved to electronic music late one night as part of a program to fight loneliness among seniors."
  },
  {
    "title": "America Can’t Bomb Iran Out of Making a Nuclear Weapon",
    "link": "https://www.nytimes.com/2025/06/19/opinion/america-iran-war-nuclear.html",
    "summary": "Trump should judge the efficacy of any military action in Iran by the same standards against which he previously assessed diplomacy."
  },
  {
    "title": "The Progressive Regulator With Trumpist Fans",
    "link": "https://www.nytimes.com/2025/06/19/opinion/lina-khan-monopolies-trump.html",
    "summary": "Lina Khan wants to overthrow “the autocrats of trade.”"
  },
  {
    "title": "A Legal Gamble",
    "link": "https://www.nytimes.com/2025/06/19/briefing/a-legal-gamble.html",
    "summary": "We explain the Supreme Court’s ruling on medical treatments for transgender kids."
  },
  {
    "title": "Seth Meyers Wishes Tucker Carlson and Ted Cruz Could Both Lose",
    "link": "https://www.nytimes.com/2025/06/19/arts/television/seth-meyers-tucker-carlson-ted-cruz.html",
    "summary": "The clash of conservative titans had Meyers feeling like a Roman emperor: “I just want someone to feed me grapes while I say, ‘Let them fight.’”"
  },
  {
    "title": "Student Who Filmed Himself Raping at Least 10 Women to Be Sentenced in London",
    "link": "https://www.nytimes.com/2025/06/19/world/europe/chinese-student-rapist-uk.html",
    "summary": "Zou Zhenhao, 28, is considered by the police in the British capital to be “one of the most prolific predators” they have encountered. Investigators say there are probably many more victims."
  },
  {
    "title": "SpaceX Starship Explodes During Test in Texas",
    "link": "https://www.nytimes.com/2025/06/19/us/spacex-rocket-explosion-texas.html",
    "summary": "The Starship experienced a “major anomaly” before starting its 10th flight test. Elon Musk’s giant moon and Mars rocket has a mixed record of success."
  },
  {
    "title": "Air India Cuts International Flights After Crash Causes Chaos",
    "link": "https://www.nytimes.com/2025/06/19/world/asia/air-india-plane-crash-flights-cuts.html",
    "summary": "The move came a day after Indian officials told the airline to improve its operations, and as delays and canceled flights are drawing complaints from passengers."
  },
  {
    "title": "The Crane That Ruined Florence’s Skyline Is Gone",
    "link": "https://www.nytimes.com/2025/06/19/world/europe/florence-crane-uffizi-gallery.html",
    "summary": "A reviled crane used during the expansion of the Uffizi Galleries was taken down this week after years of protests."
  }
]