[
  {
    "title": "Hakeem Jeffries Breaks Record in Hourslong Speech Opposing Trump’s Policy Bill",
    "link": "https://www.nytimes.com/2025/07/03/us/politics/hakeem-jeffries-house-speech-magic-minute-trump-bill.html",
    "summary": "Representative Hakeem Jeffries, the New York Democrat and minority leader, delayed a final House vote with an impassioned speech that lasted nearly nine hours."
  },
  {
    "title": "How Will Trump Sell His Big Policy Bill to the American Public?",
    "link": "https://www.nytimes.com/2025/07/03/us/politics/trump-policy-bill.html",
    "summary": "President Trump has spent days cajoling Republicans to support his spending bill. He will also have to sell it to the public as Democrats focus on all the ways it helps the wealthy."
  },
  {
    "title": "Tax Cuts Now, Benefit Cuts Later: The Timeline in the Republican Megabill",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/tax-cuts-benefit-cuts.html",
    "summary": "Republicans deferred some of their most painful spending cuts until after the midterm elections."
  },
  {
    "title": "Hiring Held Steady in June as Employers Added 147,000 Jobs",
    "link": "https://www.nytimes.com/2025/07/03/business/what-to-know-about-the-jobs-report.html",
    "summary": "The strength of the labor market suggests that the economy remains robust despite uncertainty caused by President Trump’s tariffs and geopolitical turmoil."
  },
  {
    "title": "Trump Wants the World to Squeeze Out China. He’s Starting With Vietnam.",
    "link": "https://www.nytimes.com/2025/07/03/business/trump-tariffs-vietnam-southeast-asia.html",
    "summary": "An initial trade deal with Vietnam offers a glimpse of how President Trump is pushing countries to cut back on trade with China."
  },
  {
    "title": "Solid Jobs Report Keeps Fed Rate Cuts at Bay",
    "link": "https://www.nytimes.com/2025/07/03/business/jobs-fed-rate-cuts.html",
    "summary": "The latest labor market data reinforces the central bank’s wait-and-see approach to lowering borrowing costs, despite pressure from President Trump."
  },
  {
    "title": "Supreme Court Agrees to Hear Cases Involving Transgender Athletes",
    "link": "https://www.nytimes.com/2025/07/03/us/politics/supreme-court-transgender-athletes.html",
    "summary": "The court announced it would hear challenges to state laws barring transgender athletes from girls’ and women’s sports."
  },
  {
    "title": "Democrats Denied This City Had a Gang Problem. The Truth Is Complicated.",
    "link": "https://www.nytimes.com/2025/07/03/magazine/aurora-colorado-venezuela-gangs.html",
    "summary": "Trump’s claim that Venezuelan criminals took over Aurora, Colorado, became a rationale for his immigration crackdown. What really happened there?"
  },
  {
    "title": "They Planned Parties and Salsa Music for July 4th. ICE Raids Made Them Think Twice.",
    "link": "https://www.nytimes.com/2025/07/03/us/immigration-raids-fourth-of-july.html",
    "summary": "Some communities in the Los Angeles region canceled events over fears of immigration raids, as Latinos grapple with how, and whether, to celebrate Independence Day."
  },
  {
    "title": "E.P.A. Suspends 144 Employees After They Signed a Letter Criticizing Trump",
    "link": "https://www.nytimes.com/2025/07/03/climate/epa-letter-administrative-leave.html",
    "summary": "The letter had accused the Trump administration of politicizing, dismantling and sidelining the agency."
  },
  {
    "title": "Sean ‘Diddy’ Combs’s Winning Defense: He’s Abusive, but He’s Not a Racketeer",
    "link": "https://www.nytimes.com/2025/07/03/arts/music/sean-combs-diddy-lawyers-defense-racketeering.html",
    "summary": "In defusing much of the government’s case, lawyers for the music mogul did not dispute that he did bad things. They disputed that they matched the crimes he was charged with."
  },
  {
    "title": "What’s Next in the Sean ‘Diddy’ Combs Trial?",
    "link": "https://www.nytimes.com/2025/07/03/arts/music/sean-combs-diddy-trial-next-prison-lawsuits.html",
    "summary": "The music mogul remains in custody after he was convicted on two counts of transporting prostitutes. A judge will determine his prison sentence at an unspecified date."
  },
  {
    "title": "The Diddy Trial Is Over But My Mind Is Still Racing",
    "link": "https://www.nytimes.com/2025/07/03/podcasts/diddy-sean-combs-verdict.html",
    "summary": "But my mind is still racing."
  },
  {
    "title": "He Made Green-Wood Cemetery a Destination for the Living",
    "link": "https://www.nytimes.com/2025/07/03/nyregion/green-wood-cemetery-brooklyn.html",
    "summary": "Richard J. Moylan has overseen a transformation of Green-Wood Cemetery in Brooklyn in his nearly 40 years as president. Now he’s ready to retire."
  },
  {
    "title": "Will Politics Derail America’s 250th Birthday Bash?",
    "link": "https://www.nytimes.com/2025/07/03/arts/independence-day-250-trump.html",
    "summary": "This week, President Trump will start the countdown to next summer’s Semiquincentennial with an event at the Iowa State Fairgrounds. Not everyone wants to wave the flag his way."
  },
  {
    "title": "How Trump’s China Tariffs Are Jeopardizing America’s Fireworks Extravaganzas",
    "link": "https://www.nytimes.com/2025/07/03/business/trumps-china-tariffs-effect-fireworks.html",
    "summary": "The pyrotechnics industry relies heavily on Chinese fireworks imports and warns that this could be the last big bang Fourth of July."
  },
  {
    "title": "Diogo Jota, Liverpool Soccer Star, Dies in Car Crash at 28",
    "link": "https://www.nytimes.com/2025/07/03/world/europe/diogo-jota-dead-car-crash-liverpool.html",
    "summary": "Mr. Jota and his brother André Silva died in Spain, the authorities said. The crash came two weeks after the Portuguese player’s wedding."
  },
  {
    "title": "Where Do Israel-Hamas Truce Negotiations Stand?",
    "link": "https://www.nytimes.com/2025/07/03/world/middleeast/israel-hamas-ceasefire-negotiations.html",
    "summary": "Hamas wants to ensure that the latest cease-fire proposal has sufficient guarantees that negotiations will lead to a permanent end to the Gaza war."
  },
  {
    "title": "Israel and Syria in U.S.-Brokered Talks to End Border Conflict, Trump Envoy Says",
    "link": "https://www.nytimes.com/2025/07/03/world/middleeast/israel-syria-border-us-barrack.html",
    "summary": "Thomas J. Barrack Jr., the U.S. ambassador to Turkey, says Washington is facilitating the discussions and prioritizing economic development over nation-building in the Middle East."
  },
  {
    "title": "How Drinking Alcohol Affects You in Older Age",
    "link": "https://www.nytimes.com/2025/07/03/well/alcohol-older-age-risks.html",
    "summary": "Alcohol can present health problems for even light or occasional drinkers."
  },
  {
    "title": "Mr. Big Is Alive and Well and Married in Vermont",
    "link": "https://www.nytimes.com/2025/07/03/fashion/mr-big-sex-and-the-city-inspiration-vermont.html",
    "summary": "The real-life inspiration for the famous toxic bachelor on “Sex and the City” left the Big Apple for the Green Mountain state."
  },
  {
    "title": "What to Know About the Heat Wave in Europe",
    "link": "https://www.nytimes.com/article/heat-wave-europe-what-to-know.html",
    "summary": "Some parts of Western Europe were starting to cool off as the extreme heat that has gripped the continent moved east."
  },
  {
    "title": "Extreme Heat Shuts Down Some Nuclear Reactors in Europe",
    "link": "https://www.nytimes.com/2025/07/03/climate/extreme-heat-nuclear-shutdowns.html",
    "summary": "Power plant operators in Switzerland and France idled reactors so that discharged cooling water would not harm wildlife in already-hot rivers."
  },
  {
    "title": "Greece Wildfire Forces Evacuation of 1,500 People From Island of Crete",
    "link": "https://www.nytimes.com/2025/07/03/world/europe/tourists-evacuated-crete-wildfire.html",
    "summary": "Most of those fleeing the blaze were tourists. Firefighters struggled against heavy winds to bring the flames under control."
  },
  {
    "title": "What Are Republicans Thinking With Such a Reckless Bill? Maybe This.",
    "link": "https://www.nytimes.com/2025/07/03/opinion/republican-bill-trump-reagan.html",
    "summary": "A tax move from the Reagan era might explain what’s going on now."
  },
  {
    "title": "‘There’s Just Too Much Lawlessness’: Three Legal Experts on an Embattled Supreme Court",
    "link": "https://www.nytimes.com/2025/07/03/opinion/supreme-court-trump.html",
    "summary": "Grading how the Supreme Court has done so far in Trump 2.0."
  },
  {
    "title": "Sizing Up the Debt",
    "link": "https://www.nytimes.com/2025/07/03/briefing/sizing-up-the-debt.html",
    "summary": "We explain how economists evaluate the national debt."
  },
  {
    "title": "Pardoned Jan. 6 Rioter Sentenced to Life in Assassination Plot",
    "link": "https://www.nytimes.com/2025/07/03/us/politics/jan6-assassination-plot-sentence.html",
    "summary": "Edward Kelley had been convicted of plotting to kill the law enforcement officers who had investigated his case."
  },
  {
    "title": "4 Dead, 14 Injured in Chicago Shooting Outside River North Lounge",
    "link": "https://www.nytimes.com/2025/07/03/us/chicago-shooting.html",
    "summary": "Gunfire from a passing car ripped into a crowd of clubgoers in the River North neighborhood, the police said."
  },
  {
    "title": "In Europe, Economists See a Chance to Rise on the Global Stage",
    "link": "https://www.nytimes.com/2025/07/03/business/europe-economy-trump-competition.html",
    "summary": "Central bankers who gathered in Portugal this week focused on ways that Europe could improve its competitiveness with the United States and China."
  }
]