[
  {
    "title": "Nvidia Is First Company to Top $5 Trillion in Market Value Amid AI Boom",
    "link": "https://www.nytimes.com/2025/10/29/technology/nvidia-value-market-ai.html",
    "summary": "The A.I. chip maker has become a linchpin in the Trump administration’s trade negotiations in Asia."
  },
  {
    "title": "As Trump Weighs Sale of Advanced A.I. Chips to China, Critics Sound Alarm",
    "link": "https://www.nytimes.com/2025/10/29/us/politics/trump-china-nvidia-chips-sales.html",
    "summary": "The president signaled he would discuss the sale of Nvidia’s Blackwell chips in a summit on Thursday, a move U.S. officials warned would be a “massive” national security mistake."
  },
  {
    "title": "Geert Wilders’s Party for Freedom Loses Seats in Dutch Election",
    "link": "https://www.nytimes.com/2025/10/29/world/europe/netherlands-elections-geert-wilders.html",
    "summary": "A center-left party was poised to become the country’s largest political party, according to exit polls. The anti-immigrant Party for Freedom, led by Mr. Wilders, was expected to lose 12 seats."
  },
  {
    "title": "As Both Sides Remain Dug in, What Can Break the Government Shutdown Impasse?",
    "link": "https://www.nytimes.com/2025/10/29/us/politics/democrats-republicans-shutdown-impasse.html",
    "summary": "Significant milestones over the next few weeks could shuffle the status quo. For now, both sides remain dug in as the closure heads into a fifth week."
  },
  {
    "title": "F.B.I. Opposes Push for Gabbard to Take Lead on Counterintelligence",
    "link": "https://www.nytimes.com/2025/10/29/us/politics/fbi-gabbard-counterintelligence.html",
    "summary": "The F.B.I. made the disclosure in a pointed letter that underscored broader concern over a House bill that would give more authority to Tulsi Gabbard, the director of national intelligence."
  },
  {
    "title": "Kat Abughazaleh, Democratic Congressional Candidate, Among ICE Protesters Indicted",
    "link": "https://www.nytimes.com/2025/10/29/us/chicago-immigration-protest-indictments.html",
    "summary": "Six people, including the congressional candidate Kat Abughazaleh, were indicted by a grand jury in Chicago. Ten others were arrested on charges stemming from California protests."
  },
  {
    "title": "Prosecutors Who Called Jan. 6 Attackers a ‘Mob of Rioters’ Are Punished",
    "link": "https://www.nytimes.com/2025/10/29/us/politics/prosecutors-jan-6-trump.html",
    "summary": "The prosecutors were put on leave after filing a sentencing memo in the case of a man who showed up armed near the home of former President Barack Obama."
  },
  {
    "title": "Helen DeWitt’s New Novel Almost Drove Her To Despair",
    "link": "https://www.nytimes.com/2025/10/29/books/helen-dewitt-your-name-here.html",
    "summary": "Helen DeWitt’s bewildering co-written novel, “Your Name Here,” took almost 20 years to publish, a process that nearly drove her to despair."
  },
  {
    "title": "How Japan’s New Prime Minister Bonded With Trump",
    "link": "https://www.nytimes.com/video/world/asia/100000010485242/how-japans-new-prime-minister-bonded-with-trump.html",
    "summary": "President Trump met with Japan’s new prime minister, Sanae Takaichi, on Tuesday. Javier C. Hernández, The Times’s Tokyo bureau chief, looks at their chemistry, given the friendship Mr. Trump had with her mentor, the slain former Prime Minister Shinzo Abe."
  },
  {
    "title": "South Korea Says the United States Agreed to 15% Tariffs",
    "link": "https://www.nytimes.com/2025/10/29/us/politics/tariff-trump-south-korea-trade.html",
    "summary": "Seoul will invest $200 billion, or as much as $20 billion a year, and set aside another $150 billion to invest in its American shipbuilding operations, a South Korean official said."
  },
  {
    "title": "Bloomberg Gives $1.5 Million to Pro-Cuomo Super PAC",
    "link": "https://www.nytimes.com/2025/10/29/nyregion/bloomberg-cuomo-super-pac.html",
    "summary": "Michael R. Bloomberg, the former New York City mayor, had stayed out of the race since backing former Gov. Andrew M. Cuomo’s failed Democratic primary campaign."
  },
  {
    "title": "Mamdani’s Candidacy Roils Jewish Communities Across the Country",
    "link": "https://www.nytimes.com/2025/10/29/us/politics/zohran-mamdani-jews-rabbis.html",
    "summary": "Zohran Mamdani, the Democratic candidate for mayor of New York City, has said he cannot support Israel as long as it is an officially Jewish state. More than 1,100 American rabbis are warning that the safety of Jews is at risk."
  },
  {
    "title": "Karine Jean-Pierre and a Book Tour Most Authors Would Not Dream Of",
    "link": "https://www.nytimes.com/2025/10/29/us/politics/karine-jean-pierre-book.html",
    "summary": "The Biden White House press secretary seems to be everywhere promoting her memoir, including an “absolute train wreck’’ of an interview with The New Yorker."
  },
  {
    "title": "In Mississippi, Democrats Hope New Maps Lead to Statehouse Wins",
    "link": "https://www.nytimes.com/2025/10/29/us/politics/mississippi-elections.html",
    "summary": "A federal court says Republican legislators diluted Black voter strength. New maps may help Democrats break the G.O.P. supermajority in Jackson on Nov. 4."
  },
  {
    "title": "Police Raid in Rio de Janeiro Leaves Over 130 Dead",
    "link": "https://www.nytimes.com/2025/10/29/world/americas/rio-brazil-police-raid-deaths.html",
    "summary": "The death toll in Rio’s deadliest police operation in history rose to 132 people, the state authorities say, sparking outrage and a reckoning."
  },
  {
    "title": "Burglars in Disguise. Millions in Jewels Taken. But This Was in Queens.",
    "link": "https://www.nytimes.com/2025/10/29/nyregion/jewel-theft-jamaica-hills-queens.html",
    "summary": "Thieves dressed as construction workers stole $3.2 million in jewels and cash from a jewelry store owner’s family home, the police said."
  },
  {
    "title": "Video Analysis Shows Staged Recovery of Israeli Hostage Remains",
    "link": "https://www.nytimes.com/2025/10/29/world/europe/gaza-hamas-israel-remains.html",
    "summary": "Israel’s military released a drone video of the incident in Gaza, and The New York Times analyzed the footage."
  },
  {
    "title": "Life Lessons from (Very Old) Bowhead Whales",
    "link": "https://www.nytimes.com/2025/10/29/science/genetics-bowhead-whales-longevity.html",
    "summary": "A gene that helped bowheads adapt to frigid Arctic waters also granted them extraordinary longevity. Could it help aging humans become more resilient?"
  },
  {
    "title": "Trump Lost the Trade War to China",
    "link": "https://www.nytimes.com/2025/10/29/opinion/china-us-trade-war-xi-trump.html",
    "summary": "Xi now sees our weakness and will try to exploit it, perhaps leaving America a diminished presence in Asia."
  },
  {
    "title": "The Fed Resisted Trump. Can It Resist a Return of Inflation?",
    "link": "https://www.nytimes.com/2025/10/29/opinion/federal-reserve-powell-miran-schmid-inflation.html",
    "summary": "The Federal Reserve didn’t comply with President Trump’s wishes."
  },
  {
    "title": "Obamacare Prices Set to Increase Significantly",
    "link": "https://www.nytimes.com/2025/10/29/briefing/obamacare-prices-hurricane-melissa-damage.html",
    "summary": "Also, the Caribbean begins to assess damage from Melissa. Here’s the latest at the end of Wednesday."
  },
  {
    "title": "Virginia Moves Closer to Redistricting Plan That Would Help Democrats",
    "link": "https://www.nytimes.com/2025/10/29/us/virginia-congress-redistricting-midterms.html",
    "summary": "Republicans in Texas, North Carolina and Missouri have passed new maps while Democrats in California, Illinois and Virginia are pursuing similar efforts in response."
  },
  {
    "title": "Covid and Flu Can Triple Your Risk of Heart Attack",
    "link": "https://www.nytimes.com/2025/10/29/well/viral-infections-covid-flu-heart-attacks.html",
    "summary": "A new analysis adds to the research about the link between viral infections and heart disease."
  },
  {
    "title": "Five Houses Collapse in North Carolina’s Outer Banks",
    "link": "https://www.nytimes.com/2025/10/29/us/outer-banks-homes-collapsing-ocean.html",
    "summary": "Stormy weather, strong winds and erosion have swept away more than a dozen houses on the barrier islands since mid-September."
  },
  {
    "title": "2 Louvre Heist Suspects Have ‘Partially Admitted’ to the Crime",
    "link": "https://www.nytimes.com/2025/10/29/world/europe/louvre-theft-suspects-confession.html",
    "summary": "The Paris prosecutor overseeing the case said the two men face 15 years in prison for stealing some of France’s crown jewels, while two other suspects have yet to be caught."
  }
]