[
  {
    "title": "Gazans Are Dying of Starvation",
    "link": "https://www.nytimes.com/2025/07/24/world/middleeast/gaza-starvation.html",
    "summary": "After 21 months of devastating conflict with Israel, Gaza’s most vulnerable civilians — the young, the old and the sick — are facing what aid groups say is impending famine."
  },
  {
    "title": "As Starvation Rises, Israeli Minister Says Israel Is ‘Driving Out’ Gazans",
    "link": "https://www.nytimes.com/2025/07/24/world/middleeast/israel-minister-gaza-driving-out.html",
    "summary": "Amichay Eliyahu’s comments came amid growing hunger in the territory, where Israel controls the delivery of food."
  },
  {
    "title": "Venezuelan Migrant Takes First Step Toward Suing the U.S. Over Detention in El Salvador",
    "link": "https://www.nytimes.com/2025/07/24/us/venezuelan-migrant-us-wrongful-detention.html",
    "summary": "Neiyerver Adrián Leon Rengel, who was held in a prison in El Salvador, filed a claim Thursday against Homeland Security, accusing it of wrongful detention."
  },
  {
    "title": "Amy Sherald Cancels Her Smithsonian Show, Citing Censorship",
    "link": "https://www.nytimes.com/2025/07/24/arts/design/amy-sherald-smithsonian-censorship.html",
    "summary": "The artist said that she made the decision after she said she learned that her painting of a transgender Statue of Liberty might be removed to avoid provoking President Trump."
  },
  {
    "title": "What Happens When Your Therapist Falls Ill or Dies Unexpectedly?",
    "link": "https://www.nytimes.com/2025/07/24/health/therapist-sick-death.html",
    "summary": "Therapists are cautious about sharing personal information. When they fall ill or die unexpectedly, the shock can be shattering."
  },
  {
    "title": "Josh Shapiro Says Zohran Mamdani Fails to Condemn ‘Blatantly Antisemitic’ Rhetoric",
    "link": "https://www.nytimes.com/2025/07/24/us/politics/josh-shapiro-zohran-mamdani.html",
    "summary": "Two top Jewish Democrats, Gov. Josh Shapiro of Pennsylvania and former Mayor Rahm Emanuel of Chicago, criticized Mr. Mamdani for not condemning those who use the slogan “globalize the intifada.”"
  },
  {
    "title": "Michael Whatley, R.N.C. Chairman, to Run for Senate in North Carolina",
    "link": "https://www.nytimes.com/2025/07/24/us/politics/michael-whatley-north-carolina-senate.html",
    "summary": "His entry will pave the way for a marquee contest in 2026, with former Gov. Roy Cooper planning to seek the Democratic nomination."
  },
  {
    "title": "Tony Evers Declines to Run for 3rd Term as Wisconsin Governor",
    "link": "https://www.nytimes.com/2025/07/24/us/politics/tony-evers-wisconsin-governor.html",
    "summary": "The decision is likely to invite a wide-open race for the Democratic nomination in a battleground state the party hopes to control."
  },
  {
    "title": "Anne Burrell’s Cause of Death Ruled a Suicide",
    "link": "https://www.nytimes.com/2025/07/24/dining/anne-burrell-cause-of-death-suicide.html",
    "summary": "The Food Network star was found dead in her apartment on June 17."
  },
  {
    "title": "Appeals Court Blocks California’s Background Checks for Ammunition Buyers",
    "link": "https://www.nytimes.com/2025/07/24/us/california-ammunition-background-check-appeal.html",
    "summary": "The law violates the Second Amendment, a panel of the U.S. Court of Appeals for the Ninth Circuit ruled in a 2-1 decision."
  },
  {
    "title": "Europe Nears U.S. Trade Deal, but Stands Ready to Retaliate",
    "link": "https://www.nytimes.com/2025/07/24/business/europe-nears-us-trade-deal.html",
    "summary": "Nearly every member of the European Union supports a plan to hit back against President Trump’s tariffs if no agreement is reached."
  },
  {
    "title": "Elon Musk Sees ‘Rough’ Times Ahead for Tesla",
    "link": "https://www.nytimes.com/2025/07/24/business/dealbook/musk-tesla-rough-times.html",
    "summary": "Shares in Tesla were down in premarket trading as the carmaker lays out the risks from President Trump’s tariffs and his scrapping of tax credits."
  },
  {
    "title": "How to Host a Hamptons Gala for the Super-Rich",
    "link": "https://www.nytimes.com/2025/07/24/nyregion/parrish-museum-hamptons-gala.html",
    "summary": "Facing federal funding cuts, the Parrish Art Museum is among the institutions increasingly relying on elaborate parties to lure the nation’s elites to pitch in."
  },
  {
    "title": "What to Know About the Thailand-Cambodia Clash",
    "link": "https://www.nytimes.com/2025/07/24/world/asia/thailand-cambodia-border-fight.html",
    "summary": "The countries traded fire on Thursday, and Thailand said at least 12 people had been killed. Cambodia did not immediately comment on any casualties."
  },
  {
    "title": "Christian Cancel Culture Strikes Again",
    "link": "https://www.nytimes.com/2025/07/24/opinion/chip-joanna-gaines-evangelical-christianity.html",
    "summary": "Chip and Joanna Gaines had the temerity to feature a gay couple on their new show."
  },
  {
    "title": "What’s in a Name?",
    "link": "https://www.nytimes.com/2025/07/24/briefing/whats-in-a-name.html",
    "summary": "All politicians try to play the frame game. President Trump is a master at it."
  },
  {
    "title": "What Are the Viral Moments You Remember Most From the Last Decade?",
    "link": "https://www.nytimes.com/2025/07/24/style/viral-moments-callout.html",
    "summary": "Virality has changed over the years. Tell us about your experiences online in an earlier internet age."
  },
  {
    "title": "After Surge During Pandemic, Homicides Fall Significantly",
    "link": "https://www.nytimes.com/2025/07/24/us/murders-crime-us-covid-19.html",
    "summary": "An analysis released Thursday by the Council on Criminal Justice shows that the majority of crimes the council tracks are continuing to decrease in 42 U.S. cities."
  },
  {
    "title": "A Series of Mysterious Explosions Unnerves Syrians",
    "link": "https://www.nytimes.com/2025/07/24/world/middleeast/syria-explosions.html",
    "summary": "Many of the blasts, some of them deadly, have been at weapons storage sites, raising questions about whether ordnance from Syria’s civil war has been properly secured."
  },
  {
    "title": "Prosecutor Fired by Trump Officials Defiantly Says She Is Set to Take Job",
    "link": "https://www.nytimes.com/2025/07/23/nyregion/desiree-grace-new-jersey-us-attorney.html",
    "summary": "Desiree Grace, in a social media post, said she was prepared to follow a judicial order and take over as U.S. attorney in New Jersey “in accordance with the law.”"
  },
  {
    "title": "Children Burned by Plane Crash in Bangladesh Die Days Later",
    "link": "https://www.nytimes.com/2025/07/24/world/asia/bangladesh-plane-crash-school-children-deaths.html",
    "summary": "Many have died in the days since a plane crashed into a school in Bangladesh. For the survivors, there is a critical window for lifesaving treatment."
  }
]