[
  {
    "title": "Why Now? The Lost Chances to Reach a Hostage Deal, and a Cease-Fire, Months Ago",
    "link": "https://www.nytimes.com/2025/10/12/us/politics/lost-chances-hostage-deal-gaza-israel.html",
    "summary": "On Gaza, President Trump put few, if any, guardrails on Israel’s offensive, bucking international demands for a cease-fire. Then he changed course."
  },
  {
    "title": "Who Are the Hostages Released From Captivity in Gaza?",
    "link": "https://www.nytimes.com/2025/10/09/world/middleeast/israel-hostages-alive-gaza.html",
    "summary": "Israel says 20 living hostages have been freed as part of a prisoner exchange. Here’s what we know about them."
  },
  {
    "title": "What We Know About the Deal Between Israel and Hamas",
    "link": "https://www.nytimes.com/2025/10/09/world/middleeast/israel-hamas-deal-what-to-know.html",
    "summary": "Hostages in Gaza will be swapped for Palestinian prisoners in Israel. The last 20 living hostages were released on Monday morning."
  },
  {
    "title": "All Hostages Released From Gaza, and Stocks Drop After Trump’s New Threat",
    "link": "https://www.nytimes.com/2025/10/13/podcasts/the-headlines/hostages-gaza-trump-china.html",
    "summary": "Plus, what happened to beheaded Columbus statues."
  },
  {
    "title": "Coal Miners With Black Lung Say They Are ‘Cast Aside to Die’ Under Trump",
    "link": "https://www.nytimes.com/2025/10/13/climate/coal-miners-black-lung-protest-trump.html",
    "summary": "President Trump has been a cheerleader for coal miners. But these miners say his administration is failing to enforce limits on a lethal workplace hazard."
  },
  {
    "title": "Originalist ‘Bombshell’ Complicates Case on Trump’s Power to Fire Officials",
    "link": "https://www.nytimes.com/2025/10/13/us/politics/originalism-trump-supreme-court-unitary-executive.html",
    "summary": "As the Supreme Court seems poised to expand the president’s power, a leading scholar whose work the justices have often cited issued a provocative dissent."
  },
  {
    "title": "They Fought Outbreaks Worldwide. Now They’re Fighting for New Lives.",
    "link": "https://www.nytimes.com/2025/10/13/health/trump-layoffs-scientists-public-health.html",
    "summary": "Hundreds of infectious disease specialists have been let go by the Trump administration. Here are four who focused on keeping pandemics at bay."
  },
  {
    "title": "Asia Markets Fall After Trump Threatens New Tariffs on China",
    "link": "https://www.nytimes.com/2025/10/12/business/trump-china-tariffs-global-markets.html",
    "summary": "Stocks in the United States recovered from their worst decline in months, after President Trump softened his tariff threat on China. But markets in Asia dropped."
  },
  {
    "title": "Three Share Nobel in Economics for Work on How Technology Drives Growth",
    "link": "https://www.nytimes.com/2025/10/13/business/nobel-prize-economics.html",
    "summary": "Joel Mokyr, Philippe Aghion and Peter Howitt won the prize for showing how “society must keep an eye on the factors that generate and sustain economic growth,” an award committee member said."
  },
  {
    "title": "San Francisco Wants to Destroy a 96-Year-Old’s Defining Artwork",
    "link": "https://www.nytimes.com/2025/10/12/arts/design/vaillancourt-fountain-san-francisco.html",
    "summary": "The maligned sculpture — “weird,” “odd,” “bizarre” — is no longer a working fountain or a skateboarding mecca. But its supporters consider it an important city symbol."
  },
  {
    "title": "A Tennessee Sheriff Becomes the Face of Grief After Plant Explosion",
    "link": "https://www.nytimes.com/2025/10/12/us/tennessee-sheriff-plant-explosion-tears.html",
    "summary": "The blast that killed 16 people has left area residents reeling, including Sheriff Chris Davis of Humphreys County, who has fought back tears in his public briefings."
  },
  {
    "title": "To Inflict Pain on Russians, Ukraine’s Drones Zero In on Oil Refineries",
    "link": "https://www.nytimes.com/2025/10/13/world/europe/ukraine-drones-russia-oil-refineries.html",
    "summary": "With Russian forces gaining slowly on the battlefield, Ukraine hopes its long-range drone campaign will help persuade Vladimir V. Putin to change course."
  },
  {
    "title": "Why Ukraine Is Betting on Strikes Deep Inside Russia",
    "link": "https://www.nytimes.com/2025/10/13/world/europe/ukraine-long-range-strikes-russia.html",
    "summary": "The Kremlin will only negotiate if missiles and drones bring the pain of war home to Russians, Ukrainian officials say."
  },
  {
    "title": "Ukraine Visit Leaves Lasting Mark on Times Editor",
    "link": "https://www.nytimes.com/2025/10/09/insider/ukraine-russia-war-nyt-kyiv-bureau.html",
    "summary": "A visit to The New York Times’s Kyiv bureau stayed with an editor based in Manhattan. So too did the air alert app that is widely used to warn civilians of Russian military activity."
  },
  {
    "title": "How China Powers Its Electric Cars and High-Speed Trains",
    "link": "https://www.nytimes.com/2025/10/11/business/china-electric-grid.html",
    "summary": "China is building a network of ultrahigh-voltage power lines to carry solar and wind energy hundreds and even thousands of miles as few citizens dare to protest."
  },
  {
    "title": "Why China Built 162 Square Miles of Solar Panels on the World’s Highest Plateau",
    "link": "https://www.nytimes.com/2025/10/10/business/china-solar-tibetan-plateau.html",
    "summary": "China is using the high-altitude expanse for immense solar panel farms and wind turbines and has begun work on the world’s largest hydroelectric dams."
  },
  {
    "title": "Mamdani Seeks to Charm New York’s Most Powerful Capitalists",
    "link": "https://www.nytimes.com/2025/10/13/nyregion/mamdani-charm-business-leaders.html",
    "summary": "Key power brokers attacked Zohran Mamdani and raised millions for his leading opponent in the Democratic primary. Now many are talking to him behind the scenes."
  },
  {
    "title": "Attorney General Letitia James to Headline Rally for Mamdani",
    "link": "https://www.nytimes.com/2025/10/13/nyregion/letitia-james-rally-zohran-mamdani.html",
    "summary": "In her first public appearance since she was indicted on a federal charge of bank fraud, Ms. James is expected to rebuke President Trump and make a case for Mr. Mamdani."
  },
  {
    "title": "New York Braces for Potential Flooding and Heavy Winds From Nor’Easter",
    "link": "https://www.nytimes.com/2025/10/13/nyregion/noreaster-storm-forecast-damage.html",
    "summary": "The storm has been moving up the East Coast since the weekend, dumping heavy rain and flooding roads on its way toward New England."
  },
  {
    "title": "Dozens Rescued in Remote Alaskan Villages in Storm That Swept Away Homes",
    "link": "https://www.nytimes.com/2025/10/13/us/alaska-flooding-rescues.html",
    "summary": "The Coast Guard and the Alaska National Guard were conducting search-and-rescue operations in two villages along the Bering Sea on Sunday."
  },
  {
    "title": "How Las Vegas Sands Helped Get the N.B.A. Back Into China",
    "link": "https://www.nytimes.com/2025/10/11/world/asia/las-vegas-sands-nba-china-macau-casino-dumont-games.html",
    "summary": "Las Vegas Sands, owned by the Adelson family, was under pressure in Macau, with billions at stake. That created an opportunity."
  },
  {
    "title": "N.B.A. Head Criticizes Chinese Party Paper Over LeBron James ‘Op-Ed’",
    "link": "https://www.nytimes.com/2025/10/11/world/asia/china-nba-lebron.html",
    "summary": "The People’s Daily newspaper put the star player’s name on an opinion article, an example of the political perils the N.B.A. could face in China."
  },
  {
    "title": "When I Look at Zohran Mamdani, Here’s What I See",
    "link": "https://www.nytimes.com/2025/10/13/opinion/zohran-mamdani-muslim-america-new-york.html",
    "summary": "When I look at the mayor’s race in New York, here’s what I see."
  },
  {
    "title": "Law Schools Are Using Security Concerns to Silence Speech",
    "link": "https://www.nytimes.com/2025/10/13/opinion/law-schools-trump-free-speech.html",
    "summary": "A principle is hollow if it’s not defended under pressure."
  },
  {
    "title": "A Hostage and Prisoner Exchange",
    "link": "https://www.nytimes.com/2025/10/13/briefing/a-hostage-and-prisoner-exchange.html",
    "summary": "We’re covering the release of hostages in Gaza and of Palestinian prisoners. We’re also covering President Trump’s visit to Israel."
  },
  {
    "title": "Factory Towns Revive as Defense Tech Makers Arrive",
    "link": "https://www.nytimes.com/2025/10/13/technology/defense-tech-manufacturing-midwest-northeast.html",
    "summary": "Drawn by local talent, cheap labor and state cash incentives, start-ups building the weapons of the future are revitalizing manufacturing in once-vibrant industrial towns."
  },
  {
    "title": "Bolivia Pushes to Reclaim the Coca Leaf From the Stigma of Cocaine",
    "link": "https://www.nytimes.com/2025/10/12/world/americas/bolivia-coca-plant-leaf-cocaine.html",
    "summary": "Long criminalized as the raw material for cocaine, coca is woven into Bolivian life. The government is lobbying the U.N. to ease international restrictions."
  },
  {
    "title": "What Is Indigenous Peoples’ Day and How Is It Celebrated?",
    "link": "https://www.nytimes.com/article/indigenous-peoples-day.html",
    "summary": "Many cities and states are observing the day. President Trump has declared himself a supporter of Columbus Day."
  },
  {
    "title": "China Hosts a Summit on Women’s Rights, While Stifling Activism",
    "link": "https://www.nytimes.com/2025/10/13/world/asia/china-womens-rights-feminism.html",
    "summary": "The conference was billed as a celebration of China’s achievements in supporting women. But the government has mostly wiped out independent advocacy groups."
  }
]