[
  {
    "title": "Europe, Worried by Other Global Crises, Agrees to Trump’s Trade Deal",
    "link": "https://www.nytimes.com/2025/07/28/world/europe/europe-trade-deal-trump.html",
    "summary": "The framework agreement will likely not do much for economic growth on either side. But it avoids new fissures on other foreign policy issues, particularly the war in Ukraine."
  },
  {
    "title": "Is the EU Trade Deal With Trump Good for Europe?",
    "link": "https://www.nytimes.com/2025/07/28/world/europe/eu-trade-deal-trump-tariffs.html",
    "summary": "Both sides hailed the agreement as the biggest ever. But it will come at a cost to the European Union, and many details have yet to be nailed down."
  },
  {
    "title": "Outrage Grows Over Starvation in Gaza, and a Mysterious Pentagon Budget Line",
    "link": "https://www.nytimes.com/2025/07/28/podcasts/the-headlines/starvation-gaza-pentagon-budget.html",
    "summary": "Plus, a very D.I.Y. act of defiance."
  },
  {
    "title": "‘Revenge Is Not a Policy’: Israelis Voice Dissent Against the War in Gaza",
    "link": "https://www.nytimes.com/2025/07/28/world/middleeast/israel-dissent-war-gaza.html",
    "summary": "After a long silence, prominent Israelis and activists are increasingly raising alarms about potential war crimes being carried out by the government."
  },
  {
    "title": "News Organizations Urge Israel to Let Reporters and Aid Into Gaza",
    "link": "https://www.nytimes.com/2025/07/27/world/middleeast/gaza-starvation-reporters-israel.html",
    "summary": "Saying that journalists in the territory, like many Gazans, are facing starvation, the groups urged Israel to allow more food in."
  },
  {
    "title": "Thailand and Cambodia Agree to Halt Fighting That Has Killed Dozens",
    "link": "https://www.nytimes.com/2025/07/28/world/asia/thailand-cambodia-ceasefire-talks.html",
    "summary": "U.S.-backed talks to end the border war, in which militaries have killed dozens of people and displaced hundreds of thousands, began on Monday in Malaysia."
  },
  {
    "title": "A Maine Resort Town Feels the Pressure of Trump’s Immigration Crackdown",
    "link": "https://www.nytimes.com/2025/07/28/travel/maine-wells-ice-immigration-tourism.html",
    "summary": "Wells, like many U.S. tourist spots that rely on foreign labor, is fearful of immigration raids. The local police department’s agreement to collaborate with federal agents only adds to the anxiety."
  },
  {
    "title": "The Timeless Torches Are New York Liberty’s Dance Warriors. We Need Them.",
    "link": "https://www.nytimes.com/2025/07/28/arts/dance/timeless-torches-ny-liberty-dance-team.html",
    "summary": "The dance team of the New York Liberty, in its 20th year, makes space for dancers who are 40 and over. Their message? Dance! Live a full life."
  },
  {
    "title": "How Parenting Changed After Etan Patz",
    "link": "https://www.nytimes.com/2025/07/28/nyregion/parenting-etan-patz.html",
    "summary": "Did the shocking disappearance of a 6-year-old in 1979 forever alter how Americans raised children? Or were there other reasons for parents to be anxious?"
  },
  {
    "title": "Avian Flu Wiped Out Poultry. Now the Screwworm Is Coming for Beef.",
    "link": "https://www.nytimes.com/2025/07/28/us/politics/screwworm-beef-prices.html",
    "summary": "The parasitic fly that attacks warm-blooded animals was eliminated from the United States in the 1960s, but it’s creeping toward the Texas-Mexico border."
  },
  {
    "title": "Dry Taps, Empty Lakes, Shuttered Cities: A Water Crisis Batters Iran",
    "link": "https://www.nytimes.com/2025/07/26/world/middleeast/iran-water-crisis-drought.html",
    "summary": "After a five-year drought and decades of mismanagement, Tehran is at risk of running out of water in several weeks, the government warned."
  },
  {
    "title": "Florida’s New Attorney General, a DeSantis Appointee, Is Making Waves",
    "link": "https://www.nytimes.com/2025/07/28/us/floridas-new-attorney-general-a-desantis-appointee-is-making-waves.html",
    "summary": "James Uthmeier has followed an aggressive playbook similar to that of Gov. Ron DeSantis, for whom he used to work behind the scenes as chief of staff."
  },
  {
    "title": "Democrats Plan $20 Million Fund to Target Texas Republicans for Redistricting",
    "link": "https://www.nytimes.com/2025/07/28/us/politics/democrats-texas-redistricting.html",
    "summary": "At President Trump’s urging, Texas is trying to squeeze up to five Democrats out of office to pad Republicans’ slim majority in the House."
  },
  {
    "title": "Nevada Democrats Spot an Opportunity in a Vulnerable G.O.P. Governor",
    "link": "https://www.nytimes.com/2025/07/28/us/politics/nevada-governor-ford.html",
    "summary": "The state attorney general, Aaron Ford, is seen as Democrats’ best bet to oust Gov. Joe Lombardo. Mr. Lombardo doesn’t plan on going down easy."
  },
  {
    "title": "UnitedHealth Grew to Be a Leviathan. Then Came the Backlash.",
    "link": "https://www.nytimes.com/2025/07/28/health/unitedhealth-grew-to-be-a-leviathan-then-came-the-backlash.html",
    "summary": "The conglomerate was viewed as one of the most successful companies in America, but patients are enraged and investors have lost faith in its business model."
  },
  {
    "title": "U.S. Opens Antitrust Investigation Into NewYork-Presbyterian",
    "link": "https://www.nytimes.com/2025/07/28/nyregion/doj-ny-presbyterian-heatlh.html",
    "summary": "The Justice Department scrutiny of one of New York’s leading health systems could lead to more spirited competition among hospitals — and slow rising prices."
  },
  {
    "title": "Why ‘Mankeeping’ Is Turning Women Off",
    "link": "https://www.nytimes.com/2025/07/28/well/family/mankeeping-definition.html",
    "summary": "As male social circles shrink, female partners say they have to meet more social and emotional needs."
  },
  {
    "title": "Russia Counters Ukrainian Drones by Turning Off Russians’ Mobile Internet",
    "link": "https://www.nytimes.com/2025/07/28/world/europe/russia-internet-blackouts-drones.html",
    "summary": "The same data networks that enable phone apps and web surfing help drones navigate, so officials are imposing daily, patchwork shutdowns. The actions can be very disruptive to daily life."
  },
  {
    "title": "The Supreme Court Owes the Country Explanations for Its Big Decisions",
    "link": "https://www.nytimes.com/2025/07/28/opinion/supreme-court-emergency-rulings.html",
    "summary": "When the court fails to make rulings clear, confusion can set in, and the justices’ credibility can suffer."
  },
  {
    "title": "Sovereignty Is Having a Moment",
    "link": "https://www.nytimes.com/2025/07/28/briefing/sovereignty-is-having-a-moment.html",
    "summary": "We explain why leaders are talking so much about independence."
  },
  {
    "title": "Last Soldiers of an Imperial Army Have a Warning for Young Generations",
    "link": "https://www.nytimes.com/2025/07/28/world/asia/japan-veterans-world-war-ii.html",
    "summary": "As the 80th anniversary of the end of World War II approaches, only a few veterans of Japan’s brutal war remain. “Never die for Emperor or country,” one advised."
  },
  {
    "title": "The Country Where 76% of Cars Sold Are Electric",
    "link": "https://www.nytimes.com/2025/07/28/business/nepal-electric-vehicles-china.html",
    "summary": "Subsidies, hydroelectricity and a manufacturing powerhouse neighbor are moving the cars into Nepal faster than almost anywhere else."
  },
  {
    "title": "Suspect in Traverse City Walmart Stabbing Attack Faces Terrorism Charge",
    "link": "https://www.nytimes.com/2025/07/27/us/walmart-stabbing-traverse-city-charges.html",
    "summary": "The authorities on Sunday said that a motive for the attack, which left 11 people injured, remained unknown. Citizens, including one who was armed, helped to apprehend the suspect, officials said."
  },
  {
    "title": "C.D.C. Ties 85 Cases of THC-Related Symptoms to Wisconsin Restaurant",
    "link": "https://www.nytimes.com/2025/07/28/well/wisconsin-restaurant-thc-poisoning.html",
    "summary": "The restaurant mistakenly used oil infused with THC, a psychoactive ingredient found in many cannabis products, in food preparation last year, the C.D.C. said."
  }
]