[
  {
    "title": "Columbia Agrees to $200 Million Fine to Settle Fight With Trump",
    "link": "https://www.nytimes.com/2025/07/23/nyregion/columbia-trump-funding-deal.html",
    "summary": "The White House had canceled more than $400 million in research funding to the university, saying it had failed to protect Jewish students from harassment."
  },
  {
    "title": "Trump Plans to Give A.I. Developers a Free Hand",
    "link": "https://www.nytimes.com/2025/07/23/technology/trump-ai-executive-orders.html",
    "summary": "With executive orders and an “A.I. Action Plan” to promote American dominance of the technology, President Trump declared that the United States needed to win the A.I. race."
  },
  {
    "title": "The Chatbot Culture Wars Are Here",
    "link": "https://www.nytimes.com/2025/07/23/technology/trump-ai-chatbots-bias.html",
    "summary": "Conservatives, including President Trump, are accusing A.I. companies of left-wing bias, following a playbook that worked well against social media platforms."
  },
  {
    "title": "Judge Denies Request to Unseal Epstein Grand Jury Transcripts in Florida",
    "link": "https://www.nytimes.com/2025/07/23/us/politics/florida-epstein-transcripts-unsealed-denied.html",
    "summary": "The president and his subordinates, including Attorney General Pam Bondi, have come under enormous pressure to release further details about the disgraced financier Jeffrey Epstein."
  },
  {
    "title": "House Panel Votes to Subpoena Justice Dept. for Epstein Files",
    "link": "https://www.nytimes.com/2025/07/23/us/politics/house-subpoena-justice-dept-epstein-files.html",
    "summary": "Three Republicans joined with five Democrats to support the motion."
  },
  {
    "title": "Trump’s Attempts to Change the Topic From Epstein: A Timeline",
    "link": "https://www.nytimes.com/2025/07/23/us/politics/trump-epstein-distraction-timeline.html",
    "summary": "President Trump has tried to attack, deflect and deny his way past the Jeffrey Epstein saga. He’s had less success than usual."
  },
  {
    "title": "Supreme Court Lets Trump Fire Consumer Product Safety Regulators",
    "link": "https://www.nytimes.com/2025/07/23/us/politics/supreme-court-consumer-product-commission.html",
    "summary": "The court’s order was the latest in a series of emergency rulings on the scope of the president’s power over independent agencies."
  },
  {
    "title": "Rulings Order Abrego Garcia’s Release and Guard Against Hasty Deportation",
    "link": "https://www.nytimes.com/2025/07/23/us/politics/abrego-garcia-judge-orders.html",
    "summary": "The convergence of the two judicial rulings, which came within minutes of each other, meant that Kilmar Armando Abrego Garcia could soon be released and return to Maryland."
  },
  {
    "title": "U.S. Homes Are Not Selling, and Prices Continue to Rise",
    "link": "https://www.nytimes.com/2025/07/23/realestate/home-sales-drop-prices-rise.html",
    "summary": "June, usually the height of the spring housing season, saw sales of existing homes drop from the previous month, according to the National Association of Realtors."
  },
  {
    "title": "New Documents Shed Light on Bryan Kohberger and Idaho Student Murders",
    "link": "https://www.nytimes.com/2025/07/23/us/bryan-kohberger-idaho-student-murders-evidence.html",
    "summary": "Police reports released by the authorities in Moscow, Idaho, detail what investigators found at the scene where four University of Idaho students were fatally stabbed."
  },
  {
    "title": "Bryan Kohberger Sentenced to Life in Prison for Idaho Student Murders: 6 Takeaways",
    "link": "https://www.nytimes.com/2025/07/23/us/bryan-kohberger-sentencing-takeaways.html",
    "summary": "Victims’ relatives wept and berated the killer, Bryan Kohberger, before he was sent to prison, though a few offered forgiveness. Investigators dispelled popular rumors about the case."
  },
  {
    "title": "Ozzy Osbourne’s Death Draws Mourners, Including Drake, to the ‘Home of Heavy Metal’",
    "link": "https://www.nytimes.com/2025/07/23/arts/music/ozzy-osbourne-birmingham.html",
    "summary": "In Birmingham, England, the singer’s hometown, fans paid tribute by leaving flowers, beer and tequila. The rapper Drake was there to pay his respects, too."
  },
  {
    "title": "Investment Fund Seals Trade Deal for Japan and Expands Trump’s Influence",
    "link": "https://www.nytimes.com/2025/07/23/business/economy/japan-fund-trump-tariffs-trade.html",
    "summary": "President Trump will get to decide where to invest Japanese money and the United States will keep 90 percent of the profits, the White House said."
  },
  {
    "title": "Trump’s Tariffs Are the Highest in a Century. But After His Threats, They Seem Like a Relief.",
    "link": "https://www.nytimes.com/2025/07/23/business/economy/trump-tariffs-japan.html",
    "summary": "The president imposed tariffs on Japan, one of America’s closest allies, that would have been alarming just months ago. And markets went up."
  },
  {
    "title": "After Carney Meeting, Canada’s Premiers Agree on Trump and Tariffs, Differ on Next Steps",
    "link": "https://www.nytimes.com/2025/07/23/world/canada/canada-premiers-trade-trump-tariffs-carney.html",
    "summary": "A three-day meeting in response to President Trump’s looming tariff threat underscored differences between the leaders of Canada’s provinces and territories."
  },
  {
    "title": "Free Shakespeare’s Central Park Home Gets an $85 Million Glow Up",
    "link": "https://www.nytimes.com/2025/07/23/arts/design/delacorte-central-park-shakespeare.html",
    "summary": "The rickety, beloved Delacorte Theater, built in 1962, leaked and was popular with raccoons. Now it’s a modern facility and still charmingly wild."
  },
  {
    "title": "At Texas Flooding Hearing, State Officials Look Elsewhere for Blame",
    "link": "https://www.nytimes.com/2025/07/23/us/politics/texas-floods-hearing-emergency-management.html",
    "summary": "At several points during the hearing, the state emergency management chief directed attention to the role of local emergency managers in disaster response."
  },
  {
    "title": "Prosecutor Fired by Trump Officials Says She Is Set to Take Over Office",
    "link": "https://www.nytimes.com/2025/07/23/nyregion/desiree-grace-new-jersey-us-attorney.html",
    "summary": "Desiree Grace, in a social media post, said she was prepared to follow a judicial order and take over as U.S. attorney in New Jersey “in accordance with the law.”"
  },
  {
    "title": "MLK Files Release Renews Debate Over His Legacy",
    "link": "https://www.nytimes.com/2025/07/23/us/martin-luther-king-mlk-legacy-politics-national-archives.html",
    "summary": "The release of National Archives documents is the latest attempt to define what the Civil Rights icon believed, and what that means now for the country."
  },
  {
    "title": "Microforests in Elizabeth, N.J., Help Clear the Air",
    "link": "https://www.nytimes.com/2025/07/22/climate/new-jersey-tiny-forests.html",
    "summary": "A nonprofit planted five “microforests” to tackle environmental problems in Elizabeth, N.J. Scientists say they’re making a big difference."
  },
  {
    "title": "‘The Claw Grip’: Why Are Women Always Holding Things?",
    "link": "https://www.nytimes.com/2025/07/23/style/claw-grip-women-holding-things.html",
    "summary": "Known as “the claw grip” online, women are making videos about how many objects they can hold without a purse or functional pockets. What is the larger message?"
  },
  {
    "title": "Nine Questions About the Epstein Case That Actually Need Answers",
    "link": "https://www.nytimes.com/2025/07/23/opinion/epstein-files-fbi-trump.html",
    "summary": "You needn’t be a conspiracy theorist to have questions."
  },
  {
    "title": "I Hate, Therefore I Am",
    "link": "https://www.nytimes.com/2025/07/23/opinion/i-hate-therefore-i-am.html",
    "summary": "We are constituting ourselves by whom and what we hate. But do we have to?"
  },
  {
    "title": "Trump Was Told His Name Was in the Epstein Files",
    "link": "https://www.nytimes.com/2025/07/23/briefing/trump-name-eptein-protests-ukraine-ozzy-osbourne.html",
    "summary": "Also, the U.S. drafted a plan to end its global H.I.V. campaign. Here’s the latest at the end of Wednesday."
  },
  {
    "title": "Have You Tried Alternative Health Treatments?",
    "link": "https://www.nytimes.com/2025/07/22/well/health-information.html",
    "summary": "If you or a loved one has tried treatments like supplements, detox diets or off-label uses of prescription medications, we want to hear about it."
  },
  {
    "title": "New York Republicans Unite in Attacking Mamdani",
    "link": "https://www.nytimes.com/2025/07/23/nyregion/mamdani-republicans-attack.html",
    "summary": "Zohran Mamdani, the Democratic nominee for mayor of New York City, faced a barrage of attacks from Republicans over the course of a few hours."
  },
  {
    "title": "Roy Cooper to Enter North Carolina Senate Race, Lifting Democrats",
    "link": "https://www.nytimes.com/2025/07/23/us/politics/roy-cooper-senate-north-carolina.html",
    "summary": "The campaign for the open seat will be one of the biggest of 2026, after the incumbent Republican, Senator Thom Tillis, announced his retirement."
  },
  {
    "title": "Meta Unveils Wristband For Controlling Computers With Hand Gestures",
    "link": "https://www.nytimes.com/2025/07/23/science/meta-computer-wristband-reardon.html",
    "summary": "When you write your name in the air, you can see the letters appear on your smartphone."
  },
  {
    "title": "A Pill for Sleep Apnea Could Be on the Horizon",
    "link": "https://www.nytimes.com/2025/07/23/well/apnimed-sleep-apnea-clinical-trial-ad109.html",
    "summary": "Experts say that if the new drug gets approved, it may lead to a big shift in how we treat the condition."
  }
]