[
  {
    "title": "Trump Takes America’s ‘Imperial Presidency’ to a New Level",
    "link": "https://www.nytimes.com/2025/12/21/us/politics/trump-imperial-presidency.html",
    "summary": "In his first year back in the White House, President Trump has greatly expanded executive power while embracing the trappings of royalty in ways not seen in the modern era."
  },
  {
    "title": "U.S. Coast Guard Boards Tanker Carrying Venezuelan Oil",
    "link": "https://www.nytimes.com/2025/12/20/us/politics/us-coast-guard-venezuela-oil-tanker.html",
    "summary": "Kristi Noem, the homeland security secretary, said a vessel had been “apprehended.” It was the second action this month against a tanker carrying Venezuelan oil."
  },
  {
    "title": "Immigration Crackdown Creates Fault Lines Among Baptists",
    "link": "https://www.nytimes.com/2025/12/21/us/southern-baptists-immigration-trump.html",
    "summary": "An increasingly loud contingent supports the Trump administration’s efforts to deport illegal immigrants."
  },
  {
    "title": "Bill Clinton Photos in Epstein Files Show He Can’t Escape Scandal",
    "link": "https://www.nytimes.com/2025/12/20/us/politics/bill-clinton-epstein-files-photos-scandal.html",
    "summary": "The Republican-led Justice Department’s release of photos of the former president with Jeffrey Epstein will introduce yet another generation to his flaws and controversies."
  },
  {
    "title": "How the Supreme Court’s Mail-In Ballot Ruling Could Affect Voters",
    "link": "https://www.nytimes.com/2025/12/21/us/politics/supreme-court-mail-in-ballots-election-day.html",
    "summary": "Hundreds of thousands of Americans in rural and urban areas alike could see their votes rejected if the court decides that ballots must arrive by Election Day."
  },
  {
    "title": "Turning Point’s Annual Gathering Turns Into a Gripefest",
    "link": "https://www.nytimes.com/2025/12/20/us/politics/turning-points-americafest-ben-shapiro.html",
    "summary": "At AmericaFest, conservative leaders insulted one another, revealing serious rifts over conspiracy theories, antisemitism and who belongs in America."
  },
  {
    "title": "Mamdani Inauguration to Usher in ‘New Era’ With Broadway Block Party",
    "link": "https://www.nytimes.com/2025/12/21/nyregion/nyc-zohran-mamdani-inauguration-block-party.html",
    "summary": "Zohran Mamdani will be sworn in as New York City’s new mayor on Jan. 1, alongside a party spanning seven blocks that will accommodate 40,000 spectators, his transition team said."
  },
  {
    "title": "Move Aside, Snowflake: ‘Theater Kid’ Is the New Go-To Political Insult",
    "link": "https://www.nytimes.com/2025/12/21/us/politics/theater-kid-insult-politics.html",
    "summary": "Zohran Mamdani, New York’s mayor-elect, is among the latest politicians to be tagged with the term, raising the question: What did theater kids do to deserve such scorn?"
  },
  {
    "title": "When Something Goes Wrong With Your Flight, These People Take Charge",
    "link": "https://www.nytimes.com/2025/12/21/business/american-airlines-operations-hub.html",
    "summary": "Inside a tornado-hardened office in Texas, 1,700 American Airlines employees manage the carrier’s operations, responding to bad weather, plane trouble and ailing passengers."
  },
  {
    "title": "How Much More Can the U.S. Travel Industry Take?",
    "link": "https://www.nytimes.com/2025/12/19/travel/us-travel-tourism-visas.html",
    "summary": "Politics and border hassles have chased away foreign visitors, costing businesses billions. Some fear next year’s World Cup won’t be enough to bring tourists back."
  },
  {
    "title": "‘It’s Just Us’: The Firefighter, His Son and a Treacherous Choice",
    "link": "https://www.nytimes.com/2025/12/21/us/wildfires-firefighters-immigration.html",
    "summary": "For two decades, Luis Martinez has fought wildfires for the U.S. government. Now he’s facing down cancer, debt and the threat of separation from his 11-year-old."
  },
  {
    "title": "The Trump Vibe Shift Is Dead",
    "link": "https://www.nytimes.com/2025/12/21/opinion/trump-economy-vibe-shift.html",
    "summary": "What will come in its wake?"
  },
  {
    "title": "600 Readers Told Us About the Best Gifts They Ever Got. These Are the Top 13.",
    "link": "https://www.nytimes.com/2025/12/15/opinion/contributors/holiday-gifts-presents-free.html",
    "summary": "We asked readers to tell us about the most memorable presents they’ve received."
  },
  {
    "title": "Steakhouse Woes",
    "link": "https://www.nytimes.com/2025/12/21/briefing/steakhouse-woes.html",
    "summary": "We examine how rising beef prices have stressed restaurant owners this holiday season."
  },
  {
    "title": "Older Americans Quit Weight-Loss Drugs in Droves",
    "link": "https://www.nytimes.com/2025/12/21/health/older-people-glp1-weight.html",
    "summary": "In some studies, half of patients stopped taking GLP-1s within a year despite the benefits, citing the expense and side effects."
  },
  {
    "title": "Freed From a Belarus Prison, a Nobel Peace Laureate Experiences ‘Oxygen Intoxication’",
    "link": "https://www.nytimes.com/2025/12/21/world/europe/belarus-sanctions-potash-ales-bialiatski.html",
    "summary": "Ales Bialiatski, who shared the Nobel in 2022, described long hours of backbreaking work and stints in solitary confinement."
  },
  {
    "title": "A ‘Timeout Box’ in an Elementary School Draws Outrage: ‘This is Not OK’",
    "link": "https://www.nytimes.com/2025/12/20/nyregion/school-timeout-box-discipline-new-york.html",
    "summary": "An upstate New York district, where most students are Native American, placed its superintendent on leave after images of a wooden box in a classroom spread on social media."
  }
]