[
  {
    "title": "With Ukraine in the Balance, Trump and Putin Head Into Summit With Mismatched Goals",
    "link": "https://www.nytimes.com/2025/08/10/world/europe/ukraine-trump-putin-summit.html",
    "summary": "For President Vladimir V. Putin of Russia, it is an opportunity not just to end the Ukraine war on his terms but to split apart the Western security alliance."
  },
  {
    "title": "A Sidelined Europe Seeks a Voice as Trump and Putin Prepare to Meet",
    "link": "https://www.nytimes.com/2025/08/09/world/europe/europe-ukraine-russia-us.html",
    "summary": "Ukraine and its allies are concerned that President Trump and President Vladimir V. Putin of Russia will do a deal without them and then try to impose it on Kyiv."
  },
  {
    "title": "How a Top Mexican Cartel Smuggles Fentanyl to the U.S.",
    "link": "https://www.nytimes.com/2025/08/09/world/americas/fentanyl-us-mexico-route-cartel-smuggling.html",
    "summary": "New York Times reporters documented how fentanyl was concealed by Mexico’s most powerful criminal syndicate, which is adapting in the face of a crackdown by two governments."
  },
  {
    "title": "These Are Drug Cartels Designated as Terrorists by the U.S.",
    "link": "https://www.nytimes.com/2025/08/09/world/americas/drug-cartels-us-terrorist-designation.html",
    "summary": "President Trump has signed an order telling the Pentagon to begin using military force against certain criminal gangs that the United States has named terror organizations."
  },
  {
    "title": "How Starmer, Macron and Merz Tried To Halt the War in Gaza",
    "link": "https://www.nytimes.com/2025/08/10/world/europe/gaza-europe-peace-plan-trump-netanyahu.html",
    "summary": "Images of starving children and Israel’s planned expansion of settlements spurred Britain, France and Germany to a tougher stance. Prime Minister Benjamin Netanyahu was undeterred."
  },
  {
    "title": "Netanyahu Says Israel Wants ‘Arab Forces’ to Run Gaza. What Does That Mean?",
    "link": "https://www.nytimes.com/2025/08/09/world/middleeast/israel-gaza-arab-forces-postwar.html",
    "summary": "The Israeli cabinet agreed to Prime Minister Benjamin Netanyahu’s military plan, but the quandary of who will eventually govern Gaza remains intractable."
  },
  {
    "title": "Ousted F.D.A. Vaccine Chief Returns to Agency",
    "link": "https://www.nytimes.com/2025/08/09/us/politics/fda-vaccine-chief-returns.html",
    "summary": "Dr. Vinay Prasad’s rehiring was an unusual instance of a federal official targeted by the right-wing activist Laura Loomer being brought back into the Trump administration."
  },
  {
    "title": "Flattery, Lobbyists and a Business Deal: Crypto’s Richest Man Campaigns for a Pardon",
    "link": "https://www.nytimes.com/2025/08/09/us/politics/changpeng-zhao-pardon-trump.html",
    "summary": "A sophisticated operation is pushing President Trump to forgive Changpeng Zhao, which would boost the chances for his company, Binance, to break into the U.S. market."
  },
  {
    "title": "This Blood Drive Might Be a Way into Hollywood’s Exclusive Magic Castle",
    "link": "https://www.nytimes.com/2025/08/09/style/magic-castle-la-blood-drive.html",
    "summary": "The Hollywood landmark has hosted blood drives since 2014. Donors do a good deed, but the perk is entry into the private club."
  },
  {
    "title": "Xi Looks to Tighten Grip After Scandals Shake China’s Military Elite",
    "link": "https://www.nytimes.com/2025/08/10/world/asia/china-military-corruption.html",
    "summary": "The Chinese leader’s crackdown on military corruption reveals how deep his concerns run, not only about battlefield readiness, but about political survival, as well."
  },
  {
    "title": "Gunman in Deadly C.D.C. Shooting Fixated on Covid Vaccine, Officials Say",
    "link": "https://www.nytimes.com/2025/08/09/us/gunman-cdc-shooting-vaccines.html",
    "summary": "The shooting in Atlanta, which killed a police officer, followed the spread of false information around Covid vaccines and animosity directed at the agency, public health workers say."
  },
  {
    "title": "C.D.C. Workers Say Shooting Manifests Worst Fears About Anger Among Public",
    "link": "https://www.nytimes.com/2025/08/09/us/politics/cdc-shooting-staff.html",
    "summary": "Employees expressed horror at a shooting at the agency’s headquarters, and some said they viewed it as part of a pattern of threats and assaults on health workers."
  },
  {
    "title": "How Older People Are Reaping Brain Benefits From New Tech",
    "link": "https://www.nytimes.com/2025/08/09/health/technology-cognition-older-people.html",
    "summary": "Overuse of digital gadgets harms teenagers, research suggests. But ubiquitous technology may be helping older Americans stay sharp."
  },
  {
    "title": "Alexa Got an A.I. Brain Transplant. How Smart Is It Now?",
    "link": "https://www.nytimes.com/2025/08/09/business/alexa-artificial-intelligence-amazon.html",
    "summary": "It took Amazon several years to overcome technical hurdles as it remade its voice assistant with new artificial intelligence technology."
  },
  {
    "title": "Bears Are Terrorizing Romania. It’s Humans’ Fault.",
    "link": "https://www.nytimes.com/2025/08/08/realestate/bears-romania.html",
    "summary": "Romania’s growing bear population has turned conservation into confrontation for people living in the shadows of the Carpathian Mountains."
  },
  {
    "title": "Cuomo Opens Line of Attack Over Mamdani’s Rent-Stabilized Apartment",
    "link": "https://www.nytimes.com/2025/08/09/nyregion/cuomo-mamdani-apartment-rent-control.html",
    "summary": "The former governor’s post, written on X on Friday, reflected how he has adopted a stance of more aggressive, personal jabs."
  },
  {
    "title": "The Secret to One Swing State Democrat’s Rise? Wonky TikTok Videos.",
    "link": "https://www.nytimes.com/2025/08/09/us/north-carolina-attorney-general-jeff-jackson.html",
    "summary": "Jeff Jackson was elected to attorney general in North Carolina the same year that President Trump won the state for the third time. Supporters see lessons for Democrats in Mr. Jackson’s rise."
  },
  {
    "title": "Union Leaders Get Tough With Democrats as Members Drift Toward Trump",
    "link": "https://www.nytimes.com/2025/08/09/us/politics/democrats-labor-unions-nevada.html",
    "summary": "Doubtful that President Trump has their best interests in mind, top union officials are redoubling efforts to push the Democratic Party to appeal more to their rank and file."
  },
  {
    "title": "Welcome to Trump’s Stagflation Economy",
    "link": "https://www.nytimes.com/2025/08/10/opinion/stagflation-trump-economy.html",
    "summary": "The president’s policies are fueling the dreaded combination of slowing growth and rising inflation."
  },
  {
    "title": "ICE Deported Him. His Father Heard Nothing for Months. Then, a Call.",
    "link": "https://www.nytimes.com/2025/08/09/nyregion/ice-deportation-el-salvador-venezuela.html",
    "summary": "Merwil Gutièrrez is one of many immigrants across the United States who have been taken into custody by federal authorities, their whereabouts unknown or unclear."
  },
  {
    "title": "An Unusual Soccer Finale in Italy Reveals Libya’s Frailties",
    "link": "https://www.nytimes.com/2025/08/09/sports/an-unusual-soccer-finale-in-italy-reveals-libyas-frailties.html",
    "summary": "With two governments, and two soccer leagues, Libya is holding its soccer championship in Italy for a second year. Volatile politics and fans follow."
  },
  {
    "title": "Book Blacklist in Kashmir Aims to Muzzle Criticism of India",
    "link": "https://www.nytimes.com/2025/08/10/world/asia/book-ban-india-kashmir.html",
    "summary": "The federally appointed government in the contested region has declared 25 books off limits, part of what many see as a pattern of repression."
  },
  {
    "title": "How the U.S. and Mexico Are Fighting Deadly Flesh-Eating Screwworms",
    "link": "https://www.nytimes.com/2025/08/09/us/screwworm-cattle-gene-editing.html",
    "summary": "The American and Mexican governments are exploring “all options” to battle a deadly parasite threatening cattle and wildlife."
  }
]