[
  {
    "title": "Federal Judges, Warning of ‘Judicial Crisis,’ Fault Supreme Court’s Emergency Orders",
    "link": "https://www.nytimes.com/2025/10/11/us/politics/judicial-crisis-supreme-court-trump.html",
    "summary": "Dozens of sitting judges shared with The Times their concerns about risks to the courts’ legitimacy as the Supreme Court releases opaque orders about Trump administration policies."
  },
  {
    "title": "Some Americans Are Starting to Feel the Impact of the Government Shutdown",
    "link": "https://www.nytimes.com/2025/10/11/us/politics/government-shutdown-effects.html",
    "summary": "The Trump administration said over 4,000 workers would be laid off. Farmers trying to plan next year’s crops don’t have all the tools they need. Some medical services have been curtailed in Native communities."
  },
  {
    "title": "Trump Says He Will Pay Troops Despite Government Shutdown",
    "link": "https://www.nytimes.com/2025/10/11/us/politics/trump-troops-pay-shutdown.html",
    "summary": "The president said he had identified funds even though Congress has not appropriated new money for the military."
  },
  {
    "title": "Trump’s Shutdown Layoffs Deepen Impasse, Angering Democrats",
    "link": "https://www.nytimes.com/2025/10/11/us/politics/trump-government-shutdown-layoffs-democrats.html",
    "summary": "The president’s move to fire federal workers and his threats to make others go without pay were aimed at pressuring Democrats to cut a deal to reopen the government. The tactics have fueled Democrats’ resolve."
  },
  {
    "title": "Israelis Rally for Hostages in Gaza, Hoping It Will Be the Last Time",
    "link": "https://www.nytimes.com/2025/10/11/world/middleeast/israel-hostages-square-rally.html",
    "summary": "At a Tel Aviv rally, Israelis thanked President Trump for the cease-fire that paved the way for release of the remaining hostages. They were less enthused about their own country’s leader."
  },
  {
    "title": "Thousands Return to Northern Gaza, Hopeful, but Faced With Devastation",
    "link": "https://www.nytimes.com/2025/10/11/world/middleeast/return-gaza-city-ceasefire.html",
    "summary": "With the cease-fire holding overnight, many Palestinians continued to travel toward Gaza City on Saturday to learn what remained of their lives and homes."
  },
  {
    "title": "A Memo in a Bunker, Intercepted Communications and Hamas’s Oct. 7 Plans",
    "link": "https://www.nytimes.com/2025/10/11/world/middleeast/israel-hamas-plans.html",
    "summary": "A directive, which Israeli officials believe was written by Yahya Sinwar, the powerful leader of Hamas in Gaza, and recordings called for fighters to target soldiers and civilian communities — and to broadcast the violent acts."
  },
  {
    "title": "Diane Keaton, a Star of ‘Annie Hall’ and ‘First Wives Club,’ Dies at 79",
    "link": "https://www.nytimes.com/2025/10/11/movies/diane-keaton-dead.html",
    "summary": "She brought an unconventional personality to scores of roles on television and in movies ranging from zany comedies like “Sleeper” to piercing dramas like “The Godfather.”"
  },
  {
    "title": "Hollywood and Fans Remember Diane Keaton",
    "link": "https://www.nytimes.com/2025/10/11/arts/diane-keaton-death-reactions-tributes.html",
    "summary": "Tributes from colleagues and fans flooded social media as they learned of her death. Many celebrated her onscreen legacy and some noted her impact on their lives."
  },
  {
    "title": "Five Great Diane Keaton Performances to Stream",
    "link": "https://www.nytimes.com/2025/10/11/movies/diane-keaton-movies-streaming.html",
    "summary": "The actress, who died on Saturday at 79, was known for both her dramatic heft and her comedic gifts. Here are some of the highlights."
  },
  {
    "title": "Katie Porter Videos Give California Rivals a New Opening",
    "link": "https://www.nytimes.com/2025/10/11/us/katie-porter-videos-california-governor.html",
    "summary": "Viral videos showing caustic behavior have blunted her momentum in the California governor’s race. Other campaigns are scrambling to take advantage."
  },
  {
    "title": "In L.A., a Former Ally of Mayor Bass Is Expected to Run Against Her",
    "link": "https://www.nytimes.com/2025/10/11/us/mayor-bass-austin-beutner.html",
    "summary": "The former supporter, Austin Beutner, who once led the city’s public schools as superintendent, is expected to challenge Ms. Bass’s re-election bid in next year’s mayoral race."
  },
  {
    "title": "Search After Tennessee Explosion Finds No Survivors, Officials Say",
    "link": "https://www.nytimes.com/2025/10/11/us/tennessee-munitions-plant-explosion-deaths.html",
    "summary": "Local authorities have shifted to looking for remains after the blast at the ammunition plant. On Saturday, they said 16 people were still missing."
  },
  {
    "title": "Close-Knit Rural Communities Reel After Tennessee Plant Explosion",
    "link": "https://www.nytimes.com/2025/10/11/us/tennessee-plant-explosion-hickman-humphreys-counties.html",
    "summary": "The plant owned by Accurate Energetic Systems has long been an economic bedrock in rural Hickman and Humphreys Counties. Now it’s a source of widespread grief."
  },
  {
    "title": "How Churners Earn Money By Regularly Signing Up for Credit Cards",
    "link": "https://www.nytimes.com/2025/10/11/business/credit-cards-churners.html",
    "summary": "A growing number of Americans are making thousands by exploiting credit card reward offers."
  },
  {
    "title": "This Is Un-American",
    "link": "https://www.nytimes.com/video/opinion/100000010453263/this-is-un-american.html",
    "summary": "A lot has happened this week. The New York Times Opinion editor Kathleen Kingsbury highlights one thing you shouldn’t miss: After President Trump tried to send the National Guard into Portland, Ore., a federal judge blocked him. Watch Kingsbury explain why the president’s actions defy the fundamental principles of the U.S. Constitution."
  },
  {
    "title": "Peace in Trump’s Time — Except Here",
    "link": "https://www.nytimes.com/2025/10/11/opinion/trump-nobel-peace-prize.html",
    "summary": "Peace abroad and war at home — not very America first!"
  },
  {
    "title": "At Least 8 Dead and Others Wounded in Multiple Mississippi Shootings",
    "link": "https://www.nytimes.com/2025/10/11/us/leland-mississippi-mass-shooting.html",
    "summary": "Three separate shootings occurred at local gatherings involving homecomings and high school football, though it remained unclear what led to the violence."
  },
  {
    "title": "At Least 3 Are Injured on the Ground After Helicopter Crashes in California",
    "link": "https://www.nytimes.com/2025/10/11/us/helicopter-crash-huntington-beach-california.html",
    "summary": "Two people were pulled from the wreckage, the police said. It was not clear what led up to the crash or the severity of the victims’ injuries."
  },
  {
    "title": "Jesse L. Douglas, Aide to King in Marches From Selma, Is Dead at 90",
    "link": "https://www.nytimes.com/2025/10/11/us/jesse-l-douglas-dead.html",
    "summary": "A lieutenant to Martin Luther King Jr. and a fellow preacher, he played a vital role in organizing voting-rights protests in 1965 that began with “Bloody Sunday.”"
  }
]