[
  {
    "title": "U.S. Deploys Aircraft Carrier to Latin America as Drug Operation Expands",
    "link": "https://www.nytimes.com/2025/10/24/us/politics/caribbean-sea-boat-strike-us-venezuela.html",
    "summary": "The Trump administration has acknowledged 10 strikes on suspected drug-smuggling boats from South America, which have killed 43 people."
  },
  {
    "title": "Republicans Who Have Rarely Opposed Trump Raise Questions About His Drug War",
    "link": "https://www.nytimes.com/2025/10/24/us/politics/republicans-trump-drug-war.html",
    "summary": "The president said he wouldn’t seek congressional approval for his expanding military offensive against cartels, but some in his party believe Congress should weigh in."
  },
  {
    "title": "U.S. Sanctions Colombia’s Leader, One of President Trump’s Harshest Critics",
    "link": "https://www.nytimes.com/2025/10/24/world/americas/us-sanctions-colombia-president-petro-drugs.html",
    "summary": "The United States Treasury Department accused President Gustavo Petro of allowing drug trafficking to flourish."
  },
  {
    "title": "Justice Department Will Monitor Elections in California and New Jersey",
    "link": "https://www.nytimes.com/2025/10/24/us/politics/doj-election-monitors-california-new-jersey.html",
    "summary": "The Trump administration said that monitors will watch polling in two states, led by Democrats, where key races or issues are on the ballot."
  },
  {
    "title": "Bannon Claims ‘There Is a Plan’ For Trump to Run for a Third Term",
    "link": "https://www.nytimes.com/2025/10/24/us/politics/president-trump-2028-steve-bannon.html",
    "summary": "The claim comes after months of President Trump toying with the idea, insisting that he is “not joking” about defying a constitutionally-mandated term limit."
  },
  {
    "title": "Amid the Rubble of the East Wing, Lessons in How Trump Exercises Power",
    "link": "https://www.nytimes.com/2025/10/24/us/politics/east-wing-trump-power.html",
    "summary": "From the first day of his second term, President Trump has taken an ends-justify-the-means approach to his presidency."
  },
  {
    "title": "The White House’s Movie Theater Is Among the East Wing Rubble",
    "link": "https://www.nytimes.com/2025/10/24/movies/white-house-movie-theater.html",
    "summary": "Nixon watched “Patton” there. Obama hosted the “Lincoln” cast. Built in 1942, the White House’s private movie theater offered refuge and entertainment."
  },
  {
    "title": "U.S. Details How Mob and Ex-NBA Players Lured High Rollers Into Poker Trap",
    "link": "https://www.nytimes.com/2025/10/24/nyregion/nba-mafia-rigged-poker-games.html",
    "summary": "A Manhattan apartment was at the center of a Mafia-run ring that used former N.B.A. players as bait and technology to read cards, prosecutors say."
  },
  {
    "title": "Erykah Badu Says Making Music Is a Sport. It’s Game Time.",
    "link": "https://www.nytimes.com/2025/10/23/arts/music/erykah-badu-interview-popcast.html",
    "summary": "The singer and songwriter on her reign as one of music’s most idiosyncratic and spiritual figures and where her creative impulses are headed next."
  },
  {
    "title": "Trump’s Son Is Poised to Profit From Pentagon Drone Proposal",
    "link": "https://www.nytimes.com/2025/10/24/us/politics/trump-drones-pentagon.html",
    "summary": "A small company that has been manufacturing motors domestically for only a few weeks and has Donald Trump Jr. as an adviser won a parts order from the Army."
  },
  {
    "title": "After Teen Suicide, Character.AI Lawsuit Raises Questions Over Free Speech Protections",
    "link": "https://www.nytimes.com/2025/10/24/magazine/character-ai-chatbot-lawsuit-teen-suicide-free-speech.html",
    "summary": "A mother in Florida filed a lawsuit against an A.I. start-up, alleging its product led to her son’s death. The company’s defense raises a thorny legal question."
  },
  {
    "title": "Trump and Canada’s Trade Spat Spotlights Doug Ford, the Ontario Premier",
    "link": "https://www.nytimes.com/2025/10/24/world/canada/doug-ford-trump-reagan-ad.html",
    "summary": "Doug Ford has built a reputation for picking fights with President Trump and getting under his skin with publicity-grabbing moves as U.S. tariffs have harmed Ontario’s economy."
  },
  {
    "title": "Trump Decries Anti-Tariff Ad From Ontario, Canada, That Faithfully Quotes Reagan Speech",
    "link": "https://www.nytimes.com/2025/10/24/us/politics/trump-tariffs-canada-reagan-tv-ad-video.html",
    "summary": "The anti-tariff ad, which President Trump pointed to in cutting off trade talks with Canada, uses several sound bites from an April 1987 speech, though not in the order President Ronald Reagan said them."
  },
  {
    "title": "Mamdani Says Rivals Are Pushing Hate as Mayor’s Race Enters Last Stretch",
    "link": "https://www.nytimes.com/2025/10/24/nyregion/mamdani-cuomo-muslim-mayor.html",
    "summary": "Zohran Mamdani’s opponents, Andrew Cuomo and Curtis Sliwa, denied accusations that they are stoking Islamophobia with their rhetoric and actions."
  },
  {
    "title": "Adams Eyes a Reality TV Star Who Could Help Block a Mamdani Rent Freeze",
    "link": "https://www.nytimes.com/2025/10/24/nyregion/eleonora-srugo-eric-adams-rent-board.html",
    "summary": "Mayor Eric Adams has only weeks left in office, but he can use them to appoint people with the ability to shape policy beyond his tenure."
  },
  {
    "title": "Sirikit, Glamorous Former Queen of Thailand Who Wielded Power, Dies at 93",
    "link": "https://www.nytimes.com/2025/10/24/world/asia/queen-sirikit-thailand-dead.html",
    "summary": "As the wife of King Bhumibol Adulyadej, she supported local causes and traveled the world, charming government leaders and the public."
  },
  {
    "title": "How Can Democrats Win Back the Working Class?",
    "link": "https://www.nytimes.com/2025/10/24/opinion/ezra-klein-podcast-jared-abbott.html",
    "summary": "Jared Abbott, the director of the Center for Working-Class Politics, discusses what it would take for Democrats to better appeal to working-class voters."
  },
  {
    "title": "Cherish the Last World Series Where Humans Rule Supreme",
    "link": "https://www.nytimes.com/2025/10/24/opinion/world-series-robo-umpires.html",
    "summary": "A new system next season will help perfect decisions around balls and strikes. But baseball’s charm has always been tied to its imperfections."
  },
  {
    "title": "The U.S. Is Deploying an Aircraft Carrier to Latin America",
    "link": "https://www.nytimes.com/2025/10/24/briefing/us-aircraft-carrier-world-series.html",
    "summary": "Also, the World Series begins. Here’s the latest at the end of Friday."
  },
  {
    "title": "With Halo: Campaign Evolved, Microsoft Brings Prized Xbox Game to PlayStation",
    "link": "https://www.nytimes.com/2025/10/24/arts/halo-playstation-microsoft-xbox.html",
    "summary": "As part of a strategic shift away from exclusivity, Microsoft is bringing Halo to Sony’s competing console for the first time."
  },
  {
    "title": "A Missing Picasso Is Found, and a Small Spanish Town Loses Its Air of Mystery",
    "link": "https://www.nytimes.com/2025/10/24/world/europe/spain-picasso-missing.html",
    "summary": "For a brief moment, the puzzle of what had happened to Pablo Picasso’s “Still Life With Guitar” infected Deifontes with caper fever."
  },
  {
    "title": "DNA Identifies 2 Bacterial Killers That Stalked Napoleon’s Army",
    "link": "https://www.nytimes.com/2025/10/24/health/napoleon-army-dna-bacteria.html",
    "summary": "Genetic material pulled from 13 teeth found in a grave in Lithuania revealed infectious diseases that felled the French emperor’s troops as they withdrew from Russia."
  },
  {
    "title": "Lengthy Execution by Nitrogen Gas in Alabama Renews Concerns Over Method",
    "link": "https://www.nytimes.com/2025/10/24/us/alabama-nitrogen-execution-anthony-boyd.html",
    "summary": "Anthony Boyd was the eighth person executed by nitrogen gas since Alabama began using the method last year. His execution came over the strenuous objection of three liberal Supreme Court justices."
  }
]