[
  {
    "title": "Desperation Grows as Texas Flood Rescues Stretch Into Third Day",
    "link": "https://www.nytimes.com/2025/07/06/us/texas-floods-rescues.html",
    "summary": "Scott Ruskan, a Coast Guard swimmer, is credited with saving 165 people at the all-girls’ camp from dangerous floods. “They want some sort of comfort, someone to save them.”"
  },
  {
    "title": "A Family of 6 Was Swept Away in the Texas Floods. Now, Survivors Wait and Hope.",
    "link": "https://www.nytimes.com/2025/07/06/us/politics/texas-flood-family-survivors.html",
    "summary": "A woman whose mother, stepfather, aunt, uncle and cousin are among the missing confronts the unimaginable. A cousin was dragged downriver 15 miles but survived."
  },
  {
    "title": "Texas Flood Victims: What We Know",
    "link": "https://www.nytimes.com/2025/07/05/us/texas-flood-victims.html",
    "summary": "A beloved teacher, child and adult campers, camp directors and a counselor are among at least 81 people who have died in the flooding in Central Texas."
  },
  {
    "title": "Israel’s Deadly Assault on Iran Prison Incites Fury, Even Among Dissidents",
    "link": "https://www.nytimes.com/2025/07/06/world/middleeast/israel-iran-evin-prison.html",
    "summary": "The June 23 airstrikes on Evin prison, including the hospital ward, have turned it from a hated symbol of oppression into a new rallying cry against Israel, even among the Iranian regime’s domestic critics."
  },
  {
    "title": "Trump Says Musk Is ‘Off the Rails’ With America Party Effort",
    "link": "https://www.nytimes.com/2025/07/06/us/politics/trump-musk-america-party.html",
    "summary": "The tech billionaire’s effort to create a new political party, called the America Party, comes amid a ramped-up feud with the president over his new domestic policy law."
  },
  {
    "title": "Social Security Email Says Policy Bill Eliminates Tax on Benefits. Does It?",
    "link": "https://www.nytimes.com/2025/07/06/your-money/social-security-tax.html",
    "summary": "The Social Security Administration circulated an imprecise email about the provisions in the new law. Here’s what it actually does."
  },
  {
    "title": "How Europe Got Stuck Between Xi’s China and Trump’s America",
    "link": "https://www.nytimes.com/2025/07/06/world/europe/european-union-china-tariffs.html",
    "summary": "European Union officials will spend July in talks with China. Tensions are high, hopes are low and stability is the end game."
  },
  {
    "title": "Can Taiwan Really Disconnect Its Economy From China?",
    "link": "https://www.nytimes.com/2025/07/07/business/china-taiwan-chips.html",
    "summary": "Momentum is building in Taiwan to lessen its business dependency on China, its biggest trading partner. Doing so will not be easy."
  },
  {
    "title": "Bessent Says He Expects Trade Deals by This Week’s Deadline",
    "link": "https://www.nytimes.com/2025/07/06/business/economy/bessent-trump-trade-tariffs.html",
    "summary": "But the Treasury secretary also said that some countries working toward agreements with the United States could have until Aug. 1."
  },
  {
    "title": "Ozzy Osbourne and Black Sabbath Play Final Shows in Birmingham, England",
    "link": "https://www.nytimes.com/2025/07/06/arts/music/ozzy-osbourne-black-sabbath.html",
    "summary": "Heavy metal fans crossed continents to converge on Birmingham, England, and throw devil horns in honor of the Prince of Darkness and Black Sabbath."
  },
  {
    "title": "Nearly Half of America’s Murderers Get Away With It",
    "link": "https://www.nytimes.com/2025/07/06/us/murder-solve-rate-louisville.html",
    "summary": "Most crimes go unsolved, emboldening criminals and potentially leading to more violence."
  },
  {
    "title": "South African Police’s Frequent Use of Torture Echoes Apartheid’s Brutality",
    "link": "https://www.nytimes.com/2025/07/07/world/africa/south-africa-torture-police-tubing.html",
    "summary": "A government led by freedom fighters who helped to liberate the country more than 30 years ago is now overseeing a police force accused of staggering abuses."
  },
  {
    "title": "Erin Patterson Is Found Guilty of Murder in Australia Mushroom Poisoning Case",
    "link": "https://www.nytimes.com/2025/07/07/world/australia/mushroom-poisoning-trial-verdict.html",
    "summary": "Three people died in 2023 after eating beef Wellington made by Erin Patterson, whose subsequent trial gripped the country."
  },
  {
    "title": "Keir Starmer Is Fading Away",
    "link": "https://www.nytimes.com/2025/07/07/opinion/keir-starmer-britain-government.html",
    "summary": "After a year in power, Keir Starmer appears to be losing not just political weight but material substance, too."
  },
  {
    "title": "Times Readers Open Up About the Real Cost of Motherhood",
    "link": "https://www.nytimes.com/2025/06/25/opinion/motherhood-penalty-career.html",
    "summary": "What’s the real cost of motherhood? Here’s what our readers said."
  },
  {
    "title": "Tropical Depression Chantal Brings Flooding to Parts of North Carolina",
    "link": "https://www.nytimes.com/2025/07/05/weather/tropical-storm-chantal-south-carolina.html",
    "summary": "Chantal made landfall as a tropical storm early on Sunday. Heavy rains led to widespread flooding in central North Carolina."
  },
  {
    "title": "The Coder ‘Village’ at the Heart of China’s A.I. Frenzy",
    "link": "https://www.nytimes.com/2025/07/06/technology/china-artificial-intelligence-hangzhou.html",
    "summary": "As China vies with Silicon Valley for primacy, Hangzhou, home to DeepSeek and Alibaba, is where its aspiring tech titans mingle and share ideas."
  },
  {
    "title": "As Drones Spot Sharks, New York Beaches Are Shut Down",
    "link": "https://www.nytimes.com/2025/07/06/nyregion/shark-sightings-new-york-beaches-drones.html",
    "summary": "Drone technology seemed to contribute to an unusual number of shark sightings along Rockaway Beach in recent days. Each time swimmers were ordered out of the ocean."
  }
]