[
  {
    "title": "Shutdown Fight Reopens Debate in G.O.P. Over Health Care",
    "link": "https://www.nytimes.com/2025/10/19/us/politics/obamacare-republicans-shutdown-subsidies.html",
    "summary": "The spending showdown has highlighted Republicans’ failure to produce an alternative to Obamacare, which many of them assail but concede is too politically risky to undo."
  },
  {
    "title": "Wealthy Americans Are Spending. People With Less Are Struggling.",
    "link": "https://www.nytimes.com/2025/10/19/business/economic-divide-spending-inflation-jobs.html",
    "summary": "Data show a resilient economy. But that largely reflects spending by the rich, while others pull back amid high prices and a weakening labor market."
  },
  {
    "title": "Vance Flexes the Marines’ Might as Thousands Protest Trump’s Agenda",
    "link": "https://www.nytimes.com/2025/10/19/us/politics/vance-marines-california-protests.html",
    "summary": "Vice President JD Vance’s trip to a military base in California illustrated rising tensions between the federal government and Democratic leaders."
  },
  {
    "title": "‘No Kings’ Protests Against Trump Draws Thousands Across the U.S.",
    "link": "https://www.nytimes.com/2025/10/18/us/protests-trump-no-kings.html",
    "summary": "Large crowds turned out at “No Kings” rallies on Saturday that took place in large cities and small towns nationwide."
  },
  {
    "title": "Louvre Closed After Brazen Daylight Robbery",
    "link": "https://www.nytimes.com/2025/10/19/world/europe/louvre-paris-robbery.html",
    "summary": "French officials said the thieves broke into a first-floor wing of the Paris museum and fled with “priceless” jewelry."
  },
  {
    "title": "It’s 2025, and Democrats Are Still Running Against Trump",
    "link": "https://www.nytimes.com/2025/10/19/us/politics/democratic-campaign-ads-trump.html",
    "summary": "In New Jersey, Virginia and beyond, voters have been inundated with ads linking Republican candidates to the president. Some Democratic strategists see a missed opportunity to forge a more positive message."
  },
  {
    "title": "How George Santos Won His Freedom",
    "link": "https://www.nytimes.com/2025/10/18/nyregion/george-santos-prison-trump.html",
    "summary": "On Friday evening, President Trump commuted the sentence of former Representative George Santos. “Good luck George, have a great life!” the president said."
  },
  {
    "title": "The Democratic Mayor Who Thinks Cities Are Handling Trump Wrong",
    "link": "https://www.nytimes.com/2025/10/19/us/politics/houston-mayor.html",
    "summary": "Mayor John Whitmire of Houston believes the best way to govern a diverse, immigrant-heavy city in the current political climate is by keeping your head down and your ambitions modest."
  },
  {
    "title": "A Tower on Billionaires’ Row Is Full of Cracks. Who’s to Blame?",
    "link": "https://www.nytimes.com/2025/10/19/nyregion/432-park-avenue-condo-tower.html",
    "summary": "A superstar team of architects and developers insisted on an all-white concrete facade. It could explain some of the building’s problems."
  },
  {
    "title": "A Squalid Building, a Tip to the Feds, and Then ‘Straight-Up Chaos’",
    "link": "https://www.nytimes.com/2025/10/19/us/chicago-south-shores-border-patrol-raid.html",
    "summary": "An immigration raid on an apartment building in Chicago followed years of problems with crime, and neglect by landlords. It swept up dozens of U.S. citizens who were detained in the middle of the night."
  },
  {
    "title": "What Powers Does the Border Patrol Have Across the Country?",
    "link": "https://www.nytimes.com/2025/10/18/us/politics/border-patrol-immigration-explainer.html",
    "summary": "The Trump administration is increasingly relying on the agency for immigration enforcement within the U.S."
  },
  {
    "title": "Mamdani, Jeffries and How to Beat Trump at His Own Game",
    "link": "https://www.nytimes.com/2025/10/19/opinion/democrats-attention-elections.html",
    "summary": "Democrats’ vision for the country won’t matter unless they can get people to pay attention to it."
  },
  {
    "title": "When I Look at Zohran Mamdani, Here’s What I See",
    "link": "https://www.nytimes.com/2025/10/13/opinion/zohran-mamdani-muslim-america-new-york.html",
    "summary": "What does it mean to be a “good” Muslim in America?"
  },
  {
    "title": "An Ode to October Baseball",
    "link": "https://www.nytimes.com/2025/10/19/world/la-dodgers-postseason-louvre-robbery.html",
    "summary": "With the World Series just days away, we look at the beauty of baseball — even if one team looks unbeatable."
  },
  {
    "title": "Bari Weiss’s First Days at CBS: Booking Big Guests and Irked by Leaks",
    "link": "https://www.nytimes.com/2025/10/19/business/media/bari-weiss-cbs-60-minutes.html",
    "summary": "Ms. Weiss, an unusual leader for a broadcast news division, has floated ideas for live events and asked journalists why they are seen as biased."
  },
  {
    "title": "The Indonesian Free-Food Program That Has Sickened Thousands",
    "link": "https://www.nytimes.com/2025/10/18/world/asia/indonesia-school-lunch-program-poisoning.html",
    "summary": "Indonesia’s president says the meals are improving nutrition in the country. Critics have called for a halt to the program, saying it threatens public health."
  },
  {
    "title": "A Photographer Captures Jewish Life Before and After the Holocaust",
    "link": "https://www.nytimes.com/2025/10/15/world/europe/edward-serotta-centropa-holocaust-testimonies.html",
    "summary": "Edward Serotta created an archive of 1,230 in-depth interviews with Holocaust survivors about how they lived, both before and after. “Every one of them comes with a story,” he said."
  }
]