[
  {
    "title": "With Critical Decisions Ahead, Netanyahu Faces Mounting Pressure",
    "link": "https://www.nytimes.com/2025/12/29/world/middleeast/israel-benjamin-netanyahu-decisions.html",
    "summary": "Prime Minister Benjamin Netanyahu of Israel has a series of vexing choices to make in the year ahead on issues including Gaza, conscription and a judicial overhaul, with elections looming."
  },
  {
    "title": "Zero Hour for the Middle East",
    "link": "https://www.nytimes.com/2025/12/28/world/middleeast/future-of-mideast.html",
    "summary": "After more than a decade of wars, from Syria to Gaza, the Middle East is exhausted by conflict. Is it ready to find another way?"
  },
  {
    "title": "Zelensky and Netanyahu Go to Mar-a-Lago, and Student Loan Borrowers Face New Reality",
    "link": "https://www.nytimes.com/2025/12/29/podcasts/the-headlines/zelensky-netanyahu-trump-student-loans.html",
    "summary": "Plus, food trends coming in 2026."
  },
  {
    "title": "For Zelensky, Just Keeping Trump Talking About Ukraine Peace Deal Counts as a Win",
    "link": "https://www.nytimes.com/2025/12/29/world/europe/zelensky-trump-ukraine-peace-talks.html",
    "summary": "Though discussions produced little tangible progress, President Volodymyr Zelensky of Ukraine at least avoided the type of setbacks that have blighted earlier meetings."
  },
  {
    "title": "Trump and Zelensky Meet to Iron Out Peace Plan, but Deal Remains Elusive",
    "link": "https://www.nytimes.com/2025/12/28/us/politics/trump-zelensky-peace-ukraine-putin.html",
    "summary": "The U.S. president said after a meeting at Mar-a-Lago that a deal was “maybe very close.” But a joint U.S.-Ukraine proposal appeared unfinished, as Russia rejected several ideas."
  },
  {
    "title": "Inside Marjorie Taylor Greene’s Break With Trump and MAGA",
    "link": "https://www.nytimes.com/2025/12/29/magazine/marjorie-taylor-greene-trump-maga-split.html",
    "summary": "How the Georgia congresswoman went from the president’s loudest cheerleader to his loudest Republican critic."
  },
  {
    "title": "Five Takeaways From the New York Times Profile of Marjorie Taylor Greene",
    "link": "https://www.nytimes.com/2025/12/29/magazine/marjorie-taylor-greene-interview-takeaways.html",
    "summary": "The congresswoman discussed her break with President Trump and her journey from MAGA zealot to political isolation."
  },
  {
    "title": "In Trump’s D.C. Crackdown, Murder Victims’ Families Say He’s Ignoring Them",
    "link": "https://www.nytimes.com/2025/12/29/us/politics/families-of-murder-victims-in-washington-say-trump-is-ignoring-them.html",
    "summary": "President Trump insists there are no more murders in Washington, D.C. “I wish that was true,” said Jamia Vaden, whose sister was gunned down in November."
  },
  {
    "title": "How Kevin Hassett Became a Trump Loyalist and Fed Chair Contender",
    "link": "https://www.nytimes.com/2025/12/29/us/politics/kevin-hassett-fed-chair-independence.html",
    "summary": "Mr. Hassett’s evolution from conservative economist to defender of the president’s economic agenda has raised questions about how he would lead the central bank."
  },
  {
    "title": "Trump Says the U.S. Struck a ‘Big Facility’ in Campaign Against Venezuela",
    "link": "https://www.nytimes.com/2025/12/28/us/politics/trump-drug-facility-venezuela.html",
    "summary": "The administration provided no details of what the president said was an attack last week linked to U.S. efforts to disrupt drug trafficking from Latin America."
  },
  {
    "title": "Suspect Confessed to Planting Pipe Bombs Near the Capitol Before Jan. 6",
    "link": "https://www.nytimes.com/2025/12/28/us/politics/jan-6-pipe-bomb.html",
    "summary": "A Virginia man was charged with planting the bombs outside Democratic and Republican headquarters. Court documents show he believed that the 2020 election had been “tampered with.”"
  },
  {
    "title": "How We’ll Eat in 2026: Food Forecasters Predict More Caution and More Crunch",
    "link": "https://www.nytimes.com/2025/12/29/dining/food-trends-2026-predictions.html",
    "summary": "Food forecasters see a year of quieter tastes: little bursts of pleasure, less-jangling restaurants and healthy foods worthy of the ideal Grandma."
  },
  {
    "title": "Uber Flags Sexual Misconduct but Many Drivers Stay on the Road",
    "link": "https://www.nytimes.com/2025/12/29/business/uber-sexual-assault-drivers-complaints.html",
    "summary": "The company monitors passenger feedback for risky driver behavior. Some accused of serious sexual assault had prior records of complaints."
  },
  {
    "title": "China Will Hold Live-Fire Military Exercises Around Taiwan",
    "link": "https://www.nytimes.com/2025/12/29/world/asia/china-taiwan-military-exercises.html",
    "summary": "The exercises ended months of relative calm across the Taiwan Strait, and came after the Trump administration announced plans for arms sales to the island."
  },
  {
    "title": "Experts Question Denmark’s Vaccine Program as a Model for the U.S.",
    "link": "https://www.nytimes.com/2025/12/29/world/europe/denmark-vaccine-schedule-rfk.html",
    "summary": "The United States is expected to adopt the vaccine schedule used by Denmark, a much smaller country with universal health care."
  },
  {
    "title": "As Mamdani Leaves Queens for the Upper East Side, a Cool Welcome Awaits",
    "link": "https://www.nytimes.com/2025/12/29/nyregion/mamdani-gracie-neighborhood-astoria.html",
    "summary": "Mayor-elect Zohran Mamdani loves his Astoria, Queens, neighborhood, and the feeling is mutual. But voters who live near Gracie Mansion, his new home, really wanted his opponent to win."
  },
  {
    "title": "Can You Reboot a Lamp Like a Superhero Franchise?",
    "link": "https://www.nytimes.com/2025/12/28/business/midcentury-design-furniture-lamps.html",
    "summary": "Riding an endless wave of nostalgia, one company is exhuming the intellectual property of midcentury designers to create new audiences for forgotten work."
  },
  {
    "title": "Why We Keep Falling for Narcissistic Leaders",
    "link": "https://www.nytimes.com/2025/12/29/opinion/why-we-fall-for-narcissistic-leaders-starting-in-grade-school.html",
    "summary": "We should know better."
  },
  {
    "title": "What Happens When Your Therapist Dies?",
    "link": "https://www.nytimes.com/2025/12/29/opinion/what-happens-when-therapist-dies.html",
    "summary": "People don’t like to think about their own mortality, but therapists owe it to their patients to make plans."
  },
  {
    "title": "Our Visual Journalism",
    "link": "https://www.nytimes.com/2025/12/29/briefing/our-visual-journalism.html",
    "summary": "We look at the best graphics from The Times in 2025."
  },
  {
    "title": "Parts of New York and New England Brace for Ice Storm",
    "link": "https://www.nytimes.com/2025/12/29/us/new-york-new-england-ice-storm.html",
    "summary": "Several states were under weather warnings or advisories early Monday. The same winter storm battered the Midwest over the weekend."
  },
  {
    "title": "The World Wants More Ube. Philippine Farmers Are Struggling to Keep Up.",
    "link": "https://www.nytimes.com/2025/12/29/world/asia/philippines-ube-purple-yam.html",
    "summary": "Soaring demand and extreme weather worsened by climate change have wiped out harvests of the popular purple yam."
  },
  {
    "title": "Mexico Train Derailment Kills 13 People",
    "link": "https://www.nytimes.com/2025/12/28/world/americas/mexico-train-crash.html",
    "summary": "The train was carrying around 250 passengers and crew members on a cross-country route linking the Pacific and the Gulf of Mexico. Nearly 100 people were injured."
  }
]