[
  {
    "title": "Israel Returned to War in Gaza Hoping to Break Hamas. It Achieved Few, if Any, Goals.",
    "link": "https://www.nytimes.com/2025/07/28/world/israel-gaza-hamas-all-out-war-failure.html",
    "summary": "Israel ended a truce in Gaza in March, hoping to break Hamas. The move has heightened suffering for Palestinians but achieved few, if any, Israeli goals."
  },
  {
    "title": "‘Revenge Is Not a Policy’: Israelis Voice Dissent Against the War in Gaza",
    "link": "https://www.nytimes.com/2025/07/28/world/middleeast/israel-dissent-war-gaza.html",
    "summary": "After a long silence, prominent Israelis and activists are increasingly raising alarms about potential war crimes being carried out by the government."
  },
  {
    "title": "In a First, Leading Israeli Rights Groups Accuse Israel of Gaza Genocide",
    "link": "https://www.nytimes.com/2025/07/28/world/middleeast/israel-genocide-gaza-rights-groups.html",
    "summary": "Israel says it is fighting against Hamas, not Palestinians as a group. But two of Israel’s best-known rights groups — long critical of Israeli policy — now say they disagree."
  },
  {
    "title": "Trump Gives Russia Less Than Two Weeks to End Its War in Ukraine",
    "link": "https://www.nytimes.com/2025/07/28/us/politics/trump-ukraine-russia-deadline-sanctions.html",
    "summary": "President Trump said he had decided to shorten a 50-day deadline he had given Russia to end the conflict or face punishing new sanctions."
  },
  {
    "title": "Russia Counters Ukrainian Drones by Turning Off Russians’ Mobile Internet",
    "link": "https://www.nytimes.com/2025/07/28/world/europe/russia-internet-blackouts-drones.html",
    "summary": "The same data networks that enable phone apps and web surfing help drones navigate, so officials are imposing daily, patchwork shutdowns. The actions can be very disruptive to daily life."
  },
  {
    "title": "Where Is the Economy Going? A ‘Monster Week’ of News Could Help Decide.",
    "link": "https://www.nytimes.com/2025/07/28/business/economy-tariffs-fed-jobs.html",
    "summary": "This week will bring a flood of economic data, as well as major policy decisions on trade and interest rates."
  },
  {
    "title": "Economists Are Struggling to Find Jobs. It’s an Ominous Sign for The Economy.",
    "link": "https://www.nytimes.com/2025/07/28/business/economics-jobs-hiring.html",
    "summary": "Earning a Ph.D. in economics has long been a reliable path to affluence and prestige. Not anymore."
  },
  {
    "title": "Judge Blocks Trump Administration-Backed Medicaid Cuts to Planned Parenthood",
    "link": "https://www.nytimes.com/2025/07/28/us/politics/planned-parenthood-medicaid-trump.html",
    "summary": "A federal judge in Boston ruled that a provision in President Trump’s policy bill targeting the organization most likely amounted to retaliation."
  },
  {
    "title": "A Maine Resort Town Feels the Pressure of Trump’s Immigration Crackdown",
    "link": "https://www.nytimes.com/2025/07/28/travel/maine-wells-ice-immigration-tourism.html",
    "summary": "Wells, like many U.S. tourist spots that rely on foreign labor, is fearful of immigration raids. The local police department’s agreement to collaborate with federal agents only adds to the anxiety."
  },
  {
    "title": "Durbin Demands Tapes of Interviews With Ghislaine Maxwell, Epstein’s Longtime Partner",
    "link": "https://www.nytimes.com/2025/07/28/us/politics/ghislaine-maxwell-epstein-interview-durbin.html",
    "summary": "The top Democrat on the Senate Judiciary Committee also pressed the Justice Department for a promise that Ms. Maxwell will not be pardoned for her cooperation in matters related to the Jeffrey Epstein files."
  },
  {
    "title": "Trump Says Rupert Murdoch Should be Deposed Within 15 Days in Suit Over Epstein Article",
    "link": "https://www.nytimes.com/2025/07/28/business/media/trump-rupert-murdoch-libel-epstein.html",
    "summary": "The president’s legal team argued in a legal filing that discovery process for the media mogul should be expedited because of his age and health."
  },
  {
    "title": "Why ‘Mankeeping’ Is Turning Women Off",
    "link": "https://www.nytimes.com/2025/07/28/well/family/mankeeping-definition.html",
    "summary": "As male social circles shrink, female partners say they have to meet more social and emotional needs."
  },
  {
    "title": "How Parenting Changed After Etan Patz",
    "link": "https://www.nytimes.com/2025/07/28/nyregion/parenting-etan-patz.html",
    "summary": "Did the shocking disappearance of a 6-year-old in 1979 forever alter how Americans raised children? Or were there other reasons for parents to be anxious?"
  },
  {
    "title": "Avian Flu Wiped Out Poultry. Now the Screwworm Is Coming for Beef.",
    "link": "https://www.nytimes.com/2025/07/28/us/politics/screwworm-beef-prices.html",
    "summary": "The parasitic fly that attacks warm-blooded animals was eliminated from the United States in the 1960s, but it’s creeping toward the Texas-Mexico border."
  },
  {
    "title": "Thailand and Cambodia Agree to Halt Fighting That Has Killed Dozens",
    "link": "https://www.nytimes.com/2025/07/28/world/asia/thailand-cambodia-ceasefire-talks.html",
    "summary": "U.S.-backed talks to end the border war, in which militaries have killed dozens of people and displaced hundreds of thousands, began on Monday in Malaysia."
  },
  {
    "title": "Thai-Cambodian Conflict Tears at Remnants of a Once-Proud Empire",
    "link": "https://www.nytimes.com/2025/07/28/world/asia/thailand-cambodia-khmer-empire.html",
    "summary": "People on both sides of the border share a cultural heritage much older than modern nation-states, dating back to the ancient Khmer civilization."
  },
  {
    "title": "Tehran Is at Risk of Running Out of Water Within Weeks",
    "link": "https://www.nytimes.com/2025/07/26/world/middleeast/iran-water-crisis-drought.html",
    "summary": "After a five-year drought and decades of mismanagement, a water crisis is battering Iran."
  },
  {
    "title": "UnitedHealth Grew to Be a Leviathan. Then Came the Backlash.",
    "link": "https://www.nytimes.com/2025/07/28/health/unitedhealth-backlash.html",
    "summary": "The conglomerate was viewed as one of the most successful companies in America, but patients are enraged and investors have lost faith in its business model."
  },
  {
    "title": "U.S. Opens Antitrust Investigation Into NewYork-Presbyterian",
    "link": "https://www.nytimes.com/2025/07/28/nyregion/doj-ny-presbyterian-health.html",
    "summary": "The Justice Department scrutiny of one of New York’s leading health systems could lead to more spirited competition among hospitals — and slow rising prices."
  },
  {
    "title": "How Smartphones Are Breeding a New Kind of Inequality",
    "link": "https://www.nytimes.com/2025/07/28/opinion/smartphones-literacy-inequality-democracy.html",
    "summary": "That’s bad news for our democracies."
  },
  {
    "title": "Sovereignty Is Having a Moment",
    "link": "https://www.nytimes.com/2025/07/28/briefing/sovereignty-is-having-a-moment.html",
    "summary": "We explain why leaders are talking so much about independence."
  },
  {
    "title": "Several People Injured in Shooting at Reno Casino Resort",
    "link": "https://www.nytimes.com/2025/07/28/us/reno-shooting-casino.html",
    "summary": "The police said that the gunman was in custody after the attack at the Grand Sierra Resort and Casino."
  },
  {
    "title": "Last Soldiers of an Imperial Army Have a Warning for Young Generations",
    "link": "https://www.nytimes.com/2025/07/28/world/asia/japan-veterans-world-war-ii.html",
    "summary": "As the 80th anniversary of the end of World War II approaches, only a few veterans of Japan’s brutal war remain. “Never die for Emperor or country,” one advised."
  },
  {
    "title": "Tampa Hits 100 Degrees for the First Time as Heat Grips the Southeast",
    "link": "https://www.nytimes.com/2025/07/28/weather/heat-wave-georgia-florida-carolina-us-forecast.html",
    "summary": "Extreme heat has settled across much of the region."
  },
  {
    "title": "Pilot Facing Child Sex Abuse Materials Charges Is Arrested After Flight, U.S. Says",
    "link": "https://www.nytimes.com/2025/07/28/business/delta-pilot-arrested-san-francisco-federal-agents.html",
    "summary": "The pilot was led away while the crew and passengers remained on board, according to eyewitness reports."
  }
]