[
  {
    "title": "Harvard Slips on a Global Ranking List, as Chinese Schools Surge Ahead",
    "link": "https://www.nytimes.com/2026/01/15/us/harvard-global-ranking-chinese-universities-trump-cuts.html",
    "summary": "Harvard still dominates, though it fell to No. 3 on a list measuring academic output. Other American universities are falling farther behind their global peers."
  },
  {
    "title": "Federal Agent Shoots and Injures Man in Minneapolis, and F.B.I. Searches Reporter’s Home",
    "link": "https://www.nytimes.com/2026/01/15/podcasts/the-headlines/federal-agent-minneapolis-fbi-searches-reporters-home.html",
    "summary": "Plus, a space station evacuation."
  },
  {
    "title": "Federal Agent Shoots Man in Minneapolis, Prompting Tense Protests",
    "link": "https://www.nytimes.com/2026/01/14/us/minneapolis-federal-agent-shooting-immigration.html",
    "summary": "The agent shot a Venezuelan man who was resisting arrest, an official said. Protesters and law enforcement officers clashed for hours, as city officials urged people to go home."
  },
  {
    "title": "One State, Two Very Different Views of Minneapolis",
    "link": "https://www.nytimes.com/2026/01/15/us/minnesota-minneapolis-shooting-ice-renee-good.html",
    "summary": "Pull up a stool at Ye Olde Pickle Factory and listen to a story about America’s urban-rural divide."
  },
  {
    "title": "Judge to Weigh Next Steps in Student Activist Deportations Case",
    "link": "https://www.nytimes.com/2026/01/15/us/politics/student-activist-deportations-judge.html",
    "summary": "The hearing on Thursday followed up on the court’s sweeping finding in September that noncitizen students had the same free speech rights as citizens."
  },
  {
    "title": "Woman Killed by ICE Agent Seemed at Fault, N.Y. Republican Says",
    "link": "https://www.nytimes.com/2026/01/14/nyregion/blakeman-ice-minneapolis.html",
    "summary": "Bruce Blakeman, the likely Republican candidate for governor, said the killing of Renee Good was just one point of disagreement between him and Gov. Kathy Hochul, a Democrat."
  },
  {
    "title": "Trump Vows to Make Venezuela Rich. It Will Take More Than U.S. Cash.",
    "link": "https://www.nytimes.com/2026/01/15/business/venezuela-oil-history-investment.html",
    "summary": "History suggests that the price of oil and a wider distribution of wealth are as important as foreign investment."
  },
  {
    "title": "Nobel Committee Takes Heat at Home as Machado Courts Trump in D.C.",
    "link": "https://www.nytimes.com/2026/01/15/world/americas/machado-trump-meeting-nobel-peace-prize.html",
    "summary": "The Venezuelan opposition leader’s attempts to share her award with the U.S. president have shaken some Norwegians’ faith in their signature soft-power tool."
  },
  {
    "title": "Cyberattack in Venezuela Demonstrated Precision of U.S. Capabilities",
    "link": "https://www.nytimes.com/2026/01/15/us/politics/cyberattack-venezuela-military.html",
    "summary": "Senators are expected to ask Lt. Gen. Joshua M. Rudd, President Trump’s nominee to lead the U.S. Cyber Command, about the mission in Caracas."
  },
  {
    "title": "The U.S. Is Pressing Mexico to Allow U.S. Forces to Fight Cartels",
    "link": "https://www.nytimes.com/2026/01/15/world/americas/us-mexico-cartels.html",
    "summary": "The United States is escalating pressure on the Mexican government to permit the U.S. military to target fentanyl labs, according to American officials."
  },
  {
    "title": "Trump Says Iran Is Stopping Its Killings of Protesters as U.S. Moves Troops",
    "link": "https://www.nytimes.com/2026/01/14/us/politics/us-base-qatar-iran.html",
    "summary": "Nonessential personnel were moved from Al Udeid Air Base in Qatar, an American site that could be a target of Iran if President Trump ordered an attack on the country."
  },
  {
    "title": "Trump’s Gulf Allies Do Not Want Him to Bomb Iran",
    "link": "https://www.nytimes.com/2026/01/14/world/middleeast/gulf-trump-iran.html",
    "summary": "While several of the Gulf Arab countries harbor little love for Iran, they worry that the consequences of rising tensions could blow back on them."
  },
  {
    "title": "Russia Knocks Out the Heat in Ukraine",
    "link": "https://www.nytimes.com/2026/01/15/world/europe/ukraine-kyiv-winter-heating-power-outages.html",
    "summary": "The Kremlin has tried for years to freeze Ukraine into submission. This winter, its attacks have been the most devastating ever."
  },
  {
    "title": "3 More Lawmakers in Video Say Federal Prosecutors Are Investigating Them",
    "link": "https://www.nytimes.com/2026/01/14/us/politics/crow-goodlander-houlahan-trump-investigation.html",
    "summary": "The lawmakers, all Democrats who urged military service members not to follow illegal orders, said prosecutors had contacted them. But it is unclear what crime they might have committed."
  },
  {
    "title": "Leading Prediction Firms Share a Commonality: Donald Trump Jr.",
    "link": "https://www.nytimes.com/2026/01/15/us/politics/donald-trump-jr-prediction-markets.html",
    "summary": "Traders in companies with ties to the president’s eldest son can bet on the outcome of events the president affects."
  },
  {
    "title": "Congress Is Spurning Many of Trump’s Proposed Spending Cuts",
    "link": "https://www.nytimes.com/2026/01/14/us/politics/congress-trump-spending-cuts.html",
    "summary": "Months after the partisan clash that led to the longest shutdown in history, lawmakers have agreed on spending bills that look far different from what the president wanted."
  },
  {
    "title": "After Danish and U.S. Officials Meet on Greenland, Trump Remains Unmoved",
    "link": "https://www.nytimes.com/2026/01/14/us/politics/greenland-trump-denmark.html",
    "summary": "Denmark’s foreign minister left the White House complex saying that his country had a “fundamental disagreement” with President Trump, as several NATO countries sent troops to Greenland."
  },
  {
    "title": "Food Prices Keep Climbing, Rattling Consumers and Trump",
    "link": "https://www.nytimes.com/2026/01/14/business/food-prices-tariffs-trump.html",
    "summary": "Weather, supply, tariffs, labor and changing consumer habits continue to drive up the cost of groceries. President Trump falsely claims prices are falling."
  },
  {
    "title": "Trump Signs Bill Allowing Schools to Serve Whole Milk Again",
    "link": "https://www.nytimes.com/2026/01/14/us/trump-whole-milk-schools-bill.html",
    "summary": "The law, which was approved unanimously by Congress late last year, also gives schools more flexibility in serving nondairy milks."
  },
  {
    "title": "Is Whole Milk Healthier for Kids?",
    "link": "https://www.nytimes.com/2026/01/14/well/eat/health-effects-whole-milk-kids.html",
    "summary": "A new law will allow full-fat and 2 percent milk to be served in schools. Here’s what to know."
  },
  {
    "title": "Why Are We Still So Afraid of Using the Grumpy Old Period?",
    "link": "https://www.nytimes.com/2026/01/15/magazine/ending-sentences-period.html",
    "summary": "Exclamation marks, ellipses and ‘haha’ can’t fix our growing inability to communicate."
  },
  {
    "title": "The Gaudy, Nasty Fictions of Donald J. Trump",
    "link": "https://www.nytimes.com/2026/01/15/opinion/trump-renee-good-rubio-greenland.html",
    "summary": "This is neither law nor order, and the consequences can be deadly."
  },
  {
    "title": "Democrats Will Lose in 2028 Unless They Change Course Now",
    "link": "https://www.nytimes.com/2026/01/15/opinion/democrats-strategy-elections.html",
    "summary": "Despite the successes of 2025, the party still needs a radical shake up."
  },
  {
    "title": "Greenland’s Future",
    "link": "https://www.nytimes.com/2026/01/15/briefing/greenland-future.html",
    "summary": "We examine the debate over the Arctic island and what residents are saying."
  },
  {
    "title": "Colbert Jokes That Trump Has Found ‘a New National Bird’",
    "link": "https://www.nytimes.com/2026/01/15/arts/television/colbert-trump-middle-finger-heckler.html",
    "summary": "“You got to hand it to that auto worker for getting under Trump’s skin,” Stephen Colbert said after the president appeared to flip off a heckling worker at a Ford plant."
  },
  {
    "title": "A Look At Antarctica From Above",
    "link": "https://www.nytimes.com/video/climate/100000010644792/a-look-at-antarctica-from-above.html",
    "summary": "After nearly two weeks at sea without being able to launch his drone, New York Times photographer Chang W. Lee finally captures Antarctica from the air."
  },
  {
    "title": "How One Company, Neptune Flood, Is Pushing a Private Takeover of Flood Insurance",
    "link": "https://www.nytimes.com/2026/01/15/climate/neptune-flood-nfip-insurance.html",
    "summary": "For half a century, a federal program has covered most at-risk properties. Now, a private company is pitching a plan to shrink the government’s role."
  },
  {
    "title": "Au Pair Testifies of Lurid Plot in Virginia Double-Murder Trial",
    "link": "https://www.nytimes.com/2026/01/14/us/au-pair-banfield-murder-trial.html",
    "summary": "Juliana Peres Magalhães wrapped up testimony on Wednesday in the case against Brendan Banfield, her former lover, who is accused of killing his wife and another man."
  },
  {
    "title": "Many Mayors Have Tried to Help Small Businesses. It’s Mamdani’s Turn.",
    "link": "https://www.nytimes.com/2026/01/15/nyregion/mamdani-fees-fines-businesses.html",
    "summary": "Small business advocates in New York are excited that Mayor Zohran Mamdani is tackling the issue of excessive fees and fines, but they’ve heard similar promises before."
  }
]