[
  {
    "title": "Ukraine Pursues a Weapons Buildup More Potent Than Any Security Guarantee",
    "link": "https://www.nytimes.com/2025/09/02/world/europe/ukraine-weapons-security.html",
    "summary": "Kyiv sees a well-equipped army as a stronger deterrent to Moscow than any Western pledges to defend it. It is working to attract billions to buy more arms."
  },
  {
    "title": "Putin and Xi Invoke Wartime Unity as They Hail Ties in Beijing",
    "link": "https://www.nytimes.com/2025/09/02/world/asia/china-putin-xi.html",
    "summary": "The Russian and Chinese leaders drew on a shared view of their countries’ roles in World War II to cast their modern-day partnership as a challenge to the West."
  },
  {
    "title": "Putin Finds a Growing Embrace on the Global Stage",
    "link": "https://www.nytimes.com/2025/09/01/world/europe/russia-ukraine-putin-diplomacy.html",
    "summary": "Eurasian leaders eagerly met the Russian leader at a summit this week, as President Trump has helped ease his isolation over the war in Ukraine."
  },
  {
    "title": "When Putin, Xi and Modi Get Together, and a Legal Blow to Trump’s Tariffs",
    "link": "https://www.nytimes.com/2025/09/02/podcasts/the-headlines/putin-xi-modi-trumps-tariffs.html",
    "summary": "Plus, the Bad Bunny economic boost."
  },
  {
    "title": "White House Counsel Eases Trump’s Path on Aggressive Agenda",
    "link": "https://www.nytimes.com/2025/09/02/us/politics/white-house-counsel-david-warrington.html",
    "summary": "David Warrington, the top lawyer inside the West Wing, focuses on “the art of the possible,” as one Trump adviser said."
  },
  {
    "title": "Trump Orders Have Stripped Nearly Half a Million Federal Workers of Union Rights",
    "link": "https://www.nytimes.com/2025/09/01/us/politics/trumps-unions-federal-workers.html",
    "summary": "The president, who has targeted collective bargaining contracts for nearly one million government employees, has said their functions touch on national security."
  },
  {
    "title": "Trump’s D.C. Crime Crackdown Shows Administration’s Uneasy Relationship With Guns",
    "link": "https://www.nytimes.com/2025/09/01/us/politics/dc-crime-trump-guns.html",
    "summary": "If President Trump’s actions were intended to drive a law-and-order wedge between Democratic big-city leaders and their constituents, it has also exposed a division in his own coalition."
  },
  {
    "title": "Why China Is Trying to Tame Its Electric Car Frenzy",
    "link": "https://www.nytimes.com/2025/09/02/business/china-electric-vehicles-overcapacity.html",
    "summary": "Beijing has run out of patience with companies slashing prices, and is urging restraint. But fierce competition is also producing a surge of innovation."
  },
  {
    "title": "After Court Defeat, Trump Warns of Economic Chaos From Loss of Tariffs",
    "link": "https://www.nytimes.com/2025/09/02/us/politics/trump-tariffs-appeals-court-ruling-economy.html",
    "summary": "The president and his advisers have suggested they will fight a federal appeals court’s ruling that found many of the administration’s tariffs to be illegal."
  },
  {
    "title": "A Move to the U.S. to Avoid Tariffs? There Are Trade-Offs.",
    "link": "https://www.nytimes.com/2025/09/02/world/europe/germany-tariffs-bizerba-us-move.html",
    "summary": "Bizerba, a German company that makes industrial slicers for Subway, is thinking about shifting production to the United States, if it can overcome the challenges."
  },
  {
    "title": "Trump’s Fight with the Fed Carries a Heavy Cost, Experts Say",
    "link": "https://www.nytimes.com/2025/09/02/business/dealbook/fed-trump-cook-political-independence.html",
    "summary": "The president’s attacks on the central bank’s  independence could undermine investor confidence in the institution at a crucial time."
  },
  {
    "title": "How Jair Bolsonaro Tried, and Failed, to Stage a Coup in Brazil",
    "link": "https://www.nytimes.com/2025/09/02/world/americas/jair-bolsonaro-brazil-coup-trial.html",
    "summary": "Brazil’s former president, Jair Bolsonaro, stands trial on Tuesday, accused of plotting a coup after losing the 2022 elections. Evidence suggests this is how he tried to do it."
  },
  {
    "title": "What to Know About Jair Bolsonaro’s Coup Plot Trial",
    "link": "https://www.nytimes.com/2025/09/02/world/americas/jair-bolsonaro-coup-trial-what-to-know.html",
    "summary": "The former Brazilian president is charged with planning a coup after losing the 2022 elections. He says he pursued only legal avenues to remain in power. Here is what to know about the trial."
  },
  {
    "title": "Vogue Names Chloe Malle as Its New Editor",
    "link": "https://www.nytimes.com/2025/09/02/business/media/vogue-chloe-malle-new-editor.html",
    "summary": "Ms. Malle, 39, succeeds Anna Wintour, a titan in fashion. “There has to be a noticeable shift that makes this mine,” Ms. Malle said in an interview."
  },
  {
    "title": "‘Who Am I Without Birth Control?’",
    "link": "https://www.nytimes.com/2025/09/02/style/birth-control-skepticism-wellness-tiktok.html",
    "summary": "As social media and wellness podcasters bombard young women with messages about the pill, many are questioning what they’ve long been told."
  },
  {
    "title": "How Elon Musk Is Remaking Grok in His Image",
    "link": "https://www.nytimes.com/2025/09/02/technology/elon-musk-grok-conservative-chatbot.html",
    "summary": "Mr. Musk said he wanted xAI’s chatbot to be “politically neutral.” His actions say otherwise."
  },
  {
    "title": "Kraft Heinz to Break Up Its Food Businesses",
    "link": "https://www.nytimes.com/2025/09/02/business/kraft-heinz-break-up.html",
    "summary": "A planned split of the mega company that makes products from Velveeta to Kool-Aid comes as consumers shift away from processed foods."
  },
  {
    "title": "Cue the Sun: This Lab Recreates Hot, Sweaty Days to Test Humans",
    "link": "https://www.nytimes.com/2025/09/02/climate/research-extreme-heat-lab.html",
    "summary": "Our reporter hits the treadmill to understand how scientists study extreme heat."
  },
  {
    "title": "The One Danger That Should Unite the U.S. and China",
    "link": "https://www.nytimes.com/2025/09/02/opinion/ai-us-china.html",
    "summary": "The U.S. and China must agree on a trust architecture for A.I. devices, or else rogue entities will destabilize these two superpower nations long before they get around to fighting a war."
  },
  {
    "title": "Do Not Re-Gerrymander California",
    "link": "https://www.nytimes.com/2025/09/02/opinion/gerrymander-democrats-california.html",
    "summary": "If Democrats gerrymander California, they will lose the moral high ground."
  },
  {
    "title": "We Answer Your Questions About Education",
    "link": "https://www.nytimes.com/2025/09/02/briefing/we-answer-your-questions-about-education.html",
    "summary": "Our reporters address reader concerns about K-12 schooling."
  },
  {
    "title": "It Was Supposed to Connect Segregated Neighborhoods. Did It Gentrify Them Instead?",
    "link": "https://www.nytimes.com/2025/09/02/business/atlanta-beltline-success-displacement.html",
    "summary": "The Atlanta BeltLine turned a mostly derelict 22-mile loop around the city into a wildly popular — and profitable — urban park. It also contributed to displacing longtime residents."
  },
  {
    "title": "Nadler, Pillar of Democratic Party’s Old Guard, Will Retire Next Year",
    "link": "https://www.nytimes.com/2025/09/01/nyregion/jerrold-nadler-congress-retires.html",
    "summary": "Representative Jerrold Nadler, the ex-House Judiciary chairman who helped lead President Trump’s impeachments, will not seek re-election in New York."
  },
  {
    "title": "Kim Jong-un Heads to Beijing by Train",
    "link": "https://www.nytimes.com/2025/09/02/world/asia/kim-north-korea-train.html",
    "summary": "The North Korean leader’s favorite mode of transportation provides him — like his father and grandfather before him — with tight security. But it’s no express train."
  },
  {
    "title": "‘Dances With Wolves’ Actor Graham Greene Dies at 73",
    "link": "https://www.nytimes.com/2025/09/02/movies/graham-greene-dead.html",
    "summary": "The First Nations actor, who appeared in “Dances With Wolves” and other Hollywood blockbusters, remained active in Canadian film, theater and television."
  }
]