[
  {
    "title": "With Mideast Deal, Trump Is on the Brink of a Major Diplomatic Accomplishment",
    "link": "https://www.nytimes.com/2025/10/08/us/politics/trump-mideast-visit-israel-gaza.html",
    "summary": "For President Trump, success in brokering a cease-fire is the ultimate test of his self-described goal as a deal maker and a peacemaker."
  },
  {
    "title": "What We Know About the Remaining Hostages in Gaza",
    "link": "https://www.nytimes.com/2025/10/08/world/middleeast/hostages-israel-hamas-gaza.html",
    "summary": "Israel says that there are still about 20 living hostages in Gaza, along with the bodies of around 25 others. Details of their release remain unclear."
  },
  {
    "title": "Texas’ Blue-State Deployments Shred Relations Between Governors",
    "link": "https://www.nytimes.com/2025/10/08/us/politics/national-guard-governors.html",
    "summary": "State leaders have prided themselves on finding bipartisan consensus, but President Trump’s deployment of National Guard troops from Texas to Illinois has ripped the veneer off that image."
  },
  {
    "title": "Before Trump Ordered in Troops, Federal Officers Called Portland Protests ‘Low Energy’",
    "link": "https://www.nytimes.com/2025/10/08/us/politics/trump-portland-troops.html",
    "summary": "Oregon officials say the atmosphere outside an ICE building that has drawn daily demonstrations since June has grown worse since the president’s threats."
  },
  {
    "title": "Rutgers Expert on Antifa Tries to Flee to Spain After Death Threats",
    "link": "https://www.nytimes.com/2025/10/08/nyregion/rutgers-professor-threats-antifa.html",
    "summary": "Mark Bray was teaching courses on antifascism. Turning Point USA accused of him belonging to antifa, which he denies. His flight to Spain was canceled abruptly on Wednesday night."
  },
  {
    "title": "Candidates for N.J. Governor Clash Over Opioids, Trump and Taxes",
    "link": "https://www.nytimes.com/2025/10/08/nyregion/new-jersey-governors-debate-ciattarelli-sherrill.html",
    "summary": "Jack Ciattarelli, the Republican nominee, and Representative Mikie Sherrill, the Democrat, described starkly different visions for the state in a debate Wednesday."
  },
  {
    "title": "G.O.P. Blocks Bid to Halt Trump’s Attacks in the Caribbean Sea",
    "link": "https://www.nytimes.com/2025/10/08/us/politics/trump-republicans-war-powers-caribbean-venezuela.html",
    "summary": "Republicans in the Senate blocked a measure that would terminate the president’s legally disputed campaign targeting alleged drug runners."
  },
  {
    "title": "Qatar Pushes U.S.-Venezuela Diplomacy as Trump Focuses on Military Action",
    "link": "https://www.nytimes.com/2025/10/08/us/politics/venezuela-trump-qatar.html",
    "summary": "The Pentagon has deployed 10,000 U.S. troops to the region, most of them to bases in Puerto Rico, a senior military official said."
  },
  {
    "title": "‘Les Misérables’ at 40: The Unlikely Story of a Hit",
    "link": "https://www.nytimes.com/2025/10/08/theater/les-miserables-40th-anniversary.html",
    "summary": "Critics initially panned it, but public love for the musical with songs like “One Day More” and “On My Own” has kept it going strong for four decades — and counting."
  },
  {
    "title": "Katie Porter Goes Viral for ‘Unhappy’ TV Interview in California Governor’s Race",
    "link": "https://www.nytimes.com/2025/10/08/us/katie-porter-goes-viral-for-unhappy-tv-interview-in-california-governors-race.html",
    "summary": "The former Democratic congresswoman, known for her own grilling of executives on Capitol Hill, threatened to abandon an interview after she was asked several follow-up questions."
  },
  {
    "title": "In Germany’s Depressed East, Tanks Are the Lesser of Two Evils",
    "link": "https://www.nytimes.com/2025/10/09/world/europe/germany-tanks-rearmament.html",
    "summary": "Even leaders from the far-right Alternative for Germany party, which opposes aid to Ukraine, have embraced the jobs that come with new weapons production."
  },
  {
    "title": "Chinese Surgeons Perform First Pig-to-Human Liver Transplant",
    "link": "https://www.nytimes.com/2025/10/09/health/chinese-surgeons-first-pig-human-liver-transplant.html",
    "summary": "The transplanted portion of the genetically modified pig liver was removed after 38 days, and the patient, who had advanced liver cancer and cirrhosis, died several months later."
  },
  {
    "title": "Jonathan Rinderknecht Arrested in Connection With Palisades Fire in Los Angeles",
    "link": "https://www.nytimes.com/2025/10/08/us/los-angeles-palisades-fire-arrest.html",
    "summary": "Officials said that Jonathan Rinderknecht, 29, of Melbourne, Fla., had intentionally set a fire that rekindled a week later into a devastating blaze that killed 12 people."
  },
  {
    "title": "Who is Jonathan Rinderknecht? What We Know About The Palisades Fire Arrest",
    "link": "https://www.nytimes.com/2025/10/08/us/palisades-fire-arrest-jonathan-rinderknecht.html",
    "summary": "Federal officials arrested a man they said started a small blaze in January that later rekindled and grew into the fire that devastated Pacific Palisades."
  },
  {
    "title": "James Comey, Former FBI Director, Pleads Not Guilty and Will Seek to Dismiss Charges as Vindictive",
    "link": "https://www.nytimes.com/2025/10/08/us/politics/james-comey-arraignment.html",
    "summary": "The former F.B.I. director appeared in a brief hearing in federal court. His lawyers sought clarity on the details of a case filed under pressure from President Trump."
  },
  {
    "title": "Comey’s Two Legal Challenges to His Indictment, Explained",
    "link": "https://www.nytimes.com/2025/10/08/us/politics/comey-legal-challenges-explained.html",
    "summary": "A lawyer for the former F.B.I. director said he would accuse the Justice Department of malicious and selective prosecution and contend that a U.S. attorney was illegally appointed."
  },
  {
    "title": "These Democrats Could Hold the Key to Ending the Shutdown",
    "link": "https://www.nytimes.com/2025/10/08/us/politics/key-democrats-ending-shutdown.html",
    "summary": "As the federal closure slides into a second week, Republicans are working to peel off five more Democratic senators to join them in voting to reopen the government."
  },
  {
    "title": "Inside the Capitol, a Heated Spat Over the Shutdown and Epstein",
    "link": "https://www.nytimes.com/2025/10/08/us/politics/mike-johnson-spat-democrats-shutdown-epstein.html",
    "summary": "A pair of Democratic senators confronted the Republican speaker of the House over his refusal to swear in a colleague during the shutdown."
  },
  {
    "title": "Stephen Miller Cited ‘Plenary Authority,’ Then Paused. Conspiracies Started Flying.",
    "link": "https://www.nytimes.com/2025/10/08/business/media/stephen-miller-plenary-authority-cnn-conspiracies.html",
    "summary": "Online skeptics wondered if Mr. Miller had caught himself saying something he did not mean to. CNN says there was a technical glitch."
  },
  {
    "title": "How Zohran Mamdani Came to Embrace the Palestinian Cause",
    "link": "https://www.nytimes.com/2025/10/08/nyregion/zohran-mamdani-israel-palestine.html",
    "summary": "As Mr. Mamdani seeks to reassure New York City he is open to compromise, his views on Israel and Palestinians have been the biggest exception."
  },
  {
    "title": "Mamdani Rides Slow Bus to ‘Fast and Free’ Buses Event",
    "link": "https://www.nytimes.com/2025/10/08/nyregion/mamdani-bus-plan-nyc-mayor.html",
    "summary": "Zohran Mamdani, the leading candidate in the race to be New York City’s next mayor, held a campaign event on a bus that crawled across Midtown Manhattan to highlight a signature proposal."
  },
  {
    "title": "MacArthur Foundation Announces 2025 ‘Genius Grant’ Winners",
    "link": "https://www.nytimes.com/2025/10/08/arts/design/macarthur-foundation-2025-genius-grant-winners.html",
    "summary": "Twenty-two people in a broad spectrum of the arts and sciences were awarded the fellowship, which comes with an $800,000 stipend."
  },
  {
    "title": "What Civil Society Can Do to Beat Trumpism",
    "link": "https://www.nytimes.com/2025/10/08/opinion/trump-universities-compact-civil-society.html",
    "summary": "People and institutions of civil society must coordinate against him."
  },
  {
    "title": "Radosław Sikorski: Putin Is Escalating His War",
    "link": "https://www.nytimes.com/2025/10/09/opinion/putin-poland-radoslaw-sikorski.html",
    "summary": "The leadership of Russia must understand that its attempt to rebuild Europe’s last empire is doomed to fail."
  },
  {
    "title": "Posts Calling Luigi Mangione Guilty Did No Harm, Top U.S. Prosecutor Argues",
    "link": "https://www.nytimes.com/2025/10/08/nyregion/luigi-mangione-justice-department-posts.html",
    "summary": "A judge had demanded an explanation for why Justice Department officials were publicly expressing views on Luigi Mangione’s guilt in the killing of a health insurance executive."
  },
  {
    "title": "Oakland, California, Residents Are Fed Up With Illegal Dumping",
    "link": "https://www.nytimes.com/2025/10/08/us/oakland-california-trash-garbage.html",
    "summary": "Many residents say that illegal dumping has inundated Oakland, Calif., a city with more garbage than almost anywhere else."
  },
  {
    "title": "Texts from Jay Jones, Democratic Attorney General Candidate, Roil Virginia Governor’s Race",
    "link": "https://www.nytimes.com/2025/10/08/us/jay-jones-text-messages-va-attorney-general.html",
    "summary": "In the messages, the Democratic candidate for attorney general, Jay Jones, discusses the hypothetical killing of a Republican lawmaker."
  },
  {
    "title": "Pope Leo Urges U.S. Bishops to Support Immigrants as Trump Escalates Deportations",
    "link": "https://www.nytimes.com/2025/10/08/us/pope-leo-immigration-trump.html",
    "summary": "The pope conveyed the message as President Trump escalated his deportation campaign, including in Chicago, the pope’s hometown."
  }
]