[
  {
    "title": "Reaction to Trump’s Racist Post Shows He Is Not Always Immune to Politics",
    "link": "https://www.nytimes.com/2026/02/07/us/politics/trump-social-post-reaction.html",
    "summary": "With the midterm elections nearing, President Trump has found himself in the uncomfortable position of backtracking, even if only by degrees, at key moments."
  },
  {
    "title": "Fake Post About Racist Video Looked to Be Trump’s on Truth Social",
    "link": "https://www.nytimes.com/2026/02/07/business/trump-truth-social-fake-post-obamas.html",
    "summary": "The post, which spread widely, appeared to describe the president’s rationale for deleting a racist video about the Obamas that he had shared."
  },
  {
    "title": "Binance Gives Trump Family’s Crypto Firm a Leg Up",
    "link": "https://www.nytimes.com/2026/02/07/business/binance-trump-crypto.html",
    "summary": "Ties between the exchange and the president’s company, World Liberty Financial, have only strengthened since the president pardoned Binance’s founder, Changpeng Zhao."
  },
  {
    "title": "Files Detail Epstein’s Dealings With Commerce Secretary Howard Lutnick",
    "link": "https://www.nytimes.com/2026/02/07/nyregion/lutnick-epstein-files-dealings.html",
    "summary": "Mr. Lutnick had claimed to have distanced himself from Jeffrey Epstein even before the disgraced financier was convicted of a sex crime in Florida."
  },
  {
    "title": "Washington Post C.E.O. Will Lewis Steps Down After Stormy Tenure",
    "link": "https://www.nytimes.com/2026/02/07/technology/washington-post-will-lewis.html",
    "summary": "His departure came days after the company cut 30 percent of the staff. He will be replaced in the interim by Jeff D’Onofrio, the chief financial officer, the company said."
  },
  {
    "title": "Top ICE Lawyer in Minnesota Departs as Immigration Lawsuits Overwhelm Courts",
    "link": "https://www.nytimes.com/2026/02/07/us/ice-lawyer-quits-minnesota.html",
    "summary": "Jim Stolley, the chief counsel for U.S. Immigration and Customs Enforcement in Minnesota, has left as government prosecutors grapple with a crush of cases."
  },
  {
    "title": "A Month After Renee Good’s Killing, Her Partner Makes First Public Appearance at Memorial",
    "link": "https://www.nytimes.com/2026/02/07/us/renee-good-partner-memorial-minneapolis.html",
    "summary": "Becca Good attended a memorial for Renee Good, offering words of compassion and resilience to the crowd gathered in a snow-covered Minneapolis park."
  },
  {
    "title": "At Least 50 Arrested After Protests Escalate Outside Minnesota Federal Building",
    "link": "https://www.nytimes.com/2026/02/07/us/minneapolis-immigration-protesters-arrested-whipple-building.html",
    "summary": "The Whipple Federal Building has become both a staging ground for immigration agents and a hub for demonstrations against the crackdown in the Twin Cities."
  },
  {
    "title": "A Super Bowl in Silicon Valley Filled With Valley Billionaires",
    "link": "https://www.nytimes.com/2026/02/07/business/super-bowl-tickets-billionaires.html",
    "summary": "A who’s who of celebrities will join them. Just a little over 25 percent of the seats for the game will be for regular fans, with the cheapest ticket now selling for more than $4,000."
  },
  {
    "title": "Thousands in Mississippi Remain Without Power Two Weeks After Winter Storm",
    "link": "https://www.nytimes.com/2026/02/07/us/mississippi-power-outages-winter-storm.html",
    "summary": "A majority of those who lost service have had their power restored. But thousands in more rural areas remain in darkness, according to a local utility."
  },
  {
    "title": "NYC Is Still Covered in Grimy Snow and Ice. Will It Ever Melt?",
    "link": "https://www.nytimes.com/2026/02/07/nyregion/nyc-snow-ice-dirt.html",
    "summary": "Ah, those first wondrous hours of a snowstorm in New York. Two weeks later, the sidewalks are sooty and treacherous, and the parked cars are frozen in surrender."
  },
  {
    "title": "What to Know About the Cold Snap in NYC This Weekend",
    "link": "https://www.nytimes.com/2026/02/07/nyregion/nyc-weather-extreme-cold-warning.html",
    "summary": "Cold-weary New Yorkers will get hit by another blast of frigid weather. Here’s what to expect, and what the city is doing to protect the vulnerable."
  },
  {
    "title": "The Demise of U.S.A.I.D. Was a Warning",
    "link": "https://www.nytimes.com/2026/02/08/opinion/usaid-humanitarian-aid-america.html",
    "summary": "The brutality of U.S.A.I.D.’s closure and the disregard for the human toll betrayed a vision of a crueler, meaner, more insular world."
  },
  {
    "title": "Ultraprocessed, Industrial Food Is Fine",
    "link": "https://www.nytimes.com/2026/02/08/opinion/food-industrial-local-organic.html",
    "summary": "We can’t feed 340 million Americans with local, organic and low-tech dishes."
  },
  {
    "title": "Savannah Guthrie, in New Video, Promises to Pay for Her Mother’s Return",
    "link": "https://www.nytimes.com/2026/02/07/us/savannah-guthrie-nancy-guthrie-video-message.html",
    "summary": "The “Today” show anchor, in a message on social media with her siblings, said the return of their mother Nancy “is the only way we will have peace.”"
  },
  {
    "title": "In Bid to Lead Thailand, a Progressive Party Softens Its Image",
    "link": "https://www.nytimes.com/2026/02/07/world/asia/thailand-election-peoples-party.html",
    "summary": "Sunday’s election is a test for the progressive, pro-democracy movement in Thailand, which has been blocked from taking power despite success at the polls."
  },
  {
    "title": "Brad Arnold, Rocker Who Fronted 3 Doors Down, Dies at 47",
    "link": "https://www.nytimes.com/2026/02/07/arts/music/brad-arnold-three-doors-down-dead.html",
    "summary": "He wrote the band’s breakout hit, “Kryptonite,” in a high school math class, and would go on to be nominated for three Grammy Awards."
  },
  {
    "title": "Japan’s Leader Makes a Bold Election Bet. Here’s What to Know.",
    "link": "https://www.nytimes.com/2026/02/07/world/asia/japan-election-takaichi-what-to-know.html",
    "summary": "Sanae Takaichi, who has proved popular as the first woman to lead Japan as prime minister, hopes to bolster her power in a snap election. But she faces hurdles."
  }
]