[
  {
    "title": "Mamdani’s Success Spotlights a Deepening Rupture Among U.S. Jews",
    "link": "https://www.nytimes.com/2025/06/25/us/politics/zohran-mamdani-jewish-voters.html",
    "summary": "While Zohran Mamdani won over some Jewish supporters, other Jewish Democrats suggested that concerns about their community’s safety are being dismissed in a movement and a city they helped build."
  },
  {
    "title": "As Donors Work Against Mamdani, Top Democrats Stop Short of Backing Him",
    "link": "https://www.nytimes.com/2025/06/25/nyregion/mamdani-democrats-schumer-jeffries.html",
    "summary": "After Zohran Mamdani’s performance in the New York City mayoral primary, Republicans and suburban Democrats attacked him, and party leaders seemed to be hedging their bets."
  },
  {
    "title": "Young Muslim Voters in NYC Loved Zohran Mamdani. Their Parents Listened.",
    "link": "https://www.nytimes.com/2025/06/25/nyregion/nyc-voters-muslim-zohran-mamdani.html",
    "summary": "Many Muslim Americans in New York City were impressed by Mr. Mamdani’s campaign and thrilled at being able to see themselves reflected in a mayoral candidate."
  },
  {
    "title": "In New Assessment, C.I.A. Chief Says U.S. Strikes ‘Severely Damaged’ Iranian Program",
    "link": "https://www.nytimes.com/2025/06/25/us/politics/trump-iran-nuclear.html",
    "summary": "The administration suggested an initial report of less-severe damage was already outdated as the president continued to defend his assertion that key facilities had been “obliterated,” though no intelligence official has yet directly echoed his view."
  },
  {
    "title": "Where Is Iran’s Supreme Leader, Ayatollah Ali Khamenei?",
    "link": "https://www.nytimes.com/2025/06/25/world/middleeast/where-is-khamenei-iran-supreme-leader.html",
    "summary": "Ayatollah Ali Khamenei has not been seen publicly or heard from in nearly a week. That absence has surprised and unnerved everyone from political insiders to the general public."
  },
  {
    "title": "Iran’s Attack on a U.S. Base in Qatar Is a Nightmare Come True for Gulf States",
    "link": "https://www.nytimes.com/2025/06/25/world/middleeast/gulf-states-iran-attack-us-qatar-base.html",
    "summary": "The countries have long worried about being sucked into regional war as they juggle relations with Washington, their security guarantor, while seeking to improve ties with Tehran."
  },
  {
    "title": "How Trump’s Strike on Iran Might Affect China’s Calculus on Taiwan",
    "link": "https://www.nytimes.com/2025/06/26/world/asia/iran-china-trump-taiwan.html",
    "summary": "By attacking Iran, President Trump has shown he is willing to engage in a distant war. This raises questions in Beijing about what he might risk for Taiwan."
  },
  {
    "title": "RFK Jr.’s Handpicked Vaccine Advisers Are Set to Meet for the First Time",
    "link": "https://www.nytimes.com/2025/06/25/health/vaccines-cdc-acip-kennedy.html",
    "summary": "The reconstituted C.D.C. panel will revisit the standard vaccination schedule. The former head of an anti-vaccine group is now a special federal employee."
  },
  {
    "title": "Emil Bove Denies Suggesting Justice Dept. Ignore Court Orders in Deportation Cases",
    "link": "https://www.nytimes.com/2025/06/25/us/politics/emil-bove-confirmation.html",
    "summary": "During a confirmation hearing for an appeals court opening, Emil Bove III was repeatedly questioned about a whistle-blower complaint that portrayed political appointees as willing to mislead judges."
  },
  {
    "title": "Trump Urges Congress to ‘Kill’ Voice of America as Its Leader Defends Gutting It",
    "link": "https://www.nytimes.com/2025/06/25/us/politics/trump-lake-voice-of-america.html",
    "summary": "In a heated hearing, Kari Lake, the Trump ally in charge of the federally funded international broadcasting network, called the media agency “a rotten piece of fish” that should be defunded."
  },
  {
    "title": "Usha Vance’s New Life in Trump’s Washington",
    "link": "https://www.nytimes.com/2025/06/25/us/politics/usha-vance.html",
    "summary": "Old friends are bewildered by the turn taken by the second lady, a onetime Democrat and former litigator for a San Francisco firm. Others say she’s happy in the role."
  },
  {
    "title": "In a Win for Trump, NATO Agrees to a Big Increase in Military Spending",
    "link": "https://www.nytimes.com/2025/06/25/world/europe/nato-increase-military-spending-trump.html",
    "summary": "President Trump has long pushed the European allies to be more self-sufficient on defense, relying less on American protection. NATO committed to a major increase over the next decade."
  },
  {
    "title": "They Had Come to Graduate. Their Minds Were on a Student Held by ICE.",
    "link": "https://www.nytimes.com/2025/06/25/nyregion/immigrant-students-graduation-ice.html",
    "summary": "Dylan Lopez Contreras was arrested by immigration authorities. This week, he was remembered during the commencement for a school devoted to immigrants."
  },
  {
    "title": "Trump Administration Sues Maryland Federal Judges Over Immigration Rule",
    "link": "https://www.nytimes.com/2025/06/25/us/politics/trump-maryland-judges-lawsuit.html",
    "summary": "Lawyers for the administration said that a rule issued by a judge in Maryland intruded on the White House’s inherent powers to “enforce the nation’s immigration laws.”"
  },
  {
    "title": "This Vermont Soccer Team Plays for the Planet",
    "link": "https://www.nytimes.com/2025/06/24/climate/vermont-green-soccer-climate.html",
    "summary": "The Vermont Green Football Club champions environmental work and draws sold-out crowds, with the help of free ice cream."
  },
  {
    "title": "American Airlines Passenger Recounts ‘Tense’ Landing After Engine Sparks",
    "link": "https://www.nytimes.com/2025/06/25/us/american-airlines-flight-engine-issue.html",
    "summary": "The American Airlines flight with 153 passengers, which was headed to Charlotte, N.C., returned to Las Vegas shortly after takeoff. No one was injured."
  },
  {
    "title": "Did Baby Talk Give Rise to Language?",
    "link": "https://www.nytimes.com/2025/06/25/science/language-evolution-apes.html",
    "summary": "The way that human adults talk to young children is unique among primates, a new study found. That might be one secret to our species’ grasp of language."
  },
  {
    "title": "The Ayatollah Has a Plan",
    "link": "https://www.nytimes.com/2025/06/26/opinion/iran-nuclear-ayatollah-cease-fire.html",
    "summary": "Iran’s supreme leader believes the country can outlast the West in a war of attrition."
  },
  {
    "title": "‘The U.S. Cannot Solve All the World’s Problems’",
    "link": "https://www.nytimes.com/2025/06/25/opinion/american-aid-africa.html",
    "summary": "We can’t fix everything. But if it’s cheap and easy to save lives, why wouldn’t we?"
  },
  {
    "title": "Soaring Temperatures in N.Y.C. Land More Than 100 in Emergency Rooms",
    "link": "https://www.nytimes.com/2025/06/25/nyregion/heat-related-illness-new-york-city.html",
    "summary": "Not since 2019 have so many New Yorkers in a single day sought emergency medical attention for heat-related illnesses."
  },
  {
    "title": "17-Year-Old Fatally Shot in the Bronx After Fight Over a Water Gun",
    "link": "https://www.nytimes.com/2025/06/25/nyregion/shooting-bronx-park-water-gun.html",
    "summary": "Darrell Harris, a high school student, died after an encounter with men who were having a water gun fight at a local park, an official with knowledge of the incident said."
  },
  {
    "title": "U.S. Accuses Three Mexican Financial Firms of Aiding Fentanyl Trade",
    "link": "https://www.nytimes.com/2025/06/25/world/americas/mexico-financial-firms-fentanyl.html",
    "summary": "The U.S. Treasury found ties between drug cartels and the Mexican companies, including a brokerage firm controlled by a former chief of staff of Andrés Manuel López Obrador."
  },
  {
    "title": "At Least 8 Killed as Protesters Battle Police in Kenya",
    "link": "https://www.nytimes.com/2025/06/25/world/africa/kenya-protests-ruto.html",
    "summary": "Demonstrators joined antigovernment marches across the country a year after huge rallies against a contentious tax plan left more than 60 people dead."
  }
]