[
  {
    "title": "Mayor Mamdani Appoints a Team of Government Veterans",
    "link": "https://www.nytimes.com/2026/01/01/nyregion/mamdani-administration-appointments.html",
    "summary": "Zohran Mamdani has stocked his administration with seasoned officials, in part to allay concerns about his inexperience and left-wing stances."
  },
  {
    "title": "Crans-Montana is a Historic Swiss Ski Resort TownPopular with International Tourists",
    "link": "https://www.nytimes.com/2026/01/01/world/europe/fire-crans-montana.html",
    "summary": "Known for its gourmet food, luxury stores, and for hosting major sporting events, the high-end resort was acquired by Vail Resorts in 2024."
  },
  {
    "title": "Threat to Suspend Aid for Minnesota Child-Care Centers Rattles Families",
    "link": "https://www.nytimes.com/2026/01/01/us/minnesota-child-care-funding-impact-fraud.html",
    "summary": "After the federal government threatened to withhold funds for Minnesota’s child-care program, citing fraud concerns, parents and providers warned that the effects could be dire."
  },
  {
    "title": "Toby Morton, a Comedy Writer, Owns the Trump Kennedy Center URL",
    "link": "https://www.nytimes.com/2026/01/01/us/politics/trump-kennedy-center-website-toby-morton.html",
    "summary": "A comedy writer bought the web domain TrumpKennedyCenter.org and the satirical site he created is drawing attention amid the backlash over the institution’s renaming."
  },
  {
    "title": "Another New Year at War: Ukraine’s Troops Doubt It Will Be the Last",
    "link": "https://www.nytimes.com/2026/01/01/world/europe/ukraine-russia-new-years-day-donetsk.html",
    "summary": "After a year of Russian advances, the goal for 2026 is simply to survive, said one officer in eastern Ukraine. “It’s hard to make any plans,” he said."
  },
  {
    "title": "CI.A. Says Ukraine Did Not Target Putin’s Home in a Drone Strike, Contradicting Russia’s Claims",
    "link": "https://www.nytimes.com/2025/12/31/us/politics/ukraine-putin-home-drone-strike-cia.html",
    "summary": "The assessment rebutted a claim that the Russian leader made to President Trump in a phone call this week."
  },
  {
    "title": "He’s Chevy Chase, and He’s Still Like That",
    "link": "https://www.nytimes.com/2026/01/01/arts/television/hes-chevy-chase-and-hes-still-like-that.html",
    "summary": "The famously prickly comedian found a sympathetic adversary in the director of a CNN documentary about him. Their conversation with a reporter was … spirited."
  },
  {
    "title": "How Two Powerful U.S. Allies Came to Blows in Yemen",
    "link": "https://www.nytimes.com/2026/01/01/world/middleeast/uae-saudi-arabia-yemen.html",
    "summary": "Tensions between Saudi Arabia and the United Arab Emirates burst into the open this week with an unusually direct confrontation that has global implications."
  },
  {
    "title": "90 Minutes to Give Baby Luna a New Heart",
    "link": "https://www.nytimes.com/2026/01/01/well/90-minutes-to-give-baby-luna-a-new-heart.html",
    "summary": "After eight years of training, Dr. Maureen McKiernan made her debut as the lead surgeon on an infant heart transplant — an operation on the edge of what’s possible."
  },
  {
    "title": "Space Events 2026: NASA’s Artemis II Moon Mission, Summer Eclipse and More",
    "link": "https://www.nytimes.com/2025/12/30/science/space-nasa-spacex-blue-origin-astronomy.html",
    "summary": "In 2026, there will be journeys to the moon and Mars, new visions of the cosmos and a solar eclipse that might be worth traveling for."
  },
  {
    "title": "Even the Sky May Not Be the Limit for A.I. Data Centers",
    "link": "https://www.nytimes.com/2026/01/01/technology/space-data-centers-ai.html",
    "summary": "Some tech leaders are concerned that the artificial intelligence race will exhaust available land and energy. The solution might lie in orbit."
  },
  {
    "title": "3 Years After a Toddler’s Parents Fled Kabul, a Reunion Is Still on Hold",
    "link": "https://www.nytimes.com/2025/12/31/us/politics/afghanistan-visas.html",
    "summary": "The twisting saga that separated the Hashemis in Oregon from their infant son has reached a new dead end: President Trump’s hold on all visas to the United States."
  },
  {
    "title": "Oil Tanker Fleeing the Coast Guard Now Listed in Russian Ship Database",
    "link": "https://www.nytimes.com/2025/12/31/us/politics/russia-oil-tanker-venezuela.html",
    "summary": "The listing could make it more challenging for U.S. forces to board the ship, which an arm of the Kremlin’s maritime authority says is now flying the Russian flag."
  },
  {
    "title": "Coast Guard Searches for Survivors After More Boat Strikes",
    "link": "https://www.nytimes.com/2025/12/31/us/politics/coast-guard-survivors-boat-strikes.html",
    "summary": "The U.S. military attacked a convoy of three boats in the eastern Pacific on Tuesday, and two more on Wednesday, as part of the Trump administration’s campaign against people suspected of drug trafficking."
  },
  {
    "title": "A Year of Fires and Floods in Southern California",
    "link": "https://www.nytimes.com/2026/01/01/us/los-angeles-fires-floods.html",
    "summary": "The floods that struck last week just before the first anniversary of the January wildfires show how extreme weather is defining life in the L.A. region."
  },
  {
    "title": "Behind Oklahoma Cannabis Farms, New Yorkers With Ties to Beijing",
    "link": "https://www.nytimes.com/2025/12/31/us/ny-china-hometown-association-oklahoma-marjiuana.html",
    "summary": "In China, trafficking marijuana is punishable by death. But in the United States, it has become a lucrative sideline for some favored sons of the motherland."
  },
  {
    "title": "‘Stranger Things’ Has Ended. What Happened in the Series Finale?",
    "link": "https://www.nytimes.com/2026/01/01/arts/television/stranger-things-finale-ending.html",
    "summary": "There was a lot to tie up after five seasons and nearly 10 years, and the show gave itself another two hours to do it. Here are the major events."
  },
  {
    "title": "The Two Questions I Wish We’d Stop Asking in 2026",
    "link": "https://www.nytimes.com/2026/01/01/opinion/podcasts-interviews-questions.html",
    "summary": "How did we get here? I don’t want to know."
  },
  {
    "title": "Why New York City Needs Someone Like Mamdani",
    "link": "https://www.nytimes.com/2026/01/01/opinion/zohran-mamdani-mayor-new-york.html",
    "summary": "The new mayor is an entirely familiar type of New York politician."
  },
  {
    "title": "Hope in a Time of Cynicism",
    "link": "https://www.nytimes.com/2026/01/01/briefing/hope-in-a-time-of-cynicism.html",
    "summary": "At a moment when Americans are distrusting and fearful, we examine the psychology of hope."
  },
  {
    "title": "Guinea’s Coup Leader Wins Election After Barring Leading Opponents",
    "link": "https://www.nytimes.com/2026/01/01/world/africa/guinea-election-mamady-doumbouya.html",
    "summary": "Col. Mamady Doumbouya, who seized power more than four years ago, took over 80 percent of the vote, according to a government-controlled agency that he set up."
  },
  {
    "title": "Repeat Moviegoers Help Hollywood Eke Out a Slightly Better 2025",
    "link": "https://www.nytimes.com/2026/01/01/business/cinema-hollywood-2025-ticket-sales.html",
    "summary": "Ticket sales in North America totaled $8.9 billion for the year, up 2 percent from 2024. But the box office remains far below prepandemic levels."
  },
  {
    "title": "A Monumental Church in Amsterdam Is Ravaged by Flames on New Year’s Day",
    "link": "https://www.nytimes.com/2026/01/01/world/europe/amsterdam-fire-church-new-years.html",
    "summary": "Local residents were evacuated after a fire broke out at the Vondelkerk shortly after midnight. The cause of the blaze has not yet been confirmed."
  },
  {
    "title": "Historic Snowstorm Blankets Syracuse Just in Time for the New Year",
    "link": "https://www.nytimes.com/2025/12/31/nyregion/syracuse-record-snow.html",
    "summary": "Syracuse, N.Y., has received nearly twice its usual monthly amount of snow in December."
  }
]