[
  {
    "title": "Putin Sees Ukraine Through a Lens of Grievance Over Lost Glory",
    "link": "https://www.nytimes.com/2025/08/17/world/europe/russia-ukraine-putin-alaska.html",
    "summary": "Speaking after Friday’s summit, President Putin again implied that the war is all about Russia’s diminished status since the fall of the Soviet Union."
  },
  {
    "title": "Ukrainians Fleeing Russia’s Attacks Say the Alaska Summit Was an Insult",
    "link": "https://www.nytimes.com/2025/08/17/world/europe/ukraine-evacuation-donetsk.html",
    "summary": "Evacuees at a shelter in eastern Ukraine reacted angrily to talk that land that has long been theirs could be given to Russia in exchange for peace."
  },
  {
    "title": "Ukraine Weighs Trump’s Offer of Security Guarantees With Caution",
    "link": "https://www.nytimes.com/2025/08/17/world/europe/ukraine-security-guarantees-trump-russia.html",
    "summary": "President Trump offered security guarantees to deter future Russian aggression. But the offer was vague, prompting Kyiv to seek clarity."
  },
  {
    "title": "At Trump and Putin Summit, an Alaskan Halibut Dish Gets a Cameo",
    "link": "https://www.nytimes.com/2025/08/16/dining/trump-putin-alaska-halibut.html",
    "summary": "Halibut Olympia, a Tuesday-night kind of recipe, was part of the planning (if not the eating) at the Friday meeting."
  },
  {
    "title": "Trump’s Selective Stance on Justice: Redemption for Some, Scorn for Others",
    "link": "https://www.nytimes.com/2025/08/17/us/politics/trump-dc-criminals-justice.html",
    "summary": "President Trump, himself a felon, has shown particular leniency to criminals he seems to identify with — people who are white or wealthy, or who rioted in his name on Jan. 6, 2021."
  },
  {
    "title": "Jeanine Pirro Takes on Prosecutor Role in Trump’s D.C. Crackdown",
    "link": "https://www.nytimes.com/2025/08/16/us/politics/jeanine-pirro-trump-dc-police.html",
    "summary": "As the U.S. attorney in Washington, Jeanine Pirro is a central player in a clash that could define her legacy: the president’s takeover of local law enforcement."
  },
  {
    "title": "Israel Says Iranian Agents Recruited Dozens of Its Citizens",
    "link": "https://www.nytimes.com/2025/08/17/world/middleeast/israel-says-iranian-agents-recruited-dozens-of-its-citizens.html",
    "summary": "The agents cajoled people into acts of sabotage and even assassination plots. The cases have raised questions about greed, gullibility and loyalty."
  },
  {
    "title": "Israelis Join Nationwide Rallies to Call for Release of Hostages",
    "link": "https://www.nytimes.com/2025/08/17/world/middleeast/israel-rallies-labor-strike.html",
    "summary": "It was unclear how many people would join the planned day of action, which was expected to culminate with a large evening demonstration."
  },
  {
    "title": "U.S. Pauses Visitor Visas for Gazans After Laura Loomer Posts",
    "link": "https://www.nytimes.com/2025/08/16/us/politics/gaza-visitor-visas-medical-trump-loomer.html",
    "summary": "The move blocked a pathway for those seeking medical care in the United States, including young children, who have arrived in recent weeks with serious conditions."
  },
  {
    "title": "Penn & Teller’s Secret to a 50-Year Partnership",
    "link": "https://www.nytimes.com/2025/08/17/arts/television/penn-teller-magicians-50-years.html",
    "summary": "As their magic act hits 50 years, they’re bigger than ever. They say their secret is not to socialize. But misdirection is also their love language."
  },
  {
    "title": "Redistricting Push Would Further Divide a Polarized Congress",
    "link": "https://www.nytimes.com/2025/08/17/us/politics/redistricting-polarization-congress.html",
    "summary": "Many state delegations are already under single-party control. New maps could tighten the partisan grip while decreasing the importance of general elections."
  },
  {
    "title": "Protesters Gather to Oppose Trump’s Push on Redistricting",
    "link": "https://www.nytimes.com/2025/08/16/us/politics/texas-democrats-redistricting-protests.html",
    "summary": "Thousands assembled around the country to demonstrate against a Republican effort to redraw congressional maps in their favor for 2026."
  },
  {
    "title": "Three Are Killed in Shooting at Crown Heights Bar",
    "link": "https://www.nytimes.com/2025/08/17/nyregion/brooklyn-shooting-nightclub.html",
    "summary": "Eight others were taken to the hospital with injuries after the early morning shooting in Brooklyn."
  },
  {
    "title": "North Carolina Confederate Monument Goes Too Far, Lawsuit Says",
    "link": "https://www.nytimes.com/2025/08/17/us/trump-confederate-monuments-south-carolina.html",
    "summary": "A long battle over the pro-slavery words on a Tyrrell County statue intensifies as the Trump administration reclaims Confederate imagery."
  },
  {
    "title": "They’re Stuffed Animals. They’re Also A.I. Chatbots.",
    "link": "https://www.nytimes.com/2025/08/15/arts/ai-toys-curio-grem.html",
    "summary": "New types of cuddly toys, some for children as young as 3, are being sold as an alternative to screen time — and to parental attention."
  },
  {
    "title": "The C.E.O. of Duolingo Wants to Have a Conversation About A.I.",
    "link": "https://www.nytimes.com/2025/08/17/business/duolingo-luis-von-ahn.html",
    "summary": "The language-learning app with more than 100 million users has embraced artificial intelligence but has also faced consumer backlash for it."
  },
  {
    "title": "Evo Morales, Barred from Bolivia’s Election, Urges Null Votes",
    "link": "https://www.nytimes.com/2025/08/15/world/americas/bolivia-election-evo-morales.html",
    "summary": "Despite being barred from running again for president and being sought for arrest, a towering figure of Bolivian politics is trying to rally supporters to cast null votes."
  },
  {
    "title": "What to Know About Bolivia’s Presidential Election",
    "link": "https://www.nytimes.com/2025/08/17/world/americas/bolivia-presidential-election-explained.html",
    "summary": "An economic crisis and political infighting among the country’s long-dominant socialist party could pave the way for the first right-wing president in decades."
  },
  {
    "title": "Sure, These Comics Can Make You Laugh. But Can They Hit a Jump Shot?",
    "link": "https://www.nytimes.com/2025/08/17/nyregion/comedians-basketball-adam-sandler.html",
    "summary": "A weekly pickup basketball game in Manhattan is populated almost entirely by professional funny people from all corners of the comedy landscape — stand-up comedians on their way up, comics past their primes and even industry A-listers."
  },
  {
    "title": "Trump’s Domestic Deployments Are Dangerous. For the Military.",
    "link": "https://www.nytimes.com/2025/08/17/opinion/trump-national-guard-washington.html",
    "summary": "The nation’s most trusted institution must not be reduced to a political tool."
  },
  {
    "title": "The Insidious Creep of Trump’s Speaking Style",
    "link": "https://www.nytimes.com/2025/08/17/opinion/trump-speaking-style.html",
    "summary": "The fact that we’re talking like Donald Trump could mean that we’re starting to think like him as well."
  },
  {
    "title": "Is it Actually Fine to Look at Your Phone Before Bed?",
    "link": "https://www.nytimes.com/2025/08/17/briefing/is-it-actually-fine-to-look-at-your-phone-before-bed.html",
    "summary": "Scientists offer some surprising answers."
  },
  {
    "title": "What Do You Want to See in New York’s Future?",
    "link": "https://www.nytimes.com/2025/08/14/nyregion/future-of-new-york-reader-callouts.html",
    "summary": "We’ve been envisioning how some of today’s biggest dilemmas could transform the city. We’d like you to imagine with us."
  },
  {
    "title": "Government Shuts Down Air Canada Strike That Grounded Hundreds of Flights",
    "link": "https://www.nytimes.com/2025/08/16/world/canada/air-canada-strike.html",
    "summary": "A walkout by flight attendants ended after about 12 hours with the imposition of binding arbitration. But getting travel back to normal will take days."
  },
  {
    "title": "An Arts District Helped Make Asheville a Destination. Its Recovery Is Slow Going.",
    "link": "https://www.nytimes.com/2025/08/16/arts/design/asheville-arts-recovery.html",
    "summary": "Nearly a year after Hurricane Helene severely damaged the popular River Arts District, the rebuilding process continues in a gradual manner."
  },
  {
    "title": "Louisiana Has a Long History of Political Corruption",
    "link": "https://www.nytimes.com/2025/08/16/us/new-orleans-mayor-louisiana-corruption.html",
    "summary": "For decades, Louisiana lawmakers at all levels of government have been caught up in corruption allegations."
  }
]