[
  {
    "title": "In the Trump Administration, Watchdogs Are Watching Their Backs",
    "link": "https://www.nytimes.com/2025/07/17/us/politics/inspectors-general-trump.html",
    "summary": "The president has fired or demoted over 20 inspectors general since he took office. Employees say they are demoralized and reluctant to pursue investigations that could prompt political blowback."
  },
  {
    "title": "Justice Dept. Asks California Sheriffs for Names of Undocumented Inmates",
    "link": "https://www.nytimes.com/2025/07/17/us/politics/doj-sheriffs-california-inmates-ice.html",
    "summary": "An A.C.L.U. lawyer said it was possible that any sheriff who complied with the request could be in violation of California’s so-called sanctuary state law."
  },
  {
    "title": "Trump’s Plan to Reopen Alcatraz Appears to Move Forward With Officials’ Visit",
    "link": "https://www.nytimes.com/2025/07/17/us/alcatraz-prison-trump-bondi-burgum-visit.html",
    "summary": "Attorney General Pam Bondi and Interior Secretary Doug Burgum visited the site on Thursday to study whether reopening it as a federal prison could work."
  },
  {
    "title": "Republicans Fretted Over Ceding Spending Power to Trump. Then They Voted to Do It.",
    "link": "https://www.nytimes.com/2025/07/17/us/politics/republicans-congress-spending-power.html",
    "summary": "In voting for President Trump’s cancellation of $9 billion in spending they had already approved, Republicans in Congress showed they were willing to cede their power of the purse."
  },
  {
    "title": "Senate Approves Trump’s Bid to Cancel Foreign Aid and Funds for NPR and PBS Stations",
    "link": "https://www.nytimes.com/2025/07/17/us/politics/senate-vote-trump-bill-pbs-npr-foreign-aid.html",
    "summary": "The bill to claw back $9 billion in congressionally approved spending passed the Senate over the objections of Republicans who said it abdicated the legislative branch’s power of the purse."
  },
  {
    "title": "Republicans on Senate Panel Vote to Advance Bove’s Nomination After Democrats Storm Out",
    "link": "https://www.nytimes.com/2025/07/17/us/politics/emil-bove-judge-nomination-democrats.html",
    "summary": "An even more intense battle is expected on the Senate floor over the nomination of a Trump immigration policy enforcer to a lifetime judicial post."
  },
  {
    "title": "Top Fed Official Backs July Rate Cut as Trump Ramps Up Pressure",
    "link": "https://www.nytimes.com/2025/07/17/business/fed-rate-cut-waller-powell-trump.html",
    "summary": "Christopher Waller, a potential contender to be the next chair of the central bank, said the Federal Reserve should not wait for the labor market to weaken to reduce interest rates."
  },
  {
    "title": "White House Seeks to Inspect Fed Renovation in Bid to Pressure Powell",
    "link": "https://www.nytimes.com/2025/07/17/us/politics/white-house-seeks-to-inspect-fed-renovation-in-bid-to-pressure-powell.html",
    "summary": "Russell T. Vought, the head of the Office of Management and Budget, said he and other administration officials wanted access to the Fed’s building in Washington."
  },
  {
    "title": "‘Late Show With Stephen Colbert’ Is Being Canceled by CBS",
    "link": "https://www.nytimes.com/2025/07/17/business/stephen-colbert-late-show-ending.html",
    "summary": "The show will end in May, the network said, calling it “a purely financial decision.”"
  },
  {
    "title": "To Live Up to a Legacy, These Texas High Schoolers Had Two Days to Build a Tiny House",
    "link": "https://www.nytimes.com/2025/07/17/realestate/tiny-house-championship-skillsusa-teamworks.html",
    "summary": "A Texas high school has won more championships in mock tiny home construction than any other school in the country. Could a team of rookies defend the title?"
  },
  {
    "title": "Justice Dept. Asks for 1-Day Sentence for Ex-Officer Convicted in Breonna Taylor Raid",
    "link": "https://www.nytimes.com/2025/07/17/us/politics/justice-department-brett-hankison-sentence-breonna-taylor.html",
    "summary": "The administration asked the judge in the case to sentence the former officer to essentially the brief time he had served when he was first charged, and three years of supervised release."
  },
  {
    "title": "Crypto Industry Reaches Milestone With Passage of Genius Act",
    "link": "https://www.nytimes.com/2025/07/17/technology/crypto-industry-milestone-legislation.html",
    "summary": "After a week of squabbling in Washington, the cryptocurrency industry secured one of its primary legislative objectives and made progress toward a second one."
  },
  {
    "title": "What to Know About the Three Crypto Regulation Bills in Congress",
    "link": "https://www.nytimes.com/2025/07/17/us/politics/crypto-regulation-bills-explainer.html",
    "summary": "The House this week took up a trio of bills that would establish a federal framework for regulating the cryptocurrency industry. One of the measures cleared Congress and is on its way to enactment."
  },
  {
    "title": "Columbia and White House Enter Final Stage of Talks to End Standoff",
    "link": "https://www.nytimes.com/2025/07/17/nyregion/columbia-trump-near-deal.html",
    "summary": "A deal to resolve allegations that the university failed to protect Jewish students from harassment is expected to include a fine of about $200 million."
  },
  {
    "title": "Fired D.E.I. Administrator Rachel Dawson Sues the University of Michigan",
    "link": "https://www.nytimes.com/2025/07/17/us/university-michigan-lawsuit-dei-firing-rachel-dawson.html",
    "summary": "In her lawsuit, Rachel Dawson denies making antisemitic remarks and accuses the school of racial bias in its investigation and decision-making."
  },
  {
    "title": "Ron Wyden, a Democrat, Won’t Let Go of the Jeffrey Epstein Case, Either",
    "link": "https://www.nytimes.com/2025/07/17/business/epstein-banks-wyden-trump.html",
    "summary": "Senator Ron Wyden has found that four banks waited until Mr. Epstein’s arrest on federal charges to flag $1.5 billion in suspicious transactions. Mr. Wyden wants the documents made public."
  },
  {
    "title": "Texas Legislature Special Session Will Answer Questions About Redistricting, Floods",
    "link": "https://www.nytimes.com/2025/07/17/us/texas-flood-redistricting.html",
    "summary": "A special session of the Texas Legislature will address the deadly floods in Hill Country, but the fireworks will come from President Trump’s demand for a newly gerrymandered House map."
  },
  {
    "title": "Heavy Rain Floods Kansas City Area, Prompting Overnight Rescues",
    "link": "https://www.nytimes.com/2025/07/17/weather/kansas-city-missouri-flooding.html",
    "summary": "Firefighters waded through waist-deep water to rescue people from nearly two dozen cars, officials said."
  },
  {
    "title": "Storms Crawling Along the Gulf Coast Are Raising the Risk of Flooding",
    "link": "https://www.nytimes.com/2025/07/17/weather/new-orleans-flooding-forecast-louisiana.html",
    "summary": "A tropical disturbance is bringing heavy rain as it moves west through Louisiana and Mississippi."
  },
  {
    "title": "Iran’s Fordo Nuclear Site Was Badly Damaged by U.S. Strikes, New Assessment Finds",
    "link": "https://www.nytimes.com/2025/07/17/us/politics/iran-nuclear-sites.html",
    "summary": "A clearer picture begins to emerge of what the Israeli and U.S. attacks on Iran’s nuclear sites achieved."
  },
  {
    "title": "F.D.A. Approves Juul Vapes After Yearslong Delay",
    "link": "https://www.nytimes.com/2025/07/17/health/fda-juul.html",
    "summary": "The company was accused of marketing its products to teenagers, causing a surge in use."
  },
  {
    "title": "Just How Harmful Is Vaping? More Evidence Is Emerging.",
    "link": "https://www.nytimes.com/2025/07/09/well/vaping-health-risks.html",
    "summary": "A new study that found high levels of heavy metals in popular nicotine vapes adds to concerns about the products."
  },
  {
    "title": "The Cost of Trump’s Surrender to China",
    "link": "https://www.nytimes.com/2025/07/17/opinion/trump-america-china.html",
    "summary": "China has been displaying intellectual and innovative vitality for decades and the United States has scarcely mobilized."
  },
  {
    "title": "Is ‘Toxic Empathy’ Pulling Christians to the Left?",
    "link": "https://www.nytimes.com/2025/07/17/opinion/interesting-times-allie-beth-stuckey.html",
    "summary": "How Allie Beth Stuckey is holding the line on the right."
  },
  {
    "title": "Justice Dept. Asked for 1-Day Sentence for Louisville Officer",
    "link": "https://www.nytimes.com/2025/07/17/briefing/trump-justice-department-britain-voting-age.html",
    "summary": "Also, Britain is planning to lower the voting age. Here’s the latest at the end of Thursday."
  },
  {
    "title": "Archery Club Used to ‘Nasty Storms’ Reels From Fatal Lightning Strike",
    "link": "https://www.nytimes.com/2025/07/17/nyregion/lightning-strike-jackson-nj-archery.html",
    "summary": "The bolt struck local archers and a boy scout troop in New Jersey, killing one man and injuring 13 other people. Friends of the victims said the strike had come out of nowhere."
  },
  {
    "title": "Musk Clears Final Hurdles for Tesla and Starlink in India",
    "link": "https://www.nytimes.com/2025/07/17/world/asia/tesla-starlink-india-elon-musk.html",
    "summary": "In the first tangible inroads Elon Musk has sought for years in India, Starlink passed a final regulatory hurdle and Tesla opened its first India store."
  },
  {
    "title": "Beware of ‘Swiper,’ a Fox at Grand Teton Park With a Penchant for Footwear",
    "link": "https://www.nytimes.com/2025/07/17/us/beware-of-swiper-a-fox-at-grand-teton-park-with-a-penchant-for-footwear.html",
    "summary": "One or more foxes have stolen at least 32 shoes, according to park officials, who warned campers to guard their belongings."
  },
  {
    "title": "5 Charged in U.C. Berkeley Professor’s Killing in Greece, Including His Ex-Wife",
    "link": "https://www.nytimes.com/2025/07/17/world/europe/cal-berkeley-professor-murder-suspects-arrested-greece.html",
    "summary": "Przemyslaw Jeziorski, who taught quantitative marketing at the Haas School of Business, was shot several times on July 4 outside Athens, the authorities said."
  }
]