[
  {
    "title": "Crime Festers in Republican States While Their Troops Patrol Washington",
    "link": "https://www.nytimes.com/2025/09/01/us/politics/crime-republican-states.html",
    "summary": "Republican governors who have mustered National Guard troops for deployment in blue-state cities may re-examine their deployments if federal intervention significantly brings crime down."
  },
  {
    "title": "Crime Crackdown in D.C. Shows Trump Administration’s Uneasy Relationship With Guns",
    "link": "https://www.nytimes.com/2025/09/01/us/politics/dc-crime-trump-guns.html",
    "summary": "If President Trump’s actions were intended to drive a law-and-order wedge between Democratic big-city leaders and their constituents, it has also exposed a division in his own coalition."
  },
  {
    "title": "Xi, Putin and Modi Try to Signal Unity at China Summit",
    "link": "https://www.nytimes.com/2025/09/01/world/asia/china-xi-putin-modi.html",
    "summary": "Their display of friendship in China was aimed at projecting an alternative to U.S. global leadership, even as serious differences among them remain."
  },
  {
    "title": "India Was the Economic Alternative to China. Trump Ended That.",
    "link": "https://www.nytimes.com/2025/09/01/business/india-china-trump-tariffs.html",
    "summary": "A lurch in policy has shaken the India-U.S. economic alliance against China, leaving India little choice but to consider reversing its own strategy."
  },
  {
    "title": "Afghanistan Earthquake Leaves More Than 800 Dead",
    "link": "https://www.nytimes.com/2025/08/31/world/asia/afghanistan-earthquake-jalalabad.html",
    "summary": "The quake, near the border with Pakistan, injured more than 2,500 people in mountainous areas that rescue workers took hours to reach."
  },
  {
    "title": "What to Know About the Earthquake in Afghanistan",
    "link": "https://www.nytimes.com/2025/09/01/world/asia/earthquake-afghanistan-what-to-know.html",
    "summary": "Hundreds of people were killed and more than 2,500 were injured, according to the Taliban government, and the death toll was expected to rise."
  },
  {
    "title": "Trump Administration Deports Jamaican Man to African Prison Years After U.S. Sentence",
    "link": "https://www.nytimes.com/2025/09/01/world/africa/trump-deportations-prison-us-eswatini-africa-jamaica.html",
    "summary": "The case of Orville Etoria highlights a tension in President Trump’s deportation agenda, in which immigrants can be sent abroad and detained indefinitely."
  },
  {
    "title": "Judge Halts U.S. Effort to Deport Guatemalan Children as Planes Sit on Tarmac",
    "link": "https://www.nytimes.com/2025/08/31/us/politics/trump-deportations-judge-guatemala-children.html",
    "summary": "The temporary block ended another last-minute flurry of legal action over the Trump administration’s immigration crackdown."
  },
  {
    "title": "Trump’s Push to Punish Flag Burning Puts Landmark Free Speech Ruling at Risk",
    "link": "https://www.nytimes.com/2025/09/01/us/politics/flag-burning-trump-johnson-supreme-court.html",
    "summary": "The Supreme Court ruled in 1989 that burning an American flag is speech protected by the First Amendment. President Trump says it should be punished."
  },
  {
    "title": "When the Trumpeter Plays Taps, the Crowd at the Shore Goes Silent",
    "link": "https://www.nytimes.com/2025/09/01/nyregion/long-beach-island-nj-trumpeter.html",
    "summary": "As the sun sets on another summer, John Hersh is wrapping up his 10th year of rooftop serenades."
  },
  {
    "title": "Sophie Cunningham Avenged Caitlin Clark. Now Sponsors (and the Right) Love Her.",
    "link": "https://www.nytimes.com/2025/09/01/business/sophie-cunningham-caitlin-clark-wnba.html",
    "summary": "The W.N.B.A.’s Sophie Cunningham is riding her viral moment to endorsements and brand deals. But she doesn’t want to talk politics."
  },
  {
    "title": "What to Know About Rudy Giuliani’s Car Crash",
    "link": "https://www.nytimes.com/2025/09/01/nyregion/rudy-giuliani-car-crash-accident.html",
    "summary": "Rudolph W. Giuliani, the former mayor of New York and lawyer for President Trump, suffered a fractured vertebra when a vehicle slammed into his car on Saturday."
  },
  {
    "title": "Israel’s Push for a Permanent Gaza Deal May Mean a Longer War, Experts Say",
    "link": "https://www.nytimes.com/2025/09/01/world/middleeast/israel-gaza-cease-fire-negotiations.html",
    "summary": "A shift toward pressing for a permanent cease-fire deal, alongside plans for a new offensive in Gaza City, means the fighting is unlikely to end soon."
  },
  {
    "title": "Russia Suspected of Jamming GPS for E.U. Leader’s Plane, Officials Say",
    "link": "https://www.nytimes.com/2025/09/01/world/europe/von-der-leyen-gps-jamming-russia-ukraine.html",
    "summary": "The Bulgarian authorities believe that Russia disrupted navigation signals that would have been used by a plane carrying Ursula von der Leyen, European officials said."
  },
  {
    "title": "Ukraine War Leads to Global Shortage of TNT for Military and Mining Use",
    "link": "https://www.nytimes.com/2025/09/01/us/politics/ukraine-war-tnt-shortage.html",
    "summary": "Mining materials to make cement, gravel and a host of other common products require an explosive that is becoming more expensive and limited in supply."
  },
  {
    "title": "Kyiv Links Moscow to Killing of Former Ukrainian Parliament Speaker",
    "link": "https://www.nytimes.com/2025/09/01/world/europe/ukraine-andriy-parubiy-murder.html",
    "summary": "Ukraine said it had arrested a suspect in the murder of the politician, who had voiced anti-Russian views. The authorities did not explain how the suspect was tied to Moscow."
  },
  {
    "title": "Dan Rather Is Still Chasing the News",
    "link": "https://www.nytimes.com/2025/09/01/business/media/dan-rather-steady-newsletter.html",
    "summary": "He’s 93, and 20 years removed from signing off as a CBS anchor. But he’s still tapping out stories. “As Popeye used to say, I am what I am.”"
  },
  {
    "title": "Exxon and California Spar in Dueling Lawsuits Over Plastics",
    "link": "https://www.nytimes.com/2025/09/01/climate/exxon-california-plastics-defamation-lawsuit.html",
    "summary": "The oil giant accused the state’s attorney general and four nonprofit groups of defamation after they sued over recycling claims."
  },
  {
    "title": "The Unchecked, Unbalanced Reign of King Donald",
    "link": "https://www.nytimes.com/2025/09/01/opinion/trump-checks-balances.html",
    "summary": "Is our vaunted system really safe from the shameless likes of Trump?"
  },
  {
    "title": "We Ran the CDC: RFK Jr. Is Endangering Every American’s Health",
    "link": "https://www.nytimes.com/2025/09/01/opinion/cdc-leaders-kennedy.html",
    "summary": "Agency leaders sound the alarm."
  },
  {
    "title": "A Look at Vintage Photography From Our Archives",
    "link": "https://www.nytimes.com/2025/09/01/briefing/a-look-at-vintage-photography-from-our-archives.html",
    "summary": "We study photographers’ contact sheets from the last century."
  },
  {
    "title": "In the Remains of Canada’s Jasper Wildfire, Clues to Tame Future Blazes",
    "link": "https://www.nytimes.com/2025/09/01/world/canada/canada-wildfires-alberta-jasper.html",
    "summary": "A giant fire last year consumed much of Canada’s Jasper National Park. Canadian scientists leading research into wildfires are using the blaze to learn lessons for the future."
  },
  {
    "title": "Why the Graffiti Artist Fonki Finds Inspiration in Angkorian Sculpture",
    "link": "https://www.nytimes.com/2025/09/01/world/asia/fonki-graffiti-cambodia-angkor-wat.html",
    "summary": "The artist Fonki developed a graffiti style that blends ancient motifs with scenes of modern Cambodia."
  },
  {
    "title": "Boy Shot and Killed After ‘Ding Dong Ditch’ Prank in Houston",
    "link": "https://www.nytimes.com/2025/08/31/us/houston-boy-shot-ding-dong-ditch.html",
    "summary": "The police in Houston detained a person after an 11-year-old boy was shot on Saturday night, officials said."
  },
  {
    "title": "What to Know About Covid Vaccines This Fall",
    "link": "https://www.nytimes.com/2025/08/27/well/covid-vaccines-guidelines-fall-2025.html",
    "summary": "The F.D.A. introduced new rules. Here’s what to know."
  }
]