[
  {
    "title": "Takeaways From the NYC Mayoral Election and Zohran Mamdani’s Stunning Win",
    "link": "https://www.nytimes.com/2025/11/05/nyregion/nyc-mayor-election-mamdani-takeaways.html",
    "summary": "Zohran Mamdani motivated voters to head for the polls, using a broad coalition of supporters to overcome Andrew Cuomo’s success in siphoning Republican votes."
  },
  {
    "title": "How Zohran Mamdani Beat Back New York’s Elite and Was Elected Mayor",
    "link": "https://www.nytimes.com/2025/11/04/nyregion/how-zohran-mamdani-won-nyc-mayor.html",
    "summary": "The 34-year-old assemblyman won the Democratic primary by defying the city’s all-powerful establishment. He secured the mayoralty by delicately disarming it."
  },
  {
    "title": "A Muslim Mayor in New York City? Voters Say Yes, Emphatically.",
    "link": "https://www.nytimes.com/2025/11/05/us/politics/mamdani-muslim.html",
    "summary": "Zohran Mamdani shattered a barrier that seemed insurmountable since the Sept. 11 attacks changed what it meant to be Muslim in the city."
  },
  {
    "title": "A Big Win in California Propels Newsom",
    "link": "https://www.nytimes.com/2025/11/05/us/newsom-california-election.html",
    "summary": "The passage of Proposition 50 cemented Gov. Gavin Newsom’s position as President Trump’s chief antagonist and raised his national political profile."
  },
  {
    "title": "The Democrats Just Took a Big Step Toward Getting Their Groove Back",
    "link": "https://www.nytimes.com/2025/11/05/us/politics/democratic-party-mamdani.html",
    "summary": "Victories in New York City, New Jersey, Virginia and elsewhere were decisive, but new political tests loom for a party still rebuilding its brand."
  },
  {
    "title": "Abigail Spanberger Flips Virginia, Becomes State’s First Female Governor",
    "link": "https://www.nytimes.com/2025/11/05/us/abigail-spanberger-virginia-governor-election.html",
    "summary": "In her campaign, Abigail Spanberger focused on jobs and the cost of living and emphasized her support for abortion rights."
  },
  {
    "title": "Mamdani’s Historic Win, and Democrats’ Big Night Nationwide",
    "link": "https://www.nytimes.com/2025/11/05/podcasts/the-headlines/mamdani-democrats-mayor-nyc.html",
    "summary": "Plus, a race to save artifacts from the ocean."
  },
  {
    "title": "Trump’s Sweeping Tariffs Face High-Stakes Supreme Court Test",
    "link": "https://www.nytimes.com/2025/11/05/us/politics/supreme-court-trump-tariffs.html",
    "summary": "Justices will hear arguments on Wednesday over whether the president acted legally when he used a 1977 emergency statute to unilaterally impose tariffs."
  },
  {
    "title": "Tariffs Are Here to Stay, Even if the Supreme Court Rules Against Trump",
    "link": "https://www.nytimes.com/2025/11/05/us/politics/trump-tariff-alternatives.html",
    "summary": "The Trump administration says it has plenty of other options to impose tariffs, if the court rules against the president."
  },
  {
    "title": "UPS Plane Crash Near Louisville Airport Kills at Least 7, Officials Say",
    "link": "https://www.nytimes.com/2025/11/04/us/louisville-ups-plane-crash.html",
    "summary": "The plane crashed and exploded shortly after taking off from a Kentucky airport, disrupting operations at the delivery company’s main air cargo hub."
  },
  {
    "title": "What We Know About the UPS Plane Crash in Louisville",
    "link": "https://www.nytimes.com/2025/11/04/us/plane-crash-louisville-kentucky-ups.html",
    "summary": "Seven people were dead after the cargo plane crashed soon after takeoff. The authorities canceled flights from the airport in Louisville, Ky., and local residents were ordered to remain indoors."
  },
  {
    "title": "Shutdown Becomes Longest in History, as Trump Officials Threaten Pain Could Worsen",
    "link": "https://www.nytimes.com/2025/11/04/us/politics/trump-administration-pain-shutdown.html",
    "summary": "President Trump and administration officials indicated the fallout could intensify in the coming days, even as he has kept himself at a remove from the crisis."
  },
  {
    "title": "As Government Shutdown Stalemate Persists, Frustration Defies Party Lines",
    "link": "https://www.nytimes.com/2025/11/05/us/politics/shutdown-congress-georgia-health-care.html",
    "summary": "The partisan divisions in Washington are as deep as ever, but some voters in both parties have grown weary of the standoff and want it to end."
  },
  {
    "title": "In ‘Wicked: For Good,’ Ariana Grande Solidifies Herself as a Dramatic Actress",
    "link": "https://www.nytimes.com/2025/11/05/movies/ariana-grande-wicked-for-good.html",
    "summary": "The pop superstar reinvented herself in the first “Wicked,” but the sequel shows just how much further she can go as an actress."
  },
  {
    "title": "A Woman Tells of Torture and 2½ Years of Captivity by an Iraqi Militia",
    "link": "https://www.nytimes.com/2025/11/05/world/middleeast/tsurkov-kataib-torture-kidnap.html",
    "summary": "Elizabeth Tsurkov, a citizen of Israel and Russia, recounts a harrowing story of cruelty, survival, U.S. diplomatic pressure and, finally, release from the grip of a group backed by Iran."
  },
  {
    "title": "What to Know About Kataib Hezbollah, the Iraqi Militia That Held Tsurkov Captive",
    "link": "https://www.nytimes.com/2025/11/05/world/europe/what-to-know-about-the-militia-that-kidnapped-elizabeth-tsurkov.html",
    "summary": "Kataib Hezbollah, a hard-line Iraqi militia linked to Iran, held Elizabeth Tsurkov, a citizen of Israel and Russia, hostage for more than two years."
  },
  {
    "title": "Brazil Proposes a New Type of Fund to Protect Tropical Forests",
    "link": "https://www.nytimes.com/2025/11/05/climate/cop30-amazon-brazil-forest-fund.html",
    "summary": "The multibillion-dollar fund would essentially pay countries to keep forests standing, hoping for success where earlier forest-protection ideas have struggled."
  },
  {
    "title": "A Harrowing Escape From the Drone-Infested Hellscape of Ukraine’s Front Lines",
    "link": "https://www.nytimes.com/2025/11/05/magazine/ukraine-russia-war-drones.html",
    "summary": "In Ukraine, unmanned weapons hunt the wounded and medics alike. Moving injured soldiers to safety has never been more difficult."
  },
  {
    "title": "For Dick Cheney, a Journey From Champion of War to Voice of Resistance",
    "link": "https://www.nytimes.com/2025/11/04/us/politics/dick-cheney-trump.html",
    "summary": "Dick Cheney was to many the embodiment of the unpopular and bloody Iraq war. But his late-in-life anti-Trumpism changed his image for some of his longtime critics."
  },
  {
    "title": "What Were Those 2 Spooky Flashes That Lit Up the Moon?",
    "link": "https://www.nytimes.com/2025/11/05/science/moon-asteroids-impact.html",
    "summary": "A Japanese astronomer captured a pair of objects slamming into the moon in recent days."
  },
  {
    "title": "Six Ways Zohran Mamdani Can Improve New York City",
    "link": "https://www.nytimes.com/2025/11/04/opinion/mayor-mamdani-new-york-election.html",
    "summary": "Mamdani, who campaigned on sweeping promises, can build a positive legacy by focusing on tangible accomplishments."
  },
  {
    "title": "Trump Is an Albatross",
    "link": "https://www.nytimes.com/2025/11/05/opinion/trump-mamdani-spanberger-sherrill-democrats.html",
    "summary": "Just Ask Mikie Sherrill, Abigail Spanberger and Zohran Mamdani."
  },
  {
    "title": "Late Night Chuckles at Andrew Cuomo’s Last-Minute Cheering Section",
    "link": "https://www.nytimes.com/2025/11/05/arts/television/late-night-chuckles-at-andrew-cuomos-last-minute-cheering-section.html",
    "summary": "Republicans like President Trump, Stephen Miller and Elon Musk endorsed him ahead of New York City’s mayoral election. Stephen Colbert referred to them as “everyone New Yorkers love.”"
  },
  {
    "title": "Scars in the Blue Mosque Reveal Afghanistan’s Rifts",
    "link": "https://www.nytimes.com/2025/11/05/world/africa/blue-mosque-afghanistan-earthquake.html",
    "summary": "The namesake of Mazar-i-Sharif suffered countless cracks in a 6.3-magnitude quake, but, like Afghanistan, it has endured for centuries."
  },
  {
    "title": "Bob Trumpy, Star Receiver Turned NBC Football Analyst, Dies at 70",
    "link": "https://www.nytimes.com/2025/11/04/sports/bob-trumpy-dead.html",
    "summary": "He made his mark with the Cincinnati Bengals as a fast pass-catching tight end. He later joined announcers like Bob Costas and Dick Enberg in the broadcast booth."
  },
  {
    "title": "Fire at Retirement Home in Bosnia Kills at Least 11",
    "link": "https://www.nytimes.com/2025/11/05/world/europe/fire-retirement-home-bosnia.html",
    "summary": "The country’s prime minister called the blaze “a disaster of enormous proportions.”"
  },
  {
    "title": "Director of Philadelphia Art Museum Is Dismissed After Unpopular Rebranding",
    "link": "https://www.nytimes.com/2025/11/04/arts/design/philadelphia-art-museum-director-dismissed.html",
    "summary": "Sasha Suda was three years into her five-year contract when the museum’s board announced that she was being terminated for cause."
  }
]