[
  {
    "title": "Israeli Security Cabinet Approves Military Takeover of Gaza",
    "link": "https://www.nytimes.com/2025/08/07/world/middleeast/israel-gaza-military-offensive.html",
    "summary": "The risky plan by Prime Minister Benjamin Netanyahu is not backed by the Israeli military’s chief of staff and will thrust the war with Hamas into uncharted territory."
  },
  {
    "title": "Trump Administration to Require Universities to Submit Data on Applicants’ Race",
    "link": "https://www.nytimes.com/2025/08/07/us/politics/trump-schools-race-data.html",
    "summary": "The administration has become increasingly focused on admissions data in its effort to bring the higher education system in line with President Trump’s political agenda."
  },
  {
    "title": "Trump Wasn’t the First to Deport These Men, and He Won’t Be the Last",
    "link": "https://www.nytimes.com/2025/08/08/world/asia/deportations-trump-refugees-bhutan-nepal.html",
    "summary": "Dozens of Bhutanese men ejected from the United States are now in refugee camps in Nepal, which doesn’t want them but has nowhere to send them."
  },
  {
    "title": "Trump Nominates Stephen Miran to Temporarily Join Fed Board of Governors",
    "link": "https://www.nytimes.com/2025/08/07/us/politics/trump-federal-reserve-stephen-miran.html",
    "summary": "If confirmed, Stephen Miran, the current chair of the Council of Economic Advisers, would temporarily fill a position left vacant by Adriana Kugler, who is stepping down early."
  },
  {
    "title": "F.A.A. Plans to Hire 8,900 Air Traffic Controllers but Still Expects Shortages",
    "link": "https://www.nytimes.com/2025/08/08/us/politics/faa-air-traffic-controllers.html",
    "summary": "The Federal Aviation Administration says it plans to “supercharge” hiring and training between now and late 2028. It would not be enough to end a shortage of controllers."
  },
  {
    "title": "Swiss Businesses Fear Trump’s 39% Tariff Will Create ‘Worst-Case Scenario’",
    "link": "https://www.nytimes.com/2025/08/07/business/economy/swizterland-tariffs-trump.html",
    "summary": "Goods shipped from the country face a 39 percent tariff in the U.S., which companies warn will have dire consequences if President Trump cannot be quickly dissuaded."
  },
  {
    "title": "India Bought Russian Oil. Now It’s a Trade-War Weapon.",
    "link": "https://www.nytimes.com/2025/08/07/business/oil-india-russia-trump.html",
    "summary": "If Narendra Modi surrendered to President Trump, how tough would it be to wean his country from Russia’s discounted supply?"
  },
  {
    "title": "Trump’s Tariffs Could Raise Prices on Many Consumer Goods",
    "link": "https://www.nytimes.com/2025/08/07/business/economy/trump-tariffs-prices-consumers.html",
    "summary": "The tariffs are driving up prices on everyday goods as businesses warn they can no longer absorb costs, leaving consumers to foot the bill."
  },
  {
    "title": "On Vaccines, RFK Jr. Has Broken Sharply With the Mainstream",
    "link": "https://www.nytimes.com/2025/08/07/health/kennedy-vaccines-mrna-trump.html",
    "summary": "While many officials and scientists embrace other parts of the secretary’s agenda, his stance on vaccines is alienating allies who fear a public health crisis."
  },
  {
    "title": "Cuomo and Trump, Two ‘Queens Boys,’ Go Way Back",
    "link": "https://www.nytimes.com/2025/08/07/nyregion/andrew-cuomo-trump.html",
    "summary": "President Trump has urged Andrew Cuomo to stay in the New York City mayor’s race. Here are seven moments when their paths crossed over the years."
  },
  {
    "title": "The Rise of Silicon Valley’s Techno-Religion",
    "link": "https://www.nytimes.com/2025/08/04/technology/rationalists-ai-lighthaven.html",
    "summary": "The Rationalists, a community focused on the risks of artificial intelligence, regularly gather with tech figures and other like-minded people in a complex that covers much of a city block."
  },
  {
    "title": "OpenAI Unveils GPT-5, New AI Model, to ChatGPT Users",
    "link": "https://www.nytimes.com/2025/08/07/technology/openai-chatgpt-gpt-5.html",
    "summary": "The A.I. start-up said its new flagship technology was faster, more accurate and less likely to make stuff up."
  },
  {
    "title": "Right-Wing Influence Shaped the Sydney Sweeney Ad Debate",
    "link": "https://www.nytimes.com/2025/08/07/business/sydney-sweeney-ad-right-wing-media.html",
    "summary": "Right-wing commentators suggested there was widespread criticism of Ms. Sweeney over her new ad campaign. There wasn’t, at least at first."
  },
  {
    "title": "Sallie Bingham, Author at the Center of a Newspaper Drama, Dies at 88",
    "link": "https://www.nytimes.com/2025/08/07/business/media/sallie-bingham-dead.html",
    "summary": "A novelist and memoirist, she famously clashed with her brother, leading to the fall of a Kentucky publishing dynasty that her paternal grandfather established in 1918."
  },
  {
    "title": "Why More People in the World Are Feeling Hopeful (Except Us)",
    "link": "https://www.nytimes.com/2025/08/07/opinion/happiness-community-wealth.html",
    "summary": "I would say the most important social trend over the past decade has been the disconnect between our nation’s economic health and its social health."
  },
  {
    "title": "Democrats Are Finally, Slowly, Changing Their Minds on Israel",
    "link": "https://www.nytimes.com/2025/08/08/opinion/democrats-gaza-klobuchar-booker.html",
    "summary": "Amy Klobuchar has taken a crucial step toward the view of the party’s base."
  },
  {
    "title": "Canyon Fire in Ventura County Prompts Evacuation Orders for Thousands",
    "link": "https://www.nytimes.com/2025/08/07/us/canyon-fire-ventura-county.html",
    "summary": "The Canyon fire was initially reported at about 30 acres but had rapidly grown to 1,500 acres in a few hours on Thursday, officials said."
  },
  {
    "title": "Brandon Blackstock, Kelly Clarkson’s Ex-Husband, Dies at 48",
    "link": "https://www.nytimes.com/2025/08/07/us/brandon-blackstock-dead-cancer-kelly-clarkson.html",
    "summary": "The announcement of Mr. Blackstock’s death came one day after Ms. Clarkson said she would be postponing the remainder of her residency in Las Vegas."
  },
  {
    "title": "Big-Game Hunter Is Killed by Buffalo During Safari",
    "link": "https://www.nytimes.com/2025/08/07/world/africa/big-game-hunter-killed-buffalo-safari-south-africa.html",
    "summary": "Asher Watkins, a real estate executive from Texas, was tracking a Cape buffalo in South Africa when he was attacked, a safari company said."
  },
  {
    "title": "Should Soccer Star Son Heung-min Have Held an Umbrella for a Female Reporter?",
    "link": "https://www.nytimes.com/2025/08/08/world/asia/son-heung-min-lafc-tottenham-umbrella.html",
    "summary": "A photo of Son Heung-min set off a heated debate online that laid bare the intense emotions surrounding South Korea’s gender divide."
  }
]