[
  {
    "title": "The Epstein Files and the Hidden World of an Unaccountable Elite",
    "link": "https://www.nytimes.com/2026/02/12/us/politics/epstein-files.html",
    "summary": "The search continues in the documents for ironclad criminal conduct, but the story of a sexual predator given a free ride by the ruling class has already emerged."
  },
  {
    "title": "Goldman Sachs General Counsel Kathryn Ruemmler Resigns Over Epstein Ties",
    "link": "https://www.nytimes.com/2026/02/12/business/goldman-lawyer-kathryn-ruemmler-resigns.html",
    "summary": "Kathryn Ruemmler, a former top Obama administration lawyer, is out at Goldman Sachs after emails showed a friendship with the sex offender Jeffrey Epstein spanning many years."
  },
  {
    "title": "Ex-Leader of Norway Charged With Corruption Linked to Epstein",
    "link": "https://www.nytimes.com/2026/02/12/world/europe/thorbjorn-jagland-epstein-corruption-norway.html",
    "summary": "Thorbjorn Jagland, who briefly led Norway in the 1990s, had been protected by diplomatic immunity that came with his work with the Council of Europe, but that privilege was waived."
  },
  {
    "title": "How The Times Is Digging Into Millions of Pages of Epstein Files",
    "link": "https://www.nytimes.com/2026/02/12/insider/jeffrey-epstein-files-documents.html",
    "summary": "Two dozen journalists. A pile of pages that would reach the top of the Empire State Building. And an effort to find the next revelation in a sprawling case."
  },
  {
    "title": "Trump Repeals Key Greenhouse Gas Finding, Erasing EPA’s Power to Fight Climate Change",
    "link": "https://www.nytimes.com/2026/02/12/climate/trump-epa-greenhouse-gases-climate-change.html",
    "summary": "The Environmental Protection Agency rejected the bedrock scientific finding that greenhouse gases threaten human life and well being. It means the agency can no longer regulate them."
  },
  {
    "title": "What to Know About the E.P.A.’s Big Attack on Climate Regulation",
    "link": "https://www.nytimes.com/2026/02/12/climate/what-to-know-epa-endangerment-finding.html",
    "summary": "The Trump administration has repealed the scientific determination that underpins the government’s legal authority to combat climate change."
  },
  {
    "title": "Federal Judge Blocks Trump Plan to Cut $600 Million in Health Funds",
    "link": "https://www.nytimes.com/2026/02/12/us/politics/trump-health-funding-cuts-ruling.html",
    "summary": "It is the latest court ruling staving off deep cuts to social services that Democratic-led states say are politically motivated and would harm hundreds of thousands of people."
  },
  {
    "title": "Intelligence Dispute Centers on Kushner Reference in Intercepted Communication",
    "link": "https://www.nytimes.com/2026/02/12/us/politics/kushner-gabbard-iran-intelligence.html",
    "summary": "A whistle-blower has accused Tulsi Gabbard, the director of national intelligence, of blocking distribution of a report that Jared Kushner’s name came up in an intercepted communication about Iran."
  },
  {
    "title": "DHS Shutdown Nears as Immigration Enforcement Talks Stall",
    "link": "https://www.nytimes.com/2026/02/12/us/politics/homeland-security-shutdown-funding.html",
    "summary": "Senate Democrats refused to move ahead with a spending bill needed to keep the Department of Homeland Security running because it lacked limits they have demanded on federal immigration agents."
  },
  {
    "title": "Prosecutor Seeks Dismissal of Charges Against Man Shot by ICE",
    "link": "https://www.nytimes.com/2026/02/12/us/prosecutor-dismiss-charges-men-shot-by-ice.html",
    "summary": "The top federal prosecutor in Minnesota asked a judge to drop charges against the immigrant who was shot by an ICE agent, saying new evidence was “materially inconsistent” with what officials had claimed."
  },
  {
    "title": "The High-Stakes Fight Over Masked Federal Agents",
    "link": "https://www.nytimes.com/2026/02/12/us/politics/congress-trump-ice-masked-agents.html",
    "summary": "The debate over whether federal agents should be allowed to cover their faces with masks has become a flashpoint as the government heads for a partial shutdown."
  },
  {
    "title": "Guard Troops Fully Withdraw From Chicago, Portland and Los Angeles",
    "link": "https://www.nytimes.com/2026/02/12/us/national-guard-chicago-portland-los-angeles.html",
    "summary": "President Trump initially deployed the troops in those cities to support law enforcement efforts to tamp down protests against immigration raids and protecting buildings."
  },
  {
    "title": "N.Y.C. Officials Reinstate Pride Flag at Stonewall After Federal Removal",
    "link": "https://www.nytimes.com/2026/02/12/nyregion/stonewall-flag-protest-nyc.html",
    "summary": "Hundreds of people attended a rally on Thursday to re-raise the flag, setting up a defiant response to the Trump administration’s assault on diversity initiatives."
  },
  {
    "title": "Canada School Shooter’s Online Life Showed Interest in Violent Extremism",
    "link": "https://www.nytimes.com/2026/02/12/world/canada/tumbler-ridge-shooting-suspect-social-media.html",
    "summary": "The suspect in the British Columbia shooting had long been posting about mental health problems, substance abuse and a fascination with weapons and online violence."
  },
  {
    "title": "What We Know About the Victims of the Tumbler Ridge Mass Shooting in Canada",
    "link": "https://www.nytimes.com/2026/02/12/world/canada/tumbler-ridge-shooting-victims-canada.html",
    "summary": "The attack at a secondary school and a private residence in the small, remote community in British Columbia has left families stunned and grief-stricken."
  },
  {
    "title": "Americans Are Paying the Bill for Tariffs, Despite Trump’s Claims",
    "link": "https://www.nytimes.com/2026/02/12/business/economy/americans-pay-tariffs-trump-fed.html",
    "summary": "Research from the New York Fed confirms that U.S. companies and consumers are bearing tariff costs, despite the president’s assertions otherwise."
  },
  {
    "title": "On Trump’s Tariffs, Supreme Court Hurries Up and Waits",
    "link": "https://www.nytimes.com/2026/02/12/us/the-docket-tariffs-wait-game.html",
    "summary": "The justices put the case on a fast track at the administration’s urging. But they don’t seem in a rush to rule on the president’s signature economic program."
  },
  {
    "title": "Closing of El Paso Airspace Adds to Tension Between F.A.A. and Pentagon",
    "link": "https://www.nytimes.com/2026/02/12/us/politics/faa-pentagon-el-paso-airspace.html",
    "summary": "The Federal Aviation Administration is charged with flight safety, and the Defense Department with national security. Those missions keep colliding."
  },
  {
    "title": "El Paso Incident Highlights Gaps in America’s Drone Defense Industry",
    "link": "https://www.nytimes.com/2026/02/12/business/el-paso-drone-technology.html",
    "summary": "The U.S. has spent billions of dollars developing counter-drone technology, but much of it needs more testing in the real world."
  },
  {
    "title": "Do Drug Cartels Actually Use Drones at the Border?",
    "link": "https://www.nytimes.com/2026/02/12/world/americas/mexico-drone-border-cartels.html",
    "summary": "U.S. officials warn that cartel-operated drones on the border pose a major threat. Mexican officials are less certain. Analysts say the answer is likely in between."
  },
  {
    "title": "C.I.A. Video Appeals to Potential Spies in China’s Military",
    "link": "https://www.nytimes.com/2026/02/12/us/politics/cia-china-spies.html",
    "summary": "The agency is seeking Chinese officials who are frustrated with corruption in the People’s Liberation Army."
  },
  {
    "title": "Alcohol’s Effects on the Body: What Does Drinking Do to Your Health?",
    "link": "https://www.nytimes.com/2026/02/12/well/alcohol-body-health-effects.html",
    "summary": "From the moment you take a sip, drinking starts to influence your biology. Here’s an inside look."
  },
  {
    "title": "Greg Brown, Guitarist Who Wrote Cake’s Biggest Hit, Dies at 56",
    "link": "https://www.nytimes.com/2026/02/12/arts/music/greg-brown-dead.html",
    "summary": "His song “The Distance,” released in 1996, became an anthem for the disaffected members of Generation X."
  },
  {
    "title": "Stop the Illegal Transfer of ISIS Suspects",
    "link": "https://www.nytimes.com/2026/02/13/opinion/syria-iraq-isis-syrian-democratic-forces-us.html",
    "summary": "The U.S. is sending thousands of men accused of belonging to the Islamic State from Syria to Iraq, where they face potential mistreatment."
  },
  {
    "title": "It Is Decision Time for NATO in Munich",
    "link": "https://www.nytimes.com/2026/02/13/opinion/nato-munich-conference.html",
    "summary": "The U.S. and Europe can save the trans-Atlantic alliance. They probably won’t."
  },
  {
    "title": "Japan Seizes Chinese Fishing Boat; Move Likely to Add to Tensions",
    "link": "https://www.nytimes.com/2026/02/13/world/asia/japan-seizes-chinese-boat.html",
    "summary": "The seizure of the trawler, which Japan said was sailing in its waters in the East China Sea, is likely to add to tensions between Tokyo and Beijing."
  },
  {
    "title": "Republicans Ask Supreme Court to Intervene in N.Y. Redistricting Case",
    "link": "https://www.nytimes.com/2026/02/12/nyregion/redistricting-supreme-court-ny.html",
    "summary": "Lawyers for Representative Nicole Malliotakis, Republican of New York, asked the Supreme Court to block a ruling that would redraw her district lines."
  },
  {
    "title": "Strong Storm Is Forecast to Hit the South This Weekend With a Risk of Heavy Rain",
    "link": "https://www.nytimes.com/2026/02/12/weather/us-south-rain-storm-forecast.html",
    "summary": "It’s finally warming up, which means the storm will most likely bring rain instead of more dreaded ice. But forecasters warned that there may be a lot of it."
  }
]