[
  {
    "title": "Can Zelensky Trust Trump? Ukraine’s Fate May Depend on the Answer.",
    "link": "https://www.nytimes.com/2025/08/18/us/politics/zelensky-trump-ukraine-trust.html",
    "summary": "President Trump has offered only vague assurances of security guarantees for Ukraine if President Volodymyr Zelensky agrees to cut a deal with Russia."
  },
  {
    "title": "At White House Summit, a Master Class of Diplomacy. In Courting Trump.",
    "link": "https://www.nytimes.com/2025/08/18/us/politics/white-house-summit-diplomacy-courting-trump.html",
    "summary": "President Volodymyr Zelensky of Ukraine and other European leaders have learned a thing or two about negotiating, Trump-style. So has Vladimir Putin."
  },
  {
    "title": "Zelensky Says He’s Ready to Meet Putin After Trump Talks",
    "link": "https://www.nytimes.com/2025/08/18/us/zelensky-trump-putin-meeting.html",
    "summary": "President Volodymyr Zelensky emerged upbeat, but repeated that Ukraine will not cede land to Russia. There were few tangible signs of progress toward a peace deal."
  },
  {
    "title": "5 Takeaways From Trump’s Meeting With Zelensky and European Leaders",
    "link": "https://www.nytimes.com/2025/08/18/us/politics/takeaways-trump-zelensky-putin.html",
    "summary": "The leaders presented a relatively united front and appeared to agree on the next steps in the effort to halt the fighting between Ukraine and Russia. But much remained unresolved."
  },
  {
    "title": "Trump Administration Discusses Taking 10% Stake in Intel",
    "link": "https://www.nytimes.com/2025/08/18/technology/intel-trump-government-stake.html",
    "summary": "Federal officials are considering the move because Intel, the last leading-edge chipmaker in the United States, has been struggling."
  },
  {
    "title": "In Surprise Move, Trump Taps Missouri Attorney General to Help Run F.B.I.",
    "link": "https://www.nytimes.com/2025/08/18/us/politics/fbi-missouri-attorney-general.html",
    "summary": "The move appears to diminish the authority of the current deputy director, Dan Bongino, whose tumultuous tenure has included a pitched argument over files related to the disgraced financier Jeffrey Epstein."
  },
  {
    "title": "Air Force’s Top General to Retire Early",
    "link": "https://www.nytimes.com/2025/08/18/us/politics/air-force-general-trump-hegseth-pentagon.html",
    "summary": "Gen. David Allvin, the chief of staff of the Air Force, is the latest high-ranking general to exit following President Trump’s purge of Pentagon leadership."
  },
  {
    "title": "Mississippi and Louisiana Will Send National Guard Troops to D.C.",
    "link": "https://www.nytimes.com/2025/08/18/us/politics/national-guard-dc-trump-mississippi-louisiana.html",
    "summary": "Ohio, West Virginia and South Carolina have also deployed the Guard to Washington to support President Trump’s crackdown on the city."
  },
  {
    "title": "Republican Bid to Help Trump Move Past Epstein Falls Flat",
    "link": "https://www.nytimes.com/2025/08/18/us/politics/republicans-epstein-files.html",
    "summary": "Republicans in Congress managed to recess for the summer without voting on the issue, but it has continued to dog them and awaits them when they return."
  },
  {
    "title": "Justice Dept. Will Begin Sharing Epstein Files on Friday, Top Republican Says",
    "link": "https://www.nytimes.com/2025/08/18/us/politics/epstein-files-release-trump.html",
    "summary": "The chairman of the House Oversight Committee said the department would miss a Tuesday deadline his panel set in a subpoena but would begin sharing some records on Friday."
  },
  {
    "title": "Why Rip Currents From Hurricane Erin Are So Dangerous to the East Coast",
    "link": "https://www.nytimes.com/2025/08/18/weather/hurricane-erin-rip-current-east-coast-carolina.html",
    "summary": "Rip currents are the third leading cause of deaths from hurricanes, and they can happen on a sunny day hundreds of miles from the storm."
  },
  {
    "title": "Hurricane Erin Brings Rip Currents Closing Jersey Shore and Rehoboth Beaches",
    "link": "https://www.nytimes.com/2025/08/19/nyregion/hurricane-erin-beach-closures-new-jersey.html",
    "summary": "Several beaches in New Jersey and Delaware were closed on Monday as the powerful storm churned in the Atlantic. Rip currents have been blamed for at least one death."
  },
  {
    "title": "Terence Stamp’s Swinging, Smoldering Style",
    "link": "https://www.nytimes.com/2025/08/18/style/terence-stamps-swinging-smoldering-style.html",
    "summary": "He helped redefine male beauty, ushering in the era of the cinematic bad boy."
  },
  {
    "title": "Hamas Accepts New Gaza Cease-Fire Proposal, Officials Say",
    "link": "https://www.nytimes.com/2025/08/18/world/middleeast/hamas-israel-gaza-ceasefire.html",
    "summary": "It was unclear whether Prime Minister Benjamin Netanyahu of Israel was on board with the terms, which came as Qatar and Egypt were intensifying mediation efforts."
  },
  {
    "title": "Israel Is in Talks to Send Gazans to South Sudan, Officials Say",
    "link": "https://www.nytimes.com/2025/08/18/world/middleeast/israel-gazans-south-sudan.html",
    "summary": "Israel has broadened its push, so far unsuccessful, to persuade other countries to take in Gazans en masse. Critics say the relocation could violate international law."
  },
  {
    "title": "As Trump’s Policies Take Hold, Springfield, Ohio, Loses Its Haitian Work Force",
    "link": "https://www.nytimes.com/2025/08/18/us/springfield-ohio-haitian-immigrants-trump.html",
    "summary": "Springfield faced a crisis after Donald Trump falsely claimed Haitians were eating pets. Now his policies are driving out workers like Wilford Rinvil, who left for Canada."
  },
  {
    "title": "Immigration Enforcement Takes Key Role in Trump’s D.C. Crime Crackdown",
    "link": "https://www.nytimes.com/2025/08/18/us/trump-immigration-dc-crime.html",
    "summary": "Immigrants who live and work in the city say they want violent crime lowered but fear that ICE efforts could make it worse."
  },
  {
    "title": "He Sold His Likeness. Now His Avatar Is Shilling Supplements on TikTok.",
    "link": "https://www.nytimes.com/2025/08/17/business/tiktok-ai-avatars.html",
    "summary": "Welcome to a new era of commercial work fueled by generative artificial intelligence."
  },
  {
    "title": "Madison Avenue Is Starting to Love A.I.",
    "link": "https://www.nytimes.com/2025/08/18/business/madison-avenue-is-starting-to-love-ai.html",
    "summary": "Advertisers are increasingly using generative artificial intelligence to make their commercials."
  },
  {
    "title": "Dealer Known as ‘Ketamine Queen’ to Plead Guilty in Matthew Perry Case",
    "link": "https://www.nytimes.com/2025/08/18/arts/television/matthew-perry-jasveen-singha-guilty-plea.html",
    "summary": "Jasveen Sangha will plead guilty to selling the ketamine that killed the “Friends” star, prosecutors said. She could face decades in prison."
  },
  {
    "title": "Talks Restart as Air Canada Flight Attendants’ Strike Continues",
    "link": "https://www.nytimes.com/2025/08/18/world/canada/air-canada-strike-flight-attendant-labor-board.html",
    "summary": "Negotiations between the airline and the flight attendants’ union resumed on Monday, hours after a labor relations board declared the walkout illegal."
  },
  {
    "title": "Air Canada Strike Leaves Stranded Passengers Frustrated and Angry",
    "link": "https://www.nytimes.com/2025/08/18/travel/air-canada-strike-refund.html",
    "summary": "Many passengers are still struggling to find alternative transportation and are angry at the airline. “You feel like you’re at their mercy,” said one."
  },
  {
    "title": "The Man Who Saw the Future of Africa",
    "link": "https://www.nytimes.com/2025/08/19/opinion/africa-future-kwame-nkrumah.html",
    "summary": "As the world’s powers turn away from the continent, Kwame Nkrumah’s vision for Africa may hold the key to realizing its potential today."
  },
  {
    "title": "Trump Just Reminded Me of Why I’m Still a Neocon",
    "link": "https://www.nytimes.com/2025/08/18/opinion/trump-israel-ukraine-zelensky.html",
    "summary": "By putting the interests of what Trump calls “peace” ahead of the interests of freedom, we are all-but guaranteeing that Ukraine will lose both."
  },
  {
    "title": "Cases of Mosquito-Borne Chikungunya Virus Are Surging Globally: What to Know",
    "link": "https://www.nytimes.com/2025/08/19/health/chikungunya-virus-mosquitoes-what-to-know.html",
    "summary": "Chikungunya, which can disable victims for years, is spreading rapidly, including in China and other places that have not seen it before."
  },
  {
    "title": "A Pakistani Village Devastated by Flooding: ‘Like Death Visited Every Home’",
    "link": "https://www.nytimes.com/2025/08/18/world/asia/pakistan-floods-village.html",
    "summary": "At least 660 people have died in rain-related incidents across Pakistan since monsoon season began in late June, and 935 more have been injured."
  },
  {
    "title": "M.T.A. Approves Major Contract to Expand the Second Avenue Subway Line",
    "link": "https://www.nytimes.com/2025/08/18/nyregion/mta-second-avenue-subway-harlem-125th-street.html",
    "summary": "The contract, which will award nearly $2 billion to construction firms, funds crucial aspects of the latest phase of the long-awaited subway expansion into East Harlem."
  },
  {
    "title": "Fire and Explosion Damage Ship in Baltimore Harbor",
    "link": "https://www.nytimes.com/2025/08/18/us/baltimore-ship-explosion.html",
    "summary": "No one was injured in the explosion, which occurred aboard a bulk carrier ship near the site of the collapse of the Francis Scott Key Bridge in 2024."
  }
]