[
  {
    "title": "Comey to Appear in Court in Case That Has Roiled Justice Dept.",
    "link": "https://www.nytimes.com/2025/10/08/us/politics/james-comey-arraignment.html",
    "summary": "The case against James B. Comey, the former F.B.I. director, was deemed too thin by a previous federal prosecutor, who quit under pressure from President Trump."
  },
  {
    "title": "Comey Goes to Court, and Gold Prices Hit Record High",
    "link": "https://www.nytimes.com/2025/10/08/podcasts/the-headlines/comey-gold-prices.html",
    "summary": "Plus, how job applicants are tricking A.I."
  },
  {
    "title": "Trump’s H-1B Visa Fee Could Strain Universities and Schools",
    "link": "https://www.nytimes.com/2025/10/08/us/politics/trump-h-1b-visa-fee-universities.html",
    "summary": "Higher education leaders and public-school superintendents say they depend on skilled foreign workers to fill critical roles."
  },
  {
    "title": "Senate Confirms Neil Jacobs, ‘Sharpiegate’ Meteorologist, to Lead NOAA",
    "link": "https://www.nytimes.com/2025/10/07/us/politics/senate-neil-jacobs-noaa.html",
    "summary": "Neil Jacobs was found to have violated NOAA’s code of ethics after an investigation into an incident that centered on an altered hurricane forecast map in 2019."
  },
  {
    "title": "How the Right Uses Charlie Kirk’s Death to Further Their Policies",
    "link": "https://www.nytimes.com/2025/10/08/world/americas/charlie-kirk-peru-porky.html",
    "summary": "The mayor of Lima, Peru, held a Charlie Kirk memorial — filled with attendees bused in from poor neighborhoods — as he sought help from the Trump administration."
  },
  {
    "title": "Meet ‘Porky,’ Lima’s Right-Wing Mayor Embracing Trump’s MAGA Movement",
    "link": "https://www.nytimes.com/2025/10/08/world/americas/porky-lopez-aliaga-lima-mayor-trump.html",
    "summary": "By embodying President Trump’s brash style, Rafael López Aliaga has become a leading candidate to be Peru’s next president."
  },
  {
    "title": "Nobel Prize in Chemistry Awarded to Architects of Metal-Organic Frameworks",
    "link": "https://www.nytimes.com/2025/10/08/science/nobel-prize-chemistry.html",
    "summary": "The prize was awarded to Susumu Kitagawa, Richard Robson and Omar Yaghi for the development of a new type of molecular architecture."
  },
  {
    "title": "Nobel Prizes 2025: What to Know",
    "link": "https://www.nytimes.com/2025/10/06/world/europe/nobel-prize.html",
    "summary": "The awards are being announced this week."
  },
  {
    "title": "How Much It Costs to Drive an E.V. and a Gas Car in Every State",
    "link": "https://www.nytimes.com/2025/10/08/upshot/ev-versus-gas-car-comparison-cost.html",
    "summary": "Charging an electric car battery is usually cheaper than going to the gas pump. But it depends on where you live."
  },
  {
    "title": "Supreme Court to Consider Illinois Mail-In Balloting Lawsuit",
    "link": "https://www.nytimes.com/2025/10/08/us/politics/supreme-court-mail-ballots-illinois.html",
    "summary": "The case, one of several challenges to mail-in ballot rules lodged by allies of President Trump, involves an effort to exclude votes received after Election Day."
  },
  {
    "title": "Cheer Up, or Else: China Cracks Down on the Haters and Cynics",
    "link": "https://www.nytimes.com/2025/10/08/world/asia/china-censorship-pessimism-despair.html",
    "summary": "As China struggles with economic discontent, internet censors are silencing those who voice doubts about work, marriage, or simply sigh too loudly online."
  },
  {
    "title": "Why Is This Lake ‘Burping’?",
    "link": "https://www.nytimes.com/2025/10/08/nyregion/seneca-lake-guns-drums.html",
    "summary": "For hundreds of years, people who have lived near Seneca Lake in upstate New York have reported hearing loud booms coming from the water. No one is exactly sure why."
  },
  {
    "title": "Civil Rights Lawyer Bryan Stevenson on How America’s Story Should Be Told",
    "link": "https://www.nytimes.com/2025/10/08/us/trump-smithsonian-bryan-stevenson.html",
    "summary": "The founder of the Equal Justice Initiative says it would be “dishonorable” to remain silent in the face of President Trump’s efforts."
  },
  {
    "title": "In Syria, a Crackdown on Gunfire at Weddings",
    "link": "https://www.nytimes.com/2025/10/08/world/middleeast/syria-weddings-tradition-gunfire-fireworks.html",
    "summary": "Marriages and other glad occasions in Syria are often celebrated by firing shots in the air. But after nearly 14 years of war, people want the guns to go silent."
  },
  {
    "title": "Fra Angelico and the Miracle of Faith Made Visible",
    "link": "https://www.nytimes.com/2025/10/07/arts/design/fra-angelico-florence-palazzo-strozzi.html",
    "summary": "A once-in-a-generation exhibition in Italy shows how the Renaissance painter believed something with his whole heart, and then made it manifest."
  },
  {
    "title": "Is This the End of an Era for Soul Food in Washington?",
    "link": "https://www.nytimes.com/2025/10/07/dining/soul-food-washington.html",
    "summary": "As several of the city’s classic Black-owned restaurants close, some historians worry about the passing of a beloved tradition."
  },
  {
    "title": "Tom Friedman on the Only Way to Solve the Israel-Hamas War",
    "link": "https://www.nytimes.com/2025/10/08/opinion/hamas-israel-ceasefire-trump-peace-gaza.html",
    "summary": "Can Donald Trump end the “worst war” with the latest round of peace talks?"
  },
  {
    "title": "What the Shutdown Is Really About",
    "link": "https://www.nytimes.com/2025/10/08/opinion/ezra-klein-podcast-neera-tanden.html",
    "summary": "Obamacare premiums could double for millions of Americans if the law isn’t changed. Neera Tanden walks Ezra Klein through the shutdown’s policy stakes."
  },
  {
    "title": "How ‘Les Mis’ Became So Successful",
    "link": "https://www.nytimes.com/2025/10/08/briefing/how-les-mis-became-so-successful.html",
    "summary": "We look at the story behind its more than 15,000-show run."
  },
  {
    "title": "Josh Johnson to Trump: He’s Not ‘Puff Daddy’ Anymore",
    "link": "https://www.nytimes.com/2025/10/08/arts/television/josh-johnson-trump-ghislaine-maxwell.html",
    "summary": "The “Daily Show” host found comedic fodder in an Oval Office event about mining in Alaska, at which the president wound up talking about Sean Combs."
  },
  {
    "title": "Oakland, California, Residents Are Fed Up With Illegal Dumping",
    "link": "https://www.nytimes.com/2025/10/08/us/oakland-california-trash-garbage.html",
    "summary": "Many residents say that illegal dumping has inundated Oakland, Calif., a city with more garbage than almost anywhere else."
  },
  {
    "title": "200 Animals and a 95-Year-Old Are Found Inside a Squalid Suburban Home",
    "link": "https://www.nytimes.com/2025/10/07/nyregion/long-island-animal-hoarding-charges.html",
    "summary": "The woman was confined to her room by clutter, and a Long Island wildlife rehabilitator faces charges. The authorities found everything from cats to voles, many of them in dire conditions."
  },
  {
    "title": "Carney and Trump: A Collision Avoided, Save for a Nasty Comment or Two",
    "link": "https://www.nytimes.com/2025/10/07/us/politics/carney-trump-canada-trade-relationship.html",
    "summary": "The Canadian prime minister came to Washington determined to take the heat out of the relationship. He mostly succeeded, at least for now."
  },
  {
    "title": "Myanmar Military Paraglider Bombs Buddhist Festival, Killing Dozens",
    "link": "https://www.nytimes.com/2025/10/08/world/asia/myanmar-bombing-buddhist-festival-chaung-u.html",
    "summary": "The junta targeted a  festival in the Sagaing region where people were also protesting army rule, according to witnesses and the civilian government in exile."
  }
]