[
  {
    "title": "Israel-Backed Aid Sites In Gaza Pose Lethal Risk for Palestinians Amid Deadly Fighting",
    "link": "https://www.nytimes.com/2025/06/26/world/middleeast/gaza-aid-violence.html",
    "summary": "Hundreds of Palestinians have been killed over the past month near aid hubs set up under a new Israel-backed system, according to Gaza health officials."
  },
  {
    "title": "RFK Jr.’s New Advisers Rescind Recommendations for Some Flu Vaccines",
    "link": "https://www.nytimes.com/2025/06/26/health/rfk-jr-vaccines-acip-cdc.html",
    "summary": "Panelists pulled back some endorsements for certain vaccines containing a preservative that critics have falsely linked to autism."
  },
  {
    "title": "Hegseth and Caine Delve Into Details but Not Results of Iranian Strikes",
    "link": "https://www.nytimes.com/2025/06/26/us/politics/iran-hegseth-caine.html",
    "summary": "Neither man gave new assessments of the state of Iran’s nuclear program or the damage to its sites."
  },
  {
    "title": "Centrifuges at Iran’s Fordo ‘No Longer Operational’ After U.S. Strikes, Nuclear Watchdog Says",
    "link": "https://www.nytimes.com/2025/06/26/world/middleeast/centrifuges-fordo-damage-iran.html",
    "summary": "The director general of the International Atomic Energy Agency said that there was “no escaping significant physical damage” after a U.S. strike on the Iranian facility."
  },
  {
    "title": "Iran’s Supreme Leader Khamenei Makes First Public Comments in Almost a Week",
    "link": "https://www.nytimes.com/2025/06/26/world/middleeast/iran-leader-khamenei-statement.html",
    "summary": "In a video, the Iranian supreme leader downplays damage to the country’s nuclear program, after not being seen publicly for nearly a week."
  },
  {
    "title": "Eric Adams Meets With Business Leaders Desperate to Stop Mamdani’s Rise",
    "link": "https://www.nytimes.com/2025/06/26/nyregion/eric-adams-business-leaders-meeting.html",
    "summary": "Daniel Loeb, the hedge fund manager, and some other New York City business leaders are aghast at Zohran Mamdani’s success in the Democratic mayoral primary and are considering backing Mr. Adams in the general election."
  },
  {
    "title": "How Zohran Mamdani Says He Did It",
    "link": "https://www.nytimes.com/video/nyregion/100000010249653/how-zohran-mamdani-says-he-won.html",
    "summary": "Emma Fitzsimmons, City Hall bureau chief for The New York Times, explains how State Assemblyman Zohran Mamdani claimed victory over former Gov. Andrew Cuomo."
  },
  {
    "title": "Mamdani Triumphed Without a Majority of Black Voters. Where Does That Leave Them?",
    "link": "https://www.nytimes.com/2025/06/26/us/politics/mamdani-black-voters-democrats.html",
    "summary": "Black city leaders are worried their influence is waning at a moment when the rising costs that Zohran Mamdani put at the center of his campaign are pushing Black New Yorkers out of the city."
  },
  {
    "title": "How Brad Lander Helped Push Zohran Mamdani Toward Victory",
    "link": "https://www.nytimes.com/2025/06/26/nyregion/brad-lander-zohran-mamdani.html",
    "summary": "In New York’s mayoral primary, Andrew Cuomo was no match for the energy of progressive rivals who saw a virtue in unity."
  },
  {
    "title": "Zohran Mamdani’s Winning Style",
    "link": "https://www.nytimes.com/2025/06/26/style/zohran-mamdani-style.html",
    "summary": "The Democratic candidate for New York City mayor understands what it means to look the part. Many parts."
  },
  {
    "title": "Wall Street’s Regulatory Reins Start Loosening as Fed Proposes New Rule",
    "link": "https://www.nytimes.com/2025/06/26/business/fed-banks-capital-rule-change.html",
    "summary": "The central bank is planning to reduce a capital buffer for the country’s largest banks, which critics warn will make the financial system less resilient."
  },
  {
    "title": "Crypto Industry Moves Into the U.S. Housing Market",
    "link": "https://www.nytimes.com/2025/06/26/business/crypto-industry-housing-market.html",
    "summary": "Americans are finding ways to use digital currencies to help them buy homes, and new companies are forming to help people tap their home’s value to buy Bitcoin."
  },
  {
    "title": "If Everyone Had Voted, Kamala Harris Still Would Have Lost",
    "link": "https://www.nytimes.com/2025/06/26/upshot/turnout-2024-election-trump-harris.html",
    "summary": "New data, based on authoritative voter records, suggests that Donald Trump would have done even better in 2024 with higher turnout."
  },
  {
    "title": "Trump Won by Turning Out Voters and Building a Diverse Coalition, Report Finds",
    "link": "https://www.nytimes.com/2025/06/26/us/politics/trump-harris-2024-pew-study.html",
    "summary": "A new Pew Research Center study found that 85 percent of President Trump’s 2020 supporters came out to vote for him again, a better rate than Democrats pulled off."
  },
  {
    "title": "Supreme Court Blocks Planned Parenthood From Suing Over Medicaid Funds",
    "link": "https://www.nytimes.com/2025/06/26/us/supreme-court-planned-parenthood.html",
    "summary": "The question for the justices was whether Medicaid beneficiaries may sue to receive services under a law that lets them choose any qualified provider."
  },
  {
    "title": "Supreme Court Sides With Death Row Prisoner Seeking DNA Testing",
    "link": "https://www.nytimes.com/2025/06/26/us/supreme-court-death-row-dna.html",
    "summary": "For nearly 15 years, a man on death row in Texas has sought DNA testing to try and prove he did not kill an 85-year-old woman."
  },
  {
    "title": "Luke Littler May Be Darts’ First Global Superstar",
    "link": "https://www.nytimes.com/2025/06/26/magazine/luke-littler-darts.html",
    "summary": "Luke Littler, the world’s best pro darts player, is just 18 — and he’s helping put his sport on the map."
  },
  {
    "title": "A.I. Is Starting to Wear Down Democracy",
    "link": "https://www.nytimes.com/2025/06/26/technology/ai-elections-democracy.html",
    "summary": "Content generated by artificial intelligence has become a factor in elections around the world. Most of it is bad, misleading voters and discrediting the democratic process."
  },
  {
    "title": "How America Changed After the Supreme Court Legalized Same-Sex Marriage in Obergefell v. Hodges",
    "link": "https://www.nytimes.com/2025/06/26/us/politics/gay-marriage-obergefell-hodges-anniversary.html",
    "summary": "On the 10th anniversary of the Supreme Court decision legalizing same-sex marriage nationally, supporters say they are secure but also wary and watchful."
  },
  {
    "title": "10 Years After the Supreme Court Legalized Same-Sex Marriage Nationwide, Here’s What Couples Think",
    "link": "https://www.nytimes.com/2025/06/26/style/same-sex-marriage-supreme-court.html",
    "summary": "A decade after the Supreme Court legalized same-sex marriage nationwide, we asked people from across the country to share stories of what the ruling in Obergefell v. Hodges has meant to them."
  },
  {
    "title": "These L.G.B.T.Q. Figures Forever Changed U.S. History",
    "link": "https://www.nytimes.com/2025/06/26/us/politics/important-lgbtq-figures-history.html",
    "summary": "They helped advance the rights of lesbian, gay, bisexual, transgender, queer and questioning people through legislation, legal challenges or fiery advocacy."
  },
  {
    "title": "How the Gay Rights Movement Radicalized, and Lost Its Way",
    "link": "https://www.nytimes.com/2025/06/26/opinion/gay-lesbian-trans-rights.html",
    "summary": "In the decade after the Supreme Court decision about same-sex marriage, the lesbian and gay movement has radicalized."
  },
  {
    "title": "Peter Thiel and the Antichrist",
    "link": "https://www.nytimes.com/2025/06/26/opinion/peter-thiel-antichrist-ross-douthat.html",
    "summary": "The original tech right power player on A.I., Mars and immortality."
  },
  {
    "title": "Your Questions About the Economy",
    "link": "https://www.nytimes.com/2025/06/26/briefing/your-questions-about-the-economy.html",
    "summary": "You asked. We answered."
  },
  {
    "title": "How Sandwiches in Canada’s Lloydminster Became a Test for Domestic Trade",
    "link": "https://www.nytimes.com/2025/06/26/world/americas/canada-lloydminster-sandwich-meat-trade.html",
    "summary": "A city that straddles two Canadian provinces became a crucible of the barriers that prevent trade across Canada and that Prime Minister Mark Carney wants to dismantle."
  },
  {
    "title": "Global Warming Is Speeding Up and the World Is Feeling the Effects",
    "link": "https://www.nytimes.com/2025/06/26/climate/climate-heat-intensity.html",
    "summary": "Human-caused global warming has been increasing faster and faster since the 1970s."
  },
  {
    "title": "Tanner Martin Announces His Own Death",
    "link": "https://www.nytimes.com/2025/06/26/us/tanner-martin-dead-cancer-tiktok.html",
    "summary": "Tanner Martin has documented his fight against colon cancer for hundreds of thousands of followers. His death was announced in a recorded video."
  }
]