[
  {
    "title": "Trump Predicts More Indictments After Comey and Claims It’s Not Revenge",
    "link": "https://www.nytimes.com/2025/09/26/us/politics/trump-comey-revenge.html",
    "summary": "President Trump has made clear that he expects the Justice Department to mete out punishment to his perceived enemies."
  },
  {
    "title": "Justice Dept. Seeks Information on Fani Willis, Georgia D.A. Who Prosecuted Trump",
    "link": "https://www.nytimes.com/2025/09/26/us/justice-department-fani-willis-trump.html",
    "summary": "Federal investigators have subpoenaed records related to travel they believe Fani Willis took around the time of last year’s election, but it was not immediately clear why."
  },
  {
    "title": "Trump Fired a U.S. Attorney Who Insisted on Following a Court Order",
    "link": "https://www.nytimes.com/2025/09/26/us/trump-fires-us-attorney-california-immigration.html",
    "summary": "The top federal prosecutor in Sacramento was fired hours after she reminded a Border Patrol chief to abide by court-ordered restrictions on immigration raids."
  },
  {
    "title": "Examining James Comey’s 2020 Testimony at the Heart of His Indictment",
    "link": "https://www.nytimes.com/2025/09/26/us/politics/james-comey-testimony-trump.html",
    "summary": "The charges against the former F.B.I. director center on an appearance he made before a Senate committee in September 2020. Here’s a closer look."
  },
  {
    "title": "Give In or Fight Back? Colleges Are Torn on How to Respond to Trump.",
    "link": "https://www.nytimes.com/2025/09/27/us/trump-university-california-berkeley-tactics.html",
    "summary": "The University of California, one of the Trump administration’s biggest targets so far, is in an uproar over how to respond to the president’s attacks. So is the rest of higher education."
  },
  {
    "title": "Unexpected Critics of Trump’s Attacks on Wind Energy: Oil Executives",
    "link": "https://www.nytimes.com/2025/09/27/business/energy-environment/oil-gas-trump-offshore-wind.html",
    "summary": "Business leaders and trade organizations have been especially worried by attempts to stop work on wind farms that had already secured federal approval."
  },
  {
    "title": "Trump Administration Asks Supreme Court to Allow End of Birthright Citizenship",
    "link": "https://www.nytimes.com/2025/09/26/us/politics/supreme-court-birthright-citizenship.html",
    "summary": "Government lawyers asked the justices to clear the way for the president’s executive order ending birthright citizenship."
  },
  {
    "title": "Netanyahu’s Defiant U.N. Speech Aimed at Home as Well as the World",
    "link": "https://www.nytimes.com/2025/09/27/world/middleeast/israel-netanyahu-united-nations.html",
    "summary": "The Israeli prime minister faced walkouts and protests at the United Nations, but signaled that resisting Palestinian statehood could become the core of his appeal to Israeli voters."
  },
  {
    "title": "Trump Believes ‘We Have a Deal’ on Gaza. But a Host of Obstacles Remain.",
    "link": "https://www.nytimes.com/2025/09/26/us/politics/trump-gaza-deal.html",
    "summary": "Whether President Trump can help bring the war to an end will probably depend on how much he is willing to push Benjamin Netanyahu."
  },
  {
    "title": "Trump Displays Little Interest in Fostering Unity Amid Political Violence",
    "link": "https://www.nytimes.com/2025/09/27/us/politics/political-violence-kirk-trump.html",
    "summary": "After an assassination attempt, Gov. George Wallace, the segregationist, got a surprise visitor: Shirley Chisholm, the first Black woman elected to Congress. Could this happen today?"
  },
  {
    "title": "Onstage, Chappell Roan Is a Powerhouse. And Exactly Where She Wants to Be.",
    "link": "https://www.nytimes.com/2025/09/27/arts/music/chappell-roan-damsels-dangerous-things-tour.html",
    "summary": "The singer’s Visions of Damsels & Other Dangerous Things Tour highlights how she continues to deviate from the rising pop star’s expected playbook."
  },
  {
    "title": "Des Moines Schools Superintendent Ian Roberts Detained by ICE, Officials Say",
    "link": "https://www.nytimes.com/2025/09/26/us/des-moines-schools-ice-immigration.html",
    "summary": "Federal immigration officials said the superintendent had received a deportation order in May 2024 and fled from agents when they approached him on Friday."
  },
  {
    "title": "Russia Steps Up Provocations in Europe, Alarming Leaders There",
    "link": "https://www.nytimes.com/2025/09/27/world/europe/russia-europe-poland-drones-moldova-election.html",
    "summary": "European officials fear that Moscow is escalating its antagonism of Europe as U.S. support recedes. A focus of worry now: election interference in Moldova."
  },
  {
    "title": "His Parents Disappeared. In a TV Studio, He Confessed to Killing Them.",
    "link": "https://www.nytimes.com/2025/09/27/nyregion/albany-parent-murders-interview.html",
    "summary": "After investigators came looking, Lorenz Kraus told a reporter he had strangled Franz and Theresia Kraus eight years ago. Two bodies were buried in their backyard."
  },
  {
    "title": "Iowa Matters Less Than Ever for Democrats, but They Can’t Quit It",
    "link": "https://www.nytimes.com/2025/09/27/us/politics/iowa-democrats-president.html",
    "summary": "The state no longer goes first for the party’s presidential nomination process, but ambitious politicians with an eye toward 2028 keep showing up. It’s “the gravitational pull,” as one Iowa Democrat put it."
  },
  {
    "title": "Jeanne Shaheen Wants to Make Foreign Policy Bipartisan Again",
    "link": "https://www.nytimes.com/2025/09/27/us/politics/jeanne-shaheen-foreign-policy.html",
    "summary": "The Democrat from New Hampshire has worked to find common ground with the Trump administration on foreign affairs."
  },
  {
    "title": "Making Florida More Flood Resistant Is Forcing Hard Choices for Homeowners",
    "link": "https://www.nytimes.com/2025/09/27/us/making-florida-more-flood-resistant-is-forcing-hard-choices-for-homeowners.html",
    "summary": "A rule requiring many storm-damaged homes to be demolished or rebuilt to the latest flood-resistant standards has exacted personal and cultural costs."
  },
  {
    "title": "We’re All Going to Die — Soonish!",
    "link": "https://www.nytimes.com/2025/09/27/opinion/grok-ai-companions-x.html",
    "summary": "Even with big blue eyes or amazing pecs, A.I.’s allure can be deadly."
  },
  {
    "title": "What a Book of Excuses Reveals About the Democrats’ Future",
    "link": "https://www.nytimes.com/2025/09/27/opinion/kamala-harris-107-days-memoir-democratic-party.html",
    "summary": "Three Opinion writers weigh in on Kamala Harris’s campaign memoir."
  },
  {
    "title": "Banner Year",
    "link": "https://www.nytimes.com/2025/09/27/briefing/banner-year.html",
    "summary": "Milestone birthdays occasion consideration of what we’ve done with our lives, and what we want to do with the time to come."
  },
  {
    "title": "Do You Use A.I. Chatbots for Health Advice?",
    "link": "https://www.nytimes.com/2025/09/25/well/ai-chatbots-health.html",
    "summary": "We want to hear about it."
  },
  {
    "title": "Catholic School Teacher Says She Was Suspended for Surrogate Pregnancy",
    "link": "https://www.nytimes.com/2025/09/27/nyregion/nj-teacher-surrogate-pregnancy.html",
    "summary": "Jadira Bonilla, a kindergarten teacher at a Catholic school in southern New Jersey, was told she might have violated her contract, according to an email shared with The New York Times."
  },
  {
    "title": "China’s Small Steps Look Bigger Next to Trump’s Retreat",
    "link": "https://www.nytimes.com/2025/09/27/world/asia/china-un-trump-leader.html",
    "summary": "Beijing’s climate and trade pledges at the U.N. highlighted how modest moves can stand out when the United States is pulling back from global leadership."
  },
  {
    "title": "Hawaiian Village Rebuilds With Modular Tiny Homes After Maui Wildfire Destruction",
    "link": "https://www.nytimes.com/2025/09/27/headway/lahaina-hawaii-modular-homes-wildfires.html",
    "summary": "After Lahaina burned in August 2023, Hawaii invested in a modular home development, hoping to build community and leave behind permanent infrastructure."
  }
]