[
  {
    "title": "Trump Administration Scrambles to Pick Up the Pieces of Broken Tariffs",
    "link": "https://www.nytimes.com/2026/02/23/us/politics/trump-tariffs-supreme-court.html",
    "summary": "President Trump is already working to piece his tariff program back together, after a Supreme Court ruling ruptured a centerpiece of his economic agenda."
  },
  {
    "title": "Trump-Appointed Judge Bars Release of Jack Smith’s Report in Documents Case",
    "link": "https://www.nytimes.com/2026/02/23/us/politics/trump-jack-smith-classified-documents-aileen-cannon.html",
    "summary": "Judge Aileen Cannon, a Trump-appointed federal judge in Florida, slammed the former special counsel, Jack Smith, for drafting the report even after she had dismissed the case."
  },
  {
    "title": "Judges Grow Angry Over Trump Administration Violating Their Orders",
    "link": "https://www.nytimes.com/2026/02/23/us/politics/judges-contempt-immigration-trump.html",
    "summary": "At least 35 times since August, federal judges have ordered the administration to explain why it should not be punished for violating their orders in immigration cases."
  },
  {
    "title": "‘Angel Families’ Return to Washington to Back Up Trump Ahead of State of the Union",
    "link": "https://www.nytimes.com/2026/02/23/us/politics/trump-angel-families-undocumented-immigrants.html",
    "summary": "The families of people killed by undocumented immigrants have forged a bond with the president, who has invited some of them to his address on Tuesday."
  },
  {
    "title": "C.I.A. Intelligence Helped Lead Mexican Authorities to ‘El Mencho’",
    "link": "https://www.nytimes.com/2026/02/23/world/americas/cia-el-hencho-location-mexico.html",
    "summary": "Mexican officials said they had found the elusive cartel kingpin by tracking a romantic partner. The C.I.A. provided some intelligence critical to the operation."
  },
  {
    "title": "Mexican Forces Say They Tracked El Mencho to Cabin by Following His Lover",
    "link": "https://www.nytimes.com/2026/02/23/world/americas/el-mencho-mexico-cartel-military-raid.html",
    "summary": "Top security officials revealed details of the operation that led to the death of Mexico’s most wanted drug cartel leader."
  },
  {
    "title": "What Travelers Need to Know as Cartel Violence Rattles Mexico",
    "link": "https://www.nytimes.com/2026/02/23/travel/cartel-violence-mexico-el-mencho-travel-flights.html",
    "summary": "The killing of a drug lord and the unrest that followed have prompted flight cancellations, roadblocks, cruise disruptions and “shelter in place” alerts."
  },
  {
    "title": "Snow Day! What It Looks Like When New York City Comes Out to Play.",
    "link": "https://www.nytimes.com/2026/02/23/nyregion/snow-day-blizzard-winter-storm.html",
    "summary": "Across the five boroughs, New Yorkers sledded and frolicked, but the best moments were when the city stood still."
  },
  {
    "title": "Peter Attia Leaves CBS News Amid Epstein Files Fallout",
    "link": "https://www.nytimes.com/2026/02/23/well/peter-attia-cbs-epstein.html",
    "summary": "Emails showed that the longevity influencer had provided medical advice to Jeffrey Epstein and had made crude comments about women."
  },
  {
    "title": "U.K. Police Arrest Peter Mandelson, Ex-Ambassador to the U.S., Amid Epstein Accusations",
    "link": "https://www.nytimes.com/2026/02/23/world/europe/peter-mandelson-epstein-uk.html",
    "summary": "Peter Mandelson was arrested on Monday on suspicion of “misconduct in public office” following revelations about his dealings with Jeffrey Epstein, the sex offender."
  },
  {
    "title": "The Evolution of Eyes Began With One",
    "link": "https://www.nytimes.com/2026/02/23/science/evolution-vertebrate-eye.html",
    "summary": "Even Charles Darwin was puzzled by the evolution of the vertebrate eye. New research suggests that it traces back to a cyclopean invertebrate with a single eye atop the head."
  },
  {
    "title": "Witness Who Disputed ICE Account of Ruben Ray Martinez Shooting Dies in Car Accident",
    "link": "https://www.nytimes.com/2026/02/23/us/ice-shooting-texas-witness-dead.html",
    "summary": "A passenger in the car with Ruben Ray Martinez wrote that the men were trying to comply with authorities before Mr. Martinez was shot. The passenger, Joshua Orta, died in a car accident on Saturday."
  },
  {
    "title": "‘Survivor’ Is America",
    "link": "https://www.nytimes.com/2026/02/23/arts/television/survivor-season-50.html",
    "summary": "It’s our greatest game and our truest mirror. And in its tiki-torch-festooned way, it’s captured our society as an ever-changing collection of tribes."
  },
  {
    "title": "Binance Employees Find $1.7 Billion in Crypto Was Sent to Iranian Entities",
    "link": "https://www.nytimes.com/2026/02/23/technology/binance-employees-iran-firings.html",
    "summary": "Binance pledged to crack down on crime. But internal investigators at the world’s largest crypto exchange continued to find evidence of potential legal violations on the platform."
  },
  {
    "title": "Prince William and Kate Made a Pointed Appearance at BAFTA",
    "link": "https://www.nytimes.com/2026/02/23/style/catherine-william-princess-of-wales-bafta-dress.html",
    "summary": "After Andrew Mountbatten-Windsor’s arrest, the Prince and Princess of Wales made a pointed BAFTA appearance."
  },
  {
    "title": "After Saks Bankruptcy, Richard Baker Says He Saved Luxury Department Stores",
    "link": "https://www.nytimes.com/2026/02/23/business/richard-baker-saks-neiman-marcus-bankruptcy.html",
    "summary": "Richard Baker wanted to create a retail empire when he combined Saks Fifth Avenue and Neiman Marcus. About a year later, it filed for bankruptcy."
  },
  {
    "title": "Texas Lt. Governor Says Camp Mystic Shouldn’t Receive License to Reopen",
    "link": "https://www.nytimes.com/2026/02/23/us/camp-mystic-floods-texas-lawsuit.html",
    "summary": "Separately, a lawsuit filed Monday asserted that Texas officials shared blame in the flood disaster that killed 27 girls last summer."
  },
  {
    "title": "Settlers in the Israeli-Occupied West Bank Drive a Palestinian Family Off Its Land",
    "link": "https://www.nytimes.com/2026/02/23/world/palestinian-west-bank-settlers-displacement.html",
    "summary": "For two years, settlers attacked Rezeq Abu Naim’s land in the Israeli-occupied West Bank at all hours and in all manners. After another violent incursion over the weekend, his family abandoned their home."
  },
  {
    "title": "New York Democrats Have a Chance to Vote Against the A.I. Oligarchs",
    "link": "https://www.nytimes.com/2026/02/23/opinion/alex-bores-ai-democrats.html",
    "summary": "There’s a huge political opportunity for the party that can stand up for human beings in the face of A.I."
  },
  {
    "title": "An Autonomous OpenClaw Chatbot Wanted Revenge",
    "link": "https://www.nytimes.com/2026/02/23/opinion/chatbots-open-claw.html",
    "summary": "An autonomous OpenClaw chatbot seeks revenge."
  },
  {
    "title": "Mexico Is on Edge After the Killing of a Cartel Boss",
    "link": "https://www.nytimes.com/2026/02/23/briefing/mexico-cartel-violence-snow-storm-northeast.html",
    "summary": "Also, a blizzard sweeps through the Northeast. Here’s the latest at the end of Monday."
  },
  {
    "title": "BAFTAs Guest With Tourettes Shouts Racial Slur During Michael B. Jordan and Delroy Lindo’s Appearance",
    "link": "https://www.nytimes.com/2026/02/23/movies/baftas-tourettes.html",
    "summary": "A racist slur, shouted involuntarily while Michael B. Jordan and Delroy Lindo were presenting an award, raised questions about how the show’s host and the BBC responded."
  },
  {
    "title": "Canada to Probe What OpenAI Knew About Tumbler Ridge Shooter",
    "link": "https://www.nytimes.com/2026/02/23/world/canada/canada-shooting-openai.html",
    "summary": "The company suspended the killer’s ChatGPT account over a policy violation in June, eight months before the attacks in Tumbler Ridge, British Columbia."
  },
  {
    "title": "Nick Reiner Pleads Not Guilty in the Killing of His Parents",
    "link": "https://www.nytimes.com/2026/02/23/arts/nick-reiner-plea.html",
    "summary": "Mr. Reiner, 32, was charged with murdering his parents, the Hollywood director Rob Reiner and Michele Singer Reiner, last year."
  },
  {
    "title": "Anthropic Accuses 3 Chinese Companies of Harvesting Its Data",
    "link": "https://www.nytimes.com/2026/02/23/technology/anthropic-chinese-startups-distillation.html",
    "summary": "The San Francisco start-up claimed that DeepSeek, Moonshot and MiniMax used approximately 24,000 fraudulent accounts to train their own chatbots."
  }
]