[
  {
    "title": "Inside the Trump Administration’s Push to Prosecute James Comey",
    "link": "https://www.nytimes.com/2025/09/27/us/politics/trump-comey-justice-department.html",
    "summary": "President Trump’s campaign of retribution began to intensify in mid-July and hit a fever pitch over the last week, culminating in the indictment of one of his foremost enemies."
  },
  {
    "title": "Examining James Comey’s 2020 Testimony at the Heart of His Indictment",
    "link": "https://www.nytimes.com/2025/09/26/us/politics/james-comey-testimony-trump.html",
    "summary": "The charges against the former F.B.I. director center on an appearance he made before a Senate committee in September 2020. Here’s a closer look."
  },
  {
    "title": "Greene, Straying From Trump, Reflects an Emerging MAGA Split",
    "link": "https://www.nytimes.com/2025/09/28/us/politics/marjorie-taylor-greene-maga-split.html",
    "summary": "The right-wing Republican congresswoman from Georgia has grown disillusioned with her own party and with President Trump, and increasingly willing to say so."
  },
  {
    "title": "Fear and Hope in Venezuela as U.S. Warships Lurk",
    "link": "https://www.nytimes.com/2025/09/28/world/americas/venezuela-mood.html",
    "summary": "On a visit to Venezuela, The Times found a nation bracing for potential U.S. military action."
  },
  {
    "title": "With Scant Information, Federal Workers Brace for Possible Shutdown",
    "link": "https://www.nytimes.com/2025/09/28/us/politics/federal-government-shutdown-trump.html",
    "summary": "After a tumultuous year of staffing cuts, government employees now face the prospect of going without pay — or facing even more layoffs."
  },
  {
    "title": "Trump Says He Has Ordered Troops to Portland, Oregon, to Protect ICE Facilities",
    "link": "https://www.nytimes.com/2025/09/27/us/politics/trump-portland-troops.html",
    "summary": "The president characterized Immigration and Customs Enforcement facilities as being under siege from domestic terrorists."
  },
  {
    "title": "Des Moines Schools Superintendent Arrested By ICE Is Placed on Leave",
    "link": "https://www.nytimes.com/2025/09/27/us/des-moines-schools-superintendent-ice-leave.html",
    "summary": "School Board members in Iowa’s capital made the decision one day after immigration officials accused the superintendent, Ian Roberts, of being in the country illegally."
  },
  {
    "title": "What the Public Memory of Charlie Kirk Revealed",
    "link": "https://www.nytimes.com/2025/09/28/magazine/charlie-kirk-rhetoric.html",
    "summary": "For those who felt denigrated by his rhetoric, the bipartisan tributes to him as a champion of free speech augured something dangerous: the mainstreaming of formerly extremist views."
  },
  {
    "title": "You Asked for More of Mel Taub’s Puzzles. Here Are Three.",
    "link": "https://www.nytimes.com/2025/09/26/obituaries/mel-taub-puzzles.html",
    "summary": "With his Puns and Anagrams puzzles, Mr. Taub made solvers groan and grin for decades. After he died this month, readers expressed appreciation for his work."
  },
  {
    "title": "A Stranger Shattered Their Lives. At First, They Didn’t Know Why.",
    "link": "https://www.nytimes.com/2025/09/28/us/phillip-adams-cte.html",
    "summary": "A family reckons with the devastation left behind after a former N.F.L. player showed up on their property."
  },
  {
    "title": "What Salt Typhoon Shows About the Cyber Power of China’s Spy Agency",
    "link": "https://www.nytimes.com/2025/09/28/world/asia/how-chinas-secretive-spy-agency-became-a-cyber-powerhouse.html",
    "summary": "Fears of U.S. surveillance drove Xi Jinping, China’s leader, to elevate the agency and put it at the center of his cyber ambitions."
  },
  {
    "title": "Russell M. Nelson, 17th President of the Mormon Church, Dies at 101",
    "link": "https://www.nytimes.com/2025/09/28/obituaries/russell-m-nelson-dead.html",
    "summary": "He left a career as a pioneering surgeon to become a church leader, diversifying its policies and its senior ranks. He became its president at 93."
  },
  {
    "title": "N.C. Stabbing Suspect Had Many Interactions With Police and Little Treatment",
    "link": "https://www.nytimes.com/2025/09/28/us/nc-stabbing-suspect-police-mental-health-history.html",
    "summary": "Decarlos Brown Jr. had harbored paranoid delusions for years, yet under state law he was not considered dangerous enough to be treated against his will."
  },
  {
    "title": "How Much Money Do New York’s Mayoral Candidates Actually Have?",
    "link": "https://www.nytimes.com/2025/09/28/nyregion/mamdani-cuomo-sliwa-adams-net-worth.html",
    "summary": "Andrew Cuomo appears to be the wealthiest. Eric Adams faces legal bills. Zohran Mamdani owns land near the Nile. Curtis Sliwa splurges on his cats."
  },
  {
    "title": "Forget ‘Love Island.’ Tennessee Has an Isle of Goats.",
    "link": "https://www.nytimes.com/2025/09/22/climate/climate-tennessee-goats-invasives.html",
    "summary": "Eco-grazing goats help clear overgrowth worldwide. But rare is the herd that has to get to work by boat."
  },
  {
    "title": "For His Enemies, the Law",
    "link": "https://www.nytimes.com/2025/09/28/opinion/comey-indictment-trump.html",
    "summary": "The political prosecution of James Comey."
  },
  {
    "title": "Ta-Nehisi Coates on Bridging Gaps vs. Drawing Lines",
    "link": "https://www.nytimes.com/2025/09/28/opinion/ezra-klein-podcast-ta-nehisi-coates.html",
    "summary": "The writer Ta-Nehisi Coates joins Ezra Klein on the show to discuss how the left should think about the work of politics and persuasion in this moment."
  },
  {
    "title": "Gunman Fires on Riverside Bar in North Carolina From Boat, Killing 3",
    "link": "https://www.nytimes.com/2025/09/28/us/north-carolina-boat-shooting.html",
    "summary": "Eight others were injured in the attack on the bar in Southport, N.C., the authorities said. The Coast Guard later detained a person matching a description of the shooter."
  },
  {
    "title": "Russia Hammers Kyiv in 12-Hour Drone Assault",
    "link": "https://www.nytimes.com/2025/09/28/world/europe/ukraine-kyiv-russia-strikes.html",
    "summary": "At least four people were killed in the attack, which also wounded dozens of civilians in the capital and around the country."
  },
  {
    "title": "For Many Moldovans, Their Election Is a Choice Between Russia and the E.U.",
    "link": "https://www.nytimes.com/2025/09/28/world/europe/moldova-election-russia-eu.html",
    "summary": "Parliamentary elections in this nation bordering Ukraine come at a critical moment in Moldova’s push for European Union membership."
  }
]