[
  {
    "title": "U.S. Hits Brazil With 50% Tariffs and Sanctions in Sharp Escalation",
    "link": "https://www.nytimes.com/2025/07/30/world/americas/trump-sanctions-brazil-judge-bolsonaro.html",
    "summary": "The White House hit Brazil on Wednesday with a 50 percent tariff and sanctions on a justice overseeing investigations into former President Jair Bolsonaro."
  },
  {
    "title": "South Korea Reaches Trade Deal With Trump",
    "link": "https://www.nytimes.com/2025/07/30/business/economy/trump-tariffs-south-korea.html",
    "summary": "The agreement comes after other American allies, like Japan, clinched their own deals, partly to moderate President Trump’s tariff threats."
  },
  {
    "title": "Countries Promise Trump to Buy U.S. Gas, and Leave the Details for Later",
    "link": "https://www.nytimes.com/2025/07/31/business/economy/trump-trade-deals-lng.html",
    "summary": "U.S. trading partners are committing to buy more gas than they need or than the U.S. can produce, at least in the short term."
  },
  {
    "title": "What Kamala Harris’s Decision for Governor Means for 2028",
    "link": "https://www.nytimes.com/2025/07/30/us/politics/kamala-harris-2028-democrats.html",
    "summary": "A Harris ally says “all options are on the table” but cautions against reading too much into the former vice president’s choice to skip the California governor race."
  },
  {
    "title": "Texas Republicans Unveil Gerrymandered House Map, Trying to Please Trump",
    "link": "https://www.nytimes.com/2025/07/30/us/politics/texas-republican-redistricting.html",
    "summary": "The proposed map would give Republicans a chance to gain five U.S. House seats, including in Houston, Dallas and along the U.S.-Mexican border."
  },
  {
    "title": "Treasury Secretary Says Trump Accounts Could Pave Way to Privatizing Social Security",
    "link": "https://www.nytimes.com/2025/07/30/business/bessent-trump-social-security.html",
    "summary": "Treasury Secretary Scott Bessent’s comments about the safety net program ventured onto the so-called third rail of American politics."
  },
  {
    "title": "Sneaking Into the Spy Museum’s New Vault",
    "link": "https://www.nytimes.com/2025/07/31/arts/international-spy-museum-vault-washington.html",
    "summary": "For years, the more than 10,000 items in the International Spy Museum’s collection were stored at a location outside Washington. That changed this summer."
  },
  {
    "title": "Brown University Makes a Deal With the White House to Restore Funding",
    "link": "https://www.nytimes.com/2025/07/30/us/brown-trump-deal-university-funding.html",
    "summary": "The deal, which will require Brown to spend $50 million, comes after two other Ivy League schools negotiated with the Trump administration to restore millions in research dollars."
  },
  {
    "title": "‘Loyalty Enforcer’ Laura Loomer Targets Additional Officials",
    "link": "https://www.nytimes.com/2025/07/30/us/politics/laura-loomer-trump.html",
    "summary": "The far-right activist is continuing to use her close association with President Trump to go after those she deems insufficiently loyal."
  },
  {
    "title": "Bill Barring Stock Trading for Congress Advances With Trump Carve-Out",
    "link": "https://www.nytimes.com/2025/07/30/us/politics/senate-stock-trading-bill-congress-trump-carveout.html",
    "summary": "The bill passed the committee with the support of every Democrat and only one Republican, its sponsor, who modified it to shield President Trump from a divestment requirement."
  },
  {
    "title": "Senate Approves Trump’s Pick for Top Counterterrorism Post",
    "link": "https://www.nytimes.com/2025/07/30/us/politics/joe-kent-counterterrorism-center.html",
    "summary": "Joe Kent, a former Army Green Beret, had attracted scrutiny over his associations with extremist groups and his promotion of conspiracy theories."
  },
  {
    "title": "Park Avenue Killer Bought Rifle for $1,400 From His Casino Boss",
    "link": "https://www.nytimes.com/2025/07/30/nyregion/park-avenue-killer-rifle.html",
    "summary": "The man who gunned down four people at a Park Avenue office building left anti-psychotic medication in his Las Vegas apartment, and a note."
  },
  {
    "title": "Gaza Hunger Presents Trump With Moral Test Familiar to Past Presidents",
    "link": "https://www.nytimes.com/2025/07/30/us/politics/trump-gaza-foreign-policy.html",
    "summary": "The crisis has echoes of past humanitarian crises that left presidents wringing their hands over how to respond."
  },
  {
    "title": "Canada to Recognize Palestinian State at the U.N. General Assembly",
    "link": "https://www.nytimes.com/2025/07/30/world/canada/canada-palestinian-state-recognition.html",
    "summary": "Canada joins France and Britain in taking similar steps, after months of increasing criticism of Israel by Prime Minister Mark Carney."
  },
  {
    "title": "What Countries Recognize a Palestinian State: A Map",
    "link": "https://www.nytimes.com/2025/07/30/world/middleeast/palestinian-state-recognition-maps.html",
    "summary": "In the past week alone, three new countries have said they are ready to bestow recognition on a Palestinian state."
  },
  {
    "title": "N.T.S.B. Details Evidence in Fatal Crash at Reagan National Airport",
    "link": "https://www.nytimes.com/2025/07/30/us/politics/army-helicopter-potomac-crash.html",
    "summary": "Flight instruments probably led the Black Hawk crew to believe the helicopter was lower than it actually was before the collision with a commercial airplane on Jan. 29."
  },
  {
    "title": "Key Takeaways From the D.C. Plane Crash Hearing",
    "link": "https://www.nytimes.com/2025/07/30/us/politics/takeaways-dc-plane-crash-investigation-ntsb.html",
    "summary": "After hours of testimony and thousands of pages of new documents, here’s what emerged in the first day of a marathon National Transportation Safety Board hearing."
  },
  {
    "title": "Brennan and Clapper: The Trump Administration Is Rewriting History of Russia and 2016",
    "link": "https://www.nytimes.com/2025/07/30/opinion/trump-obama-treason-russia-miller.html",
    "summary": "We want to set the record straight and also sound a warning."
  },
  {
    "title": "This Is the Moment Democrats Have Been Talking About for Years",
    "link": "https://www.nytimes.com/2025/07/30/opinion/antonio-delgado-kathy-hochul-democrats.html",
    "summary": "The party establishment is missing its chance to prove there is more to it than just outrage and opposition."
  },
  {
    "title": "Man Arrested in Killing of Couple Hiking With Kids in Arkansas",
    "link": "https://www.nytimes.com/2025/07/31/us/arkansas-murder-arrest.html",
    "summary": "The man, James Andrew McGann, was charged with two counts of capital murder. The couple was killed while hiking with their young daughters on Saturday."
  },
  {
    "title": "25 Hospitalized After Delta Flight Is Hit by Strong Turbulence",
    "link": "https://www.nytimes.com/2025/07/31/us/delta-flight-turbulence-emergency-landing.html",
    "summary": "The flight, which was taking 275 passengers from Salt Lake City to Amsterdam, made an emergency landing in Minneapolis on Wednesday evening, the airline said."
  },
  {
    "title": "Horst Mahler, 89, Dies; Voice of the German Far Left, Then the Far Right",
    "link": "https://www.nytimes.com/2025/07/30/world/europe/horst-mahler-dead.html",
    "summary": "As a young lawyer and a Communist revolutionary, he helped start the violent Red Army Faction. Later, he went to prison as a Nazi apologist and Holocaust denier."
  },
  {
    "title": "Hawaii Cruise Ships Leave Passengers Behind Amid Tsunami Warnings",
    "link": "https://www.nytimes.com/2025/07/30/travel/tsunami-hawaii-cruise-ships-passengers.html",
    "summary": "In Hawaii, ships were directed out to sea by officials, but some guests who were on shore excursions couldn’t make it back in time to get aboard."
  }
]