[
  {
    "title": "New York City Faces Its Second Big Storm in Weeks",
    "link": "https://www.nytimes.com/2026/02/22/weather/storm-nyc-preparations-mamdani.html",
    "summary": "The storm in late January was bad enough. This one is bringing true blizzard conditions, and the city has stepped up its response."
  },
  {
    "title": "Killing of Cartel Boss Sets Off Chaos in Mexico, and Trump Has a New Plan for Tariffs",
    "link": "https://www.nytimes.com/2026/02/23/podcasts/the-headlines/cartel-boss-mexico-trump-tariffs.html",
    "summary": "Plus, a shooting at Mar-a-Lago."
  },
  {
    "title": "Mexican Forces Kill ‘El Mencho,’ Nation’s Most-Wanted Cartel Boss",
    "link": "https://www.nytimes.com/2026/02/22/world/americas/jalisco-new-generation-cartel-leader-killed.html",
    "summary": "“El Mencho” was the longtime head of one of the nation’s most powerful cartels. Armed groups set fire to cars and buildings across Mexico in the wake of his death."
  },
  {
    "title": "Drug Lord ‘El Mencho’ Was Killed in Mexico. What’s Next for the Cartel He Led?",
    "link": "https://www.nytimes.com/2026/02/23/world/americas/el-mencho-killed-mexico-cartel.html",
    "summary": "The death of Nemesio Oseguera Cervantes dealt a major blow to the Jalisco New Generation Cartel, but few believe it spells the end for the powerful group."
  },
  {
    "title": "What to Know About the Killing of ‘El Mencho’",
    "link": "https://www.nytimes.com/2026/02/22/world/americas/el-mencho-mexico-what-we-know.html",
    "summary": "The Mexican government has killed Nemesio Oseguera Cervantes, the longtime leader of one of Mexico’s most powerful gangs, the Jalisco New Generation Cartel."
  },
  {
    "title": "For Iran’s Rulers, Refusing U.S. Demands Is a Risk Worth Taking",
    "link": "https://www.nytimes.com/2026/02/23/world/middleeast/iran-us-nuclear-talks-war.html",
    "summary": "The government in Tehran sees capitulating to Washington’s demands on uranium enrichment and ballistic missiles as riskier to its survival than going to war, analysts say."
  },
  {
    "title": "Trump Considers Targeted Strike Against Iran, Followed by Larger Attack",
    "link": "https://www.nytimes.com/2026/02/22/us/politics/trump-iran-strike-attack.html",
    "summary": "The top negotiators plan to meet in Geneva on Thursday for last-ditch talks, debating a new proposal that could create an off-ramp as two carrier groups massed within striking distance of Iran."
  },
  {
    "title": "The Next Conflict",
    "link": "https://www.nytimes.com/2026/02/23/briefing/potential-conflict-iran.html",
    "summary": "We’re looking at the potential for a U.S. attack on Iran."
  },
  {
    "title": "What’s Happened Since the Supreme Court’s Tariff Ruling",
    "link": "https://www.nytimes.com/2026/02/23/business/supreme-court-trump-tariffs-updates.html",
    "summary": "After the Trump administration’s punishing tariffs were invalidated, the president said he would impose new tariffs using a different authority. It’s been a whirlwind."
  },
  {
    "title": "Why the Supreme Court Struck Down Trump’s Tariffs",
    "link": "https://www.nytimes.com/video/us/100000010726142/why-the-supreme-court-struck-down-trumps-tariffs.html",
    "summary": "Our reporter Ann E. Marimow describes the rationale of the Supreme Court’s 6-to-3 ruling to strike down President Trump’s sweeping tariffs."
  },
  {
    "title": "U.K., Australia and Others Worse Off Under Trump’s New Tariffs",
    "link": "https://www.nytimes.com/2026/02/23/business/uk-australia-trump-tariffs.html",
    "summary": "Many important U.S. trading partners are facing higher duties after President Trump, reacting to a Supreme Court setback, set the rate on a new set of global tariffs at 15 percent."
  },
  {
    "title": "Trump’s Challenge to Free Market Capitalism",
    "link": "https://www.nytimes.com/2026/02/22/business/economy/trump-republicans-economy-capitalism.html",
    "summary": "Stakes in private companies. Handshake deals with chief executives. The president’s economic policy has drifted far from principles that long defined the Republican Party. Is it capitalism at all?"
  },
  {
    "title": "Pizzoccheri Was Prominent at Winter Olympics in Italy",
    "link": "https://www.nytimes.com/2026/02/23/dining/olympics-pizzoccheri-italy-valtellina.html",
    "summary": "Pizzoccheri, a hearty buckwheat pasta, graced restaurant menus and the athletes’ cafeterias. A chef hopes it can put a spotlight on the valley where it comes from."
  },
  {
    "title": "Fact-check: Trump’s Latest Claims on Jobs, Inflation and Crime",
    "link": "https://www.nytimes.com/2026/02/23/us/politics/trump-economy-fact-check.html",
    "summary": "Trends on jobs, inflation and crime that began before Donald Trump retook office continued, largely unabated, in his first year back."
  },
  {
    "title": "As Trump Touts Economic Gains, Many Workers Still Feel the Pinch",
    "link": "https://www.nytimes.com/2026/02/23/us/trump-affordability-inflation-families.html",
    "summary": "President Trump says that he has brought down inflation, but families are still struggling to pay bills and plan for the future."
  },
  {
    "title": "When Faced With Claims of Racism, Trump Points to His Black Friends",
    "link": "https://www.nytimes.com/2026/02/22/us/politics/trump-black-people-history.html",
    "summary": "President Trump has often invoked his unnamed Black friends, or name-checked celebrities and athletes, when asked to discuss anything related to Black voters."
  },
  {
    "title": "Judges Grow Angry Over Trump Administration Violating Their Orders",
    "link": "https://www.nytimes.com/2026/02/23/us/politics/judges-contempt-immigration-trump.html",
    "summary": "At least 35 times since August, federal judges have ordered the administration to explain why it should not be punished for violating their orders in immigration cases."
  },
  {
    "title": "The Ukrainian Bureaucrat Working to Squeeze Russia’s War Machine",
    "link": "https://www.nytimes.com/2026/02/23/world/europe/ukraine-russia-sanctions.html",
    "summary": "Vladyslav Vlasiuk has spent the past four years pressing Western allies to squeeze the Russian economy through more sanctions. He hopes that 2026 will be the tipping point."
  },
  {
    "title": "EU Support for Ukraine Stumbles as Hungary Looks to Delay Aid",
    "link": "https://www.nytimes.com/2026/02/23/world/europe/ukraine-war-russia-eu-hungary.html",
    "summary": "Hungary said that it would block both the latest sanctions package on Russia and a financial aid package to Kyiv worth about $106 billion."
  },
  {
    "title": "‘A.I. Literacy’ Is the New Drivers’ Ed at This Newark School",
    "link": "https://www.nytimes.com/2026/02/23/technology/ai-literacy-newark-school-chatbots.html",
    "summary": "Teachers say they want to equip high school students to drive artificial intelligence, rather than be mere passengers steered by chatbots."
  },
  {
    "title": "‘A.I. Literacy’ Is Trending in Schools. Here’s Why.",
    "link": "https://www.nytimes.com/2026/02/23/business/ai-literacy-faq.html",
    "summary": "Artificial intelligence companies are urging teachers to prepare students for an “A.I.-driven future.” What that means varies from school to school."
  },
  {
    "title": "Supreme Court Considers Fate of Docks and Other Assets Seized by Cuba in 1960",
    "link": "https://www.nytimes.com/2026/02/23/us/politics/supreme-court-cuba-cruise-docks.html",
    "summary": "Amid rising tensions with Cuba, the Trump administration is backing lawsuits that would allow Americans to get compensation for property confiscated by Fidel Castro’s regime."
  },
  {
    "title": "The Zero Units Fought for the C.I.A. in Afghanistan. In the U.S., They’re Living in Fear.",
    "link": "https://www.nytimes.com/2026/02/23/magazine/zero-units-cia-afghanistan.html",
    "summary": "A shooting in Washington, D.C., threw their immigration status into jeopardy — and brought attention to a long-hidden dimension of America’s war."
  },
  {
    "title": "In Washington State, Democrats Consider Breaking a Taboo: Taxing the Rich",
    "link": "https://www.nytimes.com/2026/02/23/us/politics/washington-taxing-the-rich.html",
    "summary": "The state where Jeff Bezos and Bill Gates made fortunes might have progressive social policies, but its resistance to an income tax is similar to conservative states. That might change."
  },
  {
    "title": "BAFTAs 2026: The Best and Worst Moments",
    "link": "https://www.nytimes.com/2026/02/23/movies/baftas-best-worst-moments.html",
    "summary": "Alan Cumming forced fishy British snacks onto movie stars. Paddington Bear presented an award. And there was more swearing, and racial curses, than this awards show has ever heard."
  },
  {
    "title": "2026 BAFTAs Winners: ‘One Battle After Another’ Wins Best Film, Besting ‘Sinners’",
    "link": "https://www.nytimes.com/2026/02/22/movies/baftas-2026.html",
    "summary": "Paul Thomas Anderson’s comedy drama won six awards at the British equivalent of the Oscars. The best actor choice, however, was a surprise."
  },
  {
    "title": "The Human Cost of the Trump Administration’s War on Science",
    "link": "https://www.nytimes.com/2026/02/23/opinion/doge-hiv-funding.html",
    "summary": "The ripple effects of cutting H.I.V. research funding."
  },
  {
    "title": "‘The Pitt’ Is the Most Patriotic Show on Television",
    "link": "https://www.nytimes.com/2026/02/23/opinion/pitt-america-tv.html",
    "summary": "An emergency room that’s a mirror."
  },
  {
    "title": "Former F.B.I. Official, Ousted Under Trump, Will Run for Congress in Maryland",
    "link": "https://www.nytimes.com/2026/02/23/us/politics/former-fbi-official-congress-maryland.html",
    "summary": "David Sundberg, who led the Washington Field Office, is joining a crowded Democratic primary for Steny H. Hoyer’s open House seat."
  },
  {
    "title": "Susan Sheehan, Pulitzer-Winning Chronicler of Lives on the Margins, Dies at 88",
    "link": "https://www.nytimes.com/2026/02/22/books/susan-sheehan-dead.html",
    "summary": "As a journalist and author, she wrote meticulous portraits of people for The New Yorker. Her book “Is There No Place on Earth for Me?” won the Pulitzer Prize."
  },
  {
    "title": "Hunter College to Review Professor’s ‘Abhorrent’ Remarks at Meeting",
    "link": "https://www.nytimes.com/2026/02/22/nyregion/hunter-college-professor-remarks-students.html",
    "summary": "A student objected to the potential closure of her New York City middle school. The professor, speaking on a hot mic, said, “They’re too dumb to know they’re in a bad school.” The comment was assailed as racist."
  },
  {
    "title": "Duterte’s Fans Rally in The Hague as the I.C.C. Weighs Evidence Against Him",
    "link": "https://www.nytimes.com/2026/02/23/world/asia/philippines-icc-duterte-supporters.html",
    "summary": "The protests are a sign of the Philippine ex-leader’s ongoing influence, even as he faces a possible trial for the deaths of thousands during his war on drugs."
  }
]