[
  {
    "title": "How Will Trump Sell His Big Policy Bill to the American Public?",
    "link": "https://www.nytimes.com/2025/07/03/us/politics/trump-policy-bill.html",
    "summary": "President Trump has spent days cajoling Republicans to support his spending bill. He will also have to sell it to a skeptical public as Democrats focus on all the ways it helps the wealthy."
  },
  {
    "title": "Supreme Court Lets Trump Deport Eight Migrants to South Sudan",
    "link": "https://www.nytimes.com/2025/07/03/us/politics/supreme-court-migrants-south-sudan.html",
    "summary": "The court’s order followed a broader one last month allowing removals to countries with which migrants have no connections."
  },
  {
    "title": "Around Los Angeles, ICE Raids Are Casting a Shadow on July 4th Plans",
    "link": "https://www.nytimes.com/2025/07/03/us/immigration-raids-fourth-of-july.html",
    "summary": "Some communities in the Los Angeles region canceled events over fears of immigration raids, as Latinos grapple with how, and whether, to celebrate Independence Day."
  },
  {
    "title": "Immigration Agents Appear to Urinate in Public at a California School",
    "link": "https://www.nytimes.com/2025/07/03/us/immigration-agents-urinate-california-school.html",
    "summary": "School officials have demanded answers from federal agencies. It was the latest example of how locals have scrutinized the actions of immigration agents."
  },
  {
    "title": "How the Trump Administration Justified Ignoring the TikTok Ban",
    "link": "https://www.nytimes.com/2025/07/03/us/politics/trump-bondi-tiktok-executive-power.html",
    "summary": "In purporting to license otherwise illegal conduct by tech firms, President Trump set a precedent expanding executive power, legal experts warned."
  },
  {
    "title": "E.P.A. Suspends 144 Employees After They Signed a Letter Criticizing Trump",
    "link": "https://www.nytimes.com/2025/07/03/climate/epa-letter-administrative-leave.html",
    "summary": "The letter had accused the Trump administration of politicizing, dismantling and sidelining the agency."
  },
  {
    "title": "Appeals Court Lets Trump Remove Another Democrat From Independent Agency",
    "link": "https://www.nytimes.com/2025/07/03/us/politics/trump-labor-relations-authority.html",
    "summary": "The ruling cited a Supreme Court decision in May that allowed President Trump to sideline Democratic appointees from several other nonpartisan agencies."
  },
  {
    "title": "Mamdani Identified as Asian and African American on College Application",
    "link": "https://www.nytimes.com/2025/07/03/nyregion/mamdani-columbia-black-application.html",
    "summary": "Zohran Mamdani, the Democrat running for mayor of New York City, was born in Uganda. He doesn’t consider himself Black but said the application didn’t allow for the complexity of his background."
  },
  {
    "title": "Hamas Has a New Leader in Gaza. His Next Test: Cease-Fire Talks.",
    "link": "https://www.nytimes.com/2025/07/03/world/middleeast/hamas-new-leader-gaza-cease-fire.html",
    "summary": "The rise of Izz al-Din al-Haddad in the chain of command suggests the group will hold firm to its position demanding a total end to the war before releasing all remaining hostages."
  },
  {
    "title": "Where Do Israel-Hamas Truce Negotiations Stand?",
    "link": "https://www.nytimes.com/2025/07/03/world/middleeast/israel-hamas-ceasefire-negotiations.html",
    "summary": "Hamas wants to ensure that the latest cease-fire proposal has sufficient guarantees that negotiations will lead to a permanent end to the Gaza war."
  },
  {
    "title": "Top Russian General Killed in ‘Combat Operations’ Near Ukraine",
    "link": "https://www.nytimes.com/2025/07/03/world/europe/russian-general-killed-ukraine-strike.html",
    "summary": "Maj. Gen. Mikhail Gudkov, promoted to deputy head of the Russian Navy just a few months earlier, died in an apparent Ukrainian strike."
  },
  {
    "title": "Trump Says Call with Putin Yields No Progress on Ukraine Cease-Fire",
    "link": "https://www.nytimes.com/2025/07/03/us/politics/trump-putin-call-ukraine-iran.html",
    "summary": "The apparent impasse came during a roughly hourlong conversation between the leaders on Thursday morning."
  },
  {
    "title": "Russia Becomes First Country to Recognize Afghanistan’s Taliban Government",
    "link": "https://www.nytimes.com/2025/07/03/world/asia/russia-afghanistan-recognize.html",
    "summary": "Afghanistan has remained largely isolated since the Taliban seized power nearly four years ago, despite subtle signs of increased cooperation with countries like China and India."
  },
  {
    "title": "Michael Madsen, Actor Known for ‘Reservoir Dogs’ and ‘Kill Bill,’ Dies at 67",
    "link": "https://www.nytimes.com/2025/07/03/movies/michael-madsen-dead.html",
    "summary": "He had the air of a timeless movie bad guy in movies like “Reservoir Dogs” and “Kill Bill.” “I’m a bit of a throwback to the days of black-and-white movies,” he said."
  },
  {
    "title": "Hiring Held Steady in June as Employers Added 147,000 Jobs",
    "link": "https://www.nytimes.com/2025/07/03/business/what-to-know-about-the-jobs-report.html",
    "summary": "The strength of the labor market suggests that the economy remains robust despite uncertainty caused by President Trump’s tariffs and geopolitical turmoil."
  },
  {
    "title": "Park Service Is Left Short-Staffed in Peak Travel Season",
    "link": "https://www.nytimes.com/2025/07/03/us/politics/park-service-staffing.html",
    "summary": "Layoffs and departures after pressure from the Trump administration have left sites struggling, with the remaining employees each doing the work of two or three people."
  },
  {
    "title": "Jim Shooter, Editor Who ‘Saved the Comics Industry,’ Dies at 73",
    "link": "https://www.nytimes.com/2025/07/03/arts/jim-shooter-dead.html",
    "summary": "He brought order and profits to Marvel in the 1980s and helped establish the genre as a popular-culture tent pole for decades to come."
  },
  {
    "title": "How Drinking Alcohol Affects You in Older Age",
    "link": "https://www.nytimes.com/2025/07/03/well/alcohol-older-age-risks.html",
    "summary": "Alcohol can present health problems for even light or occasional drinkers."
  },
  {
    "title": "Mr. Big Is Alive and Well and Married in Vermont",
    "link": "https://www.nytimes.com/2025/07/03/fashion/mr-big-sex-and-the-city-inspiration-vermont.html",
    "summary": "The real-life inspiration for the famous toxic bachelor on “Sex and the City” left the Big Apple for the Green Mountain state."
  },
  {
    "title": "Iran’s Quiet Campaign of Domestic Terror",
    "link": "https://www.nytimes.com/2025/07/04/opinion/iran-israel-arrests.html",
    "summary": "The regime is sending a chilling message: Dissent equals death."
  },
  {
    "title": "Mexico Confirms Arrest Warrant for Boxer Julio César Chávez Jr.",
    "link": "https://www.nytimes.com/2025/07/03/world/americas/mexico-arrest-warrant-boxer-julio-cesar-chavez-jr.html",
    "summary": "The well-known Mexican boxer was detained by U.S. immigration agents in California on Wednesday, days after fighting a high-profile contest against the former YouTuber Jake Paul."
  },
  {
    "title": "Teenage Aviator Detained After Landing in Antarctica, Chile Says",
    "link": "https://www.nytimes.com/2025/07/03/world/americas/ethan-guo-chile-detained.html",
    "summary": "Ethan Guo, 19, had been documenting his attempt to fly solo to all seven continents on social media. He is no longer in custody but has no easy way to leave an island off Antarctica’s coast."
  },
  {
    "title": "​North Korea Beach Resort Opens With Fanfare but No Foreigners",
    "link": "https://www.nytimes.com/2025/07/03/world/asia/north-korea-wonsan-kalma-beach.html",
    "summary": "The Kalma Beach resort town, one of Kim Jong-un’s most ambitious projects aimed at attracting foreign tourists, may not draw the waves of visitors he wants."
  },
  {
    "title": "Alternate Juror at the Sean ‘Diddy’ Combs Trial: ‘I Understand’ the Verdict",
    "link": "https://www.nytimes.com/2025/07/03/arts/music/sean-combs-diddy-alternate-juror.html",
    "summary": "A Manhattan man who did not deliberate but heard all 28 days of testimony said in an interview that he was not persuaded by the prosecution’s case."
  }
]