[
  {
    "title": "How the Future of the Fed Came to Rest on Lisa Cook",
    "link": "https://www.nytimes.com/2025/08/29/us/politics/trump-fed-independence-lisa-cook.html",
    "summary": "President Trump’s effort to oust the Federal Reserve governor has kicked off a landmark legal battle, one that will have far-reaching consequences for the institution’s independence."
  },
  {
    "title": "Trump and His Officials Target Fed and CDC, Long Seen as Above Politics",
    "link": "https://www.nytimes.com/2025/08/28/us/politics/trump-firings-cdc-fed.html",
    "summary": "Trump officials say the president is within his rights to fire officials who do not share his agenda."
  },
  {
    "title": "The C.D.C.’s Vaccine Chief on Why Quitting Was His Only Option",
    "link": "https://www.nytimes.com/2025/08/29/podcasts/the-daily/cdc-vaccine-daskalakis.html",
    "summary": "There is a growing sense of despair inside the public health agency, which is reeling after mass layoffs."
  },
  {
    "title": "Inside the C.D.C., a Growing Sense of Despair",
    "link": "https://www.nytimes.com/2025/08/28/health/cdc-employees-director-trump-rfk-jr.html",
    "summary": "After six months of turmoil, the loss of the new director and a round of high-profile resignations marks a new low, some employees said."
  },
  {
    "title": "Trump’s ‘Maximalist’ Plan for the Presidency, and a Major Loophole Closes for U.S. Shoppers",
    "link": "https://www.nytimes.com/2025/08/29/podcasts/the-headlines/trump-firings-loophole-shopping.html",
    "summary": "Plus, your Friday news quiz."
  },
  {
    "title": "De Minimis Tariff Exemption Has Ended. How Will It Affect Shoppers?",
    "link": "https://www.nytimes.com/2025/08/29/business/trump-tariffs-de-minimis.html",
    "summary": "The end of the “de minimis” exemption — which allowed packages less than $800 to enter the U.S. tariff-free — is leading to confusion."
  },
  {
    "title": "When Mailing a Letter to the U.S. Becomes a Global Headache",
    "link": "https://www.nytimes.com/2025/08/29/business/us-tariffs-shipping-suspensions-de-minimis.html",
    "summary": "A driver’s license renewal, a box of specialty candy, even early Christmas presents — all are caught up in the confusion caused by a new Trump administration customs rule."
  },
  {
    "title": "Can Cadillac Keep Selling E.V.s as Trump Repeals Climate Policies?",
    "link": "https://www.nytimes.com/2025/08/29/business/cadillac-electric-vehicles-trump.html",
    "summary": "Electric models from the luxury car brand have been very successful, but they may struggle once a $7,500 federal tax credit ends next month."
  },
  {
    "title": "Annunciation Catholic Church Reels From Deadly Minneapolis Shooting",
    "link": "https://www.nytimes.com/2025/08/28/us/catholic-church-shooting.html",
    "summary": "Annunciation Catholic Church and School has been a neighborhood anchor in Minneapolis for more than a century."
  },
  {
    "title": "After Minneapolis Church Shooting, Families Seek Healing and Comfort",
    "link": "https://www.nytimes.com/2025/08/28/us/annunciation-catholic-church-minneapolis-shooting.html",
    "summary": "Families and neighbors sought comfort on Thursday. “Give your kids an extra hug and kiss today,” the father of a victim said."
  },
  {
    "title": "What We Know About the Minneapolis Catholic School Shooting",
    "link": "https://www.nytimes.com/2025/08/27/us/minneapolis-school-shooting-minnesota.html",
    "summary": "The attack on a back-to-school Mass at Annunciation Catholic Church killed two children and injured 18 others. Investigators said the shooter’s writings and videos reflected violent obsessions."
  },
  {
    "title": "2 Weeks, 1,000 Arrests: How a Surge of Feds Changed D.C. Policing",
    "link": "https://www.nytimes.com/2025/08/29/us/federal-crackdown-washington-dc-arrest-data.html",
    "summary": "Crime has fallen since federal agents started policing the streets of Washington in large numbers. Court records show that they have been involved in about a third of arrests that resulted in prosecution, many of them for minor offenses."
  },
  {
    "title": "Gregory Bovino Is Leading the California Immigration Crackdown",
    "link": "https://www.nytimes.com/2025/08/29/us/gregory-bovino-immigration-california.html",
    "summary": "Gregory Bovino has orchestrated thousands of arrests, using confrontational tactics that have made him a MAGA star. His critics say he’s crossing legal and political lines."
  },
  {
    "title": "20 Years After Katrina, New Orleans Is ‘at a Tipping Point’",
    "link": "https://www.nytimes.com/2025/08/29/us/katrina-anniversary-new-orleans.html",
    "summary": "The city has taken pride in its ability to endure. But many residents, fed up with dysfunction and soaring costs, want it to strive for more."
  },
  {
    "title": "Living with Katrina",
    "link": "https://www.nytimes.com/2025/08/29/briefing/hurricane-katrina-20-years.html",
    "summary": "The storm made landfall 20 years ago today. What’s happened since then?"
  },
  {
    "title": "3 Ways Hurricane Forecasts Have Changed Since Katrina",
    "link": "https://www.nytimes.com/2025/08/28/weather/hurricane-katrina-forecasting.html",
    "summary": "Modern technology has given meteorologists more detail than they’ve ever had on how storms behave. Here’s what they’re doing with it."
  },
  {
    "title": "Texas House Advances Anti-Abortion Bill",
    "link": "https://www.nytimes.com/2025/08/28/us/politics/texas-house-abortion-bill.html",
    "summary": "Legislation aimed at curtailing mail-order abortions in Texas cleared a decisive hurdle, part of a broader push by abortion opponents to limit the procedure even in states where it is legal."
  },
  {
    "title": "Ukraine’s Donetsk Faces Water Crisis Under Russian Occupation",
    "link": "https://www.nytimes.com/2025/08/29/world/europe/donetsk-water-shortage-crisis.html",
    "summary": "The Russian authorities have seized on the crisis in Donetsk to argue that taking over the rest of the region from Ukraine would allow Moscow to restore the water supply."
  },
  {
    "title": "TSA PreCheck: Does It Really Save Time at the Airport?",
    "link": "https://www.nytimes.com/2025/08/29/upshot/tsa-precheck-how-long.html",
    "summary": "At the New York-area airports, for example, a lot depends on the terminal."
  },
  {
    "title": "This Summer, a Hostile Reception for Many Israelis Abroad",
    "link": "https://www.nytimes.com/2025/08/29/world/middleeast/israelis-travel-abroad-harrassment.html",
    "summary": "Against the backdrop of the devastating war and hunger crisis in Gaza, Israeli travelers have been harassed and accosted in Europe, sometimes just for speaking Hebrew."
  },
  {
    "title": "U.N. Votes to Withdraw Peacekeepers From Lebanon Over Next Two Years",
    "link": "https://www.nytimes.com/2025/08/28/world/middleeast/unifil-lebanon-security-council.html",
    "summary": "With the decades-old peacekeeping mission set to expire, the U.N. Security Council chose to extend it through 2026, then gradually withdraw the forces the following year."
  },
  {
    "title": "CVS Holds Off on Offering Covid Vaccines in 16 States",
    "link": "https://www.nytimes.com/2025/08/28/well/cvs-pharmacy-covid-vaccine-16-states.html",
    "summary": "The country’s largest pharmacy chain said it needed a C.D.C. panel to recommend the shots before it could offer them nationwide."
  },
  {
    "title": "N.Y.C. Covid Cases Appear to Be Rising. So Are Inquiries on Vaccines.",
    "link": "https://www.nytimes.com/2025/08/29/nyregion/covid-cases-rising-new-york.html",
    "summary": "Patients are flooding medical practices with reports of the telltale signs of Covid and questions about whether they will be able to get vaccinated."
  },
  {
    "title": "As Bolsonaro Heads to Trial, Brazil Faces a Dilemma: How to Prosecute a President?",
    "link": "https://www.nytimes.com/2025/08/29/world/americas/brazil-president-bolsonaro-lula-trial.html",
    "summary": "Jair Bolsonaro, Brazil’s former president, is heading to trial. But his path there has stirred concern that the judiciary has overstepped its bounds."
  },
  {
    "title": "How School Shootings Make Children Think About Death",
    "link": "https://www.nytimes.com/2025/08/29/opinion/minneapolis-school-shooting.html",
    "summary": "We drag around our brokenness in the same container as our holiness."
  },
  {
    "title": "Politicians Are Polarized. American Voters, Not So Much.",
    "link": "https://www.nytimes.com/2025/08/29/opinion/american-politics-center.html",
    "summary": "Where the center of American politics may be alive and well."
  },
  {
    "title": "Judge Orders New Federal Trial in Tyre Nichols Case",
    "link": "https://www.nytimes.com/2025/08/28/us/politics/tyre-nichols-federal-trial.html",
    "summary": "The ruling cited concerns about the appearance of bias, pointing to comments that the judge who presided over the trial of three former police officers reportedly made afterward."
  },
  {
    "title": "August in Paris: When the City Empties Out, Locals Left Behind Rejoice",
    "link": "https://www.nytimes.com/2025/08/29/world/europe/paris-summer-vacations.html",
    "summary": "With many away for long vacations, the capital is transformed into a sleepy, roomy, more friendly place."
  },
  {
    "title": "China Is Trying to Expand Its Social Safety Net. Yet Many Chinese Are Worried.",
    "link": "https://www.nytimes.com/2025/08/29/world/asia/china-social-security.html",
    "summary": "A move to force employers to pay into benefits for their employees has left people worrying that small businesses will close and jobs will be lost."
  },
  {
    "title": "Thai Court to Rule on Paetongtarn Shinawatra’s Future in Office",
    "link": "https://www.nytimes.com/2025/08/28/world/asia/thailand-paetongtarn-shinawatra-verdict.html",
    "summary": "Paetongtarn Shinawatra became the third member of her family to be removed from the job, as the nation plunged into fresh political instability."
  }
]