[
  {
    "title": "Deadlock Grows Uglier as Congress Heads Toward Government Shutdown",
    "link": "https://www.nytimes.com/2025/09/30/us/politics/government-shutdown-deadlock.html",
    "summary": "President Trump’s posting of a deepfake video mocking and insulting the top two Democrats in Congress underscored the lack of progress toward any deal to extend funding."
  },
  {
    "title": "Trump and Hegseth Recount Familiar Partisan Complaints to Top Military Leaders",
    "link": "https://www.nytimes.com/2025/09/30/us/politics/trump-hegseth-military-officers.html",
    "summary": "The U.S. generals and admirals summoned from around the world had been given little information about the planned event."
  },
  {
    "title": "Hegseth Lectures Military Brass on ‘Woke’ Leaders, Fitness and Grooming",
    "link": "https://www.nytimes.com/2025/09/30/us/politics/hegseth-military-officers.html",
    "summary": "Senior officers, summoned from around the world, are entrusted to manage complex military operations. They got a lecture on fitness and grooming standards."
  },
  {
    "title": "Gov. Jeff Landry Wants National Guard Troops Deployed in Louisiana",
    "link": "https://www.nytimes.com/2025/09/30/us/politics/jeff-landry-louisiana-national-guard.html",
    "summary": "Gov. Jeff Landry’s request to the Trump administration highlights how Republican-led states are embracing the president’s push to use the Guard to crack down on crime."
  },
  {
    "title": "With New U.S. Proposal to End Gaza War, a Rare Moment of Triumph for Netanyahu",
    "link": "https://www.nytimes.com/2025/09/30/world/middleeast/trump-netanyahu-israel-gaza-war.html",
    "summary": "In President Trump’s plan, Prime Minister Benjamin Netanyahu got almost everything he hoped for in the end, despite mounting international isolation."
  },
  {
    "title": "Ambassador Mike Huckabee Postpones Rare Visit to Egypt",
    "link": "https://www.nytimes.com/2025/09/30/world/middleeast/huckabee-egypt-israel-gaza.html",
    "summary": "Ambassador Huckabee said the delay was requested by Egyptian officials. The trip is now expected to take place in the coming weeks."
  },
  {
    "title": "Trump Pardon Ended Probe Into Green Beret’s Killing of Suspected Taliban Bombmaker. Was Justice Served?",
    "link": "https://www.nytimes.com/2025/09/30/magazine/trump-pardon-green-beret-taliban.html",
    "summary": "The president’s pardon of Mathew Golsteyn cut short an investigation into his killing of a man he believed to be a Taliban bombmaker. Was justice served?"
  },
  {
    "title": "Inside the U.S. Special Forces: 5 Takeaways on a Culture of Lawlessness in Afghanistan",
    "link": "https://www.nytimes.com/2025/09/30/magazine/afghanistan-war-green-berets-trump-hegseth.html",
    "summary": "Until now, many of the troubling events that took place during the war in Afghanistan have been shrouded in secrecy."
  },
  {
    "title": "Trinity Church’s New Organ in Manhattan Is Shaking the Pews",
    "link": "https://www.nytimes.com/2025/09/30/arts/music/trinity-church-organ.html",
    "summary": "Trinity’s organ was severely damaged in the Sept. 11 attacks. At last, its replacement has been unveiled. Hear the sound of its 8,041 pipes."
  },
  {
    "title": "The Artist Who Lived in a Cage For a Year",
    "link": "https://www.nytimes.com/2025/09/30/arts/design/artist-cage-dia.html",
    "summary": "At Dia Beacon, a retrospective looks at the career of Tehching Hsieh, whose yearlong performance art pieces were some of the most grueling the medium has ever seen."
  },
  {
    "title": "In Unusual Move, Prosecutors Secure Federal Charges From Local Grand Jury",
    "link": "https://www.nytimes.com/2025/09/30/us/politics/federal-charges-grand-jury-dc.html",
    "summary": "A judge, Zia M. Faruqui, said that what appeared to be a kind of grand jury forum shopping seemed to have broken “decades-long norms and the rule of law.”"
  },
  {
    "title": "Eric Adams’s Campaign Is Over. His Campaign Finance Problems Are Not.",
    "link": "https://www.nytimes.com/2025/09/30/nyregion/eric-adams-campaign-finance.html",
    "summary": "City regulators are focusing on potential fund-raising irregularities that could result in the clawback of $10 million from Mr. Adams’s 2021 mayoral campaign."
  },
  {
    "title": "How Zohran Mamdani Built a Campaign Around Food",
    "link": "https://www.nytimes.com/2025/09/30/dining/zohran-mamdani-nyc-mayor-food.html",
    "summary": "The front-runner for New York mayor is leveraging his lifelong love of eating to inform his policy plans and spread his message."
  },
  {
    "title": "Breaking Down the Mayor’s Race After Adams’s Exit",
    "link": "https://www.nytimes.com/2025/09/30/nyregion/nyc-mayor-adams-mamdani.html",
    "summary": "Plus, what elected officials from across the country have to say about the race."
  },
  {
    "title": "Secretive Program That Keeps Ukraine’s Weapons Firing Is Suddenly in Doubt",
    "link": "https://www.nytimes.com/2025/09/30/world/europe/ukraine-ammunition-program-czech-republic.html",
    "summary": "A Czech Republic-led effort gathers munitions for Kyiv from around the world, but an opposition party expected to win elections there has vowed to drop it."
  },
  {
    "title": "A.I. Fighter Jets and Cockroach Spies: Inside the Changing Business of War",
    "link": "https://www.nytimes.com/2025/09/30/business/economy/defense-spending-startups.html",
    "summary": "Russia’s war on Ukraine changed the course of a generation of start-ups and investors that have applied a new business model to Europe’s military buildup."
  },
  {
    "title": "Russia’s Military Budget Shrinks as War Costs Hit Kremlin’s Economic Limits",
    "link": "https://www.nytimes.com/2025/09/30/world/europe/russia-budget-military.html",
    "summary": "The budget indicates that Russia will continue to fight largely as it has, locking it in a grinding war of attrition."
  },
  {
    "title": "Top A.I. Researchers Leave OpenAI, Google and Meta for New Start-Up",
    "link": "https://www.nytimes.com/2025/09/30/technology/ai-meta-google-openai-periodic.html",
    "summary": "Founded by a co-creator of ChatGPT, Periodic Labs aims to build artificial intelligence that can accelerate discoveries in physics, chemistry and other fields."
  },
  {
    "title": "What We Know About ChatGPT’s New Parental Controls",
    "link": "https://www.nytimes.com/2025/09/30/technology/chatgpt-teen-parental-controls-openai.html",
    "summary": "OpenAI said parents can set time and content limits on accounts and receive notifications if ChatGPT detects signs of potential self-harm."
  },
  {
    "title": "The War in Gaza Needs to End",
    "link": "https://www.nytimes.com/2025/09/30/opinion/gaza-war-end-peace-plan.html",
    "summary": "The war needs to end, for the sake of the Gazan people and for the sake of Israel and its security."
  },
  {
    "title": "The Logic of Vaccine Hesitancy in a Broken Health System",
    "link": "https://www.nytimes.com/2025/09/30/opinion/vaccine-hesitancy.html",
    "summary": "Why parents are trusting themselves over the experts."
  },
  {
    "title": "Trump’s Plan to End the War in Gaza",
    "link": "https://www.nytimes.com/2025/09/30/briefing/trumps-plan-to-end-the-war-in-gaza.html",
    "summary": "We look at the plan and American public opinion polls on the war."
  },
  {
    "title": "Pope Leo Plans to Speak on Climate Change",
    "link": "https://www.nytimes.com/2025/09/30/climate/pope-leo-climate-speech-laudato-si.html",
    "summary": "The address comes 10 years after his predecessor’s groundbreaking statement on global warming. His words will be watched for signals on the direction of the new papacy."
  },
  {
    "title": "Starmer Describes ‘Fight for the Soul’ of U.K. as Populist Right Rises",
    "link": "https://www.nytimes.com/2025/09/30/world/europe/starmer-speech-soul-uk.html",
    "summary": "In a speech at an annual Labour conference, the British prime minister contrasted his political project with that of Nigel Farage, whose Reform party promises mass deportations."
  },
  {
    "title": "Second Victim of Dallas ICE Shooting Dies",
    "link": "https://www.nytimes.com/2025/09/30/us/dallas-ice-shooting-death-miguel-angel-garcia-hernandez.html",
    "summary": "A house painter who had been in the United States for two decades had been critically injured in Dallas by a gunman who the government said was aiming at federal law enforcement officers."
  },
  {
    "title": "How Chinese Weapons Transformed a War Between Two Neighbors",
    "link": "https://www.nytimes.com/2025/09/29/world/asia/thailand-cambodia-china-weapons.html",
    "summary": "China urged Cambodia and Thailand to end their border war in July. But weeks earlier, it had sent rockets and artillery shells to Cambodia, Thai intelligence documents show."
  }
]