[
  {
    "title": "More Agents Head to Minnesota as U.S. Takes Over Shooting Investigation",
    "link": "https://www.nytimes.com/2026/01/08/us/minnesota-ice-shooting-news.html",
    "summary": "A day after an ICE agent fatally shot a 37-year-old woman in Minneapolis, the governor activated the state’s National Guard, and 100 more federal agents were also being deployed."
  },
  {
    "title": "Noem Defends ICE Agent in Minneapolis Shooting and Attacks Mamdani",
    "link": "https://www.nytimes.com/2026/01/08/nyregion/kristi-noem-ice-minneapolis.html",
    "summary": "During a visit to New York, the homeland security secretary, Kristi Noem, criticized the city’s policies that prevent police officers from helping immigration agents."
  },
  {
    "title": "Federal Agents Shoot 2 in Portland, Ore., Police Say",
    "link": "https://www.nytimes.com/2026/01/08/us/politics/federal-agents-shooting-portland.html",
    "summary": "The shootings in Portland, a city previously targeted by the Trump administration, come as Minneapolis grapples with a federal agent’s fatal shooting of a woman a day earlier."
  },
  {
    "title": "Trump Addresses Venezuela, Greenland and Presidential Power in New York Times Interview",
    "link": "https://www.nytimes.com/2026/01/08/us/politics/trump-interview-power-morality.html",
    "summary": "On topic after topic, President Trump made clear that he would be the arbiter of any limits to his authorities, not international law or treaties."
  },
  {
    "title": "The Many Faces of Trump: What We Saw When We Interviewed the President",
    "link": "https://www.nytimes.com/2026/01/08/us/politics/trump-oval-office-interview-scene.html",
    "summary": "He let reporters in on a call with Colombia’s president. He complained about Zohran Mamdani. He called JD Vance and Marco Rubio “kids.” Inside an unpredictable evening with President Trump."
  },
  {
    "title": "These 5 Republicans Broke With Trump on Venezuela War Powers",
    "link": "https://www.nytimes.com/2026/01/08/us/politics/five-republicans-congress-trump-venezuela.html",
    "summary": "The Republican defectors paved the way for a debate that could expose bipartisan concern about President Trump’s actions in Venezuela. Mr. Trump called for them to lose their seats."
  },
  {
    "title": "U.S. Navy Is Chasing Several Oil Tankers in the Atlantic",
    "link": "https://www.nytimes.com/2026/01/08/world/americas/navy-chasing-tankers-venezuela.html",
    "summary": "A mass departure by sanctioned tankers, some switching to Russian flags, has triggered a fresh effort by the United States to pursue Venezuelan oil shipments at sea."
  },
  {
    "title": "House Passes Doomed Bill to Restore ACA Subsidies",
    "link": "https://www.nytimes.com/2026/01/08/us/politics/house-bill-aca-subsidies.html",
    "summary": "The passage of the bill was a triumph for Democrats, who drew substantial Republican backing. But it has no path forward, and an election-year compromise is a long shot."
  },
  {
    "title": "Vance Announces New Justice Dept. Fraud Post to Be ‘Run Out of the White House’",
    "link": "https://www.nytimes.com/2026/01/08/us/jd-vance-justice-dept-fraud-post.html",
    "summary": "The assertion was a brazen effort to toss out the traditional boundaries that have long existed between the White House and investigations conducted by federal law enforcement."
  },
  {
    "title": "House Passes Spending Package Before Another Shutdown Deadline",
    "link": "https://www.nytimes.com/2026/01/08/us/politics/house-spending-package.html",
    "summary": "The legislation would fund parts of the government ahead of a Jan. 30 deadline in a bipartisan breakthrough after the nation’s longest shutdown."
  },
  {
    "title": "Dogs Build Their Vocabularies Like Toddlers",
    "link": "https://www.nytimes.com/2026/01/08/science/dogs-research-vocabulary-toys.html",
    "summary": "Eavesdropping on their owners seems to help some toy-crazy and talented pups learn more words."
  },
  {
    "title": "Prosecutors Said to Pursue New Investigation of Letitia James",
    "link": "https://www.nytimes.com/2026/01/08/us/politics/letitia-james-trump-justice-department.html",
    "summary": "A longtime hairdresser for the New York attorney general has come under scrutiny as the Justice Department’s efforts to charge Ms. James on other fronts falter."
  },
  {
    "title": "Judge Bars Prosecutor From Inquiry Into Letitia James, New York Attorney General",
    "link": "https://www.nytimes.com/2026/01/08/nyregion/albany-us-attorney-letitia-james.html",
    "summary": "Ms. James, New York’s attorney general, had been seeking to block a Justice Department investigation into her office by challenging the legitimacy of the U.S. attorney, John A. Sarcone III."
  },
  {
    "title": "Hochul and Mamdani Announce Plan to Make N.Y. Child Care Universal",
    "link": "https://www.nytimes.com/2026/01/08/nyregion/mamdani-hochul-child-care.html",
    "summary": "Gov. Kathy Hochul and Mayor Zohran Mamdani described a complex and expensive expansion of child care in New York City that would add programs for 2-year-olds."
  },
  {
    "title": "Mamdani Is Promising Universal Child Care. How Long Could It Take?",
    "link": "https://www.nytimes.com/2025/12/30/nyregion/mamdani-nyc-mayor-free-childcare.html",
    "summary": "Here is what to expect if you’re expecting relief from the soaring cost of day care in New York City."
  },
  {
    "title": "Iran Is Cut Off From Internet as Protests Calling for Regime Change Intensify",
    "link": "https://www.nytimes.com/2026/01/08/world/middleeast/iran-protests-internet-shutdown.html",
    "summary": "As protests swelled around the country, Iran’s internet was shut down, and the heads of its judiciary and its security services warned of a harsh response amid calls for “freedom, freedom.”"
  },
  {
    "title": "Former Uvalde Teacher’s Testimony Throws a Trial Into Chaos",
    "link": "https://www.nytimes.com/2026/01/08/us/uvalde-shooting-teacher-testimony-trial.html",
    "summary": "Lawyers for a former officer charged with abandoning children in the police response accused prosecutors of withholding information. A judge ruled prosecutors had erred but denied a motion for a mistrial."
  },
  {
    "title": "The Rise of the Self-Serve Blood Test",
    "link": "https://www.nytimes.com/2026/01/08/well/function-health-blood-tests.html",
    "summary": "The start-up Function will send practically anyone to a lab for extensive medical testing, no physical required. Is that a good thing?"
  },
  {
    "title": "Gov. Gavin Newsom Criticizes Trump in State of the State Address",
    "link": "https://www.nytimes.com/2026/01/08/us/newsom-california-state-of-the-state-speech.html",
    "summary": "Gov. Gavin Newsom criticized President Trump and portrayed his state as “a beacon” of democracy in a State of the State address that suggested national ambitions."
  },
  {
    "title": "Josh Shapiro Starts a New Chapter, Attacking the ‘Toxicity in D.C.’",
    "link": "https://www.nytimes.com/2026/01/08/us/politics/josh-shapiro-pennsylvania-governor-2028.html",
    "summary": "Kicking off his re-election bid, the Pennsylvania governor warned against federal overreach and promised, “I will not let anyone mess with a Pennsylvanian.”"
  },
  {
    "title": "Ukraine Awards Major Lithium Project to Investors With Links to Trump",
    "link": "https://www.nytimes.com/2026/01/08/world/europe/trump-lauder-ukraine-lithium.html",
    "summary": "Ronald S. Lauder, a billionaire friend of Mr. Trump, is among the investors. The move comes as the Trump administration looks for investment opportunities in Ukraine."
  },
  {
    "title": "Dav Pilkey, the Man Behind ‘Dog Man,’ Aims to Please",
    "link": "https://www.nytimes.com/2026/01/08/books/review/dog-man-captain-underpants-dav-pilkey.html",
    "summary": "“I’m writing for the kid I used to be,” says Dav Pilkey, who defied expectations to create three blockbuster graphic-novel series."
  },
  {
    "title": "Apple’s John Ternus Could Be Tim Cook’s Successor as CEO",
    "link": "https://www.nytimes.com/2026/01/08/technology/apple-ceo-tim-cook-john-ternus.html",
    "summary": "John Ternus, a low-profile but influential executive at Apple, could be next in line to replace the company’s longtime chief executive, Tim Cook, if he steps aside."
  },
  {
    "title": "The Scientists Making Antacids for the Sea to Help Counter Global Warming",
    "link": "https://www.nytimes.com/2026/01/08/magazine/ocean-acidification-carbon-geoengineering.html",
    "summary": "The world’s oceans are becoming dangerously acidic. A controversial proposal would raise the pH — by mixing chemicals into the water."
  },
  {
    "title": "What Happens When No One Can Say No to Trump?",
    "link": "https://www.nytimes.com/video/opinion/100000010632349/what-happens-when-no-one-can-say-no-to-trump.html",
    "summary": "After the capture of the Venezuelan president, Nicolás Maduro, over the weekend, “Trump is setting a new course for the country where he can use the military to do just about anything he wants,” argues Times Opinion’s editor, Kathleen Kingsbury. “No one is allowed to say ‘no’ to Trump.”"
  },
  {
    "title": "I’m the Mayor of Minneapolis. Trump Is Lying to You.",
    "link": "https://www.nytimes.com/2026/01/08/opinion/minneapolis-ice-agent-shooting-trump.html",
    "summary": "This administration is making cities less safe."
  },
  {
    "title": "Trump Said His Global Power Was Limited Only by His ‘Own Morality’",
    "link": "https://www.nytimes.com/2026/01/08/briefing/trump-interview-oval-office-apple-ceo.html",
    "summary": "Also, meet one of the front-runners to become Apple’s next C.E.O. Here’s the latest at the end of Thursday."
  },
  {
    "title": "We Want to Hear From Parents and Doctors About Vaccines",
    "link": "https://www.nytimes.com/2026/01/08/well/vaccine-callout.html",
    "summary": "The Trump administration has removed six vaccines from the routine immunization schedule. How is that affecting you?"
  },
  {
    "title": "NASA Will Bring I.S.S. Astronauts Home Early After Medical Issue",
    "link": "https://www.nytimes.com/2026/01/08/science/nasa-astronaut-medical-problem.html",
    "summary": "After canceling a spacewalk planned for Thursday, the space agency’s administrator said it was erring on the side of caution and bringing a crew of four home in the coming days."
  },
  {
    "title": "Minnesota Man Is Freed After Serving 25 Years for Murder He Did Not Commit",
    "link": "https://www.nytimes.com/2026/01/08/us/brian-pippitt-wrongful-murder-conviction.html",
    "summary": "The state’s conviction review unit concluded that Brian Pippitt, 63, was not involved in the 1998 murder of an 84-year-old woman, for which he was serving a life sentence."
  },
  {
    "title": "G.M. Books a $7.1 Billion Loss as It Scales Back E.V. Ambitions",
    "link": "https://www.nytimes.com/2026/01/08/business/general-motors-electric-vehicles-writedown.html",
    "summary": "General Motors said it was writing down the value of battery and electric vehicle factories after changes in federal policy undercut demand."
  },
  {
    "title": "Cooper Union Settles Jewish Students’ Suit and Alters Protest Policies",
    "link": "https://www.nytimes.com/2026/01/08/nyregion/cooper-union-jewish-students-lawsuit-antisemitism.html",
    "summary": "The New York City college had been accused of tolerating discrimination against those who believe in Zionism following a pro-Palestinian protest that trapped students inside a library."
  }
]