[
  {
    "title": "As Trump Sows Tariff Confusion, Rules of Global Commerce Give Way to Chaos",
    "link": "https://www.nytimes.com/2025/07/11/world/europe/trump-tariffs-global-trade-deals.html",
    "summary": "Blunt letters dictating terms posted to social media and changes late in negotiations have left trading partners wondering what President Trump will do next."
  },
  {
    "title": "‘Buy the Dip’ Wins Again for Stock Investors",
    "link": "https://www.nytimes.com/2025/07/11/business/stocks-buy-the-dip.html",
    "summary": "Individual investors were the ones who piled into stocks when they plunged in early April, while big Wall Street institutions missed out on the gains."
  },
  {
    "title": "How the $1,000 ‘Trump Accounts’ for Newborns Will Work",
    "link": "https://www.nytimes.com/2025/07/11/your-money/trump-accounts-newborns.html",
    "summary": "The payments, part of the new domestic policy law, are for U.S. citizens born this year through 2028. The idea is that the money in the accounts will have many years to grow."
  },
  {
    "title": "How Netanyahu Prolonged the War in Gaza to Stay in Power",
    "link": "https://www.nytimes.com/2025/07/11/magazine/benjamin-netanyahu-gaza-war.html",
    "summary": "Secret meetings, altered records, ignored intelligence: the inside story of the prime minister’s political calculations since Oct. 7."
  },
  {
    "title": "Takeaways From the Times Investigation Into Benjamin Netanyahu",
    "link": "https://www.nytimes.com/2025/07/11/magazine/benjamin-netanyahu-gaza-investigation-takeaways.html",
    "summary": "Prolonging the Gaza war helped the Israeli prime minister forestall a political reckoning."
  },
  {
    "title": "Netanyahu Ends Washington Trip Without a Gaza Truce",
    "link": "https://www.nytimes.com/2025/07/11/world/middleeast/netanyahu-washington-gaza-talks.html",
    "summary": "Benjamin Netanyahu, the Israeli prime minister, met several times with President Trump, amid rising hopes of a cease-fire in Gaza, but there are still obstacles to a truce with Hamas."
  },
  {
    "title": "Kerr County Repeatedly Sought Help with Flood Risk. Texas Said No.",
    "link": "https://www.nytimes.com/2025/07/10/us/politics/texas-flood-alarm-system.html",
    "summary": "Kerr County failed to secure a warning system, even as local officials remained aware of the risks and as billions of dollars were available for similar projects."
  },
  {
    "title": "Federal Agents Clash With Protesters During Immigration Raid at California Farm",
    "link": "https://www.nytimes.com/2025/07/11/us/ice-raid-california-cannabis-farm.html",
    "summary": "Officers appeared to use crowd control munitions and tear gas against protesters. The F.B.I. said it was searching for a person who appeared to fire a pistol at officers."
  },
  {
    "title": "Trump’s Purge of Foreign Workers Arrives at Amazon’s Warehouses",
    "link": "https://www.nytimes.com/2025/07/11/technology/trump-immigration-amazon-warehouses.html",
    "summary": "The tech giant has quietly shed warehouse employees whose work authorizations were revoked after the Trump administration ended a Biden-era immigration program."
  },
  {
    "title": "Nantucket’s Workers Are Living on the Margins",
    "link": "https://www.nytimes.com/2025/07/11/realestate/nantucket-affordable-housing-homeless.html",
    "summary": "Teachers, police officers, firefighters and other workers live in overcrowded and substandard housing, or even in their cars on the beach."
  },
  {
    "title": "Srebrenica, a Massacre Foretold, Still Casts Its Shadow",
    "link": "https://www.nytimes.com/2025/07/11/world/europe/srebrenica-massacre-bosnia.html",
    "summary": "The town was supposed to be a “safe area,” protected by U.N. peacekeepers, but Serb forces massacred 8,000 Muslim men and boys there."
  },
  {
    "title": "Earth Is Spinning Faster, Making Some Summer Days Shorter",
    "link": "https://www.nytimes.com/2025/07/11/science/earth-speeding-up-summer-days-shorter.html",
    "summary": "The planet’s rotation fluctuates as it travels around the sun, and measurements suggest we’re losing more than a millisecond during the long days of summer."
  },
  {
    "title": "Musk’s Chatbot Started Spouting Nazi Propaganda. That’s Not the Scariest Part.",
    "link": "https://www.nytimes.com/2025/07/11/opinion/ai-grok-x-llm.html",
    "summary": "The folks at X say don’t worry, they’re on it."
  },
  {
    "title": "The Dollar’s in Trouble, but Not for the Reason You Think",
    "link": "https://www.nytimes.com/2025/07/11/opinion/dollar-money-currency-payment.html",
    "summary": "New payment systems allow users and banks to bypass the U.S. currency and sanctions."
  },
  {
    "title": "Does Brooklyn Need a New Waterfront Neighborhood?",
    "link": "https://www.nytimes.com/2025/07/11/nyregion/brooklyn-marine-terminal-development.html",
    "summary": "The risks and opportunities of turning 122 industrial acres over to developers."
  },
  {
    "title": "S.E.C. Accuses Prominent Georgia Republican of Running Ponzi Scheme",
    "link": "https://www.nytimes.com/2025/07/11/us/politics/brant-frost-first-liberty-ponzi-scheme.html",
    "summary": "Edwin Brant Frost IV, a well-known Republican, is accused of defrauding 300 investors of $140 million, and using some funds for political donations. He said he took “full responsibility.”"
  },
  {
    "title": "Strava Fitness App Revealed Locations of Swedish Leaders",
    "link": "https://www.nytimes.com/2025/07/11/world/europe/strava-sweden-bodyguards-prime-minister.html",
    "summary": "Secret meetings and private holidays of the royal family and prime minister were inadvertently made public on Strava, which has raised security concerns in other instances."
  },
  {
    "title": "Livvy Dunne Tried to Buy Babe Ruth’s Former Apartment. An N.Y.C. Co-op Board Said ‘No’.",
    "link": "https://www.nytimes.com/2025/07/10/realestate/livvy-dunne-babe-ruth-apartment-nyc.html",
    "summary": "The influencer and former collegiate gymnast tried to buy the Manhattan two-bedroom, but instead joined the ranks of high-profile rejects like Madonna and Calvin Klein."
  }
]