[
  {
    "title": "A Campaign to Revoke the Endangerment Finding Appears Near ‘Total Victory’",
    "link": "https://www.nytimes.com/2026/02/09/climate/endangerment-finding.html",
    "summary": "A small group of conservative activists has worked for 16 years to stop all government efforts to fight climate change. Their efforts seem poised to pay off."
  },
  {
    "title": "Newly Unbound, Trump Weighs More Nuclear Arms and Underground Tests",
    "link": "https://www.nytimes.com/2026/02/09/us/politics/trump-nuclear-arms-underground-tests.html",
    "summary": "It remains to be seen whether the three big nuclear powers are headed into a new arms race, or whether President Trump is trying to spur negotiations on a new accord now that a last Cold War treaty has expired."
  },
  {
    "title": "Gabbard’s 2020 Election Claims Put Her Back in Favor With Trump",
    "link": "https://www.nytimes.com/2026/02/09/us/politics/tulsi-gabbard-2020-election.html",
    "summary": "Tulsi Gabbard has focused on attacking the so-called deep state after an uneven first year as the director of national intelligence."
  },
  {
    "title": "Trump Threatens to Block Opening of Gordie Howe International Bridge to Canada",
    "link": "https://www.nytimes.com/2026/02/09/us/politics/trump-gordie-howe-bridge-canada.html",
    "summary": "The Gordie Howe International Bridge, expected to open early this year, was built by Canada to ease cargo transport between Detroit and Windsor, Ontario."
  },
  {
    "title": "Ghislaine Maxwell Refuses to Answer Questions, and Texas Republicans Increase Anti-Muslim Rhetoric",
    "link": "https://www.nytimes.com/2026/02/10/podcasts/the-headlines/trump-shootings-court-olympics.html",
    "summary": "Plus, Olympic medals are falling apart — again."
  },
  {
    "title": "Trump Administration Claims About Shootings by Federal Agents Unravel in Court",
    "link": "https://www.nytimes.com/2026/02/10/us/politics/homeland-security-shootings.html",
    "summary": "Before the killings of Renee Good and Alex Pretti, allegations against four others shot at by federal immigration agents failed to withstand scrutiny."
  },
  {
    "title": "Many Residents in Minneapolis, Tempered by ICE Turmoil, Now Feel Empowered",
    "link": "https://www.nytimes.com/2026/02/10/us/twin-cities-residents-unity-ice.html",
    "summary": "Two months after federal agents began operations in the Twin Cities, residents say they have found strength in their sense of community."
  },
  {
    "title": "Russia Nears Capture of Key Ukrainian Towns After Year of Grinding Assaults",
    "link": "https://www.nytimes.com/2026/02/10/world/europe/russia-ukraine-battlefield-huliaipole-pokrovsk.html",
    "summary": "Russian troops have advanced at a glacial pace in recent months, but gains in southern and eastern Ukraine could give Moscow an edge in U.S.-mediated peace talks."
  },
  {
    "title": "How Ukrainians Are Coping Without Heat",
    "link": "https://www.nytimes.com/video/world/europe/100000010689521/how-ukrainians-are-coping-without-heat.html",
    "summary": "Our Kyiv bureau chief, Andrew E. Kramer, describes how Kyiv residents are coping with Russia’s unrelenting assaults on their country’s heating and electrical systems and finding ways to stay warm in a cruel winter."
  },
  {
    "title": "Russia Knocked Out the Heat. So She Slept in a Tent on Her Bed.",
    "link": "https://www.nytimes.com/2026/02/10/world/europe/ukraine-war-russia-power-cold.html",
    "summary": "With defiant ingenuity, Kyiv residents are trying to find ways to stay warm in a cruel winter."
  },
  {
    "title": "Trump’s Threats to Cuba’s Oil Suppliers Put Mexico in a Bind",
    "link": "https://www.nytimes.com/2026/02/10/world/americas/mexico-cuba-oil.html",
    "summary": "The longstanding alliance between Cuba and Mexico is under mounting pressure from the United States, forcing President Claudia Sheinbaum into a precarious balancing act."
  },
  {
    "title": "Nicaragua Blocks a Route from Cuba to the U.S.",
    "link": "https://www.nytimes.com/2026/02/10/world/americas/nicaragua-cuba-us-immigration.html",
    "summary": "The Trump administration has criticized Nicaragua for serving as an illegal immigration pathway to the United States."
  },
  {
    "title": "Air Canada Cancels Flights to Cuba as Cuba Runs Out of Jet Fuel",
    "link": "https://www.nytimes.com/2026/02/09/world/americas/air-canada-flight-cancellations-cuba-jet-fuel.html",
    "summary": "The Trump administration’s crackdown on oil shipments to Cuba is beginning to wreak havoc on the Caribbean island’s travel industry."
  },
  {
    "title": "Ilia Malinin, Who Led the U.S. to Gold, Is Bringing Ice Skating Back Into the Limelight",
    "link": "https://www.nytimes.com/2026/02/09/world/olympics/ilia-malinin-ice-skating-winter-olympics.html",
    "summary": "Ilia Malinin, who led the United States to a team gold medal at the Winter Olympics and will now vie for his own, is testing the physical limits of what is possible on the ice."
  },
  {
    "title": "Maxwell Refuses to Answer Questions About Epstein Crimes in House Deposition",
    "link": "https://www.nytimes.com/2026/02/09/us/politics/ghislaine-maxwell-house-jeffrey-epstein-trump.html",
    "summary": "Ghislaine Maxwell, the longtime companion of the convicted sex offender Jeffrey Epstein, invoked her right against self-incrimination in an Oversight Committee deposition."
  },
  {
    "title": "New Email Shows Bard President Leon Botstein Thanked Epstein for Caribbean Trip",
    "link": "https://www.nytimes.com/2026/02/09/us/bard-leon-botstein-jeffrey-epstein-relationship.html",
    "summary": "Leon Botstein, Bard’s president, also invited Jeffrey Epstein to visit a high school linked to Bard College and sent him well wishes after stories were published about his sexual abuse of minors."
  },
  {
    "title": "Without a Border ‘Invasion,’ Texas G.O.P. Turns to an Old Enemy, Islam",
    "link": "https://www.nytimes.com/2026/02/10/us/politics/texas-muslims-republicans.html",
    "summary": "Republican politicians and strategists in Texas are amping up anti-Muslim rhetoric as a way to energize Republican voters after several elections when the border was the animating force."
  },
  {
    "title": "Eating Kosher in the Heart of Syria: Lamb-Stuffed Zucchini but Hold the Yogurt",
    "link": "https://www.nytimes.com/2026/02/10/world/middleeast/syria-kosher-damascus.html",
    "summary": "In the post-Assad era, more Jews are visiting a country that some fled decades ago. One hotel restaurant offers a corner where religious dietary requirements are melded with the local cuisine."
  },
  {
    "title": "Savannah Guthrie Says She Believes Her Mom, Nancy, ‘Is Still Out There’ in New Video",
    "link": "https://www.nytimes.com/2026/02/09/us/savannah-guthrie-kidnapping-video.html",
    "summary": "The television host pleaded for the public’s help in finding her mother, Nancy, who disappeared from her Arizona home last week. “We are at an hour of desperation,” she said."
  },
  {
    "title": "A Shift in Chinese Taste for Durian Throws Malaysian Farmers Into Turmoil",
    "link": "https://www.nytimes.com/2026/02/10/world/asia/durian-malaysia-china-demand.html",
    "summary": "Malaysian durian farmers saw immense profits over the last decade as China snapped up their produce. But tastes have shifted."
  },
  {
    "title": "Watch: A Conversation With Anna Wintour and Her U.S. Vogue Successor, Chloe Malle",
    "link": "https://www.nytimes.com/2026/02/10/business/media/anna-wintour-chloe-malle-vogue-interview.html",
    "summary": "In their first joint interview, Ms. Malle spoke about filling the shoes of Ms. Wintour, who urged people to “get over comparisons.”"
  },
  {
    "title": "Broadway’s Great Imitators, Now on TikTok",
    "link": "https://www.nytimes.com/2026/02/10/arts/tiktok-broadway-chicago-groff.html",
    "summary": "TikTok is the new home for musical theater fans who want to put themselves in the action. Viral re-enactments of four big numbers show why."
  },
  {
    "title": "Trump’s Doomed Drive to Rename Penn Station and Dulles Airport",
    "link": "https://www.nytimes.com/2026/02/10/opinion/trump-university-airport.html",
    "summary": "The president wants to change the public landscape to honor himself. It’s not the worst thing he’s done, but it will require fixing."
  },
  {
    "title": "The Epstein Files Are Coming for Keir Starmer",
    "link": "https://www.nytimes.com/2026/02/10/opinion/epstein-mandelson-starmer-britain.html",
    "summary": "Even longtime admirers see the writing on the wall for Keir Starmer."
  },
  {
    "title": "The End of Arms Control",
    "link": "https://www.nytimes.com/2026/02/10/briefing/the-end-of-arms-control.html",
    "summary": "We look at how world superpowers are approaching nuclear weapons."
  },
  {
    "title": "Jon Stewart Defends Bad Bunny’s Super Bowl Halftime Show",
    "link": "https://www.nytimes.com/2026/02/10/arts/television/late-night-bad-bunny.html",
    "summary": "“The Daily Show” host said it shouldn’t be a performer’s job to unify the country: “Isn’t there another person whose job description is much more along those lines?”"
  },
  {
    "title": "How a Decision to Use Whistles as a Prop Cost Eric Adams $4,000",
    "link": "https://www.nytimes.com/2026/02/09/nyregion/eric-adams-whistles.html",
    "summary": "The former New York mayor paid a Conflicts of Interest Board fine for having City Hall employees assist in attacking former Gov. Andrew Cuomo over sexual harassment allegations."
  },
  {
    "title": "How the Israeli President’s Visit to Australia Created a ‘Tinder Box’",
    "link": "https://www.nytimes.com/2026/02/10/world/australia/australia-herzog-protest-violence.html",
    "summary": "Isaac Herzog’s trip led to widespread rallies and tested the restrictions on protests that Australia installed after a deadly attack on a Jewish celebration."
  },
  {
    "title": "U.S. Archbishop Fulton J. Sheen to Be Beatified, One Step Away From Sainthood",
    "link": "https://www.nytimes.com/2026/02/09/us/archbishop-sheen-beatification-saint.html",
    "summary": "The move involving Archbishop Fulton J. Sheen, who hosted a popular midcentury radio and TV show and died in 1979, ends a six-year delay."
  },
  {
    "title": "Catherine O’Hara Died From Pulmonary Embolism, Death Certificate Says",
    "link": "https://www.nytimes.com/2026/02/09/movies/catherine-ohara-cause-of-death.html",
    "summary": "A death certificate released on Monday also said rectal cancer was an underlying cause for the comedic actress’s death on Jan. 30 at 71."
  }
]