[
  {
    "title": "No Proof Hamas Routinely Stole U.N. Aid, Israeli Military Officials Say",
    "link": "https://www.nytimes.com/2025/07/26/world/middleeast/hamas-un-aid-theft.html",
    "summary": "Israel has long restricted or completely blocked aid to Gaza on the argument that Hamas steals it to use as a weapon of control over the population."
  },
  {
    "title": "How Seeking Food in Gaza Has Become So Deadly",
    "link": "https://www.nytimes.com/2025/07/24/podcasts/the-daily/gaza-palestine-aid-food.html",
    "summary": "Hundreds of Palestinians have been killed over the past month near aid hubs set up under a new Israeli-backed system, according to Gaza health officials."
  },
  {
    "title": "From Epstein to Obama, Trump’s Washington Is Consumed by Competing Conspiracies",
    "link": "https://www.nytimes.com/2025/07/26/us/politics/trump-epstein-obama-conspiracies.html",
    "summary": "President Trump is trying to divert attention from the Epstein conspiracy theory with new-and-improved one about Barack Obama and treason."
  },
  {
    "title": "A Clash Over a Promotion Puts Hegseth at Odds With His Generals",
    "link": "https://www.nytimes.com/2025/07/26/us/politics/hegseth-pentagon-leadership.html",
    "summary": "Suspicions about leaks and a mistrust of senior military officers have defined much of the defense secretary’s first six months on the job."
  },
  {
    "title": "A Kennedy Toils in Mississippi, Tracing His Grandfather’s Path",
    "link": "https://www.nytimes.com/2025/07/26/us/politics/joe-kennedy-mississippi.html",
    "summary": "Joe Kennedy III, the grandson of Senator Robert F. Kennedy, says there is work to do in red states. He also has a few things to say about his uncle, Robert F. Kennedy Jr."
  },
  {
    "title": "This Democrat Wants Cognitive Standards in Congress. Her Colleagues Disagree.",
    "link": "https://www.nytimes.com/2025/07/26/us/politics/age-cognitive-standards-congress.html",
    "summary": "Representative Marie Gluesenkamp Perez says age-related cognitive decline among elected officials is a major issue for voters."
  },
  {
    "title": "In Russia, Corruption Cases Follow Battlefield Failures",
    "link": "https://www.nytimes.com/2025/07/26/world/europe/russia-corruption-ukraine-war.html",
    "summary": "Officials in three of the five Russian regions bordering Ukraine have been accused of embezzling funds for border defenses."
  },
  {
    "title": "New Reports on Russian Interference Show Trump’s Claims on Obama Are Overblown",
    "link": "https://www.nytimes.com/2025/07/25/us/trump-obama-russia.html",
    "summary": "The administration’s claims are overblown, but newly declassified information provides some messy details about a January 2017 intelligence assessment of Moscow’s election interference."
  },
  {
    "title": "He Read (at Least) 3,599 Books in His Lifetime. Now Anyone Can See His List.",
    "link": "https://www.nytimes.com/2025/07/26/books/man-died-book-list-thousands.html",
    "summary": "After Dan Pelzer died this month at 92, his children uploaded the handwritten reading list to what-dan-read.com, hoping to inspire readers everywhere."
  },
  {
    "title": "How Hulk Hogan Leg-Dropped the Digital Media Industry",
    "link": "https://www.nytimes.com/2025/07/26/magazine/hulk-hogan-digital-media-industry.html",
    "summary": "His lawsuit over a leaked sex tape bankrupted Gawker Media — and helped inspire the American right’s ongoing war on the press."
  },
  {
    "title": "Harvard’s Leader, Penny Pritzker, Faces Intense Scrutiny in Trump Fight",
    "link": "https://www.nytimes.com/2025/07/26/us/harvard-penny-pritzker.html",
    "summary": "As Harvard and the government negotiate to end a conflict with billions of dollars on the line, some ask whether Penny Pritzker, the head of the school’s governing board, should step down."
  },
  {
    "title": "States Look to Europe to Improve U.S. Prison Conditions",
    "link": "https://www.nytimes.com/2025/07/25/us/prison-improvements-oklahoma-germany.html",
    "summary": "States of all political stripes, including Oklahoma, North Dakota and Massachusetts, have sent officials to tour prisons in Germany in search of ways to improve conditions for American inmates."
  },
  {
    "title": "A Judge Gave a One-Word Answer. It Torpedoed the Etan Patz Case.",
    "link": "https://www.nytimes.com/2025/07/26/nyregion/etan-patz-case-challenges.html",
    "summary": "After an appeals court overturned a conviction, prosecutors must decide whether to retry a man in the notorious 1979 child killing for a third time."
  },
  {
    "title": "Plastic Turf Fields Are Taking Over America",
    "link": "https://www.nytimes.com/2025/07/26/business/artificial-turf-grass-sports.html",
    "summary": "The debate over whether to install turf over grass fields has become a referendum on sports, health, the environment and the use of scarce public resources."
  },
  {
    "title": "CBS: Caving. Bowing. Scraping.",
    "link": "https://www.nytimes.com/2025/07/26/opinion/trump-south-park-cbs.html",
    "summary": "Don’t take on satirists — they always get the last laugh."
  },
  {
    "title": "Trump Isn’t Getting Rid of Chaos at the Border. He’s Redistributing It.",
    "link": "https://www.nytimes.com/2025/07/26/opinion/trump-ice-raids-resistance-movement.html",
    "summary": "“The Opinions” round table discusses the president’s immigration policies and the emerging resistance to it."
  },
  {
    "title": "Little Victories",
    "link": "https://www.nytimes.com/2025/07/26/briefing/little-victories.html",
    "summary": "We tend to confine our parties to milestones and cultural events, but there are countless micro-occasions worthy of commemorating."
  },
  {
    "title": "Military Clash Between Thailand and Cambodia Expands Along Shared Border",
    "link": "https://www.nytimes.com/2025/07/26/world/asia/thailand-cambodia-fighting-conflict-expands.html",
    "summary": "The deadliest conflict between the two nations in 14 years, now in its third day, extended to provinces about 200 miles south of where clashes first began."
  },
  {
    "title": "Taiwan Votes in Recall Campaign That Tests China’s Nerves",
    "link": "https://www.nytimes.com/2025/07/25/world/asia/taiwans-recall-china.html",
    "summary": "An unprecedented recall vote could hand President Lai Ching-te more power by ousting legislative opponents. It could also prompt a response from China."
  },
  {
    "title": "Removal of Castro and Guevara Statues Ignites Outcry in Mexico City",
    "link": "https://www.nytimes.com/2025/07/26/world/americas/mexico-city-fidel-che-statues.html",
    "summary": "The Cuban Revolution leaders joined forces in Mexico in 1955. A local mayor removed a memorial to them, drawing protests and condemnation from Mexico’s highest office."
  }
]