[
  {
    "title": "A Test Now for Israel: Can It Repair Its Ties to Americans?",
    "link": "https://www.nytimes.com/2025/10/12/world/middleeast/israel-us-polls-support.html",
    "summary": "Israel’s advocates fear that its conduct of the war has cost it the support of an entire generation of U.S. voters."
  },
  {
    "title": "Israelis and Palestinians Await Hostage-Prisoner Swap With Relief and Elation",
    "link": "https://www.nytimes.com/2025/10/12/world/middleeast/israel-gaza-hostages-prisoners-ceasefire.html",
    "summary": "Under the first phase of the new cease-fire deal, all living hostages in Gaza are expected to be released in the next 24 hours in exchange for about 2,000 Palestinians imprisoned by Israel."
  },
  {
    "title": "Black Unemployment Is Surging Again. This Time Is Different.",
    "link": "https://www.nytimes.com/2025/10/12/business/economy/black-unemployment-federal-layoffs-diversity-initiatives.html",
    "summary": "Federal layoffs and an end to diversity initiatives have weakened a historically strong labor market for Black workers."
  },
  {
    "title": "Trump Is Blowing Up Boats Off Venezuela. Could Mexico’s Cartels Be Next?",
    "link": "https://www.nytimes.com/2025/10/12/world/americas/mexico-drugs-venezuela-us-military.html",
    "summary": "U.S. strikes on boats that President Trump says are drug smugglers have unsettled America’s biggest trading partner, where powerful criminal groups produce and smuggle drugs."
  },
  {
    "title": "Air Traffic Controllers Reject Credit for Ending the Last Shutdown",
    "link": "https://www.nytimes.com/2025/10/12/us/politics/air-traffic-controllers-shutdown.html",
    "summary": "Controllers missing work was widely cited as the reason the last shutdown came to an end. But that assumption might have been overblown, according to controllers, aviation safety experts and congressional aides."
  },
  {
    "title": "Who Are the Louisiana Voters Behind a Major Supreme Court Challenge?",
    "link": "https://www.nytimes.com/2025/10/12/us/politics/supreme-court-voting-rights.html",
    "summary": "There is little information in court filings about the dozen plaintiffs who challenged the state’s voting map as an illegal racial gerrymander."
  },
  {
    "title": "How Diane Keaton’s ‘Annie Hall’ Look Was Integral to Her Art",
    "link": "https://www.nytimes.com/2025/10/11/movies/diane-keaton-annie-hall.html",
    "summary": "Though she downplayed it, her role in creating the outfits of “Annie Hall” made her the author of a fascinating career."
  },
  {
    "title": "Diane Keaton, a Star of ‘The Godfather’ and ‘First Wives Club,’ Dies at 79",
    "link": "https://www.nytimes.com/2025/10/11/movies/diane-keaton-dead.html",
    "summary": "She brought an unconventional personality to scores of roles on television and in movies ranging from zany comedies like “Sleeper” to piercing dramas like “The Godfather.”"
  },
  {
    "title": "Diane Keaton: A Life in Pictures",
    "link": "https://www.nytimes.com/2025/10/11/arts/diane-keaton-photos.html",
    "summary": "On and off the screen, the star with a distinctive fashion sense was a singular presence."
  },
  {
    "title": "She Despised Charlie Kirk. He Resolved to Make People Like Her Pay.",
    "link": "https://www.nytimes.com/2025/10/12/us/charlie-kirk-civil-war.html",
    "summary": "In rural Texas, just 40 miles apart, a paramedic and a former small-town mayor got caught up on two sides of a digital “civil war.”"
  },
  {
    "title": "How a Trump Judge Exposed the Trump Con",
    "link": "https://www.nytimes.com/2025/10/12/opinion/trump-judge-immergut-portland-national-guard.html",
    "summary": "Dishonest presidents should be entitled to no deference at all."
  },
  {
    "title": "Jon Favreau on Where the Democrats Went Right",
    "link": "https://www.nytimes.com/2025/10/11/opinion/ezra-klein-podcast-jon-favreau.html",
    "summary": "Jon Favreau considers how the government shutdown could help Democrats rebuild their fractured party."
  },
  {
    "title": "Rethinking Bruce Springsteen’s Difficult Years",
    "link": "https://www.nytimes.com/2025/10/12/us/bruce-springsteen-film-hostage-tennessee-keaton.html",
    "summary": "A film argues that an American icon may have made his best music in some of his lowest moments."
  },
  {
    "title": "Overnight Violence Between Afghanistan and Pakistan Threatens a Wider Conflict",
    "link": "https://www.nytimes.com/2025/10/12/world/asia/afghanistan-pakistan-violence-conflict.html",
    "summary": "Isolated confrontations have intensified over the past week into the sharpest escalation of violence between the two countries in years."
  },
  {
    "title": "Katie Porter Videos Give California Rivals a New Opening",
    "link": "https://www.nytimes.com/2025/10/11/us/katie-porter-videos-california-governor.html",
    "summary": "Viral videos showing caustic behavior have blunted her momentum in the California governor’s race. Other campaigns are scrambling to take advantage."
  },
  {
    "title": "In L.A., a Former Ally of Mayor Bass Is Expected to Run Against Her",
    "link": "https://www.nytimes.com/2025/10/11/us/mayor-bass-austin-beutner.html",
    "summary": "The former supporter, Austin Beutner, who once led the city’s public schools as superintendent, is expected to challenge Ms. Bass’s re-election bid in next year’s mayoral race."
  }
]