[
  {
    "title": "Trump Administration Says It Has Begun Immigration Crackdown in Chicago",
    "link": "https://www.nytimes.com/2025/09/08/us/chicago-immigration-crackdown-trump-administration.html",
    "summary": "In Chicago, advocates for immigrants said they saw several arrests on Sunday, but were uncertain of the scale of federal action."
  },
  {
    "title": "Deportation Fears Are Fueling Money Transfers to Latin America",
    "link": "https://www.nytimes.com/2025/09/08/world/americas/trump-migrants-remittances.html",
    "summary": "Money transfers to Guatemala, Honduras and other nations have increased in recent months, totaling billions of dollars. Undocumented migrants in the United States say they are sending money to relatives while they can."
  },
  {
    "title": "Trump Administration, Again, Asks Supreme Court to Let It Block Foreign Aid",
    "link": "https://www.nytimes.com/2025/09/08/us/politics/trump-supreme-court-foreign-aid.html",
    "summary": "The court has been largely receptive to the administration’s claims of executive power."
  },
  {
    "title": "French Prime Minister Bayrou Loses Confidence Vote, Putting Pressure on Macron",
    "link": "https://www.nytimes.com/2025/09/08/world/europe/france-vote-government-collapse.html",
    "summary": "Prime Minister François Bayrou failed a confidence vote aimed at breaking an impasse over the budget, adding more pressure on President Emmanuel Macron."
  },
  {
    "title": "How JPMorgan Enabled the Crimes of Jeffrey Epstein",
    "link": "https://www.nytimes.com/2025/09/08/magazine/jeffrey-epstein-jp-morgan.html",
    "summary": "A Times investigation found that America’s leading bank spent years supporting — and profiting from — the notorious sex offender, ignoring red flags, suspicious activity and concerned executives."
  },
  {
    "title": "What We Know About JPMorgan’s Long Relationship With Jeffrey Epstein",
    "link": "https://www.nytimes.com/2025/09/08/magazine/what-we-know-about-jpmorgans-long-relationship-with-jeffrey-epstein.html",
    "summary": "Times reporters combed through thousands of pages of legal and financial records to understand how America’s leading lender enabled the notorious sexual predator."
  },
  {
    "title": "Appeals Court Upholds Carroll’s $83 Million Judgment Against Trump",
    "link": "https://www.nytimes.com/2025/09/08/nyregion/trump-e-jean-carroll-defamation.html",
    "summary": "The judges rejected President Trump’s argument that the Supreme Court’s decision extending presidential immunity should shield him from liability for defaming the writer E. Jean Carroll."
  },
  {
    "title": "States Heading Toward Constitutional Showdown Over Abortion Shield Laws",
    "link": "https://www.nytimes.com/2025/09/08/health/abortion-shield-laws.html",
    "summary": "Texas and New York are at the leading edge of an escalating states’ rights battle over the mailing of abortion pills to patients in states with bans."
  },
  {
    "title": "Juggling Congress and Life, She Opted to Freeze Her Eggs",
    "link": "https://www.nytimes.com/2025/09/08/us/politics/sara-jacobs-egg-freezing-pregnancy-bill.html",
    "summary": "Representative Sara Jacobs, Democrat of California, said her experience planning for a future pregnancy inspired her to write a bill to expand coverage of fertility treatments."
  },
  {
    "title": "Tech Companies Show Off for Trump’s ‘Golden Dome’",
    "link": "https://www.nytimes.com/2025/09/08/technology/space-capsules-ai-lasers-tech-golden-dome.html",
    "summary": "Tech companies are displaying A.I., lasers and more as they compete for a piece of President Trump’s ambitious plan for a missile defense shield."
  },
  {
    "title": "DJI’s Chinese Drones Face U.S. Ban",
    "link": "https://www.nytimes.com/2025/09/08/business/dji-chinese-drones-ban.html",
    "summary": "Farmers, builders and police officers use drones made by DJI, a Chinese company. President Trump and his allies want to stop all imports."
  },
  {
    "title": "Charlie Sheen Is Ready to Tell You Everything",
    "link": "https://www.nytimes.com/2025/09/07/books/charlie-sheen-book-netflix-documentary.html",
    "summary": "In a new memoir and documentary, the actor known for “Two and a Half Men,” “Platoon” and a debauched life that nearly killed him puts it all out there."
  },
  {
    "title": "Gunmen Attack Bus Stop in Jerusalem, Killing at Least 6",
    "link": "https://www.nytimes.com/2025/09/08/world/middleeast/jerusalem-shooting-israel.html",
    "summary": "The Israeli police described the shooting as a terrorist attack and said that the perpetrators had been killed at the scene."
  },
  {
    "title": "Trump Issues Warning to Hamas as Israeli Military Moves on Gaza City",
    "link": "https://www.nytimes.com/2025/09/08/world/middleeast/trump-hamas-warning-israel-gaza-city.html",
    "summary": "The U.S. president gave Hamas what sounded like an ultimatum to either agree to a new truce proposal or face a full-scale Israeli assault on Gaza City."
  },
  {
    "title": "China’s Exports to Africa Are Soaring as Trade to U.S. Plunges",
    "link": "https://www.nytimes.com/2025/09/08/business/china-exports-africa.html",
    "summary": "Already this year, China’s trade surplus with Africa is nearly as big as all of 2024, a sign of how President Trump’s tariffs are reshaping the flow of goods."
  },
  {
    "title": "Ken Griffin Speaks Out Against Trump’s Attacks on the Fed",
    "link": "https://www.nytimes.com/2025/09/08/business/dealbook/griffin-trump-fed.html",
    "summary": "The criticism from the hedge fund billionaire and Trump voter is a rare rebuke of the president by a corporate leader."
  },
  {
    "title": "What Happened to Mexico City’s Food Scene? Americans.",
    "link": "https://www.nytimes.com/2025/09/08/dining/mexico-city-food-restaurants.html",
    "summary": "As restaurants change to reflect new tastes, local reactions have ranged from fascination to fury."
  },
  {
    "title": "Miami Has a Padel ‘Obsession’",
    "link": "https://www.nytimes.com/2025/09/08/us/miami-padel-courts.html",
    "summary": "Residents who love fitness and socializing — and can afford to play — cannot get enough of padel, the racket sport with international cachet."
  },
  {
    "title": "The Clue to Unlocking Parkinson’s May Be All Around Us",
    "link": "https://www.nytimes.com/2025/09/08/opinion/parkinsons-pesticides-chemicals.html",
    "summary": "There is a growing mountain of imperfect but troubling evidence that pesticides and other chemicals may be behind the exploding rates of the disease."
  },
  {
    "title": "We Are Watching a Scientific Superpower Destroy Itself",
    "link": "https://www.nytimes.com/2025/09/08/opinion/universities-science-trump-china.html",
    "summary": "As China threatens to overtake U.S. leadership in science and technology, America has responded by sabotaging its own engines of progress."
  },
  {
    "title": "Jeffrey Epstein’s Bankers",
    "link": "https://www.nytimes.com/2025/09/08/world/jeffrey-epstein-jpmorgan-us-open.html",
    "summary": "Until JPMorgan dropped him as a client in 2013, America’s leading bank financially enabled the century’s most notorious sexual predator."
  },
  {
    "title": "19 Are Killed in Nepal Protests Over Corruption and Social Media Ban",
    "link": "https://www.nytimes.com/2025/09/08/world/asia/nepal-protests-gen-z-social-media.html",
    "summary": "Demonstrators stormed the Parliament complex days after the government banned most social media platforms. Hundreds of people were injured, local news media reported."
  },
  {
    "title": "Whistle-Blower Sues Meta Over Claims of WhatsApp Security Flaws",
    "link": "https://www.nytimes.com/2025/09/08/technology/whatsapp-whistleblower-lawsuit.html",
    "summary": "In a lawsuit filed Monday, the former head of security for the messaging app accused the social media company of putting billions of users at risk. Meta pushed back on his claim."
  },
  {
    "title": "Christoph von Dohnanyi, Conductor With a World of Admirers, Dies at 95",
    "link": "https://www.nytimes.com/2025/09/08/arts/music/christoph-von-dohnanyi-dead.html",
    "summary": "Known for his long tenure at the podium of the acclaimed Cleveland Orchestra, he was sought after as a guest with major symphonies and opera companies."
  },
  {
    "title": "The All-Consuming Question Hanging Over Prince Harry’s U.K. Visit",
    "link": "https://www.nytimes.com/2025/09/08/world/europe/prince-harry-uk-visit.html",
    "summary": "Harry, who has not seen his father, King Charles, for more than a year, arrived in Britain for a four-day visit on Monday."
  }
]