[
  {
    "title": "‘Your Countries Are Going to Hell’: Trump Airs His Grievances at the U.N.",
    "link": "https://www.nytimes.com/2025/09/23/us/politics/trump-un-aid-israel-gaza.html",
    "summary": "In a meandering address, President Trump rebuked global institutions and complained about immigration, environmentalists, windmills and more."
  },
  {
    "title": "Cache of Devices Capable of Crashing Cell Network Is Found Near U.N.",
    "link": "https://www.nytimes.com/2025/09/23/us/politics/secret-service-sim-cards-servers-un.html",
    "summary": "The Secret Service discovered more than 100,000 SIM cards and 300 servers, which could disable cellular towers or be used to conduct surveillance."
  },
  {
    "title": "In Israel, Government Backlash Brews Over Palestinian State Recognition",
    "link": "https://www.nytimes.com/2025/09/23/world/middleeast/palestinian-statehood-response-israel.html",
    "summary": "As more countries moved to formally recognize a Palestinian state, a far-right member of Israel’s government called for “countermeasures” including the annexation of the West Bank."
  },
  {
    "title": "ABC Affiliate Owners Boycott Jimmy Kimmel’s Return to Late Night",
    "link": "https://www.nytimes.com/2025/09/23/business/media/jimmy-kimmel-nexstar-sinclair-boycott.html",
    "summary": "Together, the two TV station groups, Sinclair and Nexstar, control more than 20 percent of ABC’s local affiliates."
  },
  {
    "title": "What Will Jimmy Kimmel Say Tonight?",
    "link": "https://www.nytimes.com/2025/09/23/business/dealbook/jimmy-kimmel-returns-trump.html",
    "summary": "The return of the late-night host’s show raises questions about how the Trump administration, TV affiliate owners and viewers might react."
  },
  {
    "title": "Trump’s Remarks at Kirk Memorial Distill His Politics: ‘I Hate My Opponent’",
    "link": "https://www.nytimes.com/2025/09/22/us/politics/trump-kirk-memorial-hate.html",
    "summary": "President Trump has been fueled by grievance and animosity over the course of his political and public life."
  },
  {
    "title": "Trump Cancels Meeting With Democrats as Government Shutdown Nears",
    "link": "https://www.nytimes.com/2025/09/23/us/politics/trump-shutdown-democrats.html",
    "summary": "Top Democrats are demanding concessions on health care in exchange for their support on a bill to fund the government. Mr. Trump called the demands “unserious.”"
  },
  {
    "title": "Powell Stresses ‘Challenging Situation’ for Fed as Rate Debate Intensifies",
    "link": "https://www.nytimes.com/2025/09/23/business/jerome-powell-federal-reserve-interest-rates.html",
    "summary": "Rising inflation and a weakening labor market have created a bind for the central bank, Jerome H. Powell, its chair, warned on Tuesday."
  },
  {
    "title": "Elon Musk’s Father, Errol Musk, Accused of Child Sexual Abuse",
    "link": "https://www.nytimes.com/2025/09/23/world/africa/elon-musk-father-errol-child-abuse.html",
    "summary": "Errol Musk has been accused of sexually abusing five of his children and stepchildren since 1993, a Times investigation found. Family members have appealed to Elon Musk for help."
  },
  {
    "title": "Sushi Is Bigger Than Ever in America. Here’s Why.",
    "link": "https://www.nytimes.com/2025/09/22/dining/america-sushi.html",
    "summary": "Once considered rarefied and exotic in the United States, sushi has become something entirely different in the last five years: convenience food."
  },
  {
    "title": "People With Autism React to Trump’s Message on Tylenol",
    "link": "https://www.nytimes.com/2025/09/23/us/trump-autism-tylenol.html",
    "summary": "Some welcomed more research and possible new treatments. But the administration’s embrace of unproven science and depiction of autism as a “crisis” has sown deep mistrust."
  },
  {
    "title": "What to Know About Tylenol, Pregnancy and Babies",
    "link": "https://www.nytimes.com/2025/09/22/well/tylenol-autism-pregnancy-babies.html",
    "summary": "President Trump said on Monday that Tylenol use during pregnancy could lead to autism, a claim that is unproven."
  },
  {
    "title": "Hepatitis B Vaccine, Once a Public Health Win, Is Under Threat From RFK Jr.",
    "link": "https://www.nytimes.com/2025/09/16/well/hepatitis-b-vaccine-rfk-jr.html",
    "summary": "Rates of the disease have fallen since 1991, when all newborns began receiving the shot. President Trump recently said he thought children should not get it until age 12."
  },
  {
    "title": "Zackery Nazario Died Subway Surfing. Is Social Media to Blame?",
    "link": "https://www.nytimes.com/2025/09/23/style/subway-surfing-death-nyc-tiktok.html",
    "summary": "Norma Nazario didn’t understand what had motivated her 15-year-old son to subway surf. Then she found his phone."
  },
  {
    "title": "Why African Countries Keep Making Deals to Accept U.S. Deportees",
    "link": "https://www.nytimes.com/2025/09/23/world/africa/african-countries-us-deportees.html",
    "summary": "As the Trump administration exerts pressure on countries to aid in its mass deportation efforts, some nations in Africa have agreed, prompting legal battles."
  },
  {
    "title": "Trump’s $100,000 H-1B Visa Fee Puts Many Tech Start-Ups in a Bind",
    "link": "https://www.nytimes.com/2025/09/23/technology/trump-h1b-visa-tech-start-ups.html",
    "summary": "Silicon Valley start-ups said they were concerned they would be disproportionately hurt by the new visa fee for skilled foreign workers, given their limited resources."
  },
  {
    "title": "To Understand Ukraine at War, Stop by a Gas Station",
    "link": "https://www.nytimes.com/2025/09/23/world/europe/ukraine-gas-stations.html",
    "summary": "Filling stations have become must-stop spots for soldiers traveling to and from the front, helping them win a place in Ukrainians’ hearts."
  },
  {
    "title": "Trump’s Pick to Replace Ousted U.S. Attorney Lacks Prosecutorial Experience",
    "link": "https://www.nytimes.com/2025/09/22/us/politics/lindsey-halligan-trump.html",
    "summary": "Lindsey Halligan worked as a personal lawyer for President Trump and then led the effort to scrutinize the Smithsonian for “improper ideology.”"
  },
  {
    "title": "TikTok Deal Could Make Oracle Founder Larry Ellison a New Kind of Media Mogul",
    "link": "https://www.nytimes.com/2025/09/23/technology/larry-ellison-oracle-tiktok.html",
    "summary": "The database billionaire and his son, David, are Trump favorites. The family could soon control an empire that includes CBS, Paramount, Warner, CNN and a piece of TikTok."
  },
  {
    "title": "Judge in Gilgo Beach Case Spurns Request to Throw Out DNA Evidence",
    "link": "https://www.nytimes.com/2025/09/23/nyregion/gilgo-beach-rex-heuermann-hearing.html",
    "summary": "Lawyers for Rex Heuermann, who is charged with killing seven women, made last-ditch attempts to toss crucial evidence, but prosecutors are preparing for an expected trial next year."
  },
  {
    "title": "4 Autism Experts React to Trump’s Plan",
    "link": "https://www.nytimes.com/2025/09/23/opinion/experts-autism-trump-kennedy.html",
    "summary": "This is not what autistic people need, experts say."
  },
  {
    "title": "The Trump Vengeance Tour Is Coming to a Stadium Near You",
    "link": "https://www.nytimes.com/2025/09/23/opinion/media-trump-ellison-murdoch-kirk.html",
    "summary": "The MAGA movement’s encirclement maneuver is gaining ground."
  },
  {
    "title": "A Fact-Check on Trump’s Claims About Tylenol, Vaccines and Autism",
    "link": "https://www.nytimes.com/2025/09/23/us/trump-tylenol-autism-vaccines-fact-check.html",
    "summary": "How President Trump ignored science about vaccines in his news conference."
  },
  {
    "title": "Jury to Decide Fate of Ryan Routh, Man Accused of Trying to Assassinate Trump",
    "link": "https://www.nytimes.com/2025/09/23/us/trump-ryan-routh-trial-florida.html",
    "summary": "The man accused of lying in wait with a rifle at a Florida golf course in 2024 mounted his own defense in a 12-day trial."
  },
  {
    "title": "N.Y.P.D. Misconduct Complaints Surged Under Adams, Report Says",
    "link": "https://www.nytimes.com/2025/09/23/nyregion/nypd-misconduct-complaints-surge.html",
    "summary": "The number of misconduct reports to a watchdog agency increased 60 percent under Mayor Eric Adams and last year were the highest in a decade, according to a city report."
  },
  {
    "title": "The Rapture Was Predicted to Happen Today. TikTok Has Some Advice.",
    "link": "https://www.nytimes.com/2025/09/23/us/rapture-tiktok-sept-23.html",
    "summary": "There are thousands of videos to help prepare those who may or may not ascend into the heavens on Tuesday."
  },
  {
    "title": "Saudi Grand Mufti, an Archconservative in a Changing Kingdom, Dies",
    "link": "https://www.nytimes.com/2025/09/23/world/middleeast/saudi-arabia-grand-mufti-dies.html",
    "summary": "The death of Abdulaziz Al Asheikh, Saudi Arabia’s most senior cleric, was the symbolic end of an era as the kingdom transforms."
  }
]