[
  {
    "title": "Vaccine Makers Curtail Research and Cut Jobs",
    "link": "https://www.nytimes.com/2026/02/16/health/rfk-vaccine-manufacturers.html",
    "summary": "Federal policies under Robert F. Kennedy Jr. that are hostile to vaccines have “sent a chill through the entire industry,” one scientist said."
  },
  {
    "title": "Should Drug Companies Be Advertising to Consumers?",
    "link": "https://www.nytimes.com/2026/02/16/health/drug-advertisements-consumers.html",
    "summary": "Aging means “becoming a target” of the industry, one expert said. After decades of debate, politicians of all stripes are proposing bans."
  },
  {
    "title": "Tom Pritzker, Hyatt Heir, Steps Down as Executive Chairman Over Links to Epstein",
    "link": "https://www.nytimes.com/2026/02/16/us/politics/tom-pritzker-hyatt-epstein.html",
    "summary": "The member of a prominent and wealthy family, Mr. Pritzker was in regular contact with the financier and sex offender Jeffrey Epstein."
  },
  {
    "title": "Columbia Punishes 2 Who Helped Epstein’s Girlfriend Enter Dental College",
    "link": "https://www.nytimes.com/2026/02/16/nyregion/columbia-epstein-dental-shuliak.html",
    "summary": "The release of documents tied to Jeffrey Epstein has sent ripples through the worlds of business, politics and academia, including at Columbia, where he helped his girlfriend gain entry."
  },
  {
    "title": "Despite Epstein’s Toxicity, Steve Bannon Stood by Him, Texts Indicate",
    "link": "https://www.nytimes.com/2026/02/16/us/politics/jeffrey-epstein-steve-bannon.html",
    "summary": "Mr. Bannon, a MAGA podcaster, developed a seemingly chummy relationship with Jeffrey Epstein, who was accused of sex trafficking. He said it was in the name of getting Mr. Epstein to open up."
  },
  {
    "title": "Robert Duvall, ‘Godfather’ and ‘Apocalypse Now’ Actor, Dies at 95",
    "link": "https://www.nytimes.com/2026/02/16/movies/robert-duvall-dead.html",
    "summary": "An Oscar winner, he was known for disappearing into wide-ranging roles in movies like “Apocalypse Now” and “The Godfather” and in the television series “Lonesome Dove.”"
  },
  {
    "title": "Where to Watch Robert Duvall’s Top Performances",
    "link": "https://www.nytimes.com/2026/02/16/movies/robert-duvall-godfather-apocalypse-now-streaming.html",
    "summary": "He played rugged, capable men drawn from America’s past, present and possible future."
  },
  {
    "title": "Robert Duvall: A Life in Pictures",
    "link": "https://www.nytimes.com/2026/02/16/movies/robert-duvall-photos.html",
    "summary": "The actor, who had a knack for embodying a wealth of varied characters, had a sprawling and celebrated career."
  },
  {
    "title": "‘Tina’ and ‘Milo’ Olympic Mascot Toys Are Almost as Tough to Get as a Medal",
    "link": "https://www.nytimes.com/2026/02/16/world/olympics/tina-milo-winter-olympics-plush-toys.html",
    "summary": "Fans have fallen hard for plush dolls representing Tina and Milo, the mascots of Italy’s Winter Games."
  },
  {
    "title": "In First Month as Governor, Abigail Spanberger Kicks Up Heat From the Right",
    "link": "https://www.nytimes.com/2026/02/16/us/politics/spanberger-virginia-governor.html",
    "summary": "The new governor of Virginia, who ran as a centrist Democrat and a former intelligence officer, says the attacks are a sign of her success."
  },
  {
    "title": "How Much Will Trump’s Approval Rating Matter in the Midterms?",
    "link": "https://www.nytimes.com/2026/02/16/upshot/trumps-approval-midterm-elections.html",
    "summary": "It’s not too early to consider the connection, and readers also have questions about the economy."
  },
  {
    "title": "Senators Meet Zelensky With Hopeful Message on Sanctions",
    "link": "https://www.nytimes.com/2026/02/16/us/politics/congress-zelensky-ukraine-russia.html",
    "summary": "During their visit, a pair of Democratic senators made the case for Congress to impose harsh penalties on Moscow for its continuing offensive."
  },
  {
    "title": "2 Killed in Shooting at High School Hockey Game in Rhode Island",
    "link": "https://www.nytimes.com/2026/02/16/us/hockey-game-shooting-pawtucket-rhode-island.html",
    "summary": "The shooter was also dead, apparently by a self-inflicted gunshot wound, the authorities said. The shooting, which the police described as a “targeted event,” happened at the Dennis M. Lynch Arena in Pawtucket."
  },
  {
    "title": "Progress in Guthrie Case Is Fitful as Search Enters Its Third Week",
    "link": "https://www.nytimes.com/2026/02/16/us/nancy-guthrie-search.html",
    "summary": "Late-night bursts of activity have yielded few visible results as investigators hunt for Nancy Guthrie, the mother of a “Today” show host. The sheriff said Monday that her children and their spouses are not suspects."
  },
  {
    "title": "Kansas Town Supports Mayor Charged With Voting Illegally",
    "link": "https://www.nytimes.com/2026/02/16/us/kansas-mayor-vote-immigration.html",
    "summary": "The Mexican-born mayor of Coldwater was accused of voting illegally as a noncitizen. Many of his neighbors want state and federal officials to back off."
  },
  {
    "title": "After Trip to Germany, AOC Expresses Frustrations",
    "link": "https://www.nytimes.com/2026/02/16/us/politics/aoc-germany-munich-security-conference.html",
    "summary": "The congresswoman argued in an interview that presidential speculation, which included scrutiny of her slip-ups, had overshadowed her anti-authoritarian message at the Munich Security Conference."
  },
  {
    "title": "How the H-1B Visa Debate Is Driving a Wave of Racism Against South Asians",
    "link": "https://www.nytimes.com/2026/02/16/us/politics/h1b-visa-debate-racism-south-asians.html",
    "summary": "A dispute over the impact of H-1B visas on U.S. workers has been overshadowed by racist rhetoric, with troubling echoes of the great replacement conspiracy theory."
  },
  {
    "title": "Teacher Killed in Crash After Man Fled in Car From ICE, Police Say",
    "link": "https://www.nytimes.com/2026/02/16/us/georgia-ice-car-crash-teacher-killed.html",
    "summary": "The man, who federal officials said had entered the United States illegally, was arrested and charged with first-degree homicide after the crash in Savannah, Ga., according to the county police."
  },
  {
    "title": "How Spain Is Carving a Different Path on Immigration",
    "link": "https://www.nytimes.com/2026/02/16/world/europe/spain-amnesty-immigration.html",
    "summary": "The country is hoping its new amnesty for undocumented immigrants will avoid a public backlash."
  },
  {
    "title": "Frederick Wiseman, 96, Penetrating Documentarian of Institutions, Dies",
    "link": "https://www.nytimes.com/2026/02/16/movies/frederick-wiseman-dead.html",
    "summary": "He exposed abuses in films like “Titicut Follies,” a once-banned portrait of a mental hospital, but ranged widely in subject matter, from a Queens neighborhood to a French restaurant."
  },
  {
    "title": "Dinner Is Being Recorded, Whether You Know It or Not",
    "link": "https://www.nytimes.com/2026/02/16/dining/meta-ray-ban-glasses-restaurants.html",
    "summary": "As Meta smart glasses capture scenes in restaurants for social media, service workers and customers are becoming captive participants."
  },
  {
    "title": "What Does Body Positivity Mean in This New Weight Loss Era?",
    "link": "https://www.nytimes.com/2026/02/16/opinion/body-positivity-social-media-weight-loss.html",
    "summary": "Can you love your body and still want to lose weight?"
  },
  {
    "title": "An Alternative to the Supreme Court’s Originalism",
    "link": "https://www.nytimes.com/2026/02/16/opinion/alternative-federalist-society.html",
    "summary": "Outside of law school classrooms, the liberal constitutional agenda is failing. Enter the American Constitution Society."
  },
  {
    "title": "Anderson Cooper Is Leaving ’60 Minutes’",
    "link": "https://www.nytimes.com/2026/02/16/business/media/anderson-cooper-60-minutes.html",
    "summary": "Mr. Cooper said in a statement that he was leaving as a correspondent for the show to focus on his CNN program and spend more time with his children."
  },
  {
    "title": "Manhattan’s Only Wild Turkey Has Her Own Entourage",
    "link": "https://www.nytimes.com/2026/02/15/nyregion/astoria-wild-turkey-caretakers-nyc.html",
    "summary": "Astoria, first spotted in Queens last spring, is now a resident of Lower Manhattan, where three devoted women watch over her."
  },
  {
    "title": "Dana Eden, Co-Creator of ‘Tehran,’ Dies During Filming of Fourth Season",
    "link": "https://www.nytimes.com/2026/02/16/world/europe/dana-eden-tehran-dead.html",
    "summary": "Ms. Eden, 52, who was also an executive producer of the Emmy-winning show, was found in a hotel room in Athens. Greek police said they did not suspect foul play."
  },
  {
    "title": "Winter Storms Could Bring 8 Feet of Snow to Parts of California",
    "link": "https://www.nytimes.com/2026/02/15/weather/sierra-nevada-storm-snow-california.html",
    "summary": "The greatest impact is expected across Northern California, where a pair of powerful storms began on Sunday night and were forecast to last into the week."
  }
]