[
  {
    "title": "Senate Passes Bill to Reopen Government Amid Democratic Rift",
    "link": "https://www.nytimes.com/2025/11/10/us/politics/senate-government-shutdown.html",
    "summary": "The vote, on Day 41 of the shutdown, signaled an end in sight to weeks of gridlock. Eight members of the Democratic Caucus supplied the critical backing."
  },
  {
    "title": "Shutdown Deal Revives Democratic Infighting",
    "link": "https://www.nytimes.com/2025/11/10/us/politics/shutdown-deal-revives-democratic-infighting.html",
    "summary": "The agreement prompted a backlash within the party, not only against the Democratic defectors who supported it, but against Senator Chuck Schumer, the leader who did not."
  },
  {
    "title": "For Trump, Nothing Was Off Limits During the Shutdown",
    "link": "https://www.nytimes.com/2025/11/10/us/politics/trump-government-shutdown.html",
    "summary": "President Trump pressured Democrats by taking punishing actions no previous administration ever took during a shutdown."
  },
  {
    "title": "As Iraqis Vote for a Parliament, U.S. Presses to Rid Country of Iran’s Influence",
    "link": "https://www.nytimes.com/2025/11/11/world/middleeast/iraq-parliamentary-election-vote.html",
    "summary": "After a U.S. occupation, years of sectarian violence and a jihadist insurgency, Iraq has become an improbable haven of calm in the Middle East."
  },
  {
    "title": "Iraqis Are Voting for a New Parliament. Here’s What to Know.",
    "link": "https://www.nytimes.com/2025/11/11/world/middleeast/iraq-election-what-to-know.html",
    "summary": "Iraq is caught in the conflict between Washington and Tehran, with the Trump administration insisting that the next government disarm powerful Iran-backed militias."
  },
  {
    "title": "Syria’s President Meets Trump at White House for First Time",
    "link": "https://www.nytimes.com/2025/11/10/world/middleeast/syria-president-al-shara-trump-washington.html",
    "summary": "The visit by President Ahmed al-Shara is another step in the transformation of the former rebel leader once wanted by the United States as a terrorist."
  },
  {
    "title": "How Syria’s President Transformed His Image",
    "link": "https://www.nytimes.com/video/world/middleeast/100000010515338/how-syrias-president-transformed-his-image.html",
    "summary": "Syrian President Ahmed al-Shara’s meeting with President Trump in Washington signifies a new turn for al-Shara, a former Islamist rebel leader who was once designated by the United States as a terrorist with a $10 million bounty on his head. Our reporter Christina Goldbaum describes the meeting."
  },
  {
    "title": "Trump Pardons the Husband of a Republican Congressional Ally",
    "link": "https://www.nytimes.com/2025/11/10/us/politics/trump-pardon-republican-harshbarger.html",
    "summary": "Robert Harshbarger Jr. pleaded guilty in 2013 to health care fraud and distributing a misbranded drug. His wife, Diana Harshbarger, is a member of Congress."
  },
  {
    "title": "Dismantled by DOGE, a Foreign Policy Center Finds New Life",
    "link": "https://www.nytimes.com/2025/11/10/us/politics/kennan-institute-doge-trump.html",
    "summary": "The Kennan Institute, which researches Russia and the surrounding region, has re-emerged in a form that is smaller but more impervious to government control."
  },
  {
    "title": "Marriage Ruling Relieves Gay Americans and Leaves Conservatives Pledging New Challenges",
    "link": "https://www.nytimes.com/2025/11/10/us/supreme-court-same-sex-marriage-reactions.html",
    "summary": "The Supreme Court chose not to revisit a case involving same-sex marriage. The number of married same-sex couples has doubled in the last 10 years."
  },
  {
    "title": "Trump Asks Supreme Court to Overturn Verdict in E. Jean Carroll Case",
    "link": "https://www.nytimes.com/2025/11/10/us/politics/trump-supreme-court-e-jean-carroll.html",
    "summary": "The president said the assertions behind a judgment that he sexually abused and defamed the writer were “implausible” and “unsubstantiated.”"
  },
  {
    "title": "2025 Booker Prize Goes to David Szalay’s ‘Flesh’",
    "link": "https://www.nytimes.com/2025/11/10/books/booker-prize-2025-david-szalay-flesh.html",
    "summary": "The rags-to-riches tale had already made fans of Zadie Smith and Dua Lipa. Roddy Doyle, who chaired the judging panel, called the book “singular” and “extraordinary.”"
  },
  {
    "title": "Why the BBC Is Facing Its Gravest Crisis in Decades",
    "link": "https://www.nytimes.com/2025/11/10/world/europe/bbc-news-trump.html",
    "summary": "The British public service broadcaster apologized on Monday for a misleadingly edited documentary about President Trump. But the scandal had already claimed two of its top executives."
  },
  {
    "title": "F.D.A. Will Remove Black Box Warnings From Hormone Treatments for Menopause",
    "link": "https://www.nytimes.com/2025/11/10/health/fda-hormone-replacement-menopause.html",
    "summary": "The benefits of hormone replacement have been underappreciated, Dr. Marty Makary, the agency’s commissioner, said on Monday. Critics described evidence for the change as insufficient."
  },
  {
    "title": "Book Review: ‘Unfettered,’ by John Fetterman",
    "link": "https://www.nytimes.com/2025/11/11/books/review/unfettered-john-fetterman.html",
    "summary": "The senator from Pennsylvania chronicles his stroke, unlikely election victory and battle with depression. Just don’t expect him to try to win you over."
  },
  {
    "title": "Chi Ossé Plans to Challenge Jeffries, Despite Mamdani’s Opposition",
    "link": "https://www.nytimes.com/2025/11/10/nyregion/chi-osse-hakeem-jeffries.html",
    "summary": "Chi Ossé, a New York City councilman, has told allies he is preparing to challenge Representative Hakeem Jeffries, the Democratic leader of the House."
  },
  {
    "title": "How Did Mamdani Reach Young Male Voters? Podcasts and YouTube Shows.",
    "link": "https://www.nytimes.com/2025/11/10/style/zohran-mamdani-podcasts-manosphere.html",
    "summary": "Zohran Mamdani navigated a media landscape similar to the one that helped Trump win over young men."
  },
  {
    "title": "Families of Children Killed in Texas Floods Sue Camp Mystic, Claiming Gross Negligence",
    "link": "https://www.nytimes.com/2025/11/10/us/camp-mystic-lawsuit.html",
    "summary": "Parents of campers and counselors who died in the July 4 Texas floods said the camp leadership did little before mounting “a hopeless ‘rescue’ effort from its self-created disaster.”"
  },
  {
    "title": "The 20-Somethings Who Raised $121 Million to Build Military Drones",
    "link": "https://www.nytimes.com/2025/11/10/business/neros-military-drones.html",
    "summary": "Neros, a company founded in 2023 by former teenage drone racers, won a coveted Army contract and is gaining popularity in the defense sector."
  },
  {
    "title": "Alex Karp Went From Biden Donor to Trump Enabler. Why?",
    "link": "https://www.nytimes.com/2025/11/10/opinion/alex-karp-palantir-trump.html",
    "summary": "A tech billionaire professes to hate identity politics, but they seem in some ways to consume him."
  },
  {
    "title": "On Veterans Day, This Is the Lonely, Terrible Sorrow We Must Never Forget",
    "link": "https://www.nytimes.com/2025/11/11/opinion/veterans-day-world-war-ii.html",
    "summary": "To imagine the cost of an “America First” policy, walk through World War II cemeteries in Europe."
  },
  {
    "title": "How China Reached Into New York to Stop a Tiny Film Festival",
    "link": "https://www.nytimes.com/2025/11/11/world/asia/china-film-festival-new-york.html",
    "summary": "A showcase for independent Chinese films was scrapped after the Chinese authorities pressured directors, moderators and even a volunteer to pull out."
  },
  {
    "title": "Mobile Lounge Crashes at Dulles Airport, Causing Injuries and Damage",
    "link": "https://www.nytimes.com/2025/11/10/us/dulles-airport-crash-mobile-lounge.html",
    "summary": "More than a dozen people were hospitalized after a bus-like vehicle for passengers crashed into a dock at the Washington airport."
  },
  {
    "title": "Sean ‘Diddy’ Combs Could Trim Prison Sentence With Drug Rehab Program",
    "link": "https://www.nytimes.com/2025/11/10/arts/music/sean-combs-diddy-fort-dix-drug-program.html",
    "summary": "A spokesman for the fallen music mogul, who is serving a four-year sentence for prostitution-related offenses at the Fort Dix prison complex in New Jersey, said he has been accepted to the program."
  }
]