[
  {
    "title": "Like Trump, U.S. Embassies Are Raising Cash for Lavish July Fourth Parties",
    "link": "https://www.nytimes.com/2026/02/15/business/trump-july-fourth-singapore-japan.html",
    "summary": "Some of Washington’s diplomatic outposts in Asia are raising millions for events to mark the 250th independence anniversary. One ambassador offered to sing and dance."
  },
  {
    "title": "Trump’s Relentless Self-Promotion Fosters an American Cult of Personality",
    "link": "https://www.nytimes.com/2026/02/15/us/politics/trumps-american-cult-of-personality.html",
    "summary": "President Trump has engaged in a spree of self-aggrandizement unlike any of his predecessors, fostering a mythologized superhuman persona and making himself the inescapable force at home and around the world."
  },
  {
    "title": "Canada Gives U.S. Arms Makers the Cold Shoulder on Military Spending",
    "link": "https://www.nytimes.com/2026/02/15/world/canada/canada-military-spending.html",
    "summary": "Canada plans to unveil a new strategy that will shift its current reliance on American companies to Canadian military suppliers."
  },
  {
    "title": "Trump Administration Ends Credit for Start-Stop Feature in Cars",
    "link": "https://www.nytimes.com/2026/02/15/business/energy-environment/epa-tax-credits-stop-start-ignition-cars.html",
    "summary": "Manufacturers will no longer get a credit toward vehicle emissions standards by installing engines that automatically stop at red lights."
  },
  {
    "title": "Three American Speeches at Munich, and Plenty of Confusion",
    "link": "https://www.nytimes.com/2026/02/15/world/europe/three-american-speeches-at-munich-and-plenty-of-confusion.html",
    "summary": "As the U.S. message veered from shared heritage and values to shared interests and back again, Europeans wondered what kind of alliance they were left with."
  },
  {
    "title": "In Munich, Lawmakers Concede Scars Remain After Trump’s Greenland Threat",
    "link": "https://www.nytimes.com/2026/02/15/us/politics/munich-democrats-cortez-greenland-trump.html",
    "summary": "Congress members said that President Trump’s coveting of Greenland had left a mark, even as they expressed hope for a less bellicose approach to foreign relations."
  },
  {
    "title": "Trump’s Stinging Attack on Israel’s President Touches a Nerve",
    "link": "https://www.nytimes.com/2026/02/15/world/middleeast/trump-israel-herzog-attacks.html",
    "summary": "President Trump called President Isaac Herzog of Israel “disgraceful” because he has not yet pardoned Prime Minister Benjamin Netanyahu in his corruption trial."
  },
  {
    "title": "Warner Bros. Is Said to Consider Reopening Talks With Paramount",
    "link": "https://www.nytimes.com/2026/02/15/business/netflix-warner-bros-discovery-paramount.html",
    "summary": "Warner Bros. Discovery had agreed to sell itself to Netflix, but its contract allows it to pursue offers that may lead to a superior deal."
  },
  {
    "title": "In Xi Jinping’s Purge of the Military, a Search for Absolute Loyalty",
    "link": "https://www.nytimes.com/2026/02/16/world/asia/xi-military-zhang-youxia-mao.html",
    "summary": "By reaching back to Maoist tactics of “rectification,” the Chinese leader is signaling that control over the gun requires a state of perpetual cleansing."
  },
  {
    "title": "Cortina’s 70-Year-Old Curling Stadium Is a Star at the Winter Olympics",
    "link": "https://www.nytimes.com/2026/02/16/world/europe/cortina-curling-stadium-winter-olympics.html",
    "summary": "It hosted Olympic hockey in 1956 and James Bond a quarter-century later. Cortina’s beloved Olympic Stadium is now bursting with excitement for curling."
  },
  {
    "title": "Republican State Legislators Rush to Limit Their Own Regulators",
    "link": "https://www.nytimes.com/2026/02/15/us/politics/states-deregulation.html",
    "summary": "South Carolina’s state legislature is one of 17, mainly in heavily Republican states, that is moving to handcuff state agencies at a moment of tectonic changes in energy, technology and finance."
  },
  {
    "title": "What to Know About the Homeland Security Shutdown",
    "link": "https://www.nytimes.com/2026/02/15/us/politics/homeland-security-shutdown.html",
    "summary": "Funding for the Department of Homeland Security lapsed on Saturday amid a standoff over restrictions that Democrats have demanded for federal immigration agents. But much of its work continues."
  },
  {
    "title": "Winter Storms Could Bring 8 Feet of Snow to Parts of California",
    "link": "https://www.nytimes.com/2026/02/15/weather/sierra-nevada-storm-snow-california.html",
    "summary": "The greatest impact is expected across Northern California, where a pair of powerful storms are expected to begin on Sunday night and last into the week."
  },
  {
    "title": "Light Snowfall Coming to New York, New Jersey and Long Island",
    "link": "https://www.nytimes.com/2026/02/15/nyregion/snow-metro-new-york.html",
    "summary": "Forecasters said snowfall totals of one to two inches were likely Sunday night, with isolated amounts of up to three inches across New York City, northeastern New Jersey and much of Long Island."
  },
  {
    "title": "Diplomatic Feud With China Weighs on Japan’s Economy",
    "link": "https://www.nytimes.com/2026/02/15/business/japan-economy-china-tourism.html",
    "summary": "A standoff over the security of Taiwan has led to a steep decline in the number of Chinese visitors to Japan, which is heavily dependent on the tourists."
  },
  {
    "title": "How A.I. Salaries Are Causing Couples to Rethink Money in Relationships",
    "link": "https://www.nytimes.com/2026/02/14/business/artificial-intelligence-relationships-income-gap.html",
    "summary": "The artificial intelligence frenzy is creating personal fortunes rarely seen in modern technology and changing people’s attitudes about fairness and money in relationships."
  },
  {
    "title": "Tax Missteps Happen — Even When Two Financial Pros are Married",
    "link": "https://www.nytimes.com/2026/02/14/your-money/taxes/couples-taxes-mistakes.html",
    "summary": "You’d think a financial planner married to another financial planner would have it easy come tax time. Alas, no."
  },
  {
    "title": "On the Las Vegas Strip, Local Acts at Delilah and Elsewhere Set the Vibe",
    "link": "https://www.nytimes.com/2026/02/15/travel/las-vegas-strip-singers-lounges.html",
    "summary": "On the Strip and beyond, clubs, bars and restaurants spotlight local performers who deliver some of the city’s best entertainment."
  },
  {
    "title": "2025 Film Independent Spirit Awards: Complete Winners List",
    "link": "https://www.nytimes.com/2026/02/15/style/2025-film-independent-spirit-awards-complete-winners-list.html",
    "summary": "Here’s who went home with an Indie Spirit Award on Sunday."
  },
  {
    "title": "See the Looks From the 2026 Film Independent Spirit Awards",
    "link": "https://www.nytimes.com/2026/02/15/style/see-the-looks-from-the-2026-film-independent-spirit-awards.html",
    "summary": "The awards show, which celebrates independent film and television, moved back to the Hollywood Palladium for this year’s awards show."
  },
  {
    "title": "Ro Khanna Is Shaken by What He’s Learned From the Epstein Files",
    "link": "https://www.nytimes.com/2026/02/15/opinion/jeffrey-epstein-ro-khanna.html",
    "summary": "Epstein’s network may not have known everything, but it is hard to deny that many of them knew enough to know better."
  },
  {
    "title": "We’re All in a Throuple With A.I.",
    "link": "https://www.nytimes.com/2026/02/13/opinion/ai-relationships.html",
    "summary": "What happens when the people building a new technology don’t want to use it?"
  },
  {
    "title": "Bans on Many CBD Products Loom This Year",
    "link": "https://www.nytimes.com/2026/02/12/health/bans-on-many-cbd-products-loom-this-year.html",
    "summary": "A federal law taking effect in November severely limits the amount of THC, the euphoric cannabis compound, allowed in over-the-counter items. Many groups are fighting back."
  },
  {
    "title": "‘Wuthering Heights’ Gallops Toward $82 Million in Global Ticket Sales",
    "link": "https://www.nytimes.com/2026/02/15/business/wuthering-heights-box-office.html",
    "summary": "Warner Bros. spent an estimated $80 million on the R-rated romance, directed by Emerald Fennell, not including hefty marketing costs."
  },
  {
    "title": "In First Public Comments Since Trump’s Racist Video, Obama Laments Lost Decorum",
    "link": "https://www.nytimes.com/2026/02/15/us/politics/obama-trump-video.html",
    "summary": "In a podcast interview, former President Barack Obama did not directly address the video posted by Mr. Trump but denounced a “clown show” on social media."
  }
]