[
  {
    "title": "DOJ Releases Another Batch of Epstein Files: Key Takeaways",
    "link": "https://www.nytimes.com/2025/12/23/us/politics/epstein-files-trump-takeaways.html",
    "summary": "The new documents — nearly 30,000 in all — contain hundreds of references to President Trump and include different versions of Jeffrey Epstein’s will."
  },
  {
    "title": "Redacted Material in Some Epstein Files Is Easily Recovered",
    "link": "https://www.nytimes.com/2025/12/23/us/politics/epstein-files-redactions-doj.html",
    "summary": "The ease of recovering information that was not properly redacted digitally suggests that at least some of the documents released by the Justice Department were hastily censored."
  },
  {
    "title": "In Private Letters, Harvard and Trump Administration Escalate Duel",
    "link": "https://www.nytimes.com/2025/12/24/us/trump-harvard-letters-deal.html",
    "summary": "It is the latest twist in the marquee battle of the administration’s campaign to rein in colleges and universities it views as too liberal."
  },
  {
    "title": "How a Scholar Nudged the Supreme Court Toward Its Troop Deployment Ruling",
    "link": "https://www.nytimes.com/2025/12/24/us/politics/georgetown-scholar-supreme-court.html",
    "summary": "Accepting an argument from a law professor that no party to the case had made, the Supreme Court handed the Trump administration a stinging loss that could lead to more aggressive tactics."
  },
  {
    "title": "Trump Tosses Lifelines to the Struggling Coal Industry",
    "link": "https://www.nytimes.com/2025/12/24/climate/coal-plant-closures-indiana.html",
    "summary": "The Energy Department ordered two coal-burning power plants to remain open, and the Environmental Protection Agency gave utilities more time to tackle toxic coal ash."
  },
  {
    "title": "Honduras Declares Nasry Asfura, Trump Ally, Winner of Presidential Election",
    "link": "https://www.nytimes.com/2025/12/24/world/americas/honduras-election-results-asfura.html",
    "summary": "Nasry Asfura was endorsed by President Trump in a contentious election. His opponent, Salvador Nasralla, said he would not accept the results."
  },
  {
    "title": "Zelensky Open to Pulling Back Troops in Eastern Ukraine to Reach Peace Deal With Russia",
    "link": "https://www.nytimes.com/2025/12/24/world/europe/zelensky-demilitarized-zone-offer.html",
    "summary": "The offer was the closest Mr. Zelensky has come to addressing the thorny territorial disputes in Donetsk that have repeatedly derailed peace talks."
  },
  {
    "title": "‘Jingle All the Way,’ and the Super Bad Dad Superhero",
    "link": "https://www.nytimes.com/2025/12/23/movies/jingle-all-the-way-christmas-movie.html",
    "summary": "Arnold Schwarzenegger, Sinbad, Phil Hartman and Rita Wilson served a platter of high-octane holiday high jinks in this unhinged 1996 comedy."
  },
  {
    "title": "Intense Storm in Southern California Brings Heavy Rain and Forces Evacuations",
    "link": "https://www.nytimes.com/2025/12/24/weather/rain-flooding-los-angeles-storm.html",
    "summary": "The authorities said some residents had resisted leaving their homes on the holidays, but forecasters warned the storm could be deadly, especially where burn scars from this year’s fires remain."
  },
  {
    "title": "Immigrant Nurse Is Among 2 Dead in Pennsylvania Nursing Home Explosions",
    "link": "https://www.nytimes.com/2025/12/24/us/politics/nursing-home-blast.html",
    "summary": "Muthoni Nduthu was one of two killed by explosions at an eastern Pennsylvania facility that was plagued by poor ratings, citations and fines from the federal government."
  },
  {
    "title": "Weight-Loss Drugs Ended Their Sex Life. Could It Bounce Back?",
    "link": "https://www.nytimes.com/2025/12/24/well/weight-loss-drugs-ended-their-sex-life-could-it-bounce-back.html",
    "summary": "She expected her body to change when she started taking Zepbound. But nobody told her what might happen to her marriage."
  },
  {
    "title": "Weight Loss Drugs and Their Lesser Known Side Effects on Relationships",
    "link": "https://www.nytimes.com/2025/02/02/magazine/weight-loss-side-effects-sex-ozempic.html",
    "summary": "Doctors warn about their physical side effects, but they can also have unexpected effects on intimacy."
  },
  {
    "title": "Mail Carriers Keep Making the Rounds, Despite a Murky Future",
    "link": "https://www.nytimes.com/2025/12/24/style/mail-carriers-keep-making-the-rounds-despite-a-murky-future.html",
    "summary": "As the much-derided agency loses billions, postal workers quietly, and sometimes heroically, serve their communities."
  },
  {
    "title": "Did We Underestimate Kate Hudson?",
    "link": "https://www.nytimes.com/2025/12/24/movies/kate-hudson-song-sung-blue.html",
    "summary": "For years she was pigeonholed as a rom-com star. Her turn as a blue-collar mom with a love of Neil Diamond just might vault her back to the Oscars."
  },
  {
    "title": "A Father and Son’s $108 Billion Hostile Bid for Warner Bros. Discovery",
    "link": "https://www.nytimes.com/2025/12/24/business/media/larry-david-ellison-warner-bros-discovery-cbs.html",
    "summary": "Larry and David Ellison didn’t always have a close relationship. Now they’re one of the most intriguing partnerships in business."
  },
  {
    "title": "After a Plane Crashed in the Texas Fog, 2 Stories of Rescue",
    "link": "https://www.nytimes.com/2025/12/24/us/galveston-plane-crash-rescue-mexico-navy.html",
    "summary": "A plane from Mexico was on a medical mission on Monday when it crashed into Galveston Bay, and two men on the water that day helped save two lives."
  },
  {
    "title": "Long Carrier Deployment Projects Strength in U.S. Pressure Campaign on Venezuela, and Carries Costs",
    "link": "https://www.nytimes.com/2025/12/24/us/politics/aircraft-carrier-deployment-caribbean-costs.html",
    "summary": "The U.S.S. Ford has been deployed for six months, now in the Caribbean as part of President Trump’s pressure campaign on Venezuela. Maintenance woes and strains on sailors will likely mount."
  },
  {
    "title": "Trump’s Seizures of Oil Tankers Challenge Maritime Rules and Customs",
    "link": "https://www.nytimes.com/2025/12/24/business/trump-venezuela-oil-tankers.html",
    "summary": "Recent U.S. actions against ships near Venezuela may embolden other countries to seize or detain ships, legal experts said."
  },
  {
    "title": "How Service Dogs Help Treat Veterans’ PTSD",
    "link": "https://www.nytimes.com/2025/12/24/well/ptsd-service-dogs.html",
    "summary": "There’s research suggesting that these four-legged “battle buddies” can reduce symptoms of depression and anxiety. But shortages and long wait times pose barriers."
  },
  {
    "title": "The Strange Death of Make America Great Again",
    "link": "https://www.nytimes.com/2025/12/24/opinion/turning-points-americafest-maga.html",
    "summary": "Trump has begun to recede from the movement he created."
  },
  {
    "title": "The Epstein File Drop Is Not About Justice",
    "link": "https://www.nytimes.com/2025/12/24/opinion/epstein-file-release-truth.html",
    "summary": "The fight was supposed to be about releasing them. But the way it’s being done seems designed to obscure the truth."
  },
  {
    "title": "The Truce Is 2 Months Old. So Why Have Hundreds of Gazans Been Killed?",
    "link": "https://www.nytimes.com/2025/12/24/world/middleeast/gaza-killings-israel-cease-fire.html",
    "summary": "Since the cease-fire took effect, Israel says it has targeted only militants. But death can come for Gazans while on a family outing or sleeping in a tent."
  },
  {
    "title": "Phyllis Lee Levin, Times Fashion Reporter and Biographer, Dies at 104",
    "link": "https://www.nytimes.com/2025/12/24/books/phyllis-lee-levin-dead.html",
    "summary": "Her 1960 essay about the frustrations of educated women prefigured Betty Friedan’s “The Feminine Mystique.” She later wrote books on John Quincy Adams and others."
  },
  {
    "title": "Crypto for Christmas? Gen Z-ers Are Cautiously Open to the Idea.",
    "link": "https://www.nytimes.com/2025/12/24/business/gen-z-crypto.html",
    "summary": "Despite recent volatility in the crypto market, younger generations are still open to receiving digital currencies as gifts."
  }
]