[
  {
    "title": "Trump Says He Will Raise Global Tariff to 15 Percent",
    "link": "https://www.nytimes.com/2026/02/21/business/trump-tariffs.html",
    "summary": "The move signaled that the president would press ahead with steep global tariffs despite the legal setback from the Supreme Court."
  },
  {
    "title": "Divide Among Supreme Court’s Conservatives Could Test Trump’s Agenda",
    "link": "https://www.nytimes.com/2026/02/21/us/politics/supreme-court-tariffs-conservatives.html",
    "summary": "In rejecting President Trump’s tariffs, the court’s six conservative justices displayed subtle differences in their views of executive power."
  },
  {
    "title": "Trump Doubles Down on Closing Tax Loophole on Cheap Imports",
    "link": "https://www.nytimes.com/2026/02/21/business/trump-deminimis-loophole-closed.html",
    "summary": "The exemption was shut down last year by President Trump based, in part, on the same legal grounds as the tariffs that were invalidated by the Supreme Court."
  },
  {
    "title": "In Gorsuch’s Homage to Legislative Power, a Subtle Reproach of a Neutered Congress",
    "link": "https://www.nytimes.com/2026/02/21/us/politics/gorsuch-congress-trump-tariffs.html",
    "summary": "In his concurrence to the ruling invalidating President Trump’s tariffs, Justice Neil M. Gorsuch made a forceful case for the sanctity of the legislative process — and an implicit critique of its current dysfunction."
  },
  {
    "title": "Bench Presses, Pull Ups … Kid Rock? The White House Had a Very Manly Week.",
    "link": "https://www.nytimes.com/2026/02/20/us/politics/trump-hegseth-rfk-manliness.html",
    "summary": "President Trump’s top cabinet officials are pumping iron in public."
  },
  {
    "title": "Bridge Owner Donated $1 Million to MAGA Group Before Trump Blasted Competitor",
    "link": "https://www.nytimes.com/2026/02/20/us/politics/trump-canada-bridge-maga-inc-donation.html",
    "summary": "The PAC and the White House say the donation had nothing to do with President Trump’s tirade against a new bridge connecting Detroit and Windsor, Ontario."
  },
  {
    "title": "Longtime Virginia Lawyer Chosen by Judges as U.S. Attorney, and Then Fired",
    "link": "https://www.nytimes.com/2026/02/20/us/politics/us-attorney-eastern-district-of-virginia.html",
    "summary": "It was the second time this month that the administration had gotten rid of a top federal prosecutor appointed to his post by federal judges."
  },
  {
    "title": "Judge Rebukes U.S. Over Application to Search Washington Post Reporter’s Home",
    "link": "https://www.nytimes.com/2026/02/20/us/politics/washington-post-reporter-home-search.html",
    "summary": "A prosecutor apologized for failing to alert the magistrate to a 1980 law that restricts searches for reporting materials."
  },
  {
    "title": "Why Attacking Iran Could Be Riskier Than Capturing Maduro",
    "link": "https://www.nytimes.com/2026/02/21/world/middleeast/iran-military-operation-venezuela.html",
    "summary": "Iran’s extensive military abilities and network of regional proxies could draw the United States into a prolonged conflict."
  },
  {
    "title": "U.S. Planes Land at Jordan Base, a Key Hub for Planning Possible Iran Strikes",
    "link": "https://www.nytimes.com/2026/02/20/us/politics/us-military-jordan-iran.html",
    "summary": "At least 60 attack aircraft are parked at the base, which has become a key hub for U.S. military planning for possible strikes on Iran."
  },
  {
    "title": "How Johannes Klaebo’s 6 Gold Medals Ranks Among the All-Time Olympic Performances",
    "link": "https://www.nytimes.com/2026/02/21/world/olympics/best-olympic-performances.html",
    "summary": "The Norwegian cross-country skier completed the biggest medal haul ever by an athlete at a Winter Games, and one of the biggest at any single Olympics."
  },
  {
    "title": "Los Angeles Olympics Have a Cloud of Concerns as Winter Games Close",
    "link": "https://www.nytimes.com/2026/02/21/us/la-olympics-casey-wasserman-epstein.html",
    "summary": "New details about the LA28 chairman’s ties to Jeffrey Epstein, as well as anxiety over key infrastructure projects, have thrown the planning into disarray."
  },
  {
    "title": "He Researched Dishonesty. He Got Friendly With Jeffrey Epstein.",
    "link": "https://www.nytimes.com/2026/02/21/business/jeffrey-epstein-dan-ariely-dishonesty.html",
    "summary": "Dan Ariely, a behavioral scientist at Duke, sought out the convicted sex offender for his research. Their yearslong correspondence suggests it wasn’t all business."
  },
  {
    "title": "Shocker! SCOTUS Schools POTUS",
    "link": "https://www.nytimes.com/2026/02/21/opinion/scotus-trump-tariffs-epstein.html",
    "summary": "The high court asserts itself as tariff sheriff."
  },
  {
    "title": "Epstein Was Only One of Thousands of Traffickers in the U.S.",
    "link": "https://www.nytimes.com/2026/02/21/opinion/epstein-sex-trafficking.html",
    "summary": "Every year, more than 100,000 children may be sold for sex in the United States. Are we willing to do something about that?"
  },
  {
    "title": "Future Perfect",
    "link": "https://www.nytimes.com/2026/02/21/briefing/future-perfect.html",
    "summary": "Does taking care of our future selves have to mean sacrifice in the present?"
  },
  {
    "title": "Blizzard Warnings Issued for Swath of East Coast, Including NYC",
    "link": "https://www.nytimes.com/2026/02/21/us/blizzard-warnings-northeast-new-york.html",
    "summary": "The blizzard warnings are the first since 2017 for New York City, which is expected to get up to 18 inches of snow, or more."
  },
  {
    "title": "Problem With Artemis Rocket Is Likely to Delay NASA’s Moon Mission",
    "link": "https://www.nytimes.com/2026/02/21/science/nasa-artemis-helium-flaw.html",
    "summary": "An interruption in the flow of helium to the upper stage may require that the rocket be removed from the launchpad for repairs."
  },
  {
    "title": "Bill Mazeroski, 89, Whose 9th-Inning Blast Made Pirates Champs, Is Dead",
    "link": "https://www.nytimes.com/2026/02/21/sports/baseball/bill-mazeroski-dead.html",
    "summary": "It was Game 7 of the 1960 World Series, when an infielder known for his glove, not his bat, crushed the powerful Yankees with one swing, bringing joy to Pittsburgh."
  },
  {
    "title": "How $600 Drones Are Outsmarting Colombia’s Billion-Dollar Military",
    "link": "https://www.nytimes.com/2026/02/21/world/americas/colombia-combat-drones-military.html",
    "summary": "Security officials say easy access by guerrilla groups to commercial drones, cheaply modified into deadly weapons, has put the nation’s army on its heels."
  }
]