[
  {
    "title": "Social Security Workers Struggle to Meet Demand After DOGE Cuts",
    "link": "https://www.nytimes.com/2025/09/24/business/social-security-customer-service.html",
    "summary": "After this year’s staffing cuts, some people wait for hours, others sail through. But overburdened field office workers carry the weight."
  },
  {
    "title": "What to Know About the ICE Shooting, and a Rare Climate Pledge from China",
    "link": "https://www.nytimes.com/2025/09/25/podcasts/the-headlines/ice-shooting-climate-china.html",
    "summary": "Plus, how big was Jimmy Kimmel’s first night back?"
  },
  {
    "title": "With His Pivot on Ukraine, Trump May Be Washing His Hands of the War",
    "link": "https://www.nytimes.com/2025/09/24/us/politics/trump-ukraine.html",
    "summary": "President Trump has shown dwindling interest in mediating a peace accord, joining European “security guarantees” for Ukraine or providing aid and intelligence to the Ukrainians."
  },
  {
    "title": "U.S. Attorney Races to Present Case Against James Comey",
    "link": "https://www.nytimes.com/2025/09/24/us/politics/james-comey-indictment.html",
    "summary": "It remains to be seen whether a career prosecutor would be willing to present a case to a grand jury or whether jurors would bring an indictment."
  },
  {
    "title": "JD Vance Spars With Jon Favreau Over Dallas Shooting Information",
    "link": "https://www.nytimes.com/2025/09/24/style/jd-vance-jon-favreau-dallas-shooting.html",
    "summary": "In the aftermath of a violent episode, political figures quickly engaged with one another on social media."
  },
  {
    "title": "What We Know About the Shooting at a Dallas ICE Facility",
    "link": "https://www.nytimes.com/2025/09/25/us/dallas-ice-facility-shooting-suspect.html",
    "summary": "One detainee was killed and two others were wounded after a gunman opened fire on Wednesday. The gunman died of a self-inflicted gunshot wound."
  },
  {
    "title": "Sarkozy Found Guilty of Conspiracy to Seek Libyan Money and Sentenced to Prison",
    "link": "https://www.nytimes.com/2025/09/25/world/europe/sarkozy-france-prison-libya-qaddafi.html",
    "summary": "Nicolas Sarkozy, former president of France, was sentenced to five years in prison over a plot to fund his election bid with help from the government of Col. Muammar el-Qaddafi."
  },
  {
    "title": "Our Best Fall Baking Recipes",
    "link": "https://cooking.nytimes.com/article/best-fall-baking-recipes",
    "summary": "It’s Bake Time! Celebrate the launch of our baking newsletter (and start of the season) with these crowd-pleasing recipes."
  },
  {
    "title": "Jimmy Kimmel’s Return Draws 6.2 Million Viewers, Ratings Show",
    "link": "https://www.nytimes.com/2025/09/24/business/media/jimmy-kimmel-ratings.html",
    "summary": "The first episode of “Jimmy Kimmel Live!” since it was suspended last week by Disney attracted nearly four times as much as its average viewership."
  },
  {
    "title": "Son of Mother Killed by Geoffrey West Urges Alabama to Halt Execution",
    "link": "https://www.nytimes.com/2025/09/25/us/alabama-execution-william-berry-geoffrey-west.html",
    "summary": "William Berry has urged Alabama officials to stop the execution of Geoffrey West, arguing that it would bring neither justice nor closure."
  },
  {
    "title": "What Declines in Reading and Math Mean for the U.S. Work Force",
    "link": "https://www.nytimes.com/2025/09/25/us/what-declines-in-reading-and-math-mean-for-the-us-work-force.html",
    "summary": "U.S. employers and colleges are contending with more young people who are behind academically. Some are trying to make up where schools have failed."
  },
  {
    "title": "As Mamdani Rises, South Asians Emerge as a Political Force in New York",
    "link": "https://www.nytimes.com/2025/09/25/nyregion/mamdani-south-asian-voters.html",
    "summary": "Zohran Mamdani’s upstart campaign for mayor of New York City is inspiring the growing South Asian community to be more active in politics."
  },
  {
    "title": "Kamala Harris Reinforces Support for Zohran Mamdani in Phone Call",
    "link": "https://www.nytimes.com/2025/09/24/nyregion/kamala-harris-mamdani-phone-call.html",
    "summary": "The conversation came two days after Ms. Harris, the former vice president, gave a muted endorsement to Mr. Mamdani’s bid for mayor of New York City."
  },
  {
    "title": "10 (More) Questions With Andrew Cuomo",
    "link": "https://www.nytimes.com/2025/09/25/nyregion/andrew-cuomo-10-questions.html",
    "summary": "Former Gov. Andrew M. Cuomo, who is running for mayor of New York City as an independent, visited The New York Times for an interview."
  },
  {
    "title": "There Are More Robots Working in China Than the Rest of the World Combined",
    "link": "https://www.nytimes.com/2025/09/25/business/china-factory-robots.html",
    "summary": "China has embarked on a campaign to use more robots in its factories, transforming its manufacturing industries and becoming the dominant maker."
  },
  {
    "title": "We Need to Think Straight About God and Politics",
    "link": "https://www.nytimes.com/2025/09/25/opinion/kirk-trump-christianity.html",
    "summary": "My problem with the conversation about Kirk’s killing is that many people seem to have no coherent idea about the proper relationship between faith and politics."
  },
  {
    "title": "Times Reporters Answer Your Vaccine Questions",
    "link": "https://www.nytimes.com/2025/09/25/us/times-reporters-answer-your-vaccine-questions.html",
    "summary": "We received hundreds of queries about efficacy, safety, cost and access."
  },
  {
    "title": "Kimmel Says There’s Plenty of Room in the ‘Bad Ratings’ Club",
    "link": "https://www.nytimes.com/2025/09/25/arts/television/late-night-jimmy-kimmel-trump.html",
    "summary": "The late night host pointed to President Trump’s approval level after he said on social media to “let Jimmy Kimmel rot in his bad ratings.”"
  },
  {
    "title": "Now Arriving, a New Theory of In-Flight Turbulence",
    "link": "https://www.nytimes.com/2025/09/24/science/physics-airplanes-turbulence.html",
    "summary": "Physicists have devised a new model to account for the discomfort that airline passengers know all too well."
  },
  {
    "title": "Kashmir’s Apple Harvest Rots After Landslide Blocks Road",
    "link": "https://www.nytimes.com/2025/09/25/world/asia/india-apples-kashmir-flooding-landslide.html",
    "summary": "The Himalayan region supplies most of India’s apples. But when heavy rains left a major highway blocked for weeks, farmers couldn’t get them to markets."
  },
  {
    "title": "Richard Moe, 88, Dies; Led the National Trust for Historic Preservation",
    "link": "https://www.nytimes.com/2025/09/24/us/politics/richard-moe-dead.html",
    "summary": "After serving as an aide to Vice President Walter Mondale, he spent 17 years at the forefront of the fight to save numerous endangered landmarks."
  },
  {
    "title": "Woman, 50, Killed by Midtown Manhattan Driver in Hit-and-Run Crash",
    "link": "https://www.nytimes.com/2025/09/24/nyregion/midtown-hit-run-woman-killed.html",
    "summary": "A driver hit the woman and her husband, tourists from Germany, near Bryant Park on Wednesday afternoon. Her husband, 55, was injured, the police said."
  }
]