[
  {
    "title": "How a Call From Trump Ignited a Frantic Week of Diplomacy by Ukraine",
    "link": "https://www.nytimes.com/2025/08/14/world/europe/ukraine-russia-zelensky-diplomacy.html",
    "summary": "Once a vague proposal for a territorial swap gained clarity, a worried President Volodymyr Zelensky worked to rally allies before Friday’s Trump-Putin summit."
  },
  {
    "title": "Alaska’s Ukrainian Refugees Brace for Putin’s Arrival in Their Safe Harbor",
    "link": "https://www.nytimes.com/2025/08/14/us/politics/putin-trump-alaska.html",
    "summary": "Ukraine’s president, Volodymyr Zelensky, was not invited to the Trump-Putin summit in Anchorage, but 1,000 Ukrainian refugees in Alaska will be watching with trepidation."
  },
  {
    "title": "Trump-Putin Meeting: Where, What Time and What’s at Stake",
    "link": "https://www.nytimes.com/article/putin-trump-summit-ukraine.html",
    "summary": "The American leader has agreed to a meeting with the Russian president in Alaska on Friday to discuss ending the war in Ukraine."
  },
  {
    "title": "Russia Steps Up Its Battlefield Attacks, and America’s Drinking Drops to Record Low",
    "link": "https://www.nytimes.com/2025/08/14/podcasts/the-headlines/russia-ukraine-attacks-drinking-drops.html",
    "summary": "Plus, a C.I.A. secret up for auction."
  },
  {
    "title": "Fed Faces High Bar for Big Cuts Despite White House Pressure",
    "link": "https://www.nytimes.com/2025/08/14/business/fed-interest-rates-inflation.html",
    "summary": "The Federal Reserve is poised to lower interest rates in September. But signs of stickier inflation could limit how much relief officials can ultimately provide to borrowers."
  },
  {
    "title": "There’s Money to Be Made From ‘MAHA.’ Food Companies Want In.",
    "link": "https://www.nytimes.com/2025/08/14/dining/maha-health-food-marketing.html",
    "summary": "Processed-food giants and produce growers are tweaking products and ads to reach the Make America Healthy Again movement. But the strategy carries risks."
  },
  {
    "title": "Law Firms That Settled With Trump Are Pressed to Help on Trade Deals",
    "link": "https://www.nytimes.com/2025/08/13/us/politics/trump-law-firms-trade-deals.html",
    "summary": "Boris Epshteyn, a personal lawyer for President Trump, connected two firms — Kirkland & Ellis and Skadden Arps — to the Commerce Department."
  },
  {
    "title": "At the Kennedy Center, Trump Puts His Pop Culture Obsession on Display",
    "link": "https://www.nytimes.com/2025/08/13/us/politics/trump-kennedy-center-pop-culture.html",
    "summary": "President Trump held forth about the nature of show business and his own tortured relationship with celebrity."
  },
  {
    "title": "Trump Wants to ‘Take Back’ D.C., but the Federal Government Already Controls Much of It",
    "link": "https://www.nytimes.com/2025/08/14/upshot/washington-dc-home-rule.html",
    "summary": "The president and his allies have berated local officials. Yet the federal government has often made it harder for those officials to manage the capital."
  },
  {
    "title": "Man Charged With Assaulting Federal Agent With Sandwich in D.C.",
    "link": "https://www.nytimes.com/2025/08/13/us/politics/federal-agent-trump-sandwich-dc.html",
    "summary": "A video showed a man repeatedly calling a group of officers “fascists” before throwing a sub sandwich at one."
  },
  {
    "title": "Israeli Settlers Unleash Record High Attacks in West Bank",
    "link": "https://www.nytimes.com/2025/08/14/world/middleeast/west-bank-israel-settler-attacks.html",
    "summary": "Extremists are carrying out one of the most violent campaigns against Palestinian villages since the U.N. began keeping records."
  },
  {
    "title": "The Secret Weapon of Dance? Hands!",
    "link": "https://www.nytimes.com/2025/08/14/arts/dance-hands-choreography-video.html",
    "summary": "It can feel overwhelming to watch a dance. But if you follow the hands, they can unlock the mysteries of a moving body."
  },
  {
    "title": "Big Tech’s A.I. Boom Is Reordering the U.S. Power Grid",
    "link": "https://www.nytimes.com/2025/08/14/business/energy-environment/ai-data-centers-electricity-costs.html",
    "summary": "Electricity rates for individuals and small businesses could rise sharply as Amazon, Google, Microsoft and other technology companies build data centers and expand into the energy business."
  },
  {
    "title": "As Trump Pushes International Students Away, Asian Schools Scoop Them Up",
    "link": "https://www.nytimes.com/2025/08/14/business/us-international-students-trump.html",
    "summary": "The president’s hostility toward foreign students has made American higher education a riskier proposition for them. Other countries are eager to capitalize."
  },
  {
    "title": "Does Earning $142,000 in New York City Make You Rich?",
    "link": "https://www.nytimes.com/2025/08/14/nyregion/who-is-rich-new-york-city.html",
    "summary": "Andrew Cuomo is basing his new line of attack against Zohran Mamdani on a certain definition of wealth. But the reality is complicated."
  },
  {
    "title": "Will New York’s Governor Endorse Mamdani for Mayor?",
    "link": "https://www.nytimes.com/2025/08/14/nyregion/hochul-mamdani-cuomo-endorsement.html",
    "summary": "Gov. Kathy Hochul, who withheld an endorsement in the New York City Democratic primary, has yet to endorse the winner, Zohran Mamdani."
  },
  {
    "title": "A Year After the Revolution, Bangladesh Grapples With Frustration",
    "link": "https://www.nytimes.com/2025/08/14/world/asia/bangladesh-revolution-sheikh-hasina.html",
    "summary": "There are concerns about the slow pace of change in the country, with a promised election still months away, a struggling economy and familiar problems persisting."
  },
  {
    "title": "Behind Wall Street’s Abrupt Flip on Crypto",
    "link": "https://www.nytimes.com/2025/08/13/business/wall-street-banks-crypto-stablecoins.html",
    "summary": "The reversal risks declawing a century of consumer financial protections and replacing the backbone of bank accounts."
  },
  {
    "title": "How Cryptocurrency Could Be Coming for Your Bank Account",
    "link": "https://www.nytimes.com/2025/08/14/briefing/how-cryptocurrency-could-be-coming-for-your-bank-account.html",
    "summary": "We explain the benefits and the risks."
  },
  {
    "title": "Treating Chronic Pain is Hard. An Experimental Approach Shows Promise.",
    "link": "https://www.nytimes.com/2025/08/14/health/pain-personalized-brain-stimulation.html",
    "summary": "A guitarist in a death metal band was one of several people who found that personalized deep brain stimulation eased their pain and helped them reduce pain medication."
  },
  {
    "title": "Taylor Swift Announces ‘The Life of a Showgirl’ Details on ‘New Heights’ Podcast",
    "link": "https://www.nytimes.com/2025/08/13/arts/music/taylor-swift-travis-kelce-new-heights-podcast.html",
    "summary": "The pop superstar discussed her upcoming album on a podcast co-hosted by her boyfriend, the N.F.L. player Travis Kelce."
  },
  {
    "title": "Crime Keeps Falling. Here’s Why.",
    "link": "https://www.nytimes.com/2025/08/14/opinion/crime-statistics-washington-dc.html",
    "summary": "Reflections on social cohesion and law enforcement can help policymakers reduce crime even further."
  },
  {
    "title": "Is Trump a Test or Triumph for Democracy?",
    "link": "https://www.nytimes.com/2025/08/14/opinion/trump-democracy-test-left.html",
    "summary": "Why the left can’t win until it reckons with this question."
  },
  {
    "title": "Late Night Hopes Trump’s New Hosting Gig Will Keep Him Busy",
    "link": "https://www.nytimes.com/2025/08/14/arts/television/late-night-trump.html",
    "summary": "Nicole Byer said she supports Trump hosting this year's Kennedy Center Honors: “Anything that distracts him from running this country into the ground.”"
  },
  {
    "title": "Sudan Hit by Its ‘Worst Cholera Outbreak’ in Years, Medical Charity Says",
    "link": "https://www.nytimes.com/2025/08/14/world/africa/sudan-cholera-outbreak.html",
    "summary": "International charities warned that, left unchecked, the disease’s spread might exacerbate similar outbreaks across the African region for weeks or months to come."
  },
  {
    "title": "Mario Paglino, 52, and Gianni Grossi, 54, Die; Designers Made Barbies Into Art",
    "link": "https://www.nytimes.com/2025/08/13/arts/design/mario-paglino-gianni-grossi-dead.html",
    "summary": "They transformed dolls into one-of-a-kind pieces that sold for thousands of dollars. A married couple, they died in a car crash in Italy."
  },
  {
    "title": "You Can Buy One of the C.I.A.’s Greatest Mysteries at an Auction House",
    "link": "https://www.nytimes.com/2025/08/14/science/kryptos-sculpture-cia-solution-auction.html",
    "summary": "Sleuths have solved three of the panels of the Kryptos sculpture at the agency’s headquarters. Now the artwork’s creator is announcing the sale of the solution to the fourth."
  },
  {
    "title": "Rabbits With Hornlike Growths Are Hopping Around Colorado. Are They OK?",
    "link": "https://www.nytimes.com/2025/08/13/science/colorado-rabbits-tentacles-papilloma-virus.html",
    "summary": "The unsightly bunnies are infected with cottontail rabbit papillomavirus, which can cause growths that resemble warts or tentacles."
  }
]