[
  {
    "title": "Trump Administration Is Delaying Hundreds of Wind and Solar Projects",
    "link": "https://www.nytimes.com/2026/02/04/climate/wind-solar-projects.html",
    "summary": "Federal agencies are delaying approvals for renewable energy projects on both federal land and private property at a time when electricity demand is going up."
  },
  {
    "title": "Supreme Court Clears Way for California Voting Map",
    "link": "https://www.nytimes.com/2026/02/04/us/politics/supreme-court-california-congressional-map.html",
    "summary": "The state’s Republican Party had asked the justices to step in and block the new congressional maps, which give an advantage to Democrats, before the midterms."
  },
  {
    "title": "Trump’s Call to ‘Nationalize’ Elections Adds to State Officials’ Alarm",
    "link": "https://www.nytimes.com/2026/02/04/us/politics/trump-election-states-midterms.html",
    "summary": "Some top state election officials, who run voting across the country, worry that the federal government has become hostile to them and their work."
  },
  {
    "title": "Prosecutor Fired After Voicing Frustration With Immigration Caseload",
    "link": "https://www.nytimes.com/2026/02/04/us/politics/prosecutor-immigration-outburst.html",
    "summary": "The prosecutor, Julie T. Le, told a judge that she and her colleagues in the U.S. attorney’s office were overwhelmed by the White House’s immigration operation in Minnesota."
  },
  {
    "title": "Nike, Accused of Bias Against White Workers, Is Under Federal Investigation",
    "link": "https://www.nytimes.com/2026/02/04/business/eeoc-nike-white-employee-discrimination.html",
    "summary": "It appeared to be the first time the Equal Employment Opportunity Commission has targeted diversity policies at a large company."
  },
  {
    "title": "Doctors’ Group Endorses Restrictions on Gender-Related Surgery for Minors",
    "link": "https://www.nytimes.com/2026/02/04/health/gender-surgery-minors-ama.html",
    "summary": "The A.M.A.’s announcement followed a similar recommendation from the American Society of Plastic Surgeons. Other medical groups argued for a more personalized approach."
  },
  {
    "title": "Libby Howes, a Promising Young Actress, Left New York in 1981 and Disappeared. What Happened?",
    "link": "https://www.nytimes.com/2026/02/04/theater/wooster-group-libby-howes-theater.html",
    "summary": "Libby Howes was an imposing presence onstage with the Wooster Group. But after abruptly leaving New York in 1981 she became a theater world mystery. What happened?"
  },
  {
    "title": "Washington Post Cuts More Than 300 Jobs",
    "link": "https://www.nytimes.com/2026/02/04/business/media/washington-post-layoffs.html",
    "summary": "The layoffs cut into The Post’s local, international and sports coverage, and reduced its entire work force by about 30 percent."
  },
  {
    "title": "The Washington Post Eliminates Its Sports Department",
    "link": "https://www.nytimes.com/2026/02/04/business/media/washington-post-layoffs-sports-section.html",
    "summary": "The Post is laying off or reassigning all the reporters and editors in its sports section, days before the Super Bowl and the Winter Olympics in Italy."
  },
  {
    "title": "How Universities and States Are Increasing Surveillance of Professors",
    "link": "https://www.nytimes.com/2026/02/04/us/professors-classroom-surveillance-politics.html",
    "summary": "Scrutiny of university classrooms is being formalized, with new laws requiring professors to post syllabuses and tip lines for students to complain."
  },
  {
    "title": "In Forcing the Clintons to Testify on Epstein, Comer Sets a New Precedent",
    "link": "https://www.nytimes.com/2026/02/04/us/politics/james-comer-clintons-epstein.html",
    "summary": "The Republican chairman’s successful targeting of a former president who faces no charge of wrongdoing was the sort of tactic typical in an autocracy where leaders fear being jailed when they are out of power."
  },
  {
    "title": "Epstein Helped Woody Allen’s Daughter Get Into College, Emails Show",
    "link": "https://www.nytimes.com/2026/02/04/us/jeffrey-epstein-woody-allen-daughter-bard-college-leon-botstein.html",
    "summary": "Bard College’s president, Leon Botstein, agreed to help Woody Allen and Soon-Yi Previn’s daughter after Jeffrey Epstein connected them, emails released by the Justice Department show."
  },
  {
    "title": "Melinda French Gates Addresses New References to Bill Gates in Epstein Files",
    "link": "https://www.nytimes.com/2026/02/04/us/melinda-bill-gates-epstein-files.html",
    "summary": "Messages in the latest Epstein files suggesting that Bill Gates had engaged in extramarital sex brought up “painful” memories, his former wife said in an interview. Mr. Gates has denied the claims."
  },
  {
    "title": "David A. Ross Resigns from Art School After Epstein Email Release",
    "link": "https://www.nytimes.com/2026/02/04/nyregion/epstein-emails-david-ross-school-visual-arts.html",
    "summary": "David A. Ross said he remained “ashamed” for having been “taken in” by Jeffrey Epstein. Mr. Ross resigned his position at the School of Visual Arts in New York."
  },
  {
    "title": "Stellan Skarsgard on ‘Sentimental Value’ and His Wide-Ranging Career",
    "link": "https://www.nytimes.com/2026/02/04/movies/stellan-skarsgard-sentimental-value.html",
    "summary": "After a stroke four years ago, the actor has changed how he approaches performances, including the one he’s become an awards favorite for."
  },
  {
    "title": "Once the Hottest Bet on Wall St., Private Credit Has Started to Crack",
    "link": "https://www.nytimes.com/2026/02/04/business/private-credit-blue-owl-ai.html",
    "summary": "Concerns about defaults, particularly among software companies, have spooked investors in the private credit firms that lend to them."
  },
  {
    "title": "Google Plans to Double Spending Amid A.I. Race",
    "link": "https://www.nytimes.com/2026/02/04/business/google-earnings-ai.html",
    "summary": "Profits jumped 30 percent to $34.5 billion last quarter, and the tech giant is increasing its capital spending this year to as much as $185 billion."
  },
  {
    "title": "Canada’s Tate McRae Roots for Team USA in New Olympics Ad",
    "link": "https://www.nytimes.com/2026/02/04/world/canada/tate-mcrae-olympics-ad-team-usa.html",
    "summary": "Tate McRae’s promotional video for NBC, in which she name checks Team USA athletes, has drawn the ire of some Canadians as the country’s relationship with the United States hits new lows."
  },
  {
    "title": "Yair Golan’s Battle for a Two-State Solution and the Future of Israel",
    "link": "https://www.nytimes.com/2026/02/04/magazine/yair-golan-israel-palestine-gaza-war.html",
    "summary": "To many Israelis, he’s a war hero. To others, he’s a traitor guilty of “blood libel.” Can Yair Golan change politics in Israel?"
  },
  {
    "title": "Mamdani Chooses a Liberal Jewish Leader to Run Antisemitism Office",
    "link": "https://www.nytimes.com/2026/02/04/nyregion/mamdani-antisemitism-wisdom.html",
    "summary": "Phylisa Wisdom, the executive director of the New York Jewish Agenda, shares Mayor Zohran Mamdani’s criticism of Israel’s treatment of Gaza, but supports its right to exist as a Jewish state."
  },
  {
    "title": "New York City Partners with W.H.O. as U.S. Withdraws From Global Effort",
    "link": "https://www.nytimes.com/2026/02/04/nyregion/nyc-health-world-health-organization.html",
    "summary": "City health authorities are joining a network that counters new pathogens and emerging outbreaks."
  },
  {
    "title": "New York and New Jersey Resolve Fight Over Port Authority Control",
    "link": "https://www.nytimes.com/2026/02/04/nyregion/hochul-sherrill-port-authority-leadership-dispute-resolved.html",
    "summary": "The board of the Port Authority of New York and New Jersey will vote this week to confirm Kathryn Garcia as the executive director and Jean Roehrenbeck as the deputy executive director of the agency."
  },
  {
    "title": "Bright Horizons Child Care Centers Face Dozens of Alarming Complaints",
    "link": "https://www.nytimes.com/2026/02/04/nyregion/bright-horizons-child-abuse-nyc.html",
    "summary": "In New York City, health officials have moved to shut down one center where workers were charged with child abuse. Records show that problems extend across the network."
  },
  {
    "title": "Savannah Guthrie’s Missing Mother Has Nation Fixated on an Arizona Subdivision",
    "link": "https://www.nytimes.com/2026/02/04/us/savannah-guthrie-missing-mother-arizona.html",
    "summary": "The disappearance of Nancy Guthrie, mother of the news anchor Savannah Guthrie, has reporters, neighbors and drones flooding streets and foothills in Tucson, Ariz."
  },
  {
    "title": "I’m the Prime Minister of Spain. This Is Why the West Needs Migrants.",
    "link": "https://www.nytimes.com/2026/02/04/opinion/spain-migrants-europe.html",
    "summary": "In Spain, it is our duty to become the welcoming and tolerant society our ancestors would have hoped to find on the other side of our borders."
  },
  {
    "title": "What a Baby’s Laugh Actually Tells Us",
    "link": "https://www.nytimes.com/2026/02/04/opinion/baby-laugh-developmental-milestone.html",
    "summary": "A kid’s first joke reveals a complex mind."
  },
  {
    "title": "Justices Allow California to Use a Voting Map That Helps Democrats",
    "link": "https://www.nytimes.com/2026/02/04/briefing/supreme-court-california-federal-agents-minnesota.html",
    "summary": "Also, hundreds of federal agents are set to withdraw from Minneapolis. Here’s the latest at the end of Wednesday."
  },
  {
    "title": "Have You Been Impacted by the Affordability Crisis? Tell Us.",
    "link": "https://www.nytimes.com/2026/02/04/us/affordability-callout.html",
    "summary": "We want to hear about how costs are having an impact on your life."
  },
  {
    "title": "Nigeria Attack Leaves More Than 160 Dead",
    "link": "https://www.nytimes.com/2026/02/04/world/africa/nigeria-attack-woro-nuku.html",
    "summary": "The raiders stormed a rural community in central Nigeria, killing dozens and setting homes on fire in one of the country’s worst recent attacks."
  },
  {
    "title": "Hochul Chooses Adrienne Adams to Join Her Re-election Ticket",
    "link": "https://www.nytimes.com/2026/02/04/nyregion/kathy-hochul-adrienne-adams-lieutenant-governor.html",
    "summary": "By choosing Ms. Adams as her nominee for lieutenant governor, Gov. Kathy Hochul created the first all-woman major-party ticket in New York State history."
  },
  {
    "title": "Dutch Queen Joins the Military",
    "link": "https://www.nytimes.com/2026/02/04/world/europe/netherlands-queen-maxima-military.html",
    "summary": "Queen Máxima of the Netherlands enlisted as a reservist, the Royal House said, because the country’s security “can no longer be taken for granted.”"
  },
  {
    "title": "Blanche Marvin, 100, Dies; Critic Was, Maybe, ‘Streetcar’ Inspiration",
    "link": "https://www.nytimes.com/2026/02/04/theater/blanche-marvin-dead.html",
    "summary": "She was a ubiquitous presence at London theaters and claimed to have inspired the name — and final words — of Tennessee Williams’s Blanche DuBois."
  }
]