[
  {
    "title": "A Second Weak Jobs Report Challenges Trump’s Claim the Economy Is Booming",
    "link": "https://www.nytimes.com/2025/09/05/us/politics/trump-jobs-report-tariffs-deportations.html",
    "summary": "After a bad employment report in August, President Trump fired the official in charge of the numbers. This month’s data was just as disappointing."
  },
  {
    "title": "How Trump’s Blunt-Force Diplomacy Is Pushing His Rivals Together",
    "link": "https://www.nytimes.com/2025/09/05/us/politics/trump-diplomacy-rivals.html",
    "summary": "Some of President Trump’s pressure tactics appear to have backfired, sending would-be allies into the embrace of China."
  },
  {
    "title": "The Return of the ‘War Department’ Is a Message From Trump",
    "link": "https://www.nytimes.com/2025/09/05/us/politics/trump-war-department-defense-history.html",
    "summary": "President Trump and his defense secretary say they want to return to the era when America won wars. They largely ignore the greatest accomplishment of the past 80 years: avoiding superpower conflict."
  },
  {
    "title": "What to Know About a Rapid U.S. Military Buildup in the Caribbean",
    "link": "https://www.nytimes.com/2025/09/05/us/politics/trump-maduro-military-venezuela.html",
    "summary": "The United States has deployed eight warships, several surveillance planes and one attack submarine to the region as tensions with Venezuela grow."
  },
  {
    "title": "How a Top Secret SEAL Team 6 Mission Into North Korea Fell Apart",
    "link": "https://www.nytimes.com/2025/09/05/us/navy-seal-north-korea-trump-2019.html",
    "summary": "The 2019 operation, greenlit by President Trump, sought a strategic edge. It left unarmed North Koreans dead."
  },
  {
    "title": "Trump Didn’t Notify Congress About a High-Stakes SEALs Mission. That Could Be an Issue.",
    "link": "https://www.nytimes.com/2025/09/05/us/politics/trump-congress-national-security-navy-seals.html",
    "summary": "The Trump administration failed to tell lawmakers about a 2019 SEAL Team 6 incursion into North Korean territory that went awry."
  },
  {
    "title": "South Koreans Are Swept Up in Immigration Raid at Hyundai Plant in Georgia",
    "link": "https://www.nytimes.com/2025/09/05/us/georgia-battery-plant-hyundai-lg-ice-raid.html",
    "summary": "They were among nearly 500 workers apprehended at a construction site for a South Korean battery maker, officials said. The episode prompted diplomatic concern in Seoul."
  },
  {
    "title": "Abrego Garcia Now Facing Shifting Threats of Deportation",
    "link": "https://www.nytimes.com/2025/09/05/us/politics/trump-deportations-abrego-garcia-el-salvador.html",
    "summary": "A court had ruled that Kilmar Armando Abrego Garcia could not be sent back to his homeland, but now the administration sees a loophole. On Friday, Mr. Abrego Garcia’s lawyers were told that he would be sent to the small African nation of Eswatini."
  },
  {
    "title": "Chicago Braces for Trump’s Immigration Crackdown",
    "link": "https://www.nytimes.com/2025/09/05/us/trump-immigration-chicago.html",
    "summary": "Protesters held demonstrations and city leaders spoke against the prospect of a surge of federal agents."
  },
  {
    "title": "Keanu Reeves and Alex Winter Are Ready for ‘Godot’",
    "link": "https://www.nytimes.com/2025/09/05/theater/keanu-reeves-alex-winter-waiting-for-godot-broadway.html",
    "summary": "After years of training (clowning, Butoh and more), the longtime friends take on Samuel Beckett’s towering drama on Broadway."
  },
  {
    "title": "Federal Report on Drinking Is Withdrawn",
    "link": "https://www.nytimes.com/2025/09/05/health/alcohol-drinking-hhs-report.html",
    "summary": "The upcoming U.S. Dietary Guidelines will instead be influenced by a competing study, favored by industry, which found that moderate alcohol consumption was healthy."
  },
  {
    "title": "A Revived Focus on an Unproven Link Between Tylenol and Autism",
    "link": "https://www.nytimes.com/2025/09/05/health/autism-acetaminophen-tylenol.html",
    "summary": "Studies over the last decade of acetaminophen use in pregnancy — including a recent scientific review — have yielded mixed results but have not found a causal connection."
  },
  {
    "title": "CBS Abruptly Changes Editing Rules After Attacks From Administration",
    "link": "https://www.nytimes.com/2025/09/05/business/cbs-face-the-nation-editing-rules.html",
    "summary": "The Sunday show “Face the Nation” will no longer edit recorded interviews with newsmakers. The administration accused the network of deceptively editing an appearance of the homeland security secretary."
  },
  {
    "title": "Adams Insists He’s Running for Mayor Despite Saudi Ambassadorship Talks",
    "link": "https://www.nytimes.com/2025/09/05/nyregion/eric-adams-saudi-arabia-ambassador.html",
    "summary": "The discussions were said to be part of an effort to consolidate opposition to Zohran Mamdani’s campaign for mayor, but appeared to be fading on Friday."
  },
  {
    "title": "Why Zohran Mamdani’s Boss in the Legislature Refuses to Endorse Him",
    "link": "https://www.nytimes.com/2025/09/05/nyregion/mamdani-heastie-endorsement-mayor.html",
    "summary": "Carl Heastie, the speaker of the Assembly, has not yet endorsed his fellow lawmaker. He’s not the only prominent Democrat to hold back support."
  },
  {
    "title": "Joseph McNeil, Young Spark in a Civil Rights Battle, Dies at 83",
    "link": "https://www.nytimes.com/2025/09/05/us/joseph-mcneil-dead.html",
    "summary": "He and his classmates from a historically Black college in Greensboro, N.C., desegregated a Woolworth’s lunch counter in 1960, inspiring similar protests across the nation."
  },
  {
    "title": "Anthropic Agrees to Pay $1.5 Billion to Settle Lawsuit With Book Authors",
    "link": "https://www.nytimes.com/2025/09/05/technology/anthropic-settlement-copyright-ai.html",
    "summary": "The settlement is the largest payout in the history of U.S. copyright cases and could lead more A.I. companies to pay rights holders for use of their works."
  },
  {
    "title": "How Giorgio Armani Conquered Hollywood",
    "link": "https://www.nytimes.com/2025/09/05/fashion/giorgio-armani-hollywood-wanda-mcdaniel.html",
    "summary": "Armani amassed a cavalcade of celebrity spokespeople. Many came through a former journalist named Wanda McDaniel."
  },
  {
    "title": "The Climate Change Playbook No Longer Works. What Can Activists Do?",
    "link": "https://www.nytimes.com/2025/09/05/magazine/climate-change-activism-renewable-energy.html",
    "summary": "Activists are hoping to recreate the magic of 1970’s Earth Day — at a moment when the movement’s future is cloudier than ever."
  },
  {
    "title": "Powerball Lottery Hopefuls Love This California Gas Station",
    "link": "https://www.nytimes.com/2025/09/05/us/lottery-tickets-california-gas-station.html",
    "summary": "A Syrian immigrant in Southern California beat the odds — twice — and now some Powerball players see an ineffable magic at work in his store."
  },
  {
    "title": "As Powerball Nears Record, Ticket Buyers Dream of New Houses and Winning in Secret",
    "link": "https://www.nytimes.com/2025/09/05/us/powerball-lottery-winners.html",
    "summary": "The Powerball jackpot hit $1.8 billion ahead of Saturday’s drawing, making it the second-largest and inspiring many to play."
  },
  {
    "title": "Trump’s Immigration Policy Is a Factor in Slow Job Growth",
    "link": "https://www.nytimes.com/2025/09/05/opinion/jobs-report-immigration-trump-fed.html",
    "summary": "Economic data suggests labor supply and immigration changes are affecting job growth. The Federal Reserve can’t fix that, but Trump can."
  },
  {
    "title": "Does the Future Belong to China?",
    "link": "https://www.nytimes.com/2025/09/04/opinion/china-global-superpower-dan-wang.html",
    "summary": "Our biggest adversary is waiting for the West to collapse."
  },
  {
    "title": "Second Weak Jobs Report in Two Months",
    "link": "https://www.nytimes.com/2025/09/05/briefing/weak-jobs-report-immigration-raid-millennial-saint.html",
    "summary": "Also, Israel strikes a Gaza City landmark. Here’s the latest at the end of Friday."
  },
  {
    "title": "With Jair Bolsonaro on Trial, Brazil Braces for U.S. Sanctions",
    "link": "https://www.nytimes.com/2025/09/05/world/americas/bolsonaro-trial-us-brazil-sanctions.html",
    "summary": "While the Supreme Court weighs the fate of the former president on charges of plotting a coup, Brazil’s government is preparing for more penalties."
  },
  {
    "title": "New Summer Camp Safety Laws Follow Texas’ Tragic Floods",
    "link": "https://www.nytimes.com/2025/09/05/us/politics/texas-summer-camp-safety-rules.html",
    "summary": "The families of “Heaven’s 27,” the children and counselors lost at Camp Mystic, pressed the Legislature to toughen flood rules over the objections of some Hill Country camp operators."
  },
  {
    "title": "Duchess of Kent Dies at 92; a Royal Who Comforted a Wimbledon Loser",
    "link": "https://www.nytimes.com/2025/09/05/world/europe/duchess-of-kent-dead.html",
    "summary": "A member of an aristocratic family, she married the Duke of Kent, a cousin of Queen Elizabeth II."
  }
]