[
  {
    "title": "Timothy Mellon Is Donor Who Gave $130 Million to Pay Troops During Shutdown",
    "link": "https://www.nytimes.com/2025/10/25/us/politics/timothy-mellon-donation-troops.html",
    "summary": "Timothy Mellon is a billionaire and a major financial backer of President Trump."
  },
  {
    "title": "Keeping the House Absent, Johnson Marginalizes Congress and Himself",
    "link": "https://www.nytimes.com/2025/10/25/us/politics/mike-johnson-speaker-congress.html",
    "summary": "The speaker’s decision to hold the House in an indefinite hiatus during the shutdown is his latest move to diminish the role of the legislative branch — and his own post."
  },
  {
    "title": "In Florida, Obamacare Price Hikes Pose an Outsized Threat",
    "link": "https://www.nytimes.com/2025/10/25/us/obamacare-price-spikes-lost-subsidies-threaten-florida.html",
    "summary": "South Florida will feel some of the most intense reverberations if Congress allows the extra insurance subsidies it approved during the pandemic to expire."
  },
  {
    "title": "Being In an N.B.A. Player’s Entourage Is Fun. Now, It Can Be a Gambling Edge, Too.",
    "link": "https://www.nytimes.com/2025/10/25/business/nba-gambling-scandal-players.html",
    "summary": "The federal indictments against N.B.A. players and others for illegal betting exposed a new wrinkle in the way old friends can benefit from their access to an athlete."
  },
  {
    "title": "NBA Gambling Scandal: What We Know",
    "link": "https://www.nytimes.com/2025/10/23/nyregion/nba-gambling-scandal-explained.html",
    "summary": "Two indictments detailed schemes involving sports betting and rigged poker games, prosecutors said. The link was current and former N.B.A. players and coaches."
  },
  {
    "title": "New York Is the Center of Basketball. And Basketball Betting Scandals.",
    "link": "https://www.nytimes.com/2025/10/25/nyregion/new-york-basketball-betting-scandals.html",
    "summary": "Point shaving. Gambling rings. Illegal poker games. Prosecutors in New York have seen it all."
  },
  {
    "title": "Asia, Caught in the Middle, Faces Trump and Xi’s Tug of War",
    "link": "https://www.nytimes.com/2025/10/25/world/asia/trump-china-trade-deal-xi.html",
    "summary": "President Trump’s visit shows how the United States and China are vying for influence in Asia over trade, technology and the fate of Taiwan."
  },
  {
    "title": "Trump’s Asia Tour: Deals, Diplomacy and a Meeting With Xi",
    "link": "https://www.nytimes.com/2025/10/25/world/asia/trump-japan-korea-china.html",
    "summary": "From Kuala Lumpur to Gyeongju, President Trump is casting himself as a deal-maker and peace negotiator, while a wary region looks for tariff relief and steadier ties."
  },
  {
    "title": "The Corruption Behind Trump’s East Wing Demolition",
    "link": "https://www.nytimes.com/video/opinion/100000010479681/the-corruption-behind-trumps-east-wing-demolition.html",
    "summary": "As of Oct. 24, the White House’s East Wing is all but a pile of debris. The New York Times Opinion’s editor Kathleen Kingsbury unpacks the public outrage and reveals why you should be concerned about this move by President Trump."
  },
  {
    "title": "Burnin’ Down the House",
    "link": "https://www.nytimes.com/2025/10/25/opinion/trump-white-house-east-wing-demolition.html",
    "summary": "Demolition Man builds a monument to his wrecking-ball style."
  },
  {
    "title": "Personal History",
    "link": "https://www.nytimes.com/2025/10/25/briefing/personal-history.html",
    "summary": "Good morning. The good things in our lives are the result of fantastic webs of interconnected prerequisites."
  },
  {
    "title": "Trump Backs Milei, But Argentina’s Elections Will Test His Popularity",
    "link": "https://www.nytimes.com/2025/10/25/world/americas/argentina-elections-milei.html",
    "summary": "President Javier Milei of Argentina has earned U.S. support, but he faces a critical legislative election at home amid voter anger over job losses and corruption scandals."
  },
  {
    "title": "Starring in Videos Is No Longer a Job Just for the Social Media Team",
    "link": "https://www.nytimes.com/2025/10/25/business/dealbook/employee-social-media-influencers.html",
    "summary": "Companies from Delta Air Lines to Portillo’s are asking all sorts of employees, sometimes through formal programs, to help build the brand."
  },
  {
    "title": "Hurricane Melissa Forecast: What to Expect in the Caribbean and Florida",
    "link": "https://www.nytimes.com/2025/10/25/weather/hurricane-melissa-forecast-florida.html",
    "summary": "After it lashes the Caribbean this weekend, there’s still uncertainty about where the storm will go next. Here are the scenarios, one day at a time."
  },
  {
    "title": "Why a Chef in Brazil Couldn’t Stomach a Menu Request for a Prince’s Event",
    "link": "https://www.nytimes.com/2025/10/25/world/americas/brazil-chef-menu-william-sustainability.html",
    "summary": "He was asked to cater a climate event for Prince William and 700 guests. But omitting the famous Amazonian fish was like “asking Iron Maiden to play jazz.”"
  }
]