[
  {
    "title": "Trump Gives Mexico a Reprieve but Slams Canada With Higher Tariffs",
    "link": "https://www.nytimes.com/2025/08/01/world/canada/canada-tariffs-trump.html",
    "summary": "The imbalance in President Trump’s treatment of America’s closest trading partners may come from his desire to make Canada the 51st state, some Canadians believe."
  },
  {
    "title": "Arab States Call for Hamas to Disarm Amid Push for a Palestinian State",
    "link": "https://www.nytimes.com/2025/07/31/world/middleeast/hamas-arab-states-palestinians.html",
    "summary": "“Hamas must end its rule in Gaza,” reads a declaration endorsed by the 22 member nations of the Arab League."
  },
  {
    "title": "Fed Up With Netanyahu and Handling of Gaza War, Democrats Rebuke Israel",
    "link": "https://www.nytimes.com/2025/07/31/us/politics/democrats-israel-gaza-netanyahu.html",
    "summary": "Votes in the Senate made clear that the longtime bipartisan consensus in support of Israel is, at least for the moment, in tatters."
  },
  {
    "title": "Gov. Hochul Says Starvation of Children in Gaza Is ‘Unconscionable’",
    "link": "https://www.nytimes.com/2025/07/31/nyregion/hochul-israel-gaza.html",
    "summary": "Gov. Kathy Hochul of New York joined other staunch supporters of Israel who have recently condemned its role in creating the humanitarian crisis in Gaza."
  },
  {
    "title": "Trump, Term-Limited, Amasses $200 Million War Chest for Political Ambitions",
    "link": "https://www.nytimes.com/2025/07/31/us/politics/maga-inc-trump-fundraising.html",
    "summary": "The money is meant to beat Democrats, but some Republicans worry it could be used to beat Republicans, too."
  },
  {
    "title": "Virginia Giuffre’s Family Responds to Trump’s Claim That Epstein ‘Stole’ Her",
    "link": "https://www.nytimes.com/2025/07/31/us/politics/virginia-giuffre-family-trump-epstein.html",
    "summary": "President Trump’s remarks raised questions about his knowledge of the crimes committed by Jeffrey Epstein and his associate Ghislaine Maxwell, the family said in a statement."
  },
  {
    "title": "‘Clinton Plan’ Emails Were Likely Made by Russian Spies, Declassified Report Shows",
    "link": "https://www.nytimes.com/2025/07/31/us/politics/trump-clinton-emails-russia-investigation.html",
    "summary": "An annex to a report by the special counsel John H. Durham was the latest in a series of disclosures about the Russia inquiry, as the Trump team seeks to distract from the Jeffrey Epstein files."
  },
  {
    "title": "Judge Extends Protections for Migrants From Nepal, Honduras and Nicaragua",
    "link": "https://www.nytimes.com/2025/08/01/us/politics/tps-immigrants-nepal-honduras-venezuela.html",
    "summary": "In blocking the end of deportation protections for more than 60,000 migrants, the judge said the Trump administration’s language surrounding the program had strayed into racist conspiracy theories."
  },
  {
    "title": "County Emergency Official Says He Was Ill and Sleeping as Texas Floods Hit",
    "link": "https://www.nytimes.com/2025/07/31/us/politics/texas-floods-hearing.html",
    "summary": "At a hearing in hard-hit Kerr County, an emergency management coordinator for the first time explained his whereabouts when the Guadalupe River burst its banks."
  },
  {
    "title": "A French Beach Town’s Plea to Tourists: Keep Your Clothes On",
    "link": "https://www.nytimes.com/2025/08/01/world/europe/france-beach-town-tourist-fines.html",
    "summary": "“A little restraint, please!” wrote the mayor of Les Sables d’Olonne, who is leading an effort to stop visitors from wandering the town in just their swimwear."
  },
  {
    "title": "Storms Bring Flood Risk and Travel Delays to NYC, New Jersey and Washington",
    "link": "https://www.nytimes.com/2025/07/31/weather/rain-flash-flooding-warning-northeast-mid-atlantic.html",
    "summary": "New Jersey issued a state of emergency, and flooding swamped parts of New York City."
  },
  {
    "title": "Grief Pervades a Somber Farewell to a Slain Police Officer",
    "link": "https://www.nytimes.com/2025/07/31/nyregion/didarul-islam-funeral-nypd-shooting.html",
    "summary": "Didarul Islam, killed by a gunman at a Park Avenue tower in Manhattan, was eulogized for his service to his community, his department and his city."
  },
  {
    "title": "She Came Face to Face With the Park Avenue Gunman and Survived",
    "link": "https://www.nytimes.com/2025/07/31/nyregion/park-avenue-shooting-sebije-nelovic.html",
    "summary": "Sebije Nelovic, who for 27 years has cleaned the Manhattan office building that was the site of the shooting, was dusting a table that Monday evening. Then she heard gunfire."
  },
  {
    "title": "Trump Sharpens Sanctions Threat on Russia, While Admitting It May Not Work",
    "link": "https://www.nytimes.com/2025/07/31/us/politics/trump-russia-putin-sanctions.html",
    "summary": "“We’re going to put sanctions,” the president said, even before a deadline he had given Russia this week to engage in cease-fire negotiations had passed."
  },
  {
    "title": "Bipartisan Pair of Senators Seeks $54.6 Billion in New Aid for Ukraine",
    "link": "https://www.nytimes.com/2025/07/31/us/politics/senators-new-aid-ukraine.html",
    "summary": "The measure faces long odds given past Republican opposition to sending additional assistance to Kyiv, but it comes as President Trump has signaled a new openness to finding ways to back the nation."
  },
  {
    "title": "A.I. Researchers Are Negotiating $250 Million Pay Packages. Just Like NBA Stars.",
    "link": "https://www.nytimes.com/2025/07/31/technology/ai-researchers-nba-stars.html",
    "summary": "A.I. technologists are approaching the job market as if they were Steph Curry or LeBron James, seeking advice from their entourages and playing hardball with the highest bidders."
  },
  {
    "title": "Air Traffic Controllers Urged Safety Changes Years Before D.C. Crash",
    "link": "https://www.nytimes.com/2025/07/31/us/politics/ntsb-dc-airport-crash-air-traffic.html",
    "summary": "Air traffic control managers told the National Transportation Safety Board that F.A.A. leaders rebuffed efforts over the years to address hazardous conditions that played a role in the Jan. 29 crash."
  },
  {
    "title": "E.U. Did Not Retain Texts Sought by Journalists on Covid Vaccine Deal",
    "link": "https://www.nytimes.com/2025/08/01/world/europe/eu-texts-covid-new-york-times.html",
    "summary": "The European Union acknowledged for the first time that a top official reviewed the messages, but said it had no duty to keep them, despite intense interest."
  },
  {
    "title": "Cécile Dionne, Who Found Fame and Despair as a Quintuplet, Dies at 91",
    "link": "https://www.nytimes.com/2025/07/31/world/canada/cecile-dionne-dead.html",
    "summary": "The Dionnes, the first quints known to have survived infancy, became a global sensation and prey for the greedy. And Cécile came to resent it all. Only one of the five now survives."
  },
  {
    "title": "How Democrats Can Be Relevant Again",
    "link": "https://www.nytimes.com/2025/07/31/opinion/democratic-republican-parties.html",
    "summary": "If Democrats can come up with an alternative vision of how to repair the social and moral order, they might be relevant in the years ahead."
  },
  {
    "title": "Netanyahu Is Choosing to Starve Gaza",
    "link": "https://www.nytimes.com/2025/08/01/opinion/gaza-israel-famine-starvation.html",
    "summary": "To end starvation — and stave off social collapse — in Gaza, Israel must allow humanitarian-aid professionals to do their jobs."
  },
  {
    "title": "El Salvador Changes Constitution, Ending Term Limits for Nayib Bukele",
    "link": "https://www.nytimes.com/2025/08/01/world/americas/el-salvador-bukele-term-limits.html",
    "summary": "The president, a Trump ally, will now be able to seek re-election indefinitely. The National Assembly also extended the presidential term to six years."
  },
  {
    "title": "Elite New York High School Admits 8 Black Students in a Class of 781",
    "link": "https://www.nytimes.com/2025/07/31/nyregion/specialized-high-schools-black-students-stuyvesant.html",
    "summary": "The city’s eight specialized high schools are regarded as crown jewels but also symbols of segregation. The number of Black and Hispanic students admitted to them dipped slightly from last year."
  },
  {
    "title": "Scientists are Learning to Rewrite the Code of Life",
    "link": "https://www.nytimes.com/2025/07/31/science/dna-genetics-engineering-microbes.html",
    "summary": "In a giant feat of genetic engineering, scientists have created bacteria that make proteins in a radically different way than all natural species do."
  }
]