[
  {
    "title": "Arab States Call for Hamas to Disarm Amid Push for a Palestinian State",
    "link": "https://www.nytimes.com/2025/07/31/world/middleeast/hamas-arab-states-palestinians.html",
    "summary": "“Hamas must end its rule in Gaza,” reads a declaration endorsed by the 22 member nations of the Arab League."
  },
  {
    "title": "Fed Up With Netanyahu and Handling of Gaza War, Democrats Rebuke Israel",
    "link": "https://www.nytimes.com/2025/07/31/us/politics/democrats-israel-gaza-netanyahu.html",
    "summary": "Votes in the Senate made clear that the longtime bipartisan consensus in support of Israel is, at least for the moment, in tatters."
  },
  {
    "title": "Gov. Hochul Says Starvation of Children in Gaza Is ‘Unconscionable’",
    "link": "https://www.nytimes.com/2025/07/31/nyregion/hochul-israel-gaza.html",
    "summary": "Gov. Kathy Hochul of New York joined other staunch supporters of Israel who have recently condemned its role in creating the humanitarian crisis in Gaza."
  },
  {
    "title": "Virginia Giuffre’s Family Responds to Trump’s Claim That Epstein ‘Stole’ Her",
    "link": "https://www.nytimes.com/2025/07/31/us/politics/virginia-giuffre-family-trump-epstein.html",
    "summary": "President Trump’s remarks raised questions about his knowledge of the crimes committed by Jeffrey Epstein and his associate Ghislaine Maxwell, the family said in a statement."
  },
  {
    "title": "White House Unveils $200 Million Plan for Enormous Ballroom Long Sought by Trump",
    "link": "https://www.nytimes.com/2025/07/31/us/politics/white-house-ballroom-trump.html",
    "summary": "Officials said a 90,000-square-foot addition to the East Wing would be paid for by President Trump and other donors."
  },
  {
    "title": "Unnoticed Whistle-Blower Document Alarms Justice Department Veterans",
    "link": "https://www.nytimes.com/2025/07/31/us/politics/emil-bove-whistle-blower.html",
    "summary": "A complaint concerning a top Justice Department official, Emil Bove III, went unnoticed for more than two months, raising worries that an internal watchdog has gone dormant."
  },
  {
    "title": "Trump Is Bringing Back the Presidential Fitness Test",
    "link": "https://www.nytimes.com/2025/07/31/well/move/trump-presidential-fitness-test.html",
    "summary": "The president signed an executive order on Thursday that would reinstate the test for schoolchildren."
  },
  {
    "title": "County Emergency Official Says He Was Ill and Sleeping as Texas Floods Hit",
    "link": "https://www.nytimes.com/2025/07/31/us/politics/texas-floods-hearing.html",
    "summary": "At a hearing in hard-hit Kerr County, an emergency management coordinator for the first time explained his whereabouts when the Guadalupe River burst its banks."
  },
  {
    "title": "Trisomy 18 Was Once Seen as Too Lethal to Treat. Some Kids Are Now Surviving.",
    "link": "https://www.nytimes.com/2025/07/31/magazine/trisomy-18-edwards-syndrome-baby-treatment-care.html",
    "summary": "Trisomy 18 is normally fatal within weeks of birth. But some parents are getting more time — with surgeries, luck and an incredible amount of effort."
  },
  {
    "title": "Storms Bring Flood Risk and Travel Delays to NYC, New Jersey and Washington",
    "link": "https://www.nytimes.com/2025/07/31/weather/rain-flash-flooding-warning-northeast-mid-atlantic.html",
    "summary": "New Jersey issued a state of emergency, and flooding swamped parts of New York City."
  },
  {
    "title": "Bipartisan Pair of Senators Seeks $54.6 Billion in New Aid for Ukraine",
    "link": "https://www.nytimes.com/2025/07/31/us/politics/senators-new-aid-ukraine.html",
    "summary": "The measure faces long odds given past Republican opposition to sending additional assistance to Kyiv, but it comes as President Trump has signaled a new openness to finding ways to back the nation."
  },
  {
    "title": "Grief Pervades a Somber Farewell to a Slain Police Officer",
    "link": "https://www.nytimes.com/2025/07/31/nyregion/didarul-islam-funeral-nypd-shooting.html",
    "summary": "Didarul Islam, killed by a gunman at a Park Avenue tower in Manhattan, was eulogized for his service to his community, his department and his city."
  },
  {
    "title": "She Came Face to Face With the Park Avenue Gunman and Survived",
    "link": "https://www.nytimes.com/2025/07/31/nyregion/park-avenue-shooting-sebije-nelovic.html",
    "summary": "Sebije Nelovic, who for 27 years has cleaned the Manhattan office building that was the site of the shooting, was dusting a table that Monday evening. Then she heard gunfire."
  },
  {
    "title": "A.I. Researchers Are Negotiating $250 Million Pay Packages. Just Like NBA Stars.",
    "link": "https://www.nytimes.com/2025/07/31/technology/ai-researchers-nba-stars.html",
    "summary": "A.I. technologists are approaching the job market as if they were Steph Curry or LeBron James, seeking advice from their entourages and playing hardball with the highest bidders."
  },
  {
    "title": "Apple Surprises Investors Worried That It Had Lost Its Touch",
    "link": "https://www.nytimes.com/2025/07/31/business/apple-earning-iphone-sales.html",
    "summary": "Despite recent criticism about its product outlook, the company reported strong sales of iPhones, Macs and services."
  },
  {
    "title": "Amazon Reports Strong Retail Demand, but Says Future Is Less Clear",
    "link": "https://www.nytimes.com/2025/07/31/business/amazon-earnings-second-quarter.html",
    "summary": "Consumers spent more than expected on the e-commerce giant’s site, while margins tightened at the company’s all-important cloud computing division."
  },
  {
    "title": "CDC Says Childhood Vaccination Rates Have Dropped Again",
    "link": "https://www.nytimes.com/2025/07/31/health/child-vaccinations-decline-cdc.html",
    "summary": "The new report paints a sobering picture of immunizations as infectious diseases like measles surge across the United States."
  },
  {
    "title": "Robert Wilson, Provocative Playwright of ‘Einstein on the Beach,’ Is Dead at 83",
    "link": "https://www.nytimes.com/2025/07/31/theater/robert-wilson-dead.html",
    "summary": "He upended theatrical norms with his own stunningly visualized works and his collaborations with a wide range of artists, from Philip Glass (“Einstein on the Beach”) to Lady Gaga."
  },
  {
    "title": "How Democrats Can Be Relevant Again",
    "link": "https://www.nytimes.com/2025/07/31/opinion/democratic-republican-parties.html",
    "summary": "If Democrats can come up with an alternative vision of how to repair the social and moral order, they might be relevant in the years ahead."
  },
  {
    "title": "The DOGE Alum Asking if Foreign Aid Is America’s Problem",
    "link": "https://www.nytimes.com/2025/07/31/opinion/doge-foreign-aid-jeremy-lewin.html",
    "summary": "“We were suckers of the global system for so long.”"
  },
  {
    "title": "Just Hours Remain Before Trump’s Tariff Deadline",
    "link": "https://www.nytimes.com/2025/07/31/briefing/trump-tariff-deadline-louisiana-deportations.html",
    "summary": "Also, the U.S. is paying more than 150,000 people not to work. Here’s the latest at the end of Thursday."
  },
  {
    "title": "Elite New York High School Admits 8 Black Students in a Class of 781",
    "link": "https://www.nytimes.com/2025/07/31/nyregion/specialized-high-schools-black-students-stuyvesant.html",
    "summary": "The city’s eight specialized high schools are regarded as crown jewels but also symbols of segregation. The number of Black and Hispanic students admitted to them dipped slightly from last year."
  },
  {
    "title": "Scientists are Learning to Rewrite the Code of Life",
    "link": "https://www.nytimes.com/2025/07/31/science/dna-genetics-engineering-microbes.html",
    "summary": "In a giant feat of genetic engineering, scientists have created bacteria that make proteins in a radically different way than all natural species do."
  },
  {
    "title": "Nashville Is a ‘Tough Place to Tunnel.’ Musk Is Digging Anyway.",
    "link": "https://www.nytimes.com/2025/07/31/us/politics/nashville-tunnel-musk.html",
    "summary": "State leaders fast-tracked plans by Elon Musk’s company for a tunnel to Nashville’s airport, ignoring the city’s concerns."
  }
]