[
  {
    "title": "In Texas Flooding, the Most Urgent Alerts Came in the Middle of the Night",
    "link": "https://www.nytimes.com/2025/07/04/weather/weather-alerts-rivers-flooding.html",
    "summary": "The National Weather Service issued a series of upgraded warnings in quick succession as rivers across the region began to rise."
  },
  {
    "title": "Camp Mystic in Texas, Where 20 Children Are Missing, Is Nearly a Century Old",
    "link": "https://www.nytimes.com/2025/07/04/us/camp-mystic-texas.html",
    "summary": "Camp Mystic, on the banks of the Guadalupe River near Hunt, Texas, has been operated by generations of the same family since the 1930s."
  },
  {
    "title": "Mother of 2 Rescued Campers in Texas Relays Their Story",
    "link": "https://www.nytimes.com/2025/07/04/us/the-mother-of-two-rescued-campers-relays-their-story.html",
    "summary": "Serena Hanor Aldrich said her daughters were trapped by floodwaters for a couple of hours at Camp Mystic, where as many as 25 girls are missing. She criticized camp officials."
  },
  {
    "title": "The Cost of Victory: Israel Overpowered Its Foes, but Deepened Its Isolation",
    "link": "https://www.nytimes.com/2025/07/05/world/middleeast/israel-cost-of-victory.html",
    "summary": "It is more secure from threats than at any time since its founding. But the war in Gaza, and attacks on Iran and Lebanon, have undercut Israel’s standing among the world’s democracies."
  },
  {
    "title": "Hamas Says It’s Ready to ‘Immediately” Return to Truce Negotiations",
    "link": "https://www.nytimes.com/2025/07/04/world/middleeast/hamas-israel-ceasefire.html",
    "summary": "It was not immediately clear whether the group was demanding any significant changes to the plan for a 60-day truce, hostage-for-prisoner swaps and talks on a permanent end to the Gaza war."
  },
  {
    "title": "Israeli Ministers Set to Meet on Next Steps Toward Gaza Truce",
    "link": "https://www.nytimes.com/2025/07/05/world/middleeast/israeli-ministers-hamas-gaza-ceasefire.html",
    "summary": "Members of the government are poised to decide whether to proceed with negotiations after Hamas said it had responded positively to the latest truce proposal."
  },
  {
    "title": "Iran Looks to BRICS for Allies, Testing a New World Order",
    "link": "https://www.nytimes.com/2025/07/05/world/americas/iran-brics-summit-rio-de-janeiro.html",
    "summary": "The alliance of emerging economies hopes to offer a counterweight to the United States and other Western powers. But military strikes on Iran are testing its unity."
  },
  {
    "title": "States Brace for Added Burdens of Trump’s Tax and Spending Law",
    "link": "https://www.nytimes.com/2025/07/04/us/politics/states-trump-bill.html",
    "summary": "With the president’s domestic policy law signed, states will have to administer many of the cuts and decide how much they can spend to keep their citizens insured and fed."
  },
  {
    "title": "Trump Signs Signature Policy Bill at Independence Day Event",
    "link": "https://www.nytimes.com/2025/07/04/us/politics/trump-signs-policy-bill.html",
    "summary": "President Trump triumphantly highlighted tax cuts in the legislation while downplaying cuts to Medicaid and other assistance for poor Americans."
  },
  {
    "title": "Court Rejects Effort to Keep Migrants From Being Sent to South Sudan",
    "link": "https://www.nytimes.com/2025/07/04/us/politics/trump-migrants-lawsuit-sudan.html",
    "summary": "After the Supreme Court ruled that the deportations could move forward, a last-ditch attempt to block them with a new lawsuit faltered."
  },
  {
    "title": "China Has Paid a High Price for Its Dominance in Rare Earths",
    "link": "https://www.nytimes.com/2025/07/05/business/china-rare-earth-environment.html",
    "summary": "Dust and groundwater contaminated with heavy metals and radioactive chemicals pose a health threat that the authorities have been trying to address for years."
  },
  {
    "title": "China’s Rare Earth Origin Story, Explained",
    "link": "https://www.nytimes.com/2025/07/05/business/china-rare-earth-history.html",
    "summary": "Low environmental standards helped China become the world’s low-cost producer of rare earths, but Beijing was also focused on helping the industry."
  },
  {
    "title": "Superhero Movies Dominated the Box Office, but Not the Top 100 List",
    "link": "https://www.nytimes.com/2025/07/04/movies/superhero-movies-best-films-list.html",
    "summary": "The notable exceptions — “The Dark Knight” and “Black Panther” — stood out among the many sequels and spinoffs."
  },
  {
    "title": "Justice Ketanji Brown Jackson Makes Herself Heard, Prompting a Rebuke",
    "link": "https://www.nytimes.com/2025/07/05/us/supreme-court-ketanji-brown-jackson.html",
    "summary": "In solo dissents this term, the justice accused the conservative majority of lawless bias. On the term’s last day, Justice Amy Coney Barrett fired back."
  },
  {
    "title": "Virginia Has Become a Hotbed for Immigration Arrests",
    "link": "https://www.nytimes.com/2025/07/05/us/virginia-immigration-arrests.html",
    "summary": "Lawyers and advocates have theories as to why immigration arrests have accelerated in Virginia at a rate more than that of almost any other state."
  },
  {
    "title": "Under Trump’s Crackdown, a New Crop of Immigrant Rights Groups Rises",
    "link": "https://www.nytimes.com/2025/07/05/us/trump-immigration-rights-ice.html",
    "summary": "The latest networks of volunteers are hyperlocal and focused on responding to federal actions. As the crackdown becomes more intense, so could confrontations."
  },
  {
    "title": "U.S. Science Cuts in Antarctica May Embolden China and Russia",
    "link": "https://www.nytimes.com/2025/07/05/science/antarctica-science-trump-budget.html",
    "summary": "The continent is dedicated to research and cooperation, but proposed funding cuts in the Trump administration and actions by other world powers may alter the environment."
  },
  {
    "title": "Combs’s Racketeering Acquittal Was a Rare Misfire for a Powerful Law",
    "link": "https://www.nytimes.com/2025/07/05/nyregion/sean-combs-rico-act.html",
    "summary": "The Racketeer Influenced and Corrupt Organizations Act has been an effective cudgel in a variety of criminal cases. Some defense lawyers say prosecutors use it unfairly."
  },
  {
    "title": "Canada’s Indigenous Groups Demand a Say in Carney’s Race to Build",
    "link": "https://www.nytimes.com/2025/07/05/world/canada/carney-projects-indigenous-opposition.html",
    "summary": "Prime Minister Mark Carney wants to fast-track nation-building projects to remake Canada’s economy. Indigenous groups want a seat at the table."
  },
  {
    "title": "Trump’s Politicized F.B.I. Has Made Americans Less Safe",
    "link": "https://www.nytimes.com/2025/07/05/opinion/trump-fbi-politics-safety.html",
    "summary": "The Trump administration’s political witch hunt is risking the bureau’s effectiveness and the public’s safety."
  },
  {
    "title": "Conservatives Are Prisoners of Their Own Tax Cuts",
    "link": "https://www.nytimes.com/2025/07/05/opinion/trump-republicans-taxes-bill.html",
    "summary": "The various ways that the G.O.P. legislation doesn’t address itself to America’s most important problems."
  },
  {
    "title": "Making Lists",
    "link": "https://www.nytimes.com/2025/07/05/briefing/making-lists.html",
    "summary": "What are they good for, anyway?"
  },
  {
    "title": "Mamdani Once Claimed to Be Asian and African American. Should It Matter?",
    "link": "https://www.nytimes.com/2025/07/04/nyregion/mamdani-college-black-reaction.html",
    "summary": "Zohran Mamdani’s responses on a 2009 college application were criticized by his mayoral rivals. The blowback was dismissed by his supporters as a politically motivated attack."
  },
  {
    "title": "Violence at Synagogue and Restaurant Unnerves Jews in Melbourne",
    "link": "https://www.nytimes.com/2025/07/05/world/australia/jewish-synagogue-restaurant-violence.html",
    "summary": "Local leaders denounced the episodes, which both took place on Friday evening: arson at a synagogue and a disturbance at an Israeli eatery."
  },
  {
    "title": "Celebrating the Fourth of July Across the Country",
    "link": "https://www.nytimes.com/2025/07/04/us/july-4th-photos-videos.html",
    "summary": "Displays of patriotism were evident at parades and hot dog eating contests, even at a time of deep political divisions among Americans."
  }
]