[
  {
    "title": "Trump Announces Tariff Increase on Canada Over Reagan Ad Spat",
    "link": "https://www.nytimes.com/2025/10/25/world/canada/trump-tariffs-reagan-ad.html",
    "summary": "The ad, which will stop airing on Monday, used audio of a 1987 address by Ronald Reagan making a case against tariffs."
  },
  {
    "title": "Trump’s Asia Tour: Deals, Diplomacy and a Meeting With Xi",
    "link": "https://www.nytimes.com/2025/10/25/world/asia/trump-japan-korea-china.html",
    "summary": "From Kuala Lumpur to Gyeongju, President Trump is casting himself as a deal-maker and peace negotiator, while a wary region looks for tariff relief and steadier ties."
  },
  {
    "title": "Timothy Mellon Is Donor Who Gave $130 Million to Pay Troops During Shutdown",
    "link": "https://www.nytimes.com/2025/10/25/us/politics/timothy-mellon-donation-troops.html",
    "summary": "Timothy Mellon is a billionaire and a major financial backer of President Trump."
  },
  {
    "title": "As Vance Takes on a Forceful New Role, His Positions Are Shifting",
    "link": "https://www.nytimes.com/2025/10/25/us/politics/jd-vance-shifting-positions.html",
    "summary": "Vice President JD Vance has found himself defending or promoting positions that he once opposed, even as recently as the campaign."
  },
  {
    "title": "Did Cheating Accusations Have Anything to Do With the Death of a Daniel Naroditsky?",
    "link": "https://www.nytimes.com/2025/10/25/style/chess-cheating-death.html",
    "summary": "Daniel Naroditsky, a top American player with an online following, was found dead in Charlotte, N.C., after talking about being accused of cheating by a former world champion."
  },
  {
    "title": "The Wish to Be Seen",
    "link": "https://www.nytimes.com/2025/10/26/opinion/slavery-memory-photograph-omar-ibn-said.html",
    "summary": "The first time photographer Laylah Amatullah Barrayn saw a portrait of Omar ibn Said, she felt he was speaking to her."
  },
  {
    "title": "America Still Has a Political Center, and It’s the Key to Winning",
    "link": "https://www.nytimes.com/2025/10/20/opinion/moderation-strategy-democrat-republican-center.html",
    "summary": "The antidote to our polarized politics is a creative, re-energized political center."
  },
  {
    "title": "Vance Criticizes Mamdani’s Comments About Islamophobia After 9/11",
    "link": "https://www.nytimes.com/2025/10/26/nyregion/jd-vance-mamdani.html",
    "summary": "Zohran Mamdani said the vice president’s attack on social media was one in a series of “cheap jokes about Islamophobia.”"
  },
  {
    "title": "June Lockhart, Beloved Television Mother, Dies at 100",
    "link": "https://www.nytimes.com/2025/10/25/arts/television/june-lockhart-dead.html",
    "summary": "She exuded earnest maternal wisdom and wistful contentment as a farm wife on “Lassie” and, later, as an interplanetary castaway on “Lost in Space.”"
  },
  {
    "title": "Honduran Man Struck and Killed On a Virginia Highway While Fleeing ICE",
    "link": "https://www.nytimes.com/2025/10/25/us/ice-honduran-killed-virginia.html",
    "summary": "ICE officers were in the process of detaining Josue Castro-Rivera, 24, of Honduras, before he ran onto a busy highway in Norfolk and was struck by a pickup truck, officials said."
  }
]