[
  {
    "title": "Trump Bows to Putin’s Approach on Ukraine: No Cease-Fire, Deadlines or Sanctions",
    "link": "https://www.nytimes.com/2025/08/16/us/politics/trump-putin-approach-ukraine.html",
    "summary": "The net effect of the Alaska summit was to give President Vladimir V. Putin of Russia a free pass to continue his war against his neighbor indefinitely without further penalty, pending talks on a broader peace deal."
  },
  {
    "title": "6 Takeaways From Trump’s Meeting With Putin",
    "link": "https://www.nytimes.com/2025/08/15/us/politics/trump-putin-meeting-takeaways.html",
    "summary": "While no deal was announced, the Russian leader secured some wins and left on good terms with the U.S. president."
  },
  {
    "title": "The Power of the Trump-Putin Presidential Photo Op",
    "link": "https://www.nytimes.com/2025/08/16/world/europe/trump-putin-red-carpet-photo-op.html",
    "summary": "At their meeting in Alaska, President Trump and President Vladimir V. Putin of Russia both understood the power of the summit’s imagery, regardless of whether they achieved their goals."
  },
  {
    "title": "Jeanine Pirro Takes on Prosecutor Role in Trump’s D.C. Crackdown",
    "link": "https://www.nytimes.com/2025/08/16/us/politics/jeanine-pirro-trump-dc-police.html",
    "summary": "As the U.S. attorney in Washington, Jeanine Pirro is a central player in a clash that could define her legacy: the president’s takeover of local law enforcement."
  },
  {
    "title": "Where D.C. Crime Is Bad, Residents Question Trump’s Motives for Federal Takeover",
    "link": "https://www.nytimes.com/2025/08/16/us/politics/trump-washington-crime.html",
    "summary": "The president might have found allies in Southeast Washington, where violent crime has long vexed residents. But when he described the city as “disgusting,” with “roving mobs,” his remarks left those looking for help cold."
  },
  {
    "title": "Protesters Gather to Oppose Trump’s Push on Redistricting",
    "link": "https://www.nytimes.com/2025/08/16/us/politics/texas-democrats-redistricting-protests.html",
    "summary": "Thousands assembled around the country to demonstrate against a Republican effort to redraw congressional maps in their favor for 2026."
  },
  {
    "title": "U.S. Pauses Visitor Visas for Gazans After Laura Loomer Posts",
    "link": "https://www.nytimes.com/2025/08/16/us/politics/gaza-visitor-visas-medical-trump-loomer.html",
    "summary": "The move blocked a pathway for those seeking medical care in the United States, including young children, who have arrived in recent weeks with serious conditions."
  },
  {
    "title": "Israel Gears Up for Nationwide Strike to Support Hostages",
    "link": "https://www.nytimes.com/2025/08/16/world/middleeast/israel-nationwide-strike-hostages.html",
    "summary": "Nearly two years of demonstrations have failed to push Prime Minister Benjamin Netanyahu to reach a deal with Hamas that would end the war and free the remaining captives."
  },
  {
    "title": "‘South Park’ Is Crude and Childish. That May Make It Perfect for This Moment.",
    "link": "https://www.nytimes.com/2025/08/16/arts/television/south-park-trump-administration-paramount.html",
    "summary": "For decades, “South Park” has been crude, cynical and childish. That may be what makes it perfect for this moment."
  },
  {
    "title": "Government Shuts Down Air Canada Strike That Grounded Hundreds of Flights",
    "link": "https://www.nytimes.com/2025/08/16/world/canada/air-canada-strike.html",
    "summary": "A walkout by flight attendants ended after about 12 hours with the imposition of binding arbitration. But getting travel back to normal will take days."
  },
  {
    "title": "One Way Gen Z Finds Stress Relief? Overspending on Treats.",
    "link": "https://www.nytimes.com/2025/08/16/business/gen-z-treat-spending.html",
    "summary": "Any excuse is good enough for young adults to treat themselves, whether it’s failing an exam, getting a “job well done” from a boss or simply washing the dishes."
  },
  {
    "title": "Tristan Rogers, ‘General Hospital’ Actor, Dies at 79",
    "link": "https://www.nytimes.com/2025/08/16/arts/television/tristan-rogers-dead.html",
    "summary": "He became a fixture on the popular daytime television show as Robert Scorpio, a spy who became a police commissioner."
  },
  {
    "title": "An Arts District Helped Make Asheville a Destination. Its Recovery Is Slow Going.",
    "link": "https://www.nytimes.com/2025/08/16/arts/design/asheville-arts-recovery.html",
    "summary": "Nearly a year after Hurricane Helene severely damaged the popular River Arts District, the rebuilding process continues in a gradual manner."
  },
  {
    "title": "Criminal Fights Crime",
    "link": "https://www.nytimes.com/2025/08/16/opinion/criminal-fights-crime.html",
    "summary": "Democrats should remember: “It’s the crime, stupid!”"
  },
  {
    "title": "The Real Danger of Trump’s Macho Act",
    "link": "https://www.nytimes.com/2025/08/16/opinion/trump-national-guard-crime-dc.html",
    "summary": "It’s been a summer full of Trump’s overreach. Our round table convenes to discuss."
  },
  {
    "title": "Louisiana Has a Long History of Political Corruption",
    "link": "https://www.nytimes.com/2025/08/16/us/new-orleans-mayor-louisiana-corruption.html",
    "summary": "For decades, Louisiana lawmakers at all levels of government have been caught up in corruption allegations."
  },
  {
    "title": "New Statue of Martin Luther King Jr. Draws Criticisms Over Its Proportions",
    "link": "https://www.nytimes.com/2025/08/16/us/mlk-statue-florida.html",
    "summary": "A statue in Florida has prompted complaints about its shoes, arm and head but also a discussion about art and representations of historic figures."
  },
  {
    "title": "Spain’s Old Ways May Show How to Keep Cool",
    "link": "https://www.nytimes.com/2025/08/16/world/europe/heat-spain-global-warming.html",
    "summary": "The tradition of the siesta is no accident. Spain has been living with extreme heat for centuries, and its people have ways of coping."
  }
]