[
  {
    "title": "Trump Repeals Key Greenhouse Gas Finding, Erasing EPA’s Power to Fight Climate Change",
    "link": "https://www.nytimes.com/2026/02/12/climate/trump-epa-greenhouse-gases-climate-change.html",
    "summary": "The Environmental Protection Agency rejected the bedrock scientific finding that greenhouse gases threaten human life and well being. It means the agency can no longer regulate them."
  },
  {
    "title": "What to Know About the E.P.A.’s Big Attack on Climate Regulation",
    "link": "https://www.nytimes.com/2026/02/12/climate/what-to-know-epa-endangerment-finding.html",
    "summary": "The Trump administration has repealed the scientific determination that underpins the government’s legal authority to combat climate change."
  },
  {
    "title": "Trump Administration to End Surge of Immigration Agents in Minnesota",
    "link": "https://www.nytimes.com/2026/02/12/us/minnesota-immigration-crackdown.html",
    "summary": "The announcement came more than two months into an operation that has led to tense protests, thousands of arrests and three shootings in the Democratic-led state."
  },
  {
    "title": "Guard Troops Fully Withdraw From Chicago, Portland and Los Angeles",
    "link": "https://www.nytimes.com/2026/02/12/us/national-guard-chicago-portland-los-angeles.html",
    "summary": "President Trump initially deployed the troops in those cities to support law enforcement efforts to tamp down protests against immigration raids and protecting buildings."
  },
  {
    "title": "The High-Stakes Fight Over Masked Federal Agents",
    "link": "https://www.nytimes.com/2026/02/12/us/politics/congress-trump-ice-masked-agents.html",
    "summary": "The debate over whether federal agents should be allowed to cover their faces with masks has become a flashpoint as the government heads for a partial shutdown."
  },
  {
    "title": "Intelligence Dispute Centers on Kushner Reference in Intercepted Communication",
    "link": "https://www.nytimes.com/2026/02/12/us/politics/kushner-gabbard-iran-intelligence.html",
    "summary": "A whistle-blower has accused Tulsi Gabbard, the director of national intelligence, of blocking distribution of a report that Jared Kushner’s name came up in an intercepted communication about Iran."
  },
  {
    "title": "Judge Temporarily Blocks Hegseth From Punishing Mark Kelly Over ‘Illegal Orders’ Video",
    "link": "https://www.nytimes.com/2026/02/12/us/judge-blocks-kelly-punishment-hegseth.html",
    "summary": "Judge Richard J. Leon found that attempts to discipline Mark Kelly for a video that warned against following illegal orders would violate the senator’s First Amendment rights."
  },
  {
    "title": "Americans Are Paying the Bill for Tariffs, Despite Trump’s Claims",
    "link": "https://www.nytimes.com/2026/02/12/business/economy/americans-pay-tariffs-trump-fed.html",
    "summary": "Research from the New York Fed confirms that U.S. companies and consumers are bearing tariff costs, despite the president’s assertions otherwise."
  },
  {
    "title": "On Trump’s Tariffs, Supreme Court Hurries Up and Waits",
    "link": "https://www.nytimes.com/2026/02/12/us/the-docket-tariffs-wait-game.html",
    "summary": "The justices put the case on a fast track at the administration’s urging. But they don’t seem in a rush to rule on the president’s signature economic program."
  },
  {
    "title": "N.Y.C. Officials Reinstate Pride Flag at Stonewall After Federal Removal",
    "link": "https://www.nytimes.com/2026/02/12/nyregion/stonewall-flag-protest-nyc.html",
    "summary": "Hundreds of people attended a rally on Thursday to re-raise the flag, setting up a defiant response to the Trump administration’s assault on diversity initiatives."
  },
  {
    "title": "To Stay in Her Home, She Let In an A.I. Robot",
    "link": "https://www.nytimes.com/2026/02/12/us/elliq-ai-robot-senior-companion.html",
    "summary": "At 85, Jan Worrell lived alone on a remote corner of the Washington coast. Could ElliQ become her companion?"
  },
  {
    "title": "What We Know About the Victims of the Tumbler Ridge Mass Shooting in Canada",
    "link": "https://www.nytimes.com/2026/02/12/world/canada/tumbler-ridge-shooting-victims-canada.html",
    "summary": "The attack at a secondary school and a private residence in the small, remote community in British Columbia has left families stunned and grief-stricken."
  },
  {
    "title": "Trump’s Actions Test the Fragile World of Air Travel",
    "link": "https://www.nytimes.com/2026/02/12/business/air-travel-trump-el-paso.html",
    "summary": "Last-minute announcements and abrupt changes by the Trump administration have caused confusion in an already strained U.S. aviation system."
  },
  {
    "title": "El Paso Incident Highlights Gaps in America’s Drone Defense Industry",
    "link": "https://www.nytimes.com/2026/02/12/business/el-paso-drone-technology.html",
    "summary": "The U.S. has spent billions of dollars developing counter-drone technology, but much of it needs more testing in the real world."
  },
  {
    "title": "Do Drug Cartels Actually Use Drones at the Border?",
    "link": "https://www.nytimes.com/2026/02/12/world/americas/mexico-drone-border-cartels.html",
    "summary": "U.S. officials warn that cartel-operated drones on the border pose a major threat. Mexican officials are less certain. Analysts say the answer is likely in between."
  },
  {
    "title": "C.I.A. Video Appeals to Potential Spies in China’s Military",
    "link": "https://www.nytimes.com/2026/02/12/us/politics/cia-china-spies.html",
    "summary": "The agency is seeking Chinese officials who are frustrated with corruption in the People’s Liberation Army."
  },
  {
    "title": "Alcohol’s Effects on the Body: What Does Drinking Do to Your Health?",
    "link": "https://www.nytimes.com/2026/02/12/well/alcohol-body-health-effects.html",
    "summary": "From the moment you take a sip, drinking starts to influence your biology. Here’s an inside look."
  },
  {
    "title": "Maybe America Needs Some New Cities",
    "link": "https://www.nytimes.com/2026/02/12/business/economy/america-new-cities-irvine.html",
    "summary": "It sounds a bit kooky to promise a whole city from scratch. But it has been done before — and might just help solve the housing crisis."
  },
  {
    "title": "Mamdani to Resurrect Bus and Bike Lanes Killed by Eric Adams",
    "link": "https://www.nytimes.com/2026/02/12/nyregion/mamdani-bus-bike-lanes.html",
    "summary": "The new projects, expected to be announced on Friday, will reverse decisions made by the Adams administration, and help the new mayor fulfill his vow to make buses fast and free in New York."
  },
  {
    "title": "Police Seek 4 People After Teen Killed in Bronx Shooting",
    "link": "https://www.nytimes.com/2026/02/12/nyregion/bronx-fatal-shooting-teens.html",
    "summary": "The police said they were seeking three men and one woman in connection with the shooting, which killed Christopher Redding, 16. Two other teenagers were injured."
  },
  {
    "title": "Former N.Y.P.D. Official Is Charged With Soliciting Bribes",
    "link": "https://www.nytimes.com/2026/02/12/nyregion/nypd-school-safety-bribes.html",
    "summary": "Kevin Taylor, who ran the School Safety Division, received cash, luxury hotel lodging and a helicopter ride for promising to help steer city contracts to a Florida businessman, prosecutors said."
  },
  {
    "title": "Strong Storm Is Forecast to Hit the South This Weekend With a Risk of Heavy Rain",
    "link": "https://www.nytimes.com/2026/02/12/weather/us-south-rain-storm-forecast.html",
    "summary": "It’s finally warming up, which means the storm will most likely bring rain instead of more dreaded ice. But forecasters warned that there may be a lot of it."
  },
  {
    "title": "Greg Brown, Guitarist Who Wrote Cake’s Biggest Hit, Dies at 56",
    "link": "https://www.nytimes.com/2026/02/12/arts/music/greg-brown-dead.html",
    "summary": "His song “The Distance,” released in 1996, became an anthem for the disaffected members of Generation X."
  },
  {
    "title": "Trump Says He Wants to Cancel Elections, but Here Is the Real Threat",
    "link": "https://www.nytimes.com/2026/02/12/opinion/trump-cancel-elections-voting.html",
    "summary": "Mr. Trump’s attempted election takeover is already underway."
  },
  {
    "title": "A.I. Companies Are Eating Higher Education",
    "link": "https://www.nytimes.com/2026/02/12/opinion/ai-companies-college-students.html",
    "summary": "Human intelligence — the thing we as educators are duty bound to defend and advance — is under attack."
  },
  {
    "title": "Trump Repeals the Government’s Power to Regulate Climate",
    "link": "https://www.nytimes.com/2026/02/12/briefing/trump-climate-regulations-tv-for-pets.html",
    "summary": "Also, an end to the surge of immigration agents in Minnesota. Here’s the latest at the end of Thursday."
  },
  {
    "title": "Share Your Memories and Photos of Six Flags Over the Years",
    "link": "https://www.nytimes.com/2026/02/12/us/six-flags-closings-memories-photos.html",
    "summary": "We’re asking readers about their memories of trips to their local amusement parks for an upcoming story."
  },
  {
    "title": "Henry McGowan Found Not Guilty By Reason of Insanity in Father’s Murder",
    "link": "https://www.nytimes.com/2026/02/12/world/europe/henry-mcgowan-murder-ireland-not-guilty-insanity.html",
    "summary": "Henry McGowan of New York City was charged in the death of his father in an Irish hotel. He had struggled with mental illness for several years."
  },
  {
    "title": "Karrin Taylor Robson Ends Bid for Arizona Governor, Showing MAGA’s Power",
    "link": "https://www.nytimes.com/2026/02/12/us/politics/karrin-taylor-robson-andy-biggs-arizona-governor.html",
    "summary": "Karrin Taylor Robson, a wealthy businesswoman, dropped out after trailing in polls to Representative Andy Biggs, who is more aligned with supporters of President Trump."
  },
  {
    "title": "California Investigates Why Most of the Eaton Fire Victims Were Black",
    "link": "https://www.nytimes.com/2026/02/12/us/los-angeles-eaton-fire-california-investigation.html",
    "summary": "The state’s attorney general opened an investigation into whether emergency responders failed to adequately warn the residents of a Black middle-class neighborhood that was devastated in the blaze."
  },
  {
    "title": "Europe’s Leaders Gather At Munich Summit, Reeling From Trump’s Criticism",
    "link": "https://www.nytimes.com/2026/02/12/world/europe/munich-conference-europe-trump-vance-trust-rubio.html",
    "summary": "Officials gather on Friday for Europe’s biggest annual security summit, where a speech by Vice President JD Vance last year started an unraveling of trans-Atlantic relations."
  }
]