[
  {
    "title": "Judge Temporarily Blocks Deportation of 5-Year-Old Detained by ICE in Minnesota",
    "link": "https://www.nytimes.com/2026/01/27/us/ice-liam-ramos-minneapolis-deportation.html",
    "summary": "An image of the boy, wearing a Spider-Man backpack as he was detained by federal agents, became a symbol of the immigration crackdown in Minnesota."
  },
  {
    "title": "Photo Shows ICE Agents Deploying at Minneapolis Protest After Alex Pretti Shooting",
    "link": "https://www.nytimes.com/2026/01/27/us/minneapolis-nicollet-avenue-alex-pretti.html",
    "summary": "Violence in Minneapolis in the Wake of Alex Pretti’s Killing"
  },
  {
    "title": "Democrats Push to Impeach DHS Secretary Kristi Noem After Minneapolis Shooting",
    "link": "https://www.nytimes.com/2026/01/27/us/kristi-noem-dhs-impeach-minneapolis.html",
    "summary": "Following the fatal shooting in Minneapolis, a drive to impeach the homeland security secretary has drawn dozens more Democratic supporters, including the party’s top three leaders."
  },
  {
    "title": "U.S. Population Growth Slows Sharply as Immigration Numbers Plunge",
    "link": "https://www.nytimes.com/2026/01/27/us/politics/census-2025-estimates-population-immigration.html",
    "summary": "New census estimates show the effects of falling birthrates and President Trump’s anti-immigration policies. As his term continues, immigration is expected to drop even further."
  },
  {
    "title": "Florida State Senator Ileana Garcia Warns Immigration Will Cost G.O.P. the Midterms",
    "link": "https://www.nytimes.com/2026/01/27/us/ileana-garcia-trump-immigration-crackdown.html",
    "summary": "State Senator Ileana Garcia, who is Cuban American, said the fatal shooting of Alex Pretti by Border Patrol agents in Minneapolis was “abhorrent.”"
  },
  {
    "title": "On Immigration, the G.O.P. Finds Itself in a Shocking Place: On Defense",
    "link": "https://www.nytimes.com/2026/01/27/us/politics/minnesota-politics-immigration-trump.html",
    "summary": "Since President Trump’s rise, the issue has been a strength for the party. But now, after the chaos in Minnesota, Democrats see an opening and some Republicans worry that Mr. Trump is going too far."
  },
  {
    "title": "Texas Moves to Curtail H-1B Visas",
    "link": "https://www.nytimes.com/2026/01/27/us/texas-immigrants-h1b-visas.html",
    "summary": "Gov. Greg Abbott said the state would investigate public agencies and universities that employ those with H-1B visas, a program the Trump administration has also targeted."
  },
  {
    "title": "Judge Revives Wind Farm That Trump Halted Off Martha’s Vineyard",
    "link": "https://www.nytimes.com/2026/01/27/climate/judge-offshore-wind-vineyard-massachusetts.html",
    "summary": "The project, known as Vineyard Wind, was already 95 percent complete when the Trump administration ordered construction to stop."
  },
  {
    "title": "Andrea Lucas, EEOC Chair, Recasts Workplace Discrimination in Trump’s Image",
    "link": "https://www.nytimes.com/2026/01/27/us/politics/eocc-dei-employment-discrimination.html",
    "summary": "Andrea Lucas, the chair of the Equal Employment Opportunity Commission, has said she wants to undo years of what she describes as activist excess around labor law."
  },
  {
    "title": "Philip Glass Withdraws From Kennedy Center, as Its Symphony Vows to Play On",
    "link": "https://www.nytimes.com/2026/01/27/arts/music/kennedy-center-national-symphony-orchestra-gianandrea-noseda.html",
    "summary": "Amid cancellations and turmoil, the National Symphony Orchestra is planning to stay. “I cannot make everybody happy,” its conductor said."
  },
  {
    "title": "Troop Casualties in Ukraine War Near 2 Million, Study Finds",
    "link": "https://www.nytimes.com/2026/01/27/us/politics/russia-ukraine-casualties.html",
    "summary": "The number of deaths, injuries and missing is approaching a grim milestone after nearly four years of fighting."
  },
  {
    "title": "How Losing Her Limbs Turned Cooking Columnist Yewande Komolafe Into a Different Kind of Cook",
    "link": "https://www.nytimes.com/2026/01/27/dining/yewande-komolafe-losing-limbs-different-kind-of-cook.html",
    "summary": "Two years ago, our cooking columnist Yewande Komolafe woke from a coma and soon learned her body would be profoundly altered. She recounts her journey back to the kitchen, and to herself."
  },
  {
    "title": "Another Weekend Winter Storm? Forecast Details and Updates.",
    "link": "https://www.nytimes.com/2026/01/27/weather/next-winter-storm-forecast-snow-ice.html",
    "summary": "Meteorologists are watching another storm that could hit the East Coast this weekend."
  },
  {
    "title": "Storm Deaths Reach 10, Testing Mamdani’s Handling of a Weather Emergency",
    "link": "https://www.nytimes.com/2026/01/27/nyregion/mamdani-storm-deaths-homeless.html",
    "summary": "After first saying that it did not appear that the dead were homeless people, Mayor Zohran Mamdani has vowed to do more to get people into shelters."
  },
  {
    "title": "Spain Offers Undocumented Migrants a Legal Way to Stay",
    "link": "https://www.nytimes.com/2026/01/27/world/europe/spain-undocumented-migrants-residency.html",
    "summary": "The measure, unexpectedly approved, comes as other countries are cracking down on immigration."
  },
  {
    "title": "Bari Weiss Urges CBS News to Think Like a ‘Start-Up’",
    "link": "https://www.nytimes.com/2026/01/27/business/media/bari-weiss-cbs-news-town-hall.html",
    "summary": "“We are not producing a product enough people want,” Ms. Weiss told employees at her first all-staff meeting at the network."
  },
  {
    "title": "Safety Board Heaps Blame on F.A.A. Over Potomac Plane-Helicopter Crash",
    "link": "https://www.nytimes.com/2026/01/27/us/politics/dca-plane-collision-faa.html",
    "summary": "The National Transportation Safety Board found the probable causes of the midair collision last year included poorly designed flight routes and ignored warnings about risks."
  },
  {
    "title": "She’s the Face of Trump’s Aviation Safety Board, and She’s a Democrat",
    "link": "https://www.nytimes.com/2026/01/27/us/politics/jennifer-homendy-trump-transportation-safety-board.html",
    "summary": "Jennifer Homendy, the outspoken chairwoman of the National Transportation Safety Board, is reclaiming the spotlight at a meeting on Tuesday about the Washington, D.C., crash that killed 67."
  },
  {
    "title": "As Trump Eyes Greenland, Denmark’s Leader Is Unsure How Long U.S. Will Be an Ally",
    "link": "https://www.nytimes.com/2026/01/27/world/europe/mette-frederiksen-greenland-us-ally.html",
    "summary": "President Trump’s efforts to pry Greenland from Denmark show that “the old world order is now gone,” Prime Minister Mette Frederiksen warned in Berlin."
  },
  {
    "title": "Greenland’s Biggest Band Is Thrust Into an Uneasy Spotlight",
    "link": "https://www.nytimes.com/2026/01/27/arts/music/nanook-greenland-band.html",
    "summary": "With President Trump threatening to seize the territory, curious listeners have discovered its poppy rock group Nanook."
  },
  {
    "title": "These Foods Might Lower Cancer Risk",
    "link": "https://www.nytimes.com/2026/01/27/well/food-diet-nutrition-cancer-risk.html",
    "summary": "Decades of research suggests that your diet can influence the risk of various cancers. Here’s what we know."
  },
  {
    "title": "Southwest Begins Assigned Seating, Scrapping a Signature Quirk",
    "link": "https://www.nytimes.com/2026/01/27/travel/southwest-airlines-assigned-seating.html",
    "summary": "The airline said its new policy, rolled out on Tuesday, responded to passengers’ preferences, but some customers said the scramble was part of the charm."
  },
  {
    "title": "Gladys West, Unsung Figure in Development of GPS, Dies at 95",
    "link": "https://www.nytimes.com/2026/01/27/science/gladys-west-dead.html",
    "summary": "As a Navy mathematician in the 1950s and beyond, she played an unheralded but foundational role in making possible the global satellite-based mapping system."
  },
  {
    "title": "Should Iran’s Executioners Go Unpunished?",
    "link": "https://www.nytimes.com/2026/01/27/opinion/iran-regime-killing-protesters.html",
    "summary": "It’s left to the United States to impose meaningful consequences on the Iranian regime for one of the worst atrocities of this century."
  },
  {
    "title": "Immigration Enforcement Is Unavoidably Upsetting. But This Is Something Else.",
    "link": "https://www.nytimes.com/2026/01/27/opinion/ice-minneapolis-immigration-republicans.html",
    "summary": "Is this really the only way to enforce the law?"
  },
  {
    "title": "U.S. Population Growth Slows Sharply",
    "link": "https://www.nytimes.com/2026/01/27/briefing/us-population-growth-fema-delays.html",
    "summary": "Also, some good news for a Broadway musical. Here’s the latest at the end of Tuesday."
  },
  {
    "title": "Alaskan Natives Uprooted by Typhoon Struggle to Adapt Far From Home",
    "link": "https://www.nytimes.com/2026/01/27/dining/typhoon-displaces-alaskan-natives-food-homeland.html",
    "summary": "After a typhoon destroyed their homes, hundreds of Alaskan Natives find themselves far from their familiar food and landscapes."
  },
  {
    "title": "Man Went on ‘Trial Run’ Before Killing 4 Homeless Men, Prosecutors Say",
    "link": "https://www.nytimes.com/2026/01/27/nyregion/santos-murder-homeless-chintatown-trial.html",
    "summary": "Randy Rodriguez Santos faces four murder charges for the beating deaths of homeless men in Manhattan’s Chinatown in 2019. The killings left the city’s homeless population on edge."
  },
  {
    "title": "Former French Senator Convicted of Drugging a Colleague, Intending to Assault Her",
    "link": "https://www.nytimes.com/2026/01/27/world/europe/french-senator-drug-assault.html",
    "summary": "The trial took on special resonance in France, a year after a court found Dominique Pelicot and dozens of other men guilty of raping Gisèle Pelicot while she was sedated."
  }
]