[
  {
    "title": "Trump Turns to Untested Tariffs to Reorder Global Trade",
    "link": "https://www.nytimes.com/2025/08/01/business/economy/trump-tariffs.html",
    "summary": "President Trump has long wanted to rework world trade. The tariffs set to go into effect next week will carry out that plan."
  },
  {
    "title": "Trump Envoy Witkoff Visits Gaza as Aid Crisis Deepens",
    "link": "https://www.nytimes.com/2025/08/01/world/middleeast/witkoff-gaza-aid-trump-us.html",
    "summary": "Steve Witkoff went to the Palestinian enclave amid growing pressure on Israel to ease a deepening hunger crisis there. Hamas derided the visit as a “propaganda show.”"
  },
  {
    "title": "How U.S. Officials Grappled With the Release of a Triple Murderer",
    "link": "https://www.nytimes.com/2025/08/01/us/politics/triple-murderer-release-trump-venezuela.html",
    "summary": "The decision to free an American convicted of murder in a prisoner swap with Venezuela threatened to undercut President Trump’s claims of keeping the worst of the worst out of the United States."
  },
  {
    "title": "States Sue Over Trump Efforts to End Pediatric Transgender Medical Care",
    "link": "https://www.nytimes.com/2025/08/01/nyregion/transgender-care-lawsuit-trump.html",
    "summary": "The lawsuit comes amid escalating efforts by the U.S. government to restrict the availability of certain services for transgender adolescents."
  },
  {
    "title": "Putin Blames Frustration Over Ukraine Talks on ‘Inflated Expectations’",
    "link": "https://www.nytimes.com/2025/08/01/world/europe/trump-putin-ukraine-russia-talks.html",
    "summary": "The Russian president didn’t directly respond to President Trump’s ultimatum that Moscow halt its offensive by the end of next week or face financial penalties."
  },
  {
    "title": "Fleeing Domestic Violence, and the Russian Advance",
    "link": "https://www.nytimes.com/2025/08/01/world/europe/ukraine-russia-women-sumy.html",
    "summary": "“I wanted something decent,” said a woman at a shelter near Ukraine’s border with Russia. “But this is how it turned out.”"
  },
  {
    "title": "A Former Rolling Stone Says the Met Has His Lost Guitar. The Museum Says No Way.",
    "link": "https://www.nytimes.com/2025/08/01/arts/music/mick-taylor-rolling-stones-guitar-met-museum.html",
    "summary": "Representatives for Mick Taylor, the Rolling Stones’ former guitarist, said the Les Paul was stolen from him decades ago. The museum says he never owned it and has not made a claim."
  },
  {
    "title": "The Publicist on Call for Controversy",
    "link": "https://www.nytimes.com/2025/08/01/style/mitchell-jackson-publicist.html",
    "summary": "Mitchell Jackson was fired from a high-profile journalism job at 25. Now he represents some of the most divisive figures in America, including the right-wing podcaster Candace Owens."
  },
  {
    "title": "In Delhi and New York, Hindu Right Wing Lines Up Against Mamdani",
    "link": "https://www.nytimes.com/2025/08/01/world/asia/mamdani-india-hindu-muslims-modi-new-york-mayor.html",
    "summary": "As Zohran Mamdani gets within striking distance of becoming New York’s first Muslim mayor, he is drawing fire from supporters of India’s populist prime minister, who accuse him of being anti-Hindu."
  },
  {
    "title": "Art Spiegelman, John Waters and Other Banned Artists on How Censorship Changed Them",
    "link": "https://www.nytimes.com/2025/07/31/t-magazine/artists-censorship-book-bans.html",
    "summary": "Nine artists on how American censorship changed their work and their lives."
  },
  {
    "title": "Virginia Education Board Could Oust George Mason’s President",
    "link": "https://www.nytimes.com/2025/08/01/us/george-masons-president-gregory-washington-republicans-diversity.html",
    "summary": "Republicans have attacked the president, Gregory Washington, over his support for diversity efforts at the university, Virginia’s largest public institution."
  },
  {
    "title": "Trump Administration Cuts UCLA Funding Over Claims of Antisemitism, Chancellor Says",
    "link": "https://www.nytimes.com/2025/08/01/us/politics/trump-cuts-ucla-funding-federal-research.html",
    "summary": "The university is the latest to be targeted by the federal government over accusations that it has not done enough to fight antisemitism on campus."
  },
  {
    "title": "Cécile Dionne, Who Found Fame and Despair as a Quintuplet, Dies at 91",
    "link": "https://www.nytimes.com/2025/07/31/world/canada/cecile-dionne-dead.html",
    "summary": "The Dionnes, the first quints known to have survived infancy, became a global sensation and prey for the greedy. And Cécile came to resent it all. Only one of the five now survives."
  },
  {
    "title": "Feeding the Maine Lobster Roll Boom",
    "link": "https://www.nytimes.com/2025/07/31/dining/maine-lobster-roll-shacks.html",
    "summary": "At one of the most renowned lobster shacks — and across the country — the star dish just keeps getting more popular."
  },
  {
    "title": "Robert Wilson Expanded Our Sense of Theatrical Possibility",
    "link": "https://www.nytimes.com/2025/08/01/arts/music/robert-wilson-theater.html",
    "summary": "Wilson, who died this week at 83, created works of otherworldly dreaminess that were also deeply human."
  },
  {
    "title": "‘South Park’ Skewers a New Kind of Sanctimony",
    "link": "https://www.nytimes.com/2025/08/01/opinion/south-park-trump-conservatives.html",
    "summary": "There’s no more pretending that it’s rebellious to be reactionary."
  },
  {
    "title": "Behind Trump and Vance Is This Man’s Movement",
    "link": "https://www.nytimes.com/2025/08/01/opinion/ezra-klein-podcast-yoram-hazony.html",
    "summary": "Yoram Hazony, the author of “The Virtue of Nationalism,” discusses the principles of national conservatism."
  },
  {
    "title": "The Politics of Masks",
    "link": "https://www.nytimes.com/2025/08/01/briefing/the-politics-of-masks.html",
    "summary": "How masking is a source of both power and protection."
  },
  {
    "title": "Kamala Harris’s Post-Election TV Diet: ‘Lots of Cooking Shows’",
    "link": "https://www.nytimes.com/2025/08/01/arts/television/kamala-harris-stephen-colbert-late-show.html",
    "summary": "The former vice president told Stephen Colbert that she didn’t watch the news for months after losing to Donald Trump. “I’m just not into self-mutilation,” she said."
  },
  {
    "title": "Mike Donilon Had $4 Million Incentive to Secure a 2024 Biden Win",
    "link": "https://www.nytimes.com/2025/08/01/us/politics/mike-donilon-biden-2024-bonus.html",
    "summary": "Mike Donilon was promised a bonus that would have doubled his payment for work on the campaign if the former president had been re-elected."
  },
  {
    "title": "They Served Their Time for Sex Crimes. The State Won’t Let Them Go.",
    "link": "https://www.nytimes.com/2025/08/01/nyregion/nj-sex-offenders-civil-commitment.html",
    "summary": "New Jersey’s secure treatment center for detaining sex offenders is supposed to keep the public safe. Critics say it violates civil liberties."
  },
  {
    "title": "A Funeral Shines a Light on the Bangladeshis Thriving in the N.Y.P.D.",
    "link": "https://www.nytimes.com/2025/08/01/nyregion/nypd-didarul-islam-bangladesh.html",
    "summary": "At least 1,000 of the department’s 34,000 officers belong to the Bangladeshi American Police Association. They are members of the latest immigrant group to join the force."
  }
]