[
  {
    "title": "Judge Again Blocks Guard Deployment as Trump Expands His Targets",
    "link": "https://www.nytimes.com/2025/10/05/us/trump-national-guard-california-oregon-newsom.html",
    "summary": "A federal judge in Oregon accused the administration of circumventing her order, even as the president turned to Texas for troops aimed at Chicago and other cities."
  },
  {
    "title": "Pritzker Says Federal Agents Are Trying to Make Chicago a ‘War Zone’",
    "link": "https://www.nytimes.com/2025/10/05/us/politics/pritzker-chicago-immigration.html",
    "summary": "Gov. JB Pritzker of Illinois said he had ordered state agencies to investigate a raid on a Chicago apartment building where there had been reports of  “nearly naked” children zip-tied by federal officers."
  },
  {
    "title": "2 Motorists Charged in Chicago, Including One Shot by Federal Agent",
    "link": "https://www.nytimes.com/2025/10/05/us/politics/chicago-motorists-charged-border-patrol.html",
    "summary": "The account in the federal criminal complaint, which differs significantly from an earlier homeland security statement, says the motorists rammed officers’ vehicle and that an agent shot one when she drove her car at him."
  },
  {
    "title": "Strong-Armed by Trump, Netanyahu Embraces Gaza Deal as a Personal Win",
    "link": "https://www.nytimes.com/2025/10/05/world/middleeast/trump-netanyahu-gaza-deal.html",
    "summary": "Prime Minister Benjamin Netanyahu of Israel took credit for an emerging agreement, but it was clear that President Trump was calling the shots."
  },
  {
    "title": "Ian Roberts, Des Moines Superintendent, Had a Story Too Good to Be True",
    "link": "https://www.nytimes.com/2025/10/05/us/des-moines-iowa-superintendent-ian-roberts-immigration-ice.html",
    "summary": "Ian Roberts rose through the ranks of American education with talent, charm and a riveting back story. He was also hiding a shocking secret."
  },
  {
    "title": "Craft Breweries Struggle as Sales and Appetites Wane",
    "link": "https://www.nytimes.com/2025/10/05/business/craft-breweries-close-sales-decline.html",
    "summary": "Once the darling of the alcohol industry, small-batch beer makers are shutting down because of increased competition and flagging interest."
  },
  {
    "title": "Appeal Trial Opens in Gisèle Pelicot Rape Case",
    "link": "https://www.nytimes.com/2025/10/06/appeal-trial-opens-in-gisele-pelicot-rape-case.html",
    "summary": "One man has appealed his conviction in a case in which a Frenchman drugged his wife and invited scores of men to rape her."
  },
  {
    "title": "What to Know as Gisèle Pelicot Returns to Court for Man’s Appeal",
    "link": "https://www.nytimes.com/2025/10/06/what-to-know-as-gisele-pelicot-returns-to-court-for-mans-appeal.html",
    "summary": "The Frenchwoman who became a feminist icon will confront one of the men convicted after her husband drugged her and invited them to rape her over nearly 10 years."
  },
  {
    "title": "The Pelicot Trial: A Timeline",
    "link": "https://www.nytimes.com/2025/10/06/world/europe/pelicot-trial-timeline.html",
    "summary": "Dominique Pelicot was convicted of drugging and raping his wife, Gisèle Pelicot, and of inviting dozens of men to rape her. Here is how the events unfolded."
  },
  {
    "title": "Yen Plummets, Stocks Rally: Markets Greet Japan’s Next Leader",
    "link": "https://www.nytimes.com/2025/10/05/business/japan-stocks-yen-takaichi.html",
    "summary": "The governing party’s unexpected choice of Sanae Takaichi to lead it rattled markets on Monday, causing the yen to weaken and sending Japanese stocks sharply higher."
  },
  {
    "title": "Sanae Takaichi Is Likely to Be Japan’s Next Leader. Who Is She?",
    "link": "https://www.nytimes.com/2025/10/04/world/asia/sanae-takaichi-japan.html",
    "summary": "Ms. Takaichi would be Japan’s first female prime minister in a country where women are drastically underrepresented at the highest levels of power."
  },
  {
    "title": "Pakistan Fights Its Fiercest Taliban Insurgency in a Decade",
    "link": "https://www.nytimes.com/2025/10/06/world/asia/pakistan-taliban.html",
    "summary": "Pakistan uprooted the Taliban with U.S. help in the 2010s. But the insurgency has resurfaced with assistance from the Afghan Taliban."
  },
  {
    "title": "Is Sports Betting Illegal in Your State? Not if You Call It a ‘Prediction Market.’",
    "link": "https://www.nytimes.com/2025/10/05/upshot/sports-betting-prediction-markets.html",
    "summary": "Prediction markets like Kalshi, once known for offering wagers on elections, are now in the multibillion-dollar sports betting business and outside the reach of state regulations and taxes."
  },
  {
    "title": "Tony Shalhoub Stars in New Travel Show ‘Breaking Bread’",
    "link": "https://www.nytimes.com/2025/09/30/dining/tony-shalhoub-breaking-bread-cnn.html",
    "summary": "The “Monk” and “Marvelous Mrs. Maisel” star joins the food-centric travel TV circuit with his new show, “Breaking Bread.”"
  },
  {
    "title": "This Crazy Crypto Heist Is the Story of Our Time",
    "link": "https://www.nytimes.com/2025/10/05/opinion/bitcoin-georgia-ivanishvili-bachiashvili.html",
    "summary": "The souring of the relationship between Georgia’s billionaire master and his former aide is a cautionary tale."
  },
  {
    "title": "G.O.P. to Gen Z: Pay Double for Health Insurance or Go Without",
    "link": "https://www.nytimes.com/2025/10/05/opinion/shutdown-health-care-republicans-young.html",
    "summary": "If Democrats don’t win the shutdown fight, millions of young Americans may lose coverage because of higher prices."
  },
  {
    "title": "From Jaguars to Grocery Shelves: Cyberattacks Disrupt British Daily Life",
    "link": "https://www.nytimes.com/2025/10/06/business/jaguar-range-rover-cyberattacks-britain.html",
    "summary": "Jaguar Land Rover is the third big British brand to have its operations severely affected by a breach this year."
  },
  {
    "title": "Why Brittle Bones Aren’t Just a Woman’s Problem",
    "link": "https://www.nytimes.com/2025/10/04/health/osteoporosis-men.html",
    "summary": "More men are now living long enough to develop osteoporosis. But few are aware of the risk, and fewer still are screened and treated."
  },
  {
    "title": "Deputy Charged With Murder Knelt on Inmate’s Back, Affidavit Says",
    "link": "https://www.nytimes.com/2025/10/05/us/inmate-murder-kansas-adair-fatherley.html",
    "summary": "A recently released affidavit relates new details about the July death in a Kansas jail of a man with medical problems who was handcuffed and face down on a bunk."
  }
]