[
  {
    "title": "For Some Republicans, Trump’s Shift on Epstein Is Just the Latest Breach",
    "link": "https://www.nytimes.com/2025/07/15/us/politics/republicans-congress-trump-epstein.html",
    "summary": "Right-wing Republicans have also criticized the president’s stances on Iran and Ukraine, hinting at a broader fraying of his political coalition."
  },
  {
    "title": "What to Know About the Fallout Around the Epstein Files and the Trump Administration",
    "link": "https://www.nytimes.com/2025/07/15/us/politics/jeffrey-epstein-files-trump.html",
    "summary": "Here’s what to know about the disturbing facts and unsubstantiated suspicions that make Jeffrey Epstein, a registered sex offender, a politically potent obsession."
  },
  {
    "title": "House Democrats Push for Hearing on Jeffrey Epstein Case Amid GOP Rift",
    "link": "https://www.nytimes.com/2025/07/15/us/politics/house-democrats-jeffrey-epstein-hearing.html",
    "summary": "Democrats urged the Republican majority to call Justice Department officials, including the attorney general and F.B.I. leaders, to Capitol Hill to discuss how they handled the Jeffrey Epstein case."
  },
  {
    "title": "Rising Inflation Underscores Risks in Trump’s New Tariff Threats",
    "link": "https://www.nytimes.com/2025/07/15/us/politics/trump-tariffs-inflation.html",
    "summary": "New data showing price increases last month could foreshadow even higher costs if the president imposes steep tariffs on Aug. 1."
  },
  {
    "title": "Jamie Dimon Backs Jerome Powell Over Trump in Fed Fight",
    "link": "https://www.nytimes.com/2025/07/15/business/jamie-dimon-jerome-powell-trump.html",
    "summary": "The C.E.O. of JPMorgan Chase, who has rarely taken on President Trump during his second term, wades into the argument over the Federal Reserve chair."
  },
  {
    "title": "Canada’s Mark Carney Says There’s Little Hope of Avoiding U.S. Tariffs in Trade Deal",
    "link": "https://www.nytimes.com/2025/07/15/us/politics/canada-tariffs-mark-carney-trump.html",
    "summary": "After long insisting that Canada could avoid Trump tariffs through talks, Mark Carney now says that is unlikely for any nation."
  },
  {
    "title": "Trump Administration Initiates Trade Investigation of Brazil",
    "link": "https://www.nytimes.com/2025/07/15/us/politics/trump-brazil-trade-investigation.html",
    "summary": "The United States has begun investigating Brazil’s trade practices and “anti-corruption interference,” after the president’s criticisms of Brazil’s treatment of Jair Bolsonaro, a Trump ally."
  },
  {
    "title": "Trump Releases About Half of the National Guard Troops in Los Angeles",
    "link": "https://www.nytimes.com/2025/07/15/us/national-guard-los-angeles-trump.html",
    "summary": "President Trump mobilized the troops on June 7 in the wake of chaotic protests. They have remained in Southern California several weeks after most of the demonstrations had ended."
  },
  {
    "title": "Senator Hawley Aims to Roll Back Medicaid Cuts He Voted for in Trump Policy Bill",
    "link": "https://www.nytimes.com/2025/07/15/us/politics/medicaid-hawley-trump-policy-bill.html",
    "summary": "The Republican senator introduced a bill Tuesday that would block restrictions on key strategies that states rely on to finance Medicaid and double a rural hospital fund."
  },
  {
    "title": "Trump Administration Will Limit Medicare Spending on Pricey Bandages",
    "link": "https://www.nytimes.com/2025/07/15/health/medicare-skin-substitutes-prices.html",
    "summary": "In an about-face, the administration is cracking down on so-called skin substitutes, overused treatments that cost Medicare more than $10 billion last year."
  },
  {
    "title": "Why the Subway Still Floods in New York After Billions in Renovations",
    "link": "https://www.nytimes.com/2025/07/15/nyregion/nyc-subway-flooding-why.html",
    "summary": "The century-old system is being hit with more powerful and frequent storms, and it will take a multiagency effort to fix it."
  },
  {
    "title": "Storm Threat Moves South Toward Virginia",
    "link": "https://www.nytimes.com/2025/07/15/weather/virginia-storms-forecast-flood.html",
    "summary": "Lingering showers were forecast for the New York City area, but heavy rain and threats of flash flooding were shifting south on Tuesday."
  },
  {
    "title": "2025 Emmy Nominations: ‘Severance’ and ‘The Penguin’ Lead the Pack",
    "link": "https://www.nytimes.com/2025/07/15/arts/television/emmy-nominations-2025.html",
    "summary": "The nominees were announced Tuesday morning at the Television Academy’s Los Angeles headquarters."
  },
  {
    "title": "Emmy Nominees 2025: See the Complete List",
    "link": "https://www.nytimes.com/2025/07/15/arts/television/emmy-nominees-list-2025.html",
    "summary": "The 77th Emmy Awards ceremony is planned for Sept. 14. See all the nominees below."
  },
  {
    "title": "Emmy Nomination Snubs and Surprises: ‘Squid Game,’ ‘The Handmaid’s Tale’ and More",
    "link": "https://www.nytimes.com/2025/07/15/arts/television/emmy-nominations-snubs-surprises.html",
    "summary": "Some big names (Alfonso Cuarón, Elisabeth Moss) were left off the Emmy nomination list while some underdogs (Jeff Hiller, “Common Side Effects”) sneaked on."
  },
  {
    "title": "Democrats Broach Potential Walkout to Block Texas Redistricting",
    "link": "https://www.nytimes.com/2025/07/15/us/politics/texas-redistricting-trump.html",
    "summary": "Hakeem Jeffries, the House Democratic leader, told Texas Democrats on a call on Tuesday that the moment required everyone to take extraordinary actions."
  },
  {
    "title": "Andrew Cuomo Test Drives a Warmer, Friendlier Version of Himself",
    "link": "https://www.nytimes.com/2025/07/15/nyregion/andrew-cuomo-mayor-campaign.html",
    "summary": "Mr. Cuomo, the former governor of New York, has vowed to run a more energetic campaign than he did in the mayoral primary, and aimed to demonstrate that on Tuesday."
  },
  {
    "title": "Columbia Expands Efforts to Fight Antisemitism as Trump Deal Seems Near",
    "link": "https://www.nytimes.com/2025/07/15/nyregion/columbia-plan-to-fight-antisemitism.html",
    "summary": "The university plans to offer additional anti-discrimination training in partnership with Jewish organizations. Some other measures could prove controversial."
  },
  {
    "title": "University Leaders Reject Republican Attacks on Campus Antisemitism",
    "link": "https://www.nytimes.com/2025/07/15/us/politics/antisemitism-hearing-uc-berkeley-georgetown-cuny.html",
    "summary": "Leaders from Georgetown, the City University of New York and the University of California, Berkeley, said they are working to protect Jewish students but also free speech on their campuses."
  },
  {
    "title": "Speculation Swirls After Deadly Fire at Massachusetts Assisted Living Facility",
    "link": "https://www.nytimes.com/2025/07/15/us/fire-gabriel-house-fall-river-massachusetts.html",
    "summary": "A former employee said she never saw the staff perform fire drills. The local fire chief pushed back at claims that dispatching more firefighters would’ve saved more lives."
  },
  {
    "title": "This Math Tutor Keeps Popping Up in Wes Anderson Films",
    "link": "https://www.nytimes.com/2025/07/15/arts/mike-maggart-wes-anderson-acting.html",
    "summary": "Michael Maggart, a high school friend of Anderson’s, has no training or aspirations to be an actor. The director keeps casting him anyway."
  },
  {
    "title": "Israel Stages Rare Attack on Syrian Government Forces",
    "link": "https://www.nytimes.com/2025/07/15/world/middleeast/airstrikes-israel-syria-lebanon.html",
    "summary": "Israel intervened in sectarian violence in Syria and attacked the Iran-backed Hezbollah militia in Lebanon."
  },
  {
    "title": "What to Know About the Fighting in Southern Syria",
    "link": "https://www.nytimes.com/2025/07/15/world/asia/druse-syria-bedouin-israel-fighting.html",
    "summary": "Druse militiamen have been fighting with Bedouins in the Sweida Province, and Syrian government forces and the Israeli military are getting involved."
  },
  {
    "title": "Huckabee Calls Death of Palestinian-American in West Bank ‘Terrorism’",
    "link": "https://www.nytimes.com/2025/07/15/world/middleeast/huckabee-west-bank-musallet-killing.html",
    "summary": "Mike Huckabee, the U.S. ambassador to Israel, demanded “accountability for this criminal and terrorist act,” referring to the killing last week of Sayfollah Musallet in the occupied territories."
  },
  {
    "title": "Andrea Gibson, a Poet of Love, Hope and Gender Identity, Dies at 49",
    "link": "https://www.nytimes.com/2025/07/15/arts/andrea-gibson-dead.html",
    "summary": "A master of spoken-word performance, Gibson insisted that poetry, especially when read aloud to an audience, was a political act."
  },
  {
    "title": "Mamdani for Mayor (if You Want to Help the Republicans)",
    "link": "https://www.nytimes.com/2025/07/15/opinion/mamdani-mayor-republicans.html",
    "summary": "Get ready for the G.O.P. to run against “Mamdani Democrats” for several election cycles to come."
  },
  {
    "title": "I’m a Genocide Scholar. I Know It When I See It.",
    "link": "https://www.nytimes.com/2025/07/15/opinion/israel-gaza-holocaust-genocide-palestinians.html",
    "summary": "A professor of Holocaust and genocide studies comes to a painful conclusion about Israel’s actions in Gaza."
  },
  {
    "title": "Tariffs Begin to Leave an Imprint on the Economy",
    "link": "https://www.nytimes.com/2025/07/15/briefing/tariffs-inflation-report-republicans-ukraine.html",
    "summary": "Also, Republicans in Congress followed Trump’s shift on Ukraine. Here’s the latest at the end of Tuesday."
  },
  {
    "title": "Robin Kaye, ‘American Idol’ Music Supervisor, and Her Husband Found Dead in LA Home",
    "link": "https://www.nytimes.com/2025/07/15/arts/american-idol-music-supervisor-killed.html",
    "summary": "The music supervisor was found shot to death in a home in Los Angeles with her husband, Thomas Deluca, the police said. A 22-year-old was arrested in connection with the case."
  },
  {
    "title": "Found: A Lost George Washington Battlefield",
    "link": "https://www.nytimes.com/2025/07/15/arts/george-washington-battlefield-war.html",
    "summary": "As a young officer in the French and Indian War, Washington was involved in a devastating friendly fire incident. Military veterans are helping archaeologists excavate the location."
  },
  {
    "title": "Cram Wildfire in Central Oregon Grows to Almost 30,000 Acres",
    "link": "https://www.nytimes.com/2025/07/15/us/cram-fire-central-oregon.html",
    "summary": "The Cram wildfire grew rapidly over the weekend, threatening small communities and ranch land."
  }
]