[
  {
    "title": "Newsom Signs California Redistricting Plan to Counter Texas Republicans",
    "link": "https://www.nytimes.com/2025/08/21/us/politics/california-newsom-redistricting-texas.html",
    "summary": "Gov. Gavin Newsom and Democratic state lawmakers moved quickly to create new districts that could help their party flip five congressional seats. Their plan still requires voter approval."
  },
  {
    "title": "Gavin Newsom’s Redistricting Ballot Fight Raises $6.2 Million Online",
    "link": "https://www.nytimes.com/2025/08/21/us/politics/newsom-gerrymandering-california-fundraising.html",
    "summary": "The figure makes plain how a gerrymandering push that began in Texas but spread nationwide has energized the Democratic base."
  },
  {
    "title": "Taking on the Fed, Trump Combines Retribution Tactics With a Power Play",
    "link": "https://www.nytimes.com/2025/08/21/us/politics/trump-fed-federal-reserve.html",
    "summary": "The president’s second term has been marked by his eagerness to go after his foes and his assertions of presidential authority. Both traits are on display as he seeks control over the central bank."
  },
  {
    "title": "Trump’s Attacks on Fed Overshadow a Critical Moment for the Central Bank",
    "link": "https://www.nytimes.com/2025/08/21/business/trump-federal-reserve-lisa-cook.html",
    "summary": "The president’s calls for Lisa Cook, a Fed governor, to resign are diverting attention from economic issues as top central bankers from around the world gather in Jackson, Wyo."
  },
  {
    "title": "Powell Is on the Cusp of Taking a Big Gamble With the U.S. Economy",
    "link": "https://www.nytimes.com/2025/08/21/business/jerome-powell-fed-jackson-hole.html",
    "summary": "Jerome Powell, the Federal Reserve chair, is managing a high-stakes balancing act as he grapples with a cooling labor market, rising inflation and White House pressure to cut interest rates."
  },
  {
    "title": "Noem’s Spending Rule Causes Delays at Homeland Security Dept.",
    "link": "https://www.nytimes.com/2025/08/21/us/kristi-noem-spending-contracts-homeland-security-department.html",
    "summary": "The secretary’s requirement that she personally approve any expense over $100,000 has created a backlog of “mission critical” contracts, records show."
  },
  {
    "title": "F.B.I. Plans to Lower Recruiting Standards, Alarming Agents",
    "link": "https://www.nytimes.com/2025/08/21/us/politics/fbi-agent-recruitment-requirements-trump.html",
    "summary": "The plan appears to be part of a broader effort to shift the agency’s focus from tracking national security threats to fighting crime."
  },
  {
    "title": "State Dept. Unlawfully Withheld Visas Under Trump’s Travel Ban, Judge Rules",
    "link": "https://www.nytimes.com/2025/08/21/us/politics/state-dept-travel-ban-ruling.html",
    "summary": "The ruling involved a subset of applicants who had won the right to apply for a visa under a lottery system aimed at fostering diversity."
  },
  {
    "title": "NY Appeals Court Throws Out Trump’s Half-Billion-Dollar Fine in Civil Fraud Case",
    "link": "https://www.nytimes.com/2025/08/21/nyregion/trump-fraud-james.html",
    "summary": "New York appeals judges said that the judgment was excessive, but agreed to uphold the case so the appeal could continue."
  },
  {
    "title": "Court Decision to Toss Penalty Frees Trump Family of Financial Straits",
    "link": "https://www.nytimes.com/2025/08/21/us/politics/court-penalty-trump-family-financials.html",
    "summary": "The president’s financial situation had already improved after taking office a second time, thanks to his cryptocurrency ventures."
  },
  {
    "title": "Joao Silva’s Journey Back to Afghanistan",
    "link": "https://www.nytimes.com/2025/08/21/world/asia/afghanistan-joao-silva.html",
    "summary": "Fifteen years after a combat photographer lost his legs to a land mine, he returned to the place in Afghanistan where it happened."
  },
  {
    "title": "Judge Says Habba Has Served as U.S. Attorney Without Legal Authority",
    "link": "https://www.nytimes.com/2025/08/21/nyregion/alina-habba-us-attorney-new-jersey.html",
    "summary": "Defense lawyers had questioned whether Alina Habba, a Trump loyalist, was legally authorized to run the U.S. attorney’s office in New Jersey."
  },
  {
    "title": "See Trump’s Deployment of the National Guard, Other Federal Agents in Washington, D.C.",
    "link": "https://www.nytimes.com/2025/08/21/us/politics/dc-police-national-guard-trump.html",
    "summary": "Times journalists reviewed hundreds of images and videos of law enforcement agents to determine what they have been doing on the ground."
  },
  {
    "title": "Red Envelopes With Cash Are Changing Hands at Adams Campaign Rallies",
    "link": "https://www.nytimes.com/2025/08/21/nyregion/eric-adams-chinese-cash-envelopes.html",
    "summary": "New York Times reporters witnessed supporters of Mayor Eric Adams handing out cash-filled envelopes. Sometimes, that money went to reporters from Chinese-language outlets."
  },
  {
    "title": "Across 5 Indictments, Prosecutors Paint a Picture of a City for Sale",
    "link": "https://www.nytimes.com/2025/08/21/nyregion/ingrid-lewis-martin-corruption-indictment.html",
    "summary": "Ingrid Lewis-Martin, the former chief adviser to Mayor Eric Adams, is accused of taking bribes in exchange for acting on behalf of favor-seekers across New York City."
  },
  {
    "title": "As Adams Tries to Run on His Record, Scandals Keep Swirling Around Him",
    "link": "https://www.nytimes.com/2025/08/21/nyregion/eric-adams-mayor-corruption.html",
    "summary": "Mayor Eric Adams of New York has sought to argue that his first-term wins have earned him the right to serve a second. But he cannot shake the stench of corruption around his administration."
  },
  {
    "title": "Analysis: What Progress Has Trump Really Made in Ukraine Peace Talks?",
    "link": "https://www.nytimes.com/2025/08/21/world/europe/russia-ukraine-peace-talks-trump.html",
    "summary": "Nearly a week after President Trump’s Alaska summit, his suggestions of imminent breakthroughs have not come to pass."
  },
  {
    "title": "Vance Recounts Telling Zelensky to ‘Behave’ in Trump Meeting",
    "link": "https://www.nytimes.com/2025/08/21/us/politics/vance-zelensky-ukraine.html",
    "summary": "It was not the first time that the vice president had addressed Ukraine’s leader with words more commonly spoken to toddlers than heads of state."
  },
  {
    "title": "Hurricane Erin Is Heading Out to Sea. People Are Riveted Anyway.",
    "link": "https://www.nytimes.com/2025/08/21/us/hurricane-erin.html",
    "summary": "The Category 2 hurricane isn’t expected to make landfall. Still, it’s drawing notice as the first named storm to reach hurricane strength this year."
  },
  {
    "title": "Hurricane Erin Captured From International Space Station",
    "link": "https://www.nytimes.com/2025/08/21/weather/hurricane-erin-international-space-station.html",
    "summary": "The International Space Station captured the unusually large storm as it swirled near the East Coast of the United States."
  },
  {
    "title": "Europe Watches as Hurricane Erin Crosses the Atlantic",
    "link": "https://www.nytimes.com/2025/08/21/weather/hurricane-erin-uk-europe-atlantic.html",
    "summary": "It won’t be a hurricane much longer, but the storm could still make an impact next week."
  },
  {
    "title": "Heart of the Menendez Case: Who Deserves a Second Chance?",
    "link": "https://www.nytimes.com/2025/08/21/us/menendez-brothers-lawyer-resentencing.html",
    "summary": "Media attention has brought the Menendez brothers to the cusp of early release from prison. Criminal justice reform proponents hope other prisoners benefit."
  },
  {
    "title": "Menendez Brothers Parole Hearings: What to Expect and How to Follow",
    "link": "https://www.nytimes.com/2025/08/21/us/menendez-parole-how-to-watch.html",
    "summary": "The hearings are being held on consecutive days, with separate deliberations for each brother."
  },
  {
    "title": "Delaware Looks to ‘Living Shorelines’ to Save Its Coasts",
    "link": "https://www.nytimes.com/2025/08/20/climate/delaware-living-shorelines.html",
    "summary": "Along with other East Coast states, Delaware is using natural materials to protect vulnerable coastal areas."
  },
  {
    "title": "The Rise of Right-Wing Nihilism",
    "link": "https://www.nytimes.com/2025/08/21/opinion/rufo-yarvin-trump-nihilism.html",
    "summary": "Rather than conserve or build, some people just want to destroy."
  },
  {
    "title": "One Sentence in the Constitution Is Causing America Huge Problems",
    "link": "https://www.nytimes.com/2025/08/21/opinion/trump-constitution-unitary-executive.html",
    "summary": "An amendment that can help save our democracy."
  },
  {
    "title": "A Half-Billion-Dollar Fine Against Trump Was Thrown Out",
    "link": "https://www.nytimes.com/2025/08/21/briefing/trump-fine-court-us-eu-trade-deal.html",
    "summary": "Also, Texas and California raced to gerrymander their maps. Here’s the latest at the end of Thursday."
  },
  {
    "title": "What Do You Want to Read About Disability?",
    "link": "https://www.nytimes.com/2025/08/20/us/disability-stories-callout.html",
    "summary": "Input from readers will help shape our coverage."
  },
  {
    "title": "Minnesota’s Democratic Party Revokes Endorsement of Mayoral Candidate",
    "link": "https://www.nytimes.com/2025/08/21/us/minnesotas-democratic-party-revokes-endorsement-of-mayoral-candidate.html",
    "summary": "State Democratic officials withdrew the endorsement of a Minneapolis mayoral candidate who has drawn comparisons to Zohran Mamdani, the New York mayoral hopeful."
  },
  {
    "title": "U.S. Kills Islamic State Operative in Rare Raid in Syria",
    "link": "https://www.nytimes.com/2025/08/21/us/politics/islamic-state-us-raid-syria.html",
    "summary": "The Pentagon provided few details about the operation. But counterterrorism raids — as opposed to airstrikes — typically involve helicopter-borne commandos."
  },
  {
    "title": "Family of Slain New Jersey Woman Who Reported Harassment Says Police ‘Failed’",
    "link": "https://www.nytimes.com/2025/08/21/nyregion/semanchik-murder-new-jersey-police.html",
    "summary": "Dr. Lauren Semanchik told the police that she was “especially uncomfortable” because her ex-boyfriend was a state trooper. She and her boyfriend were later shot to death."
  }
]