[
  {
    "title": "Trump Says U.S. Oversight of Venezuela Could Last for Years",
    "link": "https://www.nytimes.com/2026/01/08/us/politics/trump-interview-venezuela.html",
    "summary": "In a wide-ranging interview with The New York Times on Wednesday, President Trump said “only time will tell” when it comes to how long the United States aims to control the country."
  },
  {
    "title": "Trump Sits Down With Times Reporters for Two-Hour Interview",
    "link": "https://www.nytimes.com/2026/01/08/us/trump-new-york-times-reporter-interview.html",
    "summary": "In a wide-ranging conversation with four Times reporters, President Trump talked about the Minneapolis ICE shooting, immigration, Venezuela and even his plans for further White House renovations."
  },
  {
    "title": "Colombia’s President Feared a U.S. Attack. Then Trump Called.",
    "link": "https://www.nytimes.com/2026/01/08/world/americas/colombia-petro-trump-venezuela.html",
    "summary": "The conversation appeared to defuse a crisis that erupted after President Trump said military action against Colombia “sounds good.” President Gustavo Petro spoke to The New York Times just before the call."
  },
  {
    "title": "The Latest on the ICE Killing in Minneapolis, and a Shadow Fleet of Oil Tankers",
    "link": "https://www.nytimes.com/2026/01/08/podcasts/the-headlines/ice-minneapolis-oil-tanker.html",
    "summary": "Plus, President Trump sits down with The Times."
  },
  {
    "title": "Minnesota’s Dispute With Trump Administration Boils Over After ICE Shooting",
    "link": "https://www.nytimes.com/2026/01/07/us/minnesota-shooting-trump-walz-frey.html",
    "summary": "The contradicting accounts of the ICE shooting in Minneapolis from the federal government and officials in Minnesota were the latest episode in a dispute that has been building for weeks."
  },
  {
    "title": "We Pressed Trump on His Conclusion About the ICE Shooting in Minneapolis. Here’s What He Said.",
    "link": "https://www.nytimes.com/2026/01/08/us/politics/trump-minnesota-ice-shooting-video.html",
    "summary": "The exchange was a glimpse into the president’s reflexive defense of his federal crackdown on immigration."
  },
  {
    "title": "When It Comes to Russia, Trump Navigates Conflicting Goals",
    "link": "https://www.nytimes.com/2026/01/08/us/politics/trump-russia-goals.html",
    "summary": "President Trump’s efforts to court President Vladimir V. Putin of Russia are rife with contradictions about stability and displays of American power."
  },
  {
    "title": "During Maduro Raid in Venezuela, a Close Call for Helicopters and Trump’s Plan",
    "link": "https://www.nytimes.com/2026/01/07/us/politics/trump-venezuela-helicopter.html",
    "summary": "As a damaged U.S. helicopter struggled to stay aloft over Venezuela’s capital, the success of the entire operation hung in the balance."
  },
  {
    "title": "The Smithsonian Faces New Pressure to Submit to Trump’s Will",
    "link": "https://www.nytimes.com/2026/01/08/arts/design/smithsonian-trump-pressure.html",
    "summary": "The institution, long regarded as independent, is facing a White House deadline to hand over records about its content and will see turnover that could reshape its governing board."
  },
  {
    "title": "Push to Audit Private Equity and Venture Capital Falters Under Trump",
    "link": "https://www.nytimes.com/2026/01/08/business/irs-private-equity-venture-capital-audits.html",
    "summary": "Specialists have left the I.R.S. and audits have been abandoned since the president returned to office."
  },
  {
    "title": "Trump Withdraws the U.S. From More International Organizations",
    "link": "https://www.nytimes.com/2026/01/07/us/politics/trump-withdraw-un-organizations.html",
    "summary": "The executive order the president signed Wednesday follows a broader vision of American foreign policy that shuns coalition building and the consensus of nations."
  },
  {
    "title": "Brown Shooting Suspect’s Descent from Brilliant Friend to Angry Loner",
    "link": "https://www.nytimes.com/2026/01/08/us/brown-shooting-suspect-claudio-valente-portugal.html",
    "summary": "After Claudio Neves Valente was accused of killing two Brown students and a M.I.T. professor, former classmates recalled how he yearned to go to M.I.T. himself and failed, adding to his growing list of resentments."
  },
  {
    "title": "How One Death Underscores the Suicide Risk for Construction Workers",
    "link": "https://www.nytimes.com/2026/01/08/realestate/construction-industry-suicides.html",
    "summary": "The death of TJ Kimball was a private tragedy that underscores a widespread risk in the stressful field."
  },
  {
    "title": "Why Russian Tourists Are Flocking to Southern China’s Beaches",
    "link": "https://www.nytimes.com/2026/01/08/world/asia/china-hainan-russian-tourists.html",
    "summary": "Russians find a refuge on the beaches of Sanya from sanctions and “sideways looks,” toasting the New Year beside a Chinese nuclear submarine base."
  },
  {
    "title": "Steny Hoyer, Longest-Serving House Democrat, to Retire From Congress",
    "link": "https://www.nytimes.com/2026/01/07/us/politics/hoyer-house-democrat-retire-congress.html",
    "summary": "The Maryland congressman, who served as one of his party’s top leaders, plans to depart after nearly half a century in Congress, as his party looks toward generational change."
  },
  {
    "title": "Josh Shapiro Begins a Re-election Bid That Carries Implications for 2028",
    "link": "https://www.nytimes.com/2026/01/08/us/politics/josh-shapiro-pennsylvania-governor-2028.html",
    "summary": "The Pennsylvania governor starts out as a clear favorite, but Republicans are trying to make him sweat."
  },
  {
    "title": "Mamdani Hosts Influencer Summit, Sidestepping Traditional Media",
    "link": "https://www.nytimes.com/2026/01/07/business/media/zohran-mamdani-social-media-creators.html",
    "summary": "A friendly summit at New York’s City Hall with digital content creators and social media stars symbolized the new mayor’s attitude toward the changing news media."
  },
  {
    "title": "Can Claire Valdez, a Mamdani Ally, Become New York’s Next Socialist in Congress?",
    "link": "https://www.nytimes.com/2026/01/08/nyregion/claire-valdez-congress-mamdani.html",
    "summary": "Claire Valdez, a New York assemblywoman, will face the Brooklyn borough president in a Democratic primary race to replace Representative Nydia Velázquez."
  },
  {
    "title": "This City’s Housing Boom Is a Model for Mamdani",
    "link": "https://www.nytimes.com/2026/01/08/nyregion/jersey-city-housing.html",
    "summary": "Mayor Zohran Mamdani is eyeing Jersey City, N.J., for ideas as he looks to address New York’s housing crisis. For residents, the surge in development has been a mixed blessing."
  },
  {
    "title": "Protests Spread in Iran, and Crackdowns Escalate",
    "link": "https://www.nytimes.com/2026/01/07/world/middleeast/iran-protest-crackdown.html",
    "summary": "Bazaars were shuttered and demonstrators met with violence from security forces amid rising anger about the country’s dire economic situation."
  },
  {
    "title": "Kennedy Is Telling Americans How to Eat. It’s Not Crazy Advice.",
    "link": "https://www.nytimes.com/2026/01/08/opinion/dietary-guidelines-protein.html",
    "summary": "Newly released dietary guidelines emphasize protein and full-fat dairy."
  },
  {
    "title": "My Grandfather Sexually Abused Countless Children. Could He Have Been Stopped?",
    "link": "https://www.nytimes.com/2026/01/08/opinion/child-sexual-abuse-prevention.html",
    "summary": "We spend billions of dollars on punishing child sexual abusers and far less on prevention. It’s not stopping the problem. We must rethink our approach."
  },
  {
    "title": "Late Night Responds to Trump’s Bid to Be an Oil Baron",
    "link": "https://www.nytimes.com/2026/01/08/arts/television/late-night-trump-oil-venezuela.html",
    "summary": "Jimmy Kimmel said it was good President Trump would be in charge of Venezuela’s oil sales: “That way we know it will be spent honestly.”"
  },
  {
    "title": "Minimum Wage Rises in Some States as Workers Struggle With Basic Costs",
    "link": "https://www.nytimes.com/2026/01/08/us/minimum-wage-increases.html",
    "summary": "This year, for the first time, more Americans will earn a minimum wage of $15 per hour or higher than will earn the federal minimum of $7.25 per hour."
  },
  {
    "title": "2 Killed in Shooting Outside Mormon Church in Salt Lake City",
    "link": "https://www.nytimes.com/2026/01/08/us/salt-lake-city-church-shooting.html",
    "summary": "The shooting did not appear to be a targeted attack against the church and seemed to stem from an altercation in its parking lot, the police said."
  },
  {
    "title": "Even Without Hurricanes, U.S. Disaster Costs Surpassed $100 Billion Last Year",
    "link": "https://www.nytimes.com/2026/01/08/climate/us-disaster-damage-costs-2025.html",
    "summary": "A record-setting 21 thunderstorm events each caused at least $1 billion in damages, a sign that more people and property are in harm’s way."
  },
  {
    "title": "China Is Investigating Meta’s Latest A.I. Acquisition",
    "link": "https://www.nytimes.com/2026/01/08/business/meta-manus-china-ai.html",
    "summary": "Regulators said they will look at whether the deal for Manus, a Singapore start-up with Chinese roots, complied with China’s export and investment rules."
  }
]