[
  {
    "title": "FAA Warns of Air Traffic Cuts Friday if Government Shutdown Continues",
    "link": "https://www.nytimes.com/2025/11/05/us/politics/faa-flights-air-traffic-government-shutdown.html",
    "summary": "The plan, which officials said was intended to help air traffic controllers, could force the cancellation of thousands of flights as the administration seeks to pressure Democrats to end the shutdown."
  },
  {
    "title": "‘Broken My Hope’: Trump’s Move to Slash Refugee Arrivals Ricochets Widely",
    "link": "https://www.nytimes.com/2025/11/06/world/asia/trump-refugee-cap-despair.html",
    "summary": "President Trump’s policy has shut the door on all but a tiny fraction of people across the world seeking refuge in the United States from conflict, persecution or both."
  },
  {
    "title": "A Big Test for Trump’s Tariffs, and Major Cuts to Air Traffic",
    "link": "https://www.nytimes.com/2025/11/06/podcasts/the-headlines/trump-tariffs-air-traffic-cuts-shutdown.html",
    "summary": "Plus, using A.I. to find a date."
  },
  {
    "title": "As Mamdani Surges Ahead, Schumer Risks Finding Himself Left Behind",
    "link": "https://www.nytimes.com/2025/11/06/nyregion/schumer-mamdani-democrats-new-york.html",
    "summary": "The rise of New York City’s mayor-elect comes at a complicated moment in the career of Senator Chuck Schumer, who is in danger of looking out of touch with the prevailing energy back home."
  },
  {
    "title": "An Emboldened Mamdani Sheds Conciliatory Tone",
    "link": "https://www.nytimes.com/2025/11/05/nyregion/zohran-mamdani-wins-interview.html",
    "summary": "Fresh from a stunning victory, Zohran Mamdani, the mayor-elect, said in an interview that his supporters wanted “a politics of consistency” and aggressive action, including on taxing the rich."
  },
  {
    "title": "Trump vs. Mamdani: President Sees a Capable Foil in New York’s Next Mayor",
    "link": "https://www.nytimes.com/2025/11/05/us/politics/trump-mamdani-showdown.html",
    "summary": "President Trump has berated Zohran Mamdani, the mayor-elect of New York City, in public. But privately, Mr. Trump describes him as slick and a good talker."
  },
  {
    "title": "5 Pressing Housing Issues for Mamdani, From Airbnb to Angry Landlords",
    "link": "https://www.nytimes.com/2025/11/06/nyregion/zohran-mamdani-housing.html",
    "summary": "When Zohran Mamdani becomes mayor, he will immediately have to confront a host of issues that have little to do with “freezing the rent,” his main housing-related pledge."
  },
  {
    "title": "A Skeptical Supreme Court Puts Trump’s Tariffs and Economic Agenda in Question",
    "link": "https://www.nytimes.com/2025/11/06/us/politics/supreme-court-trump-tariffs.html",
    "summary": "President Trump has used his sweeping global tariffs as an economic tool and a political cudgel. A decision invalidating them could hamper his power."
  },
  {
    "title": "Democrats Won Big Because They Won Over Trump Supporters",
    "link": "https://www.nytimes.com/2025/11/06/upshot/election-turnout-trump-hispanics.html",
    "summary": "It wasn’t just about superior turnout. Party switchers played a significant role in Virginia and New Jersey."
  },
  {
    "title": "Nick Fuentes’s Rise Puts MAGA Movement in a ‘Time of Choosing’",
    "link": "https://www.nytimes.com/2025/11/06/us/politics/nick-fuentes-trump.html",
    "summary": "After Mr. Fuentes’s interview with Tucker Carlson, Republicans are considering just how far his views are from the nationalism embraced by President Trump’s followers."
  },
  {
    "title": "Republicans Point Fingers After Election Losses, but Not at Trump",
    "link": "https://www.nytimes.com/2025/11/05/us/politics/republicans-elections-trump.html",
    "summary": "Casting around for culprits, leaders in the party blamed their candidates, the government shutdown and a weak economic message."
  },
  {
    "title": "The Florentine Diamond Resurfaces After 100 Years in Hiding",
    "link": "https://www.nytimes.com/2025/11/06/arts/design/florentine-diamond-resurfaces-hapsburg.html",
    "summary": "A legendary jewel of the Hapsburg dynasty — not seen since 1919 and thought lost, stolen or recut — has actually been safe in a Canadian bank for decades."
  },
  {
    "title": "The ‘Worst Test in Medicine’ Is Driving America’s High C-Section Rate",
    "link": "https://www.nytimes.com/2025/11/06/health/electronic-fetal-monitoring-c-sections.html",
    "summary": "Round-the-clock fetal monitoring leads to unnecessary C-sections. But it’s used in nearly every birth because of business and legal concerns, The Times found."
  },
  {
    "title": "A Grave Condition Caused by C-Sections Is on the Rise",
    "link": "https://www.nytimes.com/2025/11/06/health/placenta-accreta-c-sections.html",
    "summary": "Placenta accreta is a life-threatening condition in which the placenta attaches to scar tissue left by a C-section. It used to be extremely rare."
  },
  {
    "title": "Russia Close to Its Biggest Capture of a Ukrainian City Since 2023",
    "link": "https://www.nytimes.com/2025/11/06/world/europe/ukraine-war-pokrovsk-frontline.html",
    "summary": "The Kremlin is focusing its fire on Pokrovsk, a gateway to the Donetsk region, which Russia’s president, Vladimir V. Putin, has long coveted."
  },
  {
    "title": "In Russia, Bookstores Offer a Shrinking Refuge as Censorship Tightens",
    "link": "https://www.nytimes.com/2025/11/05/world/europe/russia-bookstores-refuge-censorship.html",
    "summary": "Restrictions on publishers and sellers have grown more severe. Volumes are being pulled from shelves or redacted like secret documents, but bookstores remain important sources of community."
  },
  {
    "title": "Would Elon Musk Work Harder for $1 Trillion Than $1 Billion?",
    "link": "https://www.nytimes.com/2025/11/06/business/elon-musk-tesla-trillion-dollar.html",
    "summary": "Economists and psychologists say that compensation may not provide as powerful an incentive as is often assumed."
  },
  {
    "title": "Remains of the Last American Hostage Held in Gaza Returned to Israel",
    "link": "https://www.nytimes.com/2025/11/05/world/middleeast/american-hostage-body-gaza.html",
    "summary": "Israeli officials told Itay Chen’s family last year that he was probably killed on Oct. 7, 2023, but relatives put off mourning until his body had come home."
  },
  {
    "title": "Mexico’s President Presses Charges Against Man Who Groped Her on the Street",
    "link": "https://www.nytimes.com/2025/11/05/world/americas/sheinbaum-man-video-charges.html",
    "summary": "A video of a man touching Mexico’s first female president, Claudia Sheinbaum, shocked many Mexicans but did not surprise them. “It’s so common,” one woman said."
  },
  {
    "title": "Canada Is About to Lose Its Status as Having Eliminated Measles",
    "link": "https://www.nytimes.com/2025/11/06/world/canada/canada-measles-elimination-measles.html",
    "summary": "One province with an outsized number of cases has seen a collision of politics and public health policy."
  },
  {
    "title": "The U.S. Is Skipping This Year’s Climate Summit. For Many, That’s OK.",
    "link": "https://www.nytimes.com/2025/11/06/climate/belem-brazi-cop30-trump.html",
    "summary": "World leaders, gathering in Brazil, will try to agree on new, more ambitious plans to cut greenhouse gases."
  },
  {
    "title": "COP30 U.N. Climate Talks Are Starting in Brazil. Here’s What to Know.",
    "link": "https://www.nytimes.com/2025/11/06/climate/what-is-cop30-belem.html",
    "summary": "Diplomats and leaders from around the world are gathering on the edge of the Amazon rainforest for annual talks on how to limit global warming."
  },
  {
    "title": "Rock Star Glamour and Centrist Pragmatism: Democrats Had It All",
    "link": "https://www.nytimes.com/2025/11/06/opinion/democrats-mamdani-sherrill-spanberger.html",
    "summary": "The constructive, if messy, path forward is for the party to embrace an all-of-the-above approach."
  },
  {
    "title": "Did Women Ruin the Workplace?",
    "link": "https://www.nytimes.com/2025/11/06/opinion/women-workplace-feminism-conservative.html",
    "summary": "And can conservative feminism fix it?"
  },
  {
    "title": "Late Night Celebrates a Consequential Election Day",
    "link": "https://www.nytimes.com/2025/11/06/arts/television/late-night-election-day-democrats.html",
    "summary": "“We needed a big night,” Jimmy Kimmel said. “Democrats have had fewer wins this year than the Jets.”"
  },
  {
    "title": "Analysis Finds Global Warming Made Hurricane Melissa More Damaging",
    "link": "https://www.nytimes.com/2025/11/06/climate/climate-change-hurricane-melissa.html",
    "summary": "Climate change enabled the storm to churn faster and grow more quickly, a rapid analysis found."
  },
  {
    "title": "In China, Victims of Abuse Are Told to ‘Keep It in the Family’",
    "link": "https://www.nytimes.com/2025/11/06/world/asia/china-domestic-violence-police.html",
    "summary": "Cases of domestic violence in China point to a legal system that looks good on paper but is failing victims because of a lack of resources and political will."
  },
  {
    "title": "Philippines Faces Grim Typhoon Aftermath as Another Storm Nears",
    "link": "https://www.nytimes.com/2025/11/06/world/asia/philippines-typhoon-kalmaegi-aftermath.html",
    "summary": "As the death toll for Typhoon Kalmaegi rose into the triple digits, the country braced for another tropical storm expected this weekend."
  },
  {
    "title": "Miss Universe Organizer Apologizes After Tirade at Miss Mexico",
    "link": "https://www.nytimes.com/2025/11/06/world/asia/miss-universe-walkout-mexico-thailand.html",
    "summary": "Several contestants walked out of a Miss Universe event this week when the pageant director berated Miss Mexico for not taking part in promotional activities."
  }
]