[
  {
    "title": "Supreme Court Clears Way for Texas to Use Republican-Friendly Redistricting Maps",
    "link": "https://www.nytimes.com/2025/12/04/us/politics/supreme-court-texas-congressional-maps.html",
    "summary": "Texas officials had asked the court to allow the state to use the new maps in the midterm elections, part of a push by President Trump to gain a partisan advantage."
  },
  {
    "title": "Florida Republicans Start Redistricting Talks, but Some Aren’t in a Rush",
    "link": "https://www.nytimes.com/2025/12/04/us/florida-redistricting-republicans.html",
    "summary": "Redistricting talks in Florida got off to a slow start on Thursday, as state lawmakers grapple with political and legal questions amid internal power struggles."
  },
  {
    "title": "Trump Switches Architects for White House Ballroom Project",
    "link": "https://www.nytimes.com/2025/12/04/us/politics/trump-ballroom-white-house-construction.html",
    "summary": "The president had clashed with the original designer and insisted on increasing the size and scope of the ballroom on a short timeline."
  },
  {
    "title": "Groups Express Anixety as Trump Threatens to Derail U.S.-Mexico-Canada Trade Pact",
    "link": "https://www.nytimes.com/2025/12/04/business/economy/trump-north-american-trade-deal.html",
    "summary": "Hearings that began Wednesday in Washington reflected anxiety over the future of the U.S.-Mexico-Canada trade pact and whether the president could end up scrapping it."
  },
  {
    "title": "Days After Trump Pardoned One Honduran Politician, Another Gets 22 Years",
    "link": "https://www.nytimes.com/2025/12/04/nyregion/honduras-congressman-drug-sentence.html",
    "summary": "President Trump pardoned the former Honduran president, who had been convicted for drug trafficking. Midence Oqueli Martinez Turcios, a former congressman, got nearly 22 years."
  },
  {
    "title": "Boat Strike Video Shown to Lawmakers",
    "link": "https://www.nytimes.com/2025/12/04/us/politics/drug-boat-strikes-sept-2-video-congress.html",
    "summary": "Gen. Dan Caine, chairman of the Joint Chiefs of Staff, and Adm. Frank M. Bradley, commander of the operation, met with members of Congress behind closed doors."
  },
  {
    "title": "Takeaways From the Pentagon Investigation on Hegseth’s Use of Signal",
    "link": "https://www.nytimes.com/2025/12/04/us/politics/pentagon-investigation-hegseth-signal.html",
    "summary": "The inspector general concluded that the defense secretary violated the Pentagon’s instructions on using a private electronic device to share sensitive information."
  },
  {
    "title": "Her Roof Was About to Be Fixed. Then Immigration Agents Showed Up.",
    "link": "https://www.nytimes.com/2025/12/04/us/new-orleans-border-patrol-immigration-home-repair.html",
    "summary": "The Trump administration’s deportation agenda is reverberating beyond immigrant communities as agents begin fanning out around New Orleans."
  },
  {
    "title": "ICE Separates Boy, 6, From Father During Effort to Deport Them to China",
    "link": "https://www.nytimes.com/2025/12/04/nyregion/chinese-father-son-migrants-separated.html",
    "summary": "The child and his father fled China earlier this year and the boy had just been enrolled in school. Federal officials have tried and failed to send them back."
  },
  {
    "title": "Tim Walz Calls Trump’s Tirade Against Somalis in Minnesota ‘Vile’",
    "link": "https://www.nytimes.com/2025/12/04/us/tim-walz-trump-somalia-minnesota.html",
    "summary": "Minnesota’s governor said the president’s xenophobic remarks were dangerous as the state continued to face fiscal questions about a fraud scandal."
  },
  {
    "title": "Best TV Shows of 2025",
    "link": "https://www.nytimes.com/2025/12/04/arts/television/best-tv-shows-of-2025.html",
    "summary": "Many of the year’s best series seemed to be in conversation with one another, including “Severance,” “The Pitt,” “Andor,” “Pluribus,” “The Lowdown” and others."
  },
  {
    "title": "Suspect Arrested in Inquiry Into Pipe Bombs in D.C. Ahead of Jan. 6 Riot",
    "link": "https://www.nytimes.com/2025/12/04/us/politics/washington-dc-pipe-bombs-arrest-jan-6-fbi.html",
    "summary": "The suspect was described as a 30-year-old man from Prince William County, Va. His arrest could ultimately provide an answer to one of the mysteries arising from the Jan. 6. attack."
  },
  {
    "title": "Inside RFK Jr.’s Methodical Quest to Shake Up America’s Vaccine System",
    "link": "https://www.nytimes.com/2025/12/04/us/politics/rfk-vaccines-hhs-trump.html",
    "summary": "The health secretary has walled himself off from government scientists and empowered fellow activists to pursue his vaccine agenda."
  },
  {
    "title": "Vaccine Advisory Panel Again Postpones Vote on Hepatitis B Shot for Newborns",
    "link": "https://www.nytimes.com/2025/12/04/health/cdc-vaccine-committee-newborns-hepatitis-b.html",
    "summary": "After heated disagreements, the committee members, appointed by Health Secretary Robert F. Kennedy Jr., delayed the vote until Friday morning. It was the third time the vote had been postponed."
  },
  {
    "title": "In Her 90s, a Painter Finally Confronts Her Nazi Trauma",
    "link": "https://www.nytimes.com/2025/12/04/nyregion/cornelia-foss-little-red-nazi.html",
    "summary": "Cornelia Foss, better known as a confidante to other artists than as an artist herself, has put aside landscape painting for something far more visceral."
  },
  {
    "title": "Eurovision Is in Turmoil as Israel’s Participation Leads to Boycott",
    "link": "https://www.nytimes.com/2025/12/04/arts/music/eurovision-israel-boycott.html",
    "summary": "The Netherlands and Slovenia also said they would not take part in next year’s contest, meant to be its celebratory 70th edition."
  },
  {
    "title": "Meta Weighs Cuts to Its Metaverse Unit",
    "link": "https://www.nytimes.com/2025/12/04/technology/meta-cuts-metaverse-unit.html",
    "summary": "Meta plans to direct its investments to focus on wearables like its augmented reality glasses but does not plan to abandon building the metaverse."
  },
  {
    "title": "A.I. Deal Making Is Getting Faster",
    "link": "https://www.nytimes.com/2025/12/04/technology/ai-deal-making-faster.html",
    "summary": "Investors are deciding within 15 minutes whether to shovel millions into A.I. start-ups and taking entrepreneurs weight lifting and rock climbing to get deals done."
  },
  {
    "title": "Macron Urges Xi to Help End War in Ukraine",
    "link": "https://www.nytimes.com/2025/12/04/world/asia/china-france-macron-ukraine.html",
    "summary": "As President Emmanuel Macron of France visited China, its leader, Xi Jinping, said his country would play a constructive role in ending the fighting."
  },
  {
    "title": "Amid Russian Sabotage, U.K. Points Finger at Putin Over Novichok Death",
    "link": "https://www.nytimes.com/2025/12/04/world/europe/putin-novichok-salisbury-skripal-poisoning.html",
    "summary": "The 2018 death of a British woman from exposure to a rare, military-grade nerve agent was the result of a botched assassination attempt on a former Russian spy, an official report said on Thursday."
  },
  {
    "title": "What to Know About Putin’s Visit to India as Oil Trade Dries Up",
    "link": "https://www.nytimes.com/2025/12/03/world/asia/india-russia-putin-visit-arms.html",
    "summary": "The Trump administration, which crippled Russia’s oil sales to India with sanctions, will be watching Mr. Putin’s talks with Prime Minister Narendra Modi."
  },
  {
    "title": "Ilhan Omar: Somali Americans Aren’t Afraid of Trump’s Bigotry",
    "link": "https://www.nytimes.com/2025/12/04/opinion/ilhan-omar-somalia-trump.html",
    "summary": "Attacks on Somali Americans are a cruel distraction."
  },
  {
    "title": "The One Child Policy’s Legacy: A Surplus of Single Men",
    "link": "https://www.nytimes.com/2025/12/04/opinion/china-dating-men-one-child-policy.html",
    "summary": "A decade after the end of the one-child policy, China has over 30 million so-called surplus men. Can this dating boot camp help them find love?"
  },
  {
    "title": "Lawmakers Split on the Military’s Defense of Boat Strikes",
    "link": "https://www.nytimes.com/2025/12/04/briefing/boat-strikes-congress-reading-gifts.html",
    "summary": "Also, a man was arrested on charges of planting pipe bombs before Jan. 6. Here’s the latest at the end of Thursday."
  },
  {
    "title": "Stellantis Is in Default for Moving Jeep Production to U.S., Canada Says",
    "link": "https://www.nytimes.com/2025/12/04/world/canada/lawsuit-stellantis-us-jeep-production.html",
    "summary": "The automaker switched production from Ontario in a bid to please President Trump. But the company defaulted on contracts covering hundreds of millions of dollars in assistance, Canada said."
  },
  {
    "title": "Biden to Attend First Event for Presidential Library",
    "link": "https://www.nytimes.com/2025/12/04/us/politics/biden-presidential-library.html",
    "summary": "His plans for the library have been slow to take shape, but he has invited potential donors to a holiday reception in Washington this month."
  },
  {
    "title": "How Israel’s Settlement Surge in the West Bank Is Displacing Palestinians",
    "link": "https://www.nytimes.com/2025/12/04/world/middleeast/israel-west-bank-settlements-palestinians.html",
    "summary": "The Israeli government authorized 22 settlements in May, the largest expansion in decades, and Palestinian families are now being forced from their homes."
  },
  {
    "title": "Charles Norman Shay, Tribal Elder and World War II Hero, Dies at 101",
    "link": "https://www.nytimes.com/2025/12/04/us/politics/charles-norman-shay-dead.html",
    "summary": "As a 19-year-old medic, he won a Silver Star for his service during D-Day. Later, in the Korean War, he earned a Bronze Star."
  }
]