[
  {
    "title": "Trump Organization Is Said to Be in Talks on a Saudi Government Real Estate Deal",
    "link": "https://www.nytimes.com/2025/11/15/world/middleeast/trump-organization-saudi-development-deal.html",
    "summary": "The chief executive of a Saudi firm says a Trump-branded project is “just a matter of time.” The Trump Organization’s major foreign partner is also signaling new Saudi deals."
  },
  {
    "title": "U.S. Border Patrol Launches Operation in Charlotte, N.C.",
    "link": "https://www.nytimes.com/2025/11/15/us/us-border-patrol-charlotte-nc-immigration.html",
    "summary": "It is unclear how long the operation will last in North Carolina’s largest city, which has a growing immigrant population."
  },
  {
    "title": "Former Fed Official Violated Trading Rules, Disclosures Show",
    "link": "https://www.nytimes.com/2025/11/15/business/economy/fed-kugler-financial-disclosures.html",
    "summary": "Adriana D. Kugler, who stepped down as a governor in August, reported trades in stocks, including Apple and Southwest Airlines, in 2024."
  },
  {
    "title": "A Tiny West Wing Office Is Big on Trump Messaging",
    "link": "https://www.nytimes.com/2025/11/14/us/trump-oval-office-study-merch.html",
    "summary": "The Oval Office study has become a room for Trump merchandise."
  },
  {
    "title": "Gallego Pitches Demoralized Democrats on a Midterm Message",
    "link": "https://www.nytimes.com/2025/11/15/us/politics/ruben-gallego-democrats-midterms.html",
    "summary": "At a health care town hall in his swing state, Senator Ruben Gallego, Democrat of Arizona, test-drove his party’s new political pitch to an audience disappointed in the outcome of the shutdown."
  },
  {
    "title": "Fetterman Is Released From the Hospital After a Fall",
    "link": "https://www.nytimes.com/2025/11/15/us/john-fetterman-fall-hospital-released.html",
    "summary": "The Pennsylvania senator was hospitalized on Thursday after he fell during a morning walk near his home in Braddock, Pa. He required 20 stitches."
  },
  {
    "title": "Once He Was ‘Just Asking Questions.’ Now Tucker Carlson Is the Question.",
    "link": "https://www.nytimes.com/2025/11/15/us/politics/tucker-carlson-fuentes.html",
    "summary": "The conservative commentator has further fractured the right with his anti-Israel rhetoric and sympathy for a white nationalist. He’s not in the mood to apologize."
  },
  {
    "title": "What’s More Dangerous than India’s Frequent Heat Waves? Heat Stress.",
    "link": "https://www.nytimes.com/2025/11/16/world/asia/heat-stress-women-india.html",
    "summary": "Women who face long-term heat exposure in workplaces and homes are finding it takes a heavy toll on their health and income."
  },
  {
    "title": "How Many People Die in India From Hot Weather? Nobody Really Knows.",
    "link": "https://www.nytimes.com/2025/11/16/world/asia/india-heat-wave-deaths.html",
    "summary": "Officials have yet to grasp the magnitude of heat-related deaths, let alone effectively deal with the problem, public health experts and scientists say."
  },
  {
    "title": "Storm Pounds Southern California With Heavy Rains and Some Flooding",
    "link": "https://www.nytimes.com/2025/11/14/weather/california-rain-flood-storm-los-angeles-forecast.html",
    "summary": "Evacuation orders were lifted in Los Angeles County after an unusually powerful storm brought heavy rain and prompted concerns about mudslides. At least two deaths were linked to the storm."
  },
  {
    "title": "The Laptop That Ate Your Child’s Classroom",
    "link": "https://www.nytimes.com/2025/11/16/opinion/laptop-classroom-test-scores.html",
    "summary": "Asking students to drill down on their schoolwork amid an array of digital distractions is inimical to learning."
  },
  {
    "title": "Adam Sandler Is the Light We Need",
    "link": "https://www.nytimes.com/2025/11/16/opinion/adam-sandler-comedy-fun-light.html",
    "summary": "When I took my dad to see Adam Sandler live, I expected to laugh. We both got so much more."
  },
  {
    "title": "Displaced Gazans Face More Misery as Torrential Rain Lashes Enclave",
    "link": "https://www.nytimes.com/2025/11/15/world/middleeast/gazan-winter-tent-camps.html",
    "summary": "Heavy rainfall and chilling winds have added to the challenges facing people still forced to live in tents in the devastated territory."
  },
  {
    "title": "4 Dead After Suspected Migrant Boat Overturns Near a San Diego Area Beach",
    "link": "https://www.nytimes.com/2025/11/15/us/panga-boat-capsizes-imperial-beach.html",
    "summary": "The boat capsized off the coast, officials said. Four people were taken to a hospital and one person was taken into custody."
  },
  {
    "title": "Alice Wong, Writer and Relentless Advocate for Disability Rights, Dies at 51",
    "link": "https://www.nytimes.com/2025/11/15/us/alice-wong-dead.html",
    "summary": "Born with muscular dystrophy, she received a MacArthur “Genius” grant in 2024 for her decades of calling attention to the need for equal rights for disabled people."
  }
]