[
  {
    "title": "D.C. Shooting Suspect Worked With C.I.A.-Backed Unit in Afghanistan",
    "link": "https://www.nytimes.com/2025/11/27/us/national-guard-dc-shooting-suspect-cia-afghanistan.html",
    "summary": "The C.I.A. and an Afghan intelligence official said that the shooter had been part of an Afghan “partner force,” known as a Zero Unit, trained and supported by the agency in the southern province of Kandahar."
  },
  {
    "title": "What We Know About the National Guard Shooting in D.C. and the Suspect",
    "link": "https://www.nytimes.com/2025/11/26/us/national-guard-dc-shooting-suspect.html",
    "summary": "Two National Guard members are in critical condition after the attack near the White House on the eve of Thanksgiving. The suspect is a 29-year-old Afghan man."
  },
  {
    "title": "Hong Kong’s Worst Fire in Decades Fuels Scrutiny of Safety Lapses",
    "link": "https://www.nytimes.com/2025/11/27/world/asia/hong-kong-fire-tai-po-apartment-buildings.html",
    "summary": "The authorities said flammable netting and foam boards may have fueled the city’s deadliest blaze in nearly 70 years, killing more than 80 and prompting arrests."
  },
  {
    "title": "‘No Alarm Went Off’: Hong Kong Fire Survivor Recounts Harrowing Escape",
    "link": "https://www.nytimes.com/2025/11/27/world/asia/hong-kong-fire-survivors-escape.html",
    "summary": "Many windows were covered, preventing residents from seeing the fire and smoke, one survivor said."
  },
  {
    "title": "Hong Kong Arrests 3 Tied to Construction Company After Deadly Apartment Fire",
    "link": "https://www.nytimes.com/2025/11/26/world/asia/arrests-hong-kong-fire-manslaughter.html",
    "summary": "The police said that building materials used by the company for the work at Wang Fuk Court may not have been up to fire safety standards. The police did not identify the company or who was arrested."
  },
  {
    "title": "U.S. Has Limited Knowledge of Those It Kills in Boat Strikes",
    "link": "https://www.nytimes.com/2025/11/27/us/politics/us-military-boat-strikes.html",
    "summary": "The U.S. military has killed more than 80 people since the campaign began in early September. But it does not know who specifically is being killed."
  },
  {
    "title": "U.S. to Press Europe and Other Allies on Immigration, Document Says",
    "link": "https://www.nytimes.com/2025/11/26/us/politics/trump-rubio-mass-migration.html",
    "summary": "American diplomats were told to raise U.S. concerns about “violent crimes associated with people of a migration background.”"
  },
  {
    "title": "Where the Waters Are Rough, a Fishing Town Confronts Trump’s Priorities",
    "link": "https://www.nytimes.com/2025/11/27/us/politics/newport-oregon-ice.html",
    "summary": "First, Newport, Ore., lost its Coast Guard rescue chopper. Then came the swirl of rumors and evidence that Immigration and Customs Enforcement was coming to town."
  },
  {
    "title": "Heading to the Mideast, Pope Leo May Show ‘Who He Really Is’",
    "link": "https://www.nytimes.com/2025/11/27/world/middleeast/pope-leo-trip.html",
    "summary": "The pontiff begins a trip to Turkey and Lebanon on Thursday — the first foreign voyage of his papacy, and his biggest test yet."
  },
  {
    "title": "Pope Leo Lands in Turkey, Planning to Meet Erdogan With a Message of Outreach",
    "link": "https://www.nytimes.com/2025/11/27/world/middleeast/pope-first-foreign-trip-turkey-erdogan.html",
    "summary": "President Recep Tayyip Erdogan received Leo XIV on the opening leg of a trip that will also include Lebanon."
  },
  {
    "title": "When Is My Thanksgiving Turkey Done? and More Thanksgiving Questions Answered",
    "link": "https://cooking.nytimes.com/article/thanksgiving-turkey-internal-temperature-done",
    "summary": "This is your year to be the turkey expert: Here’s how to know when to baste, how to carve and serve and more."
  },
  {
    "title": "I’ve Written About Loads of Scams. This Phone Scam Almost Got Me.",
    "link": "https://www.nytimes.com/2025/09/18/nyregion/zelle-chase-banking-scam.html",
    "summary": "The caller ID said “Chase Bank,” and the man on the line said I might be a victim of fraud. His supervisor would explain."
  },
  {
    "title": "Did a Brooklyn Couple Kill a Neighbor’s Trees for a Better View in Maine?",
    "link": "https://www.nytimes.com/2025/09/11/us/trees-poison.html",
    "summary": "Maine’s Board of Pesticides Control says two summer residents poisoned a neighbor’s trees so the couple, both Martha Stewart associates, could have a harbor view. They deny it."
  },
  {
    "title": "11 Women, 9 Dogs, Not Much Drama (and No Guys)",
    "link": "https://www.nytimes.com/2025/08/07/well/eleven-women-nine-dogs-not-much-drama-and-no-guys.html",
    "summary": "These retired women in Texas have been through infertility, illness, layoffs, addiction and disappointing marriages. Now they are trying to create a utopia just for themselves."
  },
  {
    "title": "Penn & Teller’s Secret to a 50-Year Partnership",
    "link": "https://www.nytimes.com/2025/08/17/arts/television/penn-teller-magicians-50-years.html",
    "summary": "As their magic act hits 50 years, they’re bigger than ever. They say their secret is not to socialize. But misdirection is also their love language."
  },
  {
    "title": "My Parents Expected to Be Retired. Instead, They Are Raising My Sister’s Kids.",
    "link": "https://www.nytimes.com/2025/05/18/magazine/grandparents-families-children-kids.html",
    "summary": "My mom and dad joined the millions of Americans who parent their children’s children — a beautiful responsibility that comes at a high cost."
  },
  {
    "title": "A Professor’s Final Gift to Her Students: Her Life Savings",
    "link": "https://www.nytimes.com/2025/05/11/us/cris-hassold-professor-new-college-will.html",
    "summary": "Cris Hassold, a professor at New College of Florida for 50 years, left a mark on her 31 favorite students. “I think about her almost every day,” one said."
  },
  {
    "title": "Sean Duffy Longs for the ‘Golden Days’ of Air Travel. What Was That Like?",
    "link": "https://www.nytimes.com/2025/11/27/travel/air-travel-sean-duffy.html",
    "summary": "Back in the ’50s and ’60s, passengers (well-dressed, of course, and with perfect manners) could count on hot meals on china, plenty of legroom, the occasional piano bar, even wool blankets. Those days are gone."
  },
  {
    "title": "Trump Cut Europe Out of Ukraine Talks. Here’s How Europe Pushed Back.",
    "link": "https://www.nytimes.com/2025/11/27/world/europe/europe-ukraine-trump.html",
    "summary": "European leaders were blindsided by President Trump’s 28-point-plan to end the Ukraine war, setting off a dash for influence."
  },
  {
    "title": "France Creates Voluntary Military Service as Europe Faces Russian Threat",
    "link": "https://www.nytimes.com/2025/11/27/world/europe/france-military-service.html",
    "summary": "The effort, aimed at young people, came after an army chief angered many by saying the country must accept the possible loss of “our children” in a future war."
  },
  {
    "title": "Putin Defends Witkoff Against Accusations of Pro-Russia Bias",
    "link": "https://www.nytimes.com/2025/11/27/world/europe/putin-witkoff-trump.html",
    "summary": "The Russian leader called the U.S. special envoy “an intelligent man” who is properly representing his country in peace negotiations."
  },
  {
    "title": "The Writer Who Dared Criticize Silicon Valley",
    "link": "https://www.nytimes.com/2025/11/27/technology/writer-silicon-valley-criticism.html",
    "summary": "Paulina Borsook’s “Cyberselfish,” which offered dire predictions about the tech world’s love for libertarianism, is finding fans. It only took 25 years."
  },
  {
    "title": "Beekeepers, Farmers and the Fight to Save a Century-Old Research Hub",
    "link": "https://www.nytimes.com/2025/11/27/us/politics/beekeepers-farmers-research-hub-barc.html",
    "summary": "Industry groups and scientists have urged the Trump administration to reconsider its plan to close a renowned Agriculture Department center in Maryland and disperse its work around the country."
  },
  {
    "title": "Gene Therapy Offer a Cure for Babies With the Deadly ‘Bubble Boy Disease’",
    "link": "https://www.nytimes.com/2025/11/27/well/bubble-boy-disease-gene-therapy.html",
    "summary": "“Bubble boy disease” was once a death sentence. A scientific breakthrough changed that."
  },
  {
    "title": "‘Stranger Things’ Cast Looks Back on the Show and How It Shaped Them",
    "link": "https://www.nytimes.com/2025/11/27/arts/television/stranger-things-cast-changes.html",
    "summary": "The first episodes of the final season just premiered on Netflix. In interviews, the young stars looked back on the show and how it shaped them."
  },
  {
    "title": "Labubu and KPop Demon Hunters Join Macy’s Thanksgiving Day Parade",
    "link": "https://www.nytimes.com/2025/11/27/nyregion/macys-thanksgiving-day-parade.html",
    "summary": "Crowds in New York City bundled up to take in the latest version of a tradition that has run for nearly a century."
  },
  {
    "title": "Winter Storm in Northern U.S. Expected to Snarl Post-Thanksgiving Travel",
    "link": "https://www.nytimes.com/2025/11/27/weather/winter-storm-thanksgiving-travel.html",
    "summary": "Forecasters say a winter storm could disrupt travel, dumping up to a foot of snow across parts of the Midwest through the holiday weekend."
  },
  {
    "title": "Robert A.M. Stern, Architect Who Reinvented Prewar Splendor, Dies at 86",
    "link": "https://www.nytimes.com/2025/11/27/arts/design/robert-am-stern-dead.html",
    "summary": "He designed museums, schools and libraries before winning international acclaim late in life for 15 Central Park West in Manhattan, hailed as a rebirth of the luxury apartment building."
  },
  {
    "title": "Time to Let My Brother Kevin Do the Carving",
    "link": "https://www.nytimes.com/2025/11/27/opinion/maureen-dowd-brother-thanksgiving-trump.html",
    "summary": "My brother takes a slice out of Trump and Mamdani."
  },
  {
    "title": "What Hunger Looks Like in America",
    "link": "https://www.nytimes.com/2025/11/27/opinion/hunger-food-insecurity-affordability.html",
    "summary": "We spoke with dozens of people living with hunger in the United States. These are their stories."
  },
  {
    "title": "This Thanksgiving, Everything Is Going to Be All Right",
    "link": "https://www.nytimes.com/2025/11/27/briefing/this-thanksgiving-everything-is-going-to-be-all-right.html",
    "summary": "A pep talk for the day."
  },
  {
    "title": "Tell Us How You Watch TV and Movies",
    "link": "https://www.nytimes.com/2025/11/21/business/media/movie-tv-habits.html",
    "summary": "The New York Times wants to learn more about how viewing habits are evolving."
  },
  {
    "title": "The British Public Thinks Immigration Is Up. It’s Actually Down, Sharply.",
    "link": "https://www.nytimes.com/2025/11/27/world/europe/uk-immigration-statistics.html",
    "summary": "Net migration to Britain has fallen by almost 80 percent from its 2023 peak, according to data released on Thursday."
  },
  {
    "title": "What to Know About the Coup in Guinea-Bissau",
    "link": "https://www.nytimes.com/2025/11/27/world/africa/guinea-bissau-coup.html",
    "summary": "The opposition claimed a new general has been put in charge of the government to help keep the current president in power."
  },
  {
    "title": "ABBA Voyage, the Popular London Hologram Show, Could Come to New York City",
    "link": "https://www.nytimes.com/2025/11/27/nyregion/abba-voyage-nyc.html",
    "summary": "ABBA Voyage, the popular London show, features holograph versions of the Swedish pop band when they were decades younger."
  },
  {
    "title": "Paul Ekman, Who Linked Facial Expressions to Universal Emotions, Dies at 91",
    "link": "https://www.nytimes.com/2025/11/26/science/paul-ekman-dead.html",
    "summary": "Often called the world’s most famous face reader, he inspired the TV show ‘Lie to Me.’ But some questioned his assumption that human expressions were ‘pan-cultural.’"
  }
]