[
  {
    "title": "Companies Have Shielded Buyers From Tariffs. But Not for Long.",
    "link": "https://www.nytimes.com/2025/10/24/business/economy/companies-have-shielded-buyers-from-tariffs-but-not-for-long.html",
    "summary": "Cars, toys and tea are among products set to get more expensive as tariffs weigh on corporate profits."
  },
  {
    "title": "A Major Crypto Pardon, and the N.B.A. Gambling Scandal With Mob Ties",
    "link": "https://www.nytimes.com/2025/10/24/podcasts/the-headlines/crypto-pardon-nba-gambling-scandal.html",
    "summary": "Plus, your Friday news quiz."
  },
  {
    "title": "Letitia James Case Shows Ruthlessness of Justice Dept. in Trump’s Grip",
    "link": "https://www.nytimes.com/2025/10/24/nyregion/trump-james-shame-campaign.html",
    "summary": "For the Trump administration, creating an aura of criminality around the indicted New York attorney general — through public scrutiny of her and her relatives — may be as important as a conviction."
  },
  {
    "title": "Letitia James to Appear in Court as Battle Over Trump-Urged Prosecution Begins",
    "link": "https://www.nytimes.com/2025/10/24/us/politics/letitia-james-court.html",
    "summary": "The New York attorney general, indicted by President Trump’s handpicked prosecutor in the Eastern District of Virginia, is expected to plead not guilty in her arraignment on Friday."
  },
  {
    "title": "Rebuilding Israeli-Held Parts of Gaza: Workable or Another U.S. Pipe Dream?",
    "link": "https://www.nytimes.com/2025/10/24/world/middleeast/gaza-rebuilding-israel-hamas-us.html",
    "summary": "There are many questions about whether the idea is feasible or doomed from the outset."
  },
  {
    "title": "Who Were the Palestinian Prisoners Freed by Israel?",
    "link": "https://www.nytimes.com/2025/10/24/world/middleeast/israel-palestinian-prisoners-freed.html",
    "summary": "Under the cease-fire deal, Israel released 250 Palestinians serving long sentences for violent attacks. More than 1,700 others had been detained in Gaza and held without charge."
  },
  {
    "title": "N.B.A. Gambling Scandal Reflects America’s Obsession With Sports Betting",
    "link": "https://www.nytimes.com/2025/10/24/nyregion/nba-sports-betting-gambling-scandal.html",
    "summary": "As legalized betting has become ubiquitous in American sport, the opportunities for cheating, like those outlined in a recent federal indictment, have multiplied."
  },
  {
    "title": "NBA Gambling Scandal: What We Know",
    "link": "https://www.nytimes.com/2025/10/23/nyregion/nba-gambling-scandal-explained.html",
    "summary": "Two indictments detailed schemes involving sports betting and rigged poker games, prosecutors said. The link was current and former N.B.A. players and coaches."
  },
  {
    "title": "Can Ken Burns Win the American Revolution?",
    "link": "https://www.nytimes.com/2025/10/23/arts/television/ken-burns-american-revolution.html",
    "summary": "Burns’s 12-hour documentary about our national origin story is landing in the middle of a culture war. Yes, it’s complicated. No, he does not want to talk about President Trump."
  },
  {
    "title": "On a Roll, European Leaders Meet to Bolster Support for Ukraine",
    "link": "https://www.nytimes.com/2025/10/24/world/europe/coalition-of-the-willing-zelensky-uk.html",
    "summary": "Britain, the host, is framing a meeting of the “coalition of the willing” as an effort to fortify Kyiv for the winter fighting months."
  },
  {
    "title": "Europe’s Persistence in Supporting Ukraine Is Bearing Fruit",
    "link": "https://www.nytimes.com/2025/10/24/world/europe/europe-ukraine-russia.html",
    "summary": "European leaders want to build on President Trump’s sanctions on Russia with new commitments of financial and military support for Kyiv."
  },
  {
    "title": "The U.S. and Europe Are Trying New Ways to Pressure Russia",
    "link": "https://www.nytimes.com/2025/10/23/world/europe/russia-oil-sanctions-prices.html",
    "summary": "For the first time in his second term, President Trump is imposing new sanctions, but they may not shift the course of Russia’s war in Ukraine."
  },
  {
    "title": "With Power Move on Rare Earths, China Plays Both Victim and Bully",
    "link": "https://www.nytimes.com/2025/10/24/world/asia/china-trade-trump.html",
    "summary": "In weaponizing its dominance over the crucial minerals, Beijing is using tactics that it once denounced, potentially alienating nations it wants to court."
  },
  {
    "title": "U.S. to Investigate China’s Compliance With 2020 Trade Deal",
    "link": "https://www.nytimes.com/2025/10/23/business/economy/us-china-trade-investigation.html",
    "summary": "The trade case is coming at a pivotal moment, before a meeting next week between President Trump and China’s leader."
  },
  {
    "title": "South Korea Tries to Curb Anti-China Protests Ahead of Xi Visit",
    "link": "https://www.nytimes.com/2025/10/24/world/asia/south-korea-china-protests.html",
    "summary": "The recent surge in demonstrations by far-right groups presents a challenge for the South Korean government, as it prepares to host both Xi Jinping, the leader of China, and President Trump."
  },
  {
    "title": "How San Francisco Mayor Daniel Lurie Avoided Trump’s Enforcement Surge",
    "link": "https://www.nytimes.com/2025/10/24/us/daniel-lurie-trump-san-francisco.html",
    "summary": "Daniel Lurie, the San Francisco mayor, relied on powerful tech executives and his own low-key approach to help his liberal city escape a rush of federal agents."
  },
  {
    "title": "Trump Official Warns California Against Arresting Federal Agents",
    "link": "https://www.nytimes.com/2025/10/24/us/federal-ice-agents-arrests-california-pelosi.html",
    "summary": "Deputy U.S. Attorney General Todd Blanche told top California leaders that they would be prosecuted if they arrested federal agents performing immigration raids."
  },
  {
    "title": "Can ICE Stop People Solely Based on Their Race?",
    "link": "https://www.nytimes.com/2025/10/24/us/ice-race-ethnicity-immigration.html",
    "summary": "For decades, federal officers have had to rely on more than race or ethnicity to stop and question someone over citizenship. That is now being tested."
  },
  {
    "title": "Trump’s Ballroom Project Claims 123-Year-Old East Wing",
    "link": "https://www.nytimes.com/2025/10/23/us/politics/east-wing-obituary.html",
    "summary": "Critics are outraged over President Trump’s demolition of the East Wing to make way for his $300 million ballroom. Others say it was time for change."
  },
  {
    "title": "Renovations at the White House Aren’t Unusual. But Trump’s Makeover Is.",
    "link": "https://www.nytimes.com/2025/10/24/style/renovations-at-the-white-house-arent-unusual-but-trumps-makeover-is.html",
    "summary": "Presidents have always tailored the White House to their needs, but with the demolition of the East Wing, a $300 million ballroom and other changes, President Trump isn’t wasting any time making it into his own project."
  },
  {
    "title": "From Truman to Trump: A Tale of Two White House Renovations",
    "link": "https://www.nytimes.com/2025/10/23/us/politics/white-house-renovations-trump-ballroom.html",
    "summary": "President Harry S. Truman consulted Congress, architects and a fine arts commission on everything from construction plans to fabric samples. President Trump is taking a different approach."
  },
  {
    "title": "The Peril of a White House That Flaunts Its Indifference to the Law",
    "link": "https://www.nytimes.com/2025/10/24/us/politics/white-house-boats-law.html",
    "summary": "The White House has made no legal argument explaining its bald claim that the president has wartime power to summarily kill people suspected of smuggling drugs."
  },
  {
    "title": "After Remark About Mamdani and Sept. 11, Cuomo Faces Democratic Rebukes",
    "link": "https://www.nytimes.com/2025/10/23/nyregion/cuomo-mamdani-sept-11.html",
    "summary": "When a radio host suggested that Zohran Mamdani would celebrate another Sept. 11-style attack, Andrew Cuomo chuckled. Democrats denounced the exchange as Islamophobic."
  },
  {
    "title": "There Are 6 NYC Ballot Measures. Here’s What to Know.",
    "link": "https://www.nytimes.com/2025/10/24/nyregion/nyc-ballot-measures-proposals.html",
    "summary": "Voters will have a chance to weigh in on ballot questions concerning the housing crisis and when local elections should be held."
  },
  {
    "title": "How to Vote Early in New York City, Where It’s Not Too Late to Register",
    "link": "https://www.nytimes.com/2025/10/24/nyregion/nyc-election-what-to-know.html",
    "summary": "New Yorkers can vote early in the race for mayor and other contests starting Saturday, Oct. 25 — which is also the voter registration deadline."
  },
  {
    "title": "Why Is There a Wasp Nest In the Living Room?",
    "link": "https://www.nytimes.com/2025/10/24/realestate/luxury-wasp-nest.html",
    "summary": "These variegated, collaged-looking nests — fetching up to $250 each — are a recent fixation in interior design."
  },
  {
    "title": "Crypto and Trump Corrupted America",
    "link": "https://www.nytimes.com/2025/10/24/opinion/crypto-trump-libertarianism-corruption.html",
    "summary": "Trump has bared the corruption at the heart of crypto and the libertarian ideas behind it."
  },
  {
    "title": "I Resented the White House Bitterly. Now I Mourn It.",
    "link": "https://www.nytimes.com/2025/10/24/opinion/east-wing-white-house-patti-davis-reagan.html",
    "summary": "The East Wing was where Eleanor Roosevelt walked. It was where Jacqueline Kennedy planned the Rose Garden. Now it’s all but gone."
  },
  {
    "title": "So Long, East Wing",
    "link": "https://www.nytimes.com/2025/10/24/briefing/so-long-east-wing.html",
    "summary": "We look back at the history of this corner of the White House."
  },
  {
    "title": "Stephen Colbert Tears Into the East Wing Demolition",
    "link": "https://www.nytimes.com/2025/10/24/arts/television/stephen-colbert-east-wing-demolition.html",
    "summary": "The East Wing now “looks like a rotisserie chicken your dog got into,” Colbert said on Thursday."
  },
  {
    "title": "Hollywood Weeps as Warner Bros. Hangs a Sale Sign",
    "link": "https://www.nytimes.com/2025/10/24/business/warner-bros-hollywood-reaction.html",
    "summary": "Losing the stand-alone studio, suddenly a real possibility, would be “heartbreaking,” one producer said."
  },
  {
    "title": "After the Mexican Cartel Comes, They Pick Up the Pieces",
    "link": "https://www.nytimes.com/2025/10/24/world/americas/mexico-sinaloa-cartel-deaths.html",
    "summary": "They arrive where the killings end, retrieving bodies, comforting families and bearing the emotional toll of a deadly struggle that shows no sign of stopping."
  },
  {
    "title": "India’s Most Valuable Export: Tens of Millions of Workers",
    "link": "https://www.nytimes.com/2025/10/24/business/india-labor-mobility-migration-germany-japan.html",
    "summary": "India plans to send its vast work force abroad to countries with labor shortages, like Germany and Japan."
  },
  {
    "title": "German Company Launches Ad After Its Lift Is Used in Louvre Heist",
    "link": "https://www.nytimes.com/2025/10/24/world/europe/louvre-robbery-german-campaign-bocker.html",
    "summary": "The brazen daylight robbery of the Louvre on Sunday has turned into a marketing opportunity for Böcker, a German maker of cranes and elevators whose product was used in the heist."
  }
]