[
  {
    "title": "Trump, Long Erratic on the World Stage, Reaches a New Level",
    "link": "https://www.nytimes.com/2025/10/26/us/politics/trump-erratic-foreign-policy.html",
    "summary": "Whether because of his increasingly mercurial approach or despite it, President Trump has won some foreign policy victories in his second term. The question now is whether he can build on his record."
  },
  {
    "title": "Japan Deals With the Price of Playing to Trump: $550 Billion",
    "link": "https://www.nytimes.com/2025/10/26/business/japan-investment-trump-tariffs.html",
    "summary": "A new prime minister must decide whether to maintain the previous administration’s deferential negotiating strategy that secured a contentious trade deal."
  },
  {
    "title": "How Canada Is Dealing With Its Latest Tussle With President Trump",
    "link": "https://www.nytimes.com/2025/10/26/us/politics/canada-tariffs-trump-carney.html",
    "summary": "Prime Minister Mark Carney is focusing on what the country can control, including looking for economic partnerships abroad, especially in Asia."
  },
  {
    "title": "‘No Idea How Long People Can Hold Out’: Federal Workers Feel Brunt of Shutdown",
    "link": "https://www.nytimes.com/2025/10/26/us/politics/federal-workers-shutdown-pay.html",
    "summary": "As more than one million government employees go without pay, many are turning to side jobs and food banks to make ends meet."
  },
  {
    "title": "Food Banks in U.S. Brace for Surging Demand as SNAP Aid Cutoff Looms",
    "link": "https://www.nytimes.com/2025/10/26/us/food-banks-snap-shutdown-hunger-trump.html",
    "summary": "Growing need and decreased resources are squeezing the charitable food system beyond its capacity, leaders say."
  },
  {
    "title": "Newsom Says He Will Consider a 2028 Presidential Run After the Midterms",
    "link": "https://www.nytimes.com/2025/10/26/us/politics/gavin-newsom-2028-race.html",
    "summary": "The California governor acknowledged in an interview Sunday on CBS that he would give the question serious thought after the 2026 elections."
  },
  {
    "title": "Caribbean Braces for Hurricane Melissa",
    "link": "https://www.nytimes.com/2025/10/26/world/americas/hurricane-melissa-caribbean-rain-flood.html",
    "summary": "A fast-developing storm was expected to bring “unprecedented” amounts of rain to several countries, meteorologists said."
  },
  {
    "title": "How Hurricane Melissa Rapidly Intensified",
    "link": "https://www.nytimes.com/2025/10/26/weather/hurricane-melissa-rapid-intensification-jamaica.html",
    "summary": "Melissa grew from a tropical storm to a Category 4 hurricane in a matter of hours."
  },
  {
    "title": "Cal State Invited Tech Companies to Remake Learning With A.I.",
    "link": "https://www.nytimes.com/2025/10/26/technology/cal-state-ai-amazon-openai.html",
    "summary": "Spurred by titans like Amazon and OpenAI, California State wants to become the nation’s “largest A.I.-empowered” university."
  },
  {
    "title": "Burevestnik Nuclear Missile Tests Successful, Russia Says",
    "link": "https://www.nytimes.com/2025/10/26/world/europe/russia-burevestnik-missile.html",
    "summary": "Because of its power source, the Burevestnik can remain airborne far longer than other nuclear-armed missiles."
  },
  {
    "title": "The Odd History of the Rowhouse at the Center of the N.B.A. Betting Scandal",
    "link": "https://www.nytimes.com/2025/10/26/realestate/nba-gambling-scandal-house.html",
    "summary": "The Greenwich Village building has been home to celebrities like John Philip Sousa and Kylie Jenner — and, according to prosecutors, Mafia-controlled poker games."
  },
  {
    "title": "Philip Pullman Brings Lyra’s Story to a Close in ‘The Rose Field’",
    "link": "https://www.nytimes.com/2025/10/26/books/review/philip-pullman-the-rose-field.html",
    "summary": "At 79, he is wrapping up the fantastical saga set in motion with “His Dark Materials,” while still loath to discuss how his work comments on current events."
  },
  {
    "title": "The Thread Tying Together Everything Trump Does",
    "link": "https://www.nytimes.com/2025/10/26/opinion/trump-foreign-policy.html",
    "summary": "Whether he is negotiating a deal in the Middle East, bombing boats off the coast of Venezuela or deploying troops to American cities, it’s always about power."
  },
  {
    "title": "Labubus Ate My Daughter",
    "link": "https://www.nytimes.com/2025/10/26/opinion/labubu-parenting-consumerism.html",
    "summary": "I thought our frenzied quest to find the trendy doll would teach my daughter a lesson. It did, just not the one I expected."
  },
  {
    "title": "Suspects in Louvre Jewelry Heist Arrested, French Authorities Say",
    "link": "https://www.nytimes.com/2025/10/26/world/europe/louvre-heist-arrests.html",
    "summary": "Thieves stole over $100 million in jewelry from the Paris museum. It is unclear how many people were arrested, but one man was caught while trying to leave France."
  },
  {
    "title": "As the Left’s Biggest Stars Unite Behind Mamdani, a Bigger Test Awaits",
    "link": "https://www.nytimes.com/2025/10/26/nyregion/mamdani-sanders-aoc-rally.html",
    "summary": "Senator Bernie Sanders and Representative Alexandria Ocasio-Cortez will join Zohran Mamdani on Sunday to help push his bid to win the Nov. 4 election for mayor of New York City."
  }
]