[
  {
    "title": "A Test Now for Israel: Can It Repair Its Ties to Americans?",
    "link": "https://www.nytimes.com/2025/10/12/world/middleeast/israel-us-polls-support.html",
    "summary": "Israel’s advocates fear that its conduct of the war has cost it the support of an entire generation of U.S. voters."
  },
  {
    "title": "Israel and Hamas Were Not Ready for a Comprehensive Peace Deal, Mediator Says",
    "link": "https://www.nytimes.com/2025/10/12/world/middleeast/israel-hamas-peace-deal.html",
    "summary": "The Qatari prime minister told The New York Times that Gaza war mediators decided to delay talks on more difficult issues so a hostage-prisoner swap could be concluded quickly."
  },
  {
    "title": "Israelis and Palestinians Await Hostage-Prisoner Swap With Relief and Elation",
    "link": "https://www.nytimes.com/2025/10/12/world/middleeast/israel-gaza-hostages-prisoners-ceasefire.html",
    "summary": "Under the first phase of the new cease-fire deal, all of living hostages in Gaza are expected to be released in the next 24 hours in exchange for about 2,000 Palestinians imprisoned by Israel."
  },
  {
    "title": "Black Unemployment Is Surging Again. This Time Is Different.",
    "link": "https://www.nytimes.com/2025/10/12/business/economy/black-unemployment-federal-layoffs-diversity-initiatives.html",
    "summary": "Federal layoffs and an end to diversity initiatives have weakened a historically strong labor market for Black workers."
  },
  {
    "title": "Trump Is Blowing Up Boats Off Venezuela. Could Mexico’s Cartels Be Next?",
    "link": "https://www.nytimes.com/2025/10/12/world/americas/mexico-drugs-venezuela-us-military.html",
    "summary": "U.S. strikes on boats that President Trump says are drug smugglers have unsettled America’s biggest trading partner, where powerful criminal groups produce and smuggle drugs."
  },
  {
    "title": "Air Traffic Controllers Reject Credit for Ending the Last Shutdown",
    "link": "https://www.nytimes.com/2025/10/12/us/politics/air-traffic-controllers-shutdown.html",
    "summary": "Controllers missing work was widely cited as the reason the last shutdown came to an end. But that assumption might have been overblown, according to controllers, aviation safety experts and congressional aides."
  },
  {
    "title": "Cars to Fighter Jets: China’s New Export Curbs May Level a Heavy Blow Worldwide",
    "link": "https://www.nytimes.com/2025/10/12/business/china-rare-earth-export-controls.html",
    "summary": "Broad restrictions could cause supply interruptions for arms makers, as well as manufacturers in the semiconductor, automotive and other sectors."
  },
  {
    "title": "Who Are the Louisiana Voters Behind a Major Supreme Court Challenge?",
    "link": "https://www.nytimes.com/2025/10/12/us/politics/supreme-court-voting-rights.html",
    "summary": "There is little information in court filings about the dozen plaintiffs who challenged the state’s voting map as an illegal racial gerrymander."
  },
  {
    "title": "How Trump’s Chicago Immigration Crackdown Escalated, in 10 Videos",
    "link": "https://www.nytimes.com/2025/10/12/us/chicago-immigration-crackdown-videos.html",
    "summary": "Week by week, the federal campaign to ramp up immigration enforcement in the Chicago area has created fear and inflamed tensions."
  },
  {
    "title": "These Students Are Scared. Friends and Teachers Are Their Protectors.",
    "link": "https://www.nytimes.com/2025/10/11/nyregion/schools-immigrant-children-deportation.html",
    "summary": "Sometimes, they offer a place to stay to immigrant children. Other times, they provide help navigating the legal system. They have become part of the resistance."
  },
  {
    "title": "Often Overlooked, Diane Keaton Was Essential to ‘The Godfather’ Saga",
    "link": "https://www.nytimes.com/2025/10/12/movies/diane-keaton-the-godfather.html",
    "summary": "The star’s emotional transparency and expressive eyes helped us see the Corleones as both fascinating and repellent, just as her character did."
  },
  {
    "title": "Diane Keaton Was the Definition of a Style Icon",
    "link": "https://www.nytimes.com/2025/10/12/style/diane-keaton-style-icon.html",
    "summary": "Her legacy will include the ways she shaped fashion, rather than allowing fashion to shape her."
  },
  {
    "title": "She Despised Charlie Kirk. He Resolved to Make People Like Her Pay.",
    "link": "https://www.nytimes.com/2025/10/12/us/charlie-kirk-civil-war.html",
    "summary": "In rural Texas, just 40 miles apart, a paramedic and a former small-town mayor got caught up on two sides of a digital “civil war.”"
  },
  {
    "title": "Trump’s Peace Plan Dismantled Netanyahu’s Vision for  Gaza",
    "link": "https://www.nytimes.com/2025/10/12/opinion/israel-palestinians-gaza-netanyahu-peace-deal.html",
    "summary": "While he is trying to sell it as a strategic win, the peace deal contradicts many of his coalition’s goals."
  },
  {
    "title": "Jon Favreau on Where the Democrats Went Right",
    "link": "https://www.nytimes.com/2025/10/11/opinion/ezra-klein-podcast-jon-favreau.html",
    "summary": "Jon Favreau considers how the government shutdown could help Democrats rebuild their fractured party."
  },
  {
    "title": "Rethinking Bruce Springsteen’s Difficult Years",
    "link": "https://www.nytimes.com/2025/10/12/us/bruce-springsteen-film-hostage-tennessee-keaton.html",
    "summary": "A film argues that an American icon may have made his best music in some of his lowest moments."
  },
  {
    "title": "South Carolina Bar Shooting Leaves at Least 4 Dead, Sheriff Says",
    "link": "https://www.nytimes.com/2025/10/12/us/south-carolina-st-helena-shooting-bar.html",
    "summary": "Four people were in critical condition after an early-morning shooting that left 12 other people injured on Sunday in St. Helena, S.C., according to the Beaufort County Sheriff’s Office."
  },
  {
    "title": "Arson That Seemed Spontaneous in Nepal Could Have Been Deliberate",
    "link": "https://www.nytimes.com/2025/10/12/world/asia/nepal-protests-genz-arson.html",
    "summary": "A New York Times investigation points to a coordinated campaign of destruction during last month’s unrest. An official inquiry is underway but answers are growing harder to find."
  },
  {
    "title": "‘Really Big’ Cascadia Earthquake Could Trigger San Andreas Fault Activity",
    "link": "https://www.nytimes.com/2025/10/12/science/earthquake-san-andreas-cascadia.html",
    "summary": "The disaster caused by a predicted large earthquake in the Pacific Northwest could be compounded by shaking along the San Andreas fault in California, scientists warned."
  }
]