[
  {
    "title": "How Hurricane Melissa Got So Intense, and a ‘Plan’ for a Third Trump Term",
    "link": "https://www.nytimes.com/2025/10/28/podcasts/the-headlines/hurricane-melissa-third-trump-term-plan.html",
    "summary": "Plus, the longest-ever World Series game."
  },
  {
    "title": "Beyond Trade War, China’s Xi Looks to Press Trump on Taiwan",
    "link": "https://www.nytimes.com/2025/10/28/world/asia/trump-tariffs-china-taiwan.html",
    "summary": "China’s leader wants to weaken American support for Taiwan. But first he will want clarity about President Trump’s stance toward the island."
  },
  {
    "title": "Trump’s China Deal May Avert a Crisis of His Own Making",
    "link": "https://www.nytimes.com/2025/10/27/us/politics/trump-china-trade-deal-talks.html",
    "summary": "The Trump administration is hailing a potential deal that may return the U.S.-China relationship to where it was before the president began a trade war against Beijing."
  },
  {
    "title": "Bill Gates Says Climate Change ‘Will Not Lead to Humanity’s Demise’",
    "link": "https://www.nytimes.com/2025/10/28/climate/bill-gates-climate-change-humanity.html",
    "summary": "In a memo, the Microsoft co-founder warned against a “doomsday outlook” and appears to have shifted some of his views about climate change."
  },
  {
    "title": "Misty Copeland, Ballerina of the People, Moves On",
    "link": "https://www.nytimes.com/2025/10/28/arts/dance/misty-copeland-ballerina.html",
    "summary": "American Ballet Theater’s first Black female principal dancer has given her farewell performance. But she’s not done with this art form yet."
  },
  {
    "title": "Government Shutdown Imperils SNAP and Other Antipoverty Programs",
    "link": "https://www.nytimes.com/2025/10/27/us/politics/trump-shutdown-snap-food-stamps-aid.html",
    "summary": "Within days, tens of millions of low-income Americans may lose assistance for food, child care and utilities if the federal government remains shut down."
  },
  {
    "title": "Radiation Fears Bring MAHA and MAGA Movements Into Conflict",
    "link": "https://www.nytimes.com/2025/10/28/science/radiation-nuclear-5g-maha.html",
    "summary": "The Trump administration is considering tighter safety rules on the weak radiations of cellphones even as it pursues looser regulations on the deadly emanations of the nuclear industry."
  },
  {
    "title": "Trump Argues in Formal Appeal That His Conviction Was ‘Fatally Marred’",
    "link": "https://www.nytimes.com/2025/10/28/nyregion/trump-hush-money-appeal.html",
    "summary": "In 2024, a jury found that Donald J. Trump approved a scheme to falsify business records to conceal a hush-money payment to a porn star. He became the first felon president."
  },
  {
    "title": "Trump Keeps Musing About a 3rd Term Despite Constitutional Limits",
    "link": "https://www.nytimes.com/2025/10/27/us/politics/trump-third-term-politics.html",
    "summary": "A president who has chafed at the limits on his power sees political benefit in talking about remaining in office."
  },
  {
    "title": "Should the Mayor Control N.Y.C. Schools? Mamdani and Cuomo Don’t Agree.",
    "link": "https://www.nytimes.com/2025/10/28/nyregion/new-york-city-schools-mayoral-control.html",
    "summary": "Zohran Mamdani and the teachers’ union have called for changes in mayoral control. Andrew M. Cuomo and some education leaders say that would be a grave mistake."
  },
  {
    "title": "At Mamdani Rally, a Moment of Unity Goes Sideways for Hochul",
    "link": "https://www.nytimes.com/2025/10/27/nyregion/hochul-mamdani-rally.html",
    "summary": "Gov. Kathy Hochul received a tepid response from a stadium filled with Zohran Mamdani supporters, whose chants of “Tax the rich” interrupted her speech."
  },
  {
    "title": "Fed’s Policy Path Looks More Treacherous as Shutdown Delays Critical Data",
    "link": "https://www.nytimes.com/2025/10/28/business/fed-interest-rates-shutdown-data.html",
    "summary": "The central bank is poised to lower interest rates again on Wednesday despite having only a partial view of how the economy is faring."
  },
  {
    "title": "Texas Sues Tylenol Makers, Claiming They Hid Autism Risks",
    "link": "https://www.nytimes.com/2025/10/28/health/tylenol-autism-texas-lawsuit.html",
    "summary": "The lawsuit follows claims by President Trump that linked use by pregnant women of acetaminophen to autism, a connection that is unproven."
  },
  {
    "title": "More Food Reaches Gaza, but It’s Still Not Enough",
    "link": "https://www.nytimes.com/2025/10/28/nyregion/more-food-reaches-gaza-but-its-still-not-enough.html",
    "summary": "Aid to the devastated territory has increased since the cease-fire took effect and prices have fallen. But many trucks going into Gaza are bringing food and commercial goods to sell that most people cannot afford."
  },
  {
    "title": "Israel Conducts First Airstrike in West Bank in Months and Kills 3",
    "link": "https://www.nytimes.com/2025/10/28/world/middleeast/jenin-west-bank-airstrike-israel.html",
    "summary": "A militant group allied with Hamas confirmed the deaths, which were part of an increase in fighting in the Palestinian territory during a surge of settler violence."
  },
  {
    "title": "Sudan’s Military Withdraws From El Fasher in Darfur, Handing City to R.S.F.",
    "link": "https://www.nytimes.com/2025/10/28/world/africa/sudan-el-fasher-burhan-rsf.html",
    "summary": "Gen. Abdel Fattah al-Burhan confirmed that Sudan’s military had retreated from El Fasher, a decisive shift in control of the country’s sprawling Darfur region."
  },
  {
    "title": "In a Looming Nuclear Arms Race, Aging Los Alamos Faces a Major Test",
    "link": "https://www.nytimes.com/2025/10/28/us/los-alamos-nuclear-program.html",
    "summary": "The lab where Oppenheimer developed the atomic bomb is the linchpin in the United States’ effort to modernize its nuclear weapons. Yet the site has contended with contamination incidents, work disruptions and old infrastructure."
  },
  {
    "title": "How to Make Art Out of Confederate Monuments",
    "link": "https://www.nytimes.com/2025/10/28/magazine/monuments-art-exhibition-confederate-statues-trump.html",
    "summary": "A new show featuring decommissioned statues dispels myths of American history at a moment when President Trump is insisting on them."
  },
  {
    "title": "I Worked at OpenAI. It’s Not Doing Enough to Protect People.",
    "link": "https://www.nytimes.com/2025/10/28/opinion/openai-chatgpt-safety.html",
    "summary": "A.I. companies need to do more to show the proof behind their claims."
  },
  {
    "title": "Adelita Grijalva Just Wants to Get to Work. The House Speaker Won’t Let Her.",
    "link": "https://www.nytimes.com/2025/10/28/opinion/grijalva-congress-mike-johnson.html",
    "summary": "Mike Johnson, the speaker, won’t swear in the Democratic representative-elect from Arizona."
  },
  {
    "title": "Anti-Vax for Dogs?",
    "link": "https://www.nytimes.com/2025/10/28/briefing/anti-vax-for-dogs.html",
    "summary": "We explain how pet owners are expressing vaccine hesitancy."
  },
  {
    "title": "Seth Meyers Thinks Trump Is Trolling With Third-Term Talk",
    "link": "https://www.nytimes.com/2025/10/28/arts/television/seth-meyers-trump-third-term.html",
    "summary": "The president says he hasn’t really thought about a third term. Meyers said that was “like James Cameron saying he hasn’t thought about ‘Avatar 4.’”"
  },
  {
    "title": "Prunella Scales, Sybil on ‘Fawlty Towers,’ Dies at 93",
    "link": "https://www.nytimes.com/2025/10/28/arts/television/prunella-scales-dead.html",
    "summary": "Best known “for playing unfortunate wives,” she had a decades-long career in the theater and on television."
  },
  {
    "title": "A City Council Race in Arizona Turns Toxic Over Charlie Kirk’s Legacy",
    "link": "https://www.nytimes.com/2025/10/28/us/politics/charlie-kirk-mesa-arizona.html",
    "summary": "By nationalizing a local election, Turning Point Action is trying to show it can carry on without its founder and recall a local Republican who endorsed Kamala Harris."
  },
  {
    "title": "A Tidy Dutch Town Offers a Window Into a Messy Dutch Election",
    "link": "https://www.nytimes.com/2025/10/28/world/europe/netherlands-geert-wilders-election.html",
    "summary": "Two years after a shock win for the far-right Geert Wilders, the Netherlands is returning to the polls. His hometown shows the pain points of the country’s volatile politics."
  }
]