[
  {
    "title": "Targeting Iran’s Leaders, Israel Found a Weak Link: Their Bodyguards",
    "link": "https://www.nytimes.com/2025/08/30/us/politics/israel-iran-assassination.html",
    "summary": "Israel was able to track the movements of key Iranian figures and assassinate them during the 12-day war this spring by following the cellphones carried by members of their security forces."
  },
  {
    "title": "Trump’s Sweeping Tariffs Invalidated by Appeals Court",
    "link": "https://www.nytimes.com/2025/08/29/business/economy/trump-tariffs-appeals-court.html",
    "summary": "The decision is a big blow to President Trump’s trade policies, but the judges left the duties in place for now to allow time for a likely appeal to the Supreme Court."
  },
  {
    "title": "Trump Takes Aim at South Korean Chipmakers’ China Operations",
    "link": "https://www.nytimes.com/2025/08/30/business/trump-samsung-skhynix-chips.html",
    "summary": "The U.S. said Samsung and SK Hynix can no longer ship American equipment to their production facilities in China without government licenses."
  },
  {
    "title": "Will the C.D.C. Survive?",
    "link": "https://www.nytimes.com/2025/08/29/health/cdc-kennedy-public-health.html",
    "summary": "Robert F. Kennedy Jr.’s assault may have dealt lasting damage to the agency, experts fear, with harsh consequences for public health."
  },
  {
    "title": "Benny Johnson Was Fired for Plagiarism. At the White House, He’s Embraced.",
    "link": "https://www.nytimes.com/2025/08/30/business/media/trump-benny-johnson.html",
    "summary": "Benny Johnson, a right-wing podcaster, has enjoyed rare access and promotion from the Trump administration."
  },
  {
    "title": "Judge Blocks Pillar of Trump’s Mass Deportation Campaign",
    "link": "https://www.nytimes.com/2025/08/29/us/politics/judge-fast-track-deportations.html",
    "summary": "Judge Jia M. Cobb rejected what she called “a truly startling argument” from the government that it could use a fast-track procedure to remove people arrested far from the southern border."
  },
  {
    "title": "How the Trump-Kennedy Alliance Is Pushing the Boundaries of Public Health",
    "link": "https://www.nytimes.com/2025/08/29/us/politics/trump-kennedy-alliance-vaccines.html",
    "summary": "The mutually beneficial relationship between President Trump and Robert F. Kennedy Jr. is based on a striking alignment of some of their views."
  },
  {
    "title": "The Nobel Prize and a Testy Phone Call: How the Trump-Modi Relationship Unraveled",
    "link": "https://www.nytimes.com/2025/08/30/us/politics/trump-modi-india.html",
    "summary": "President Trump’s repeated claims about having “solved” the India-Pakistan war infuriated Prime Minister Narendra Modi of India. And that was only the beginning."
  },
  {
    "title": "Croquet, Anyone? Making Moscow a Vast Fun Zone to Divert Minds From War.",
    "link": "https://www.nytimes.com/2025/08/30/world/europe/russia-ukraine-war-summer-in-moscow.html",
    "summary": "A festival known as Summer in Moscow showcases the city’s transformation into an ultramodern metropolis. But the feast can’t last forever."
  },
  {
    "title": "How Russia Is Distracting Citizens From the War",
    "link": "https://www.nytimes.com/video/world/europe/100000010362770/how-russia-is-distracting-citizens-from-the-war.html",
    "summary": "Moscow is hosting a big summer festival as Russia continues its war in Ukraine. Katrin Bennhold, a senior international reporter for The New York Times, talks with Ivan Nechepurenko, a Times reporter in Russia, about the spectacle and what it says about Russian public opinion more than three and a half years into the war."
  },
  {
    "title": "Amid Stalled Bid for Peace Talks, Russia Pounds Ukraine",
    "link": "https://www.nytimes.com/2025/08/30/world/europe/russia-barrage-ukraine-peace-talks.html",
    "summary": "It was the second massive assault in three days, as the Kremlin rebuffed peace talks sought by Ukraine and the United States."
  },
  {
    "title": "Families of Minneapolis Church Shooting Victims Pay Loving Tributes",
    "link": "https://www.nytimes.com/2025/08/29/us/minneapolis-shooting-victims-families.html",
    "summary": "The impact of the deaths of Fletcher Merkel, 8, and Harper Moyski, 10, and the injuries sustained by 18 others are only beginning to be felt."
  },
  {
    "title": "In Secret Diaries, the Church Shooter’s Plans for Mass Murder",
    "link": "https://www.nytimes.com/2025/08/30/us/minneapolis-church-shooter-robin-westman.html",
    "summary": "Robin W. Westman described how she had obtained guns and how she had visited the church on a test run this summer during a Sunday Mass."
  },
  {
    "title": "20 Years After Katrina, New Orleans Is Still Home for Those Who Left",
    "link": "https://www.nytimes.com/2025/08/30/us/new-orleans-katrina-diaspora.html",
    "summary": "For many displaced by Hurricane Katrina, distance did not diminish their bond with the city they left behind, even as they built new lives."
  },
  {
    "title": "After Katrina’s Deadly Waters, Therapists Brought Watercolors",
    "link": "https://www.nytimes.com/2025/08/29/arts/design/hurricane-katrina-anniversary-art-therapy.html",
    "summary": "When Hurricane Katrina devastated New Orleans, an art program helped displaced children process their emotions. Twenty years later, their creations still have power."
  },
  {
    "title": "London’s Peace Monk Chants, Drums and Walks to Urge an End to War",
    "link": "https://www.nytimes.com/2025/08/30/world/europe/london-peace-monk-battersea.html",
    "summary": "For 40 years, the Rev. Gyoro Nagase has overseen a temple to peace in a popular park in Battersea, his ever-present drum by his side."
  },
  {
    "title": "The ‘Economic Storm’ of Crises That Is Battering Afghanistan",
    "link": "https://www.nytimes.com/2025/08/30/world/africa/afghanistan-economy-deportation.html",
    "summary": "Afghanistan was on a timid recovery path. But four years after the Taliban retook power, it has been badly hit by aid cuts and an inflow of two million Afghans forced out of Iran and Pakistan."
  },
  {
    "title": "Bernie Sanders: Kennedy Must Resign",
    "link": "https://www.nytimes.com/2025/08/30/opinion/bernie-sanders-robert-f-kennedy-jr-resign-hhs.html",
    "summary": "The health secretary is endangering the lives of American people now and into the future."
  },
  {
    "title": "Vax Quack Lacks Facts",
    "link": "https://www.nytimes.com/2025/08/30/opinion/robert-f-kennedy-jr-maha.html",
    "summary": "This Kennedy is no profile in courage."
  },
  {
    "title": "Golden Hour",
    "link": "https://www.nytimes.com/2025/08/30/briefing/golden-hour.html",
    "summary": "This weekend marks summer’s unofficial end — but that doesn’t have to mean abandoning the season’s many splendors."
  },
  {
    "title": "3 Dead in Indonesia After Jumping From Building Protesters Set on Fire, Official Says",
    "link": "https://www.nytimes.com/2025/08/30/world/asia/indonesia-protests-dead-prabowo-subianto.html",
    "summary": "The student-led demonstrations in Indonesia are against President Prabowo Subianto’s economic policies and fatal police brutality."
  },
  {
    "title": "China Revisits Its War With Japan, Stirring Pride and Fears of Hatred",
    "link": "https://www.nytimes.com/2025/08/30/world/asia/china-japan-wwii-nationalism.html",
    "summary": "A series of World War II dramas about China’s fight against Japan is drawing audiences to their feet, and, in some cases, to tears. Some say it helps deflect public discontent."
  },
  {
    "title": "Why N.Y. Legal Weed Might Not Be as Safe, or as Strong, as Advertised",
    "link": "https://www.nytimes.com/2025/08/30/nyregion/nyc-cannabis-testing-weed-safety.html",
    "summary": "New York depends on private labs to test cannabis products’ potency and check for contaminants. Some industry experts say the tests are not reliable."
  },
  {
    "title": "Strangers Come Together to Deliver Baby Girl at Burning Man Festival",
    "link": "https://www.nytimes.com/2025/08/29/us/burning-man-baby.html",
    "summary": "A woman unexpectedly went into labor at the desert festival. Within minutes, a neonatal nurse, an OB-GYN, a pediatric doctor and other attendees filled her camper."
  }
]