[
  {
    "title": "Republicans Seek Votes for Trump Policy Bill as Senate Begins Debate",
    "link": "https://www.nytimes.com/2025/06/29/us/politics/senate-trump-domestic-policy-bill.html",
    "summary": "New official estimates showed the bill would swell deficits while slashing health programs and insurance coverage, posing potential problems as the legislation moved forward in the Senate."
  },
  {
    "title": "Thom Tillis, Republican Senator, Won’t Seek Re-election Amid Trump’s Primary Threats",
    "link": "https://www.nytimes.com/2025/06/29/us/politics/thom-tillis-retirement.html",
    "summary": "The day after President Trump castigated Senator Thom Tillis for opposing the bill carrying the president’s domestic agenda, the North Carolina Republican said he would not seek a third term."
  },
  {
    "title": "G.O.P. Bill Adds Surprise Tax That Could Cripple Wind and Solar Power",
    "link": "https://www.nytimes.com/2025/06/29/climate/gop-bill-adds-surprise-tax-that-could-cripple-wind-and-solar-power.html",
    "summary": "Wind and solar companies were already bracing for Congress to end federal subsidies. But the Senate bill goes even further and penalizes those industries."
  },
  {
    "title": "Canada to Scrap Tax That Led Trump to Suspend Trade Talks",
    "link": "https://www.nytimes.com/2025/06/29/world/canada/trump-digital-services-tax.html",
    "summary": "The government said on Sunday night that it would cancel its tax on American technology companies, handing a victory to the Trump administration."
  },
  {
    "title": "Trump Wants America to Make iPhones. Here’s How India Is Doing It.",
    "link": "https://www.nytimes.com/2025/06/30/business/apple-foxconn-india.html",
    "summary": "India is carving out a new space for Foxconn and other high-end manufacturers, just as President Trump demands American companies do at home."
  },
  {
    "title": "Trump’s Tariffs May Push This American Company to Move Jobs to China",
    "link": "https://www.nytimes.com/2025/06/30/business/trump-tariffs-textiles-china.html",
    "summary": "The experience of a company in the textile business illustrates how the trade war could force some industries to shift production out of the United States."
  },
  {
    "title": "U.N. Inspector Says Iran Could Enrich Nuclear Fuel in ‘Matter of Months’",
    "link": "https://www.nytimes.com/2025/06/29/us/politics/un-iran-nuclear-program-enrichment.html",
    "summary": "The assessment widens the divide with President Trump, who has claimed that Tehran has given up its nuclear ambitions after a U.S. attack."
  },
  {
    "title": "Israel’s Attack on Evin Prison Killed 71, Iranian State Media Report",
    "link": "https://www.nytimes.com/2025/06/29/world/middleeast/evin-prison-iran.html",
    "summary": "The notorious detention facility in Tehran, where dissidents and political prisoners are held, came under attack on June 23."
  },
  {
    "title": "2 Firefighters Killed in Idaho Sniper Ambush",
    "link": "https://www.nytimes.com/2025/06/29/us/coeur-dalene-idaho-shooting-ambush.html",
    "summary": "Firefighters were responding to a blaze near Coeur d’Alene when the shooting happened, a sheriff said. The body of a suspect was recovered on Sunday evening."
  },
  {
    "title": "Appeals Court to Consider Trump’s Use of Alien Enemies Act in Mass Deportations",
    "link": "https://www.nytimes.com/2025/06/29/us/politics/appeal-trump-alien-enemies-act.html",
    "summary": "The case before one of the most conservative courts in the country is likely to be the first to reach the Supreme Court."
  },
  {
    "title": "Trump Says He’s Found Buyers for TikTok",
    "link": "https://www.nytimes.com/2025/06/29/us/politics/trump-tiktok-buyer.html",
    "summary": "He didn’t say who was interested in buying the app, just that it was “a group of very wealthy people.” But the Chinese government needs to approve any sale."
  },
  {
    "title": "Europe Heat Wave Drives Record-High Temperatures, Prompting Health Alerts",
    "link": "https://www.nytimes.com/2025/06/29/world/europe/europe-heat-wave-record-temperatures.html",
    "summary": "Extreme heat has gripped Europe with record-high temperatures, health alerts and wildfires, from France and Spain to Greece."
  },
  {
    "title": "Baseball in the Everlasting Light of Fairbanks, Alaska",
    "link": "https://www.nytimes.com/2025/06/29/us/baseball-fairbanks-alaska-midnight-game.html",
    "summary": "For more than a century, baseball teams in Fairbanks have played at midnight on the summer solstice, illuminated only by the sun."
  },
  {
    "title": "Europe Is Making a Big Mistake",
    "link": "https://www.nytimes.com/2025/06/30/opinion/europe-nato-military-spending.html",
    "summary": "Breakneck rearmament risks taking the European Union not forward but backward."
  },
  {
    "title": "A Reckless Judicial Nomination Puts the Senate to the Test",
    "link": "https://www.nytimes.com/2025/06/29/opinion/bove-trump-judges-confirmation.html",
    "summary": "Trump wants one of his lawyers to be one of his judges."
  },
  {
    "title": "2 Shot Near Stonewall Inn in Manhattan’s Greenwich Village",
    "link": "https://www.nytimes.com/2025/06/29/nyregion/stonewall-inn-pride-shooting-nyc.html",
    "summary": "One of the victims was in critical condition after being shot in the head. Mayor Eric Adams said the shooting occurred as Pride celebrations were ending."
  },
  {
    "title": "They Demanded Democracy. Years Later, They Are Still Paying the Price.",
    "link": "https://www.nytimes.com/2025/06/30/world/asia/hong-kong-protesters.html",
    "summary": "Thousands of young people lost careers, friends and dreams after taking part in mass antigovernment protests that erupted six years ago in Hong Kong."
  },
  {
    "title": "We Shouldn’t Have Billionaires, Mamdani Says",
    "link": "https://www.nytimes.com/2025/06/29/nyregion/zohran-mamdani-nyc-affordability-billionaires.html",
    "summary": "Appearing on “Meet the Press” days after the mayoral primary, Zohran Mamdani defended his proposals to make New York City more affordable and to increase taxes on the wealthy."
  },
  {
    "title": "D. Wayne Lukas, Horse Trainer Who Saddled Winners From Coast to Coast, Dies at 89",
    "link": "https://www.nytimes.com/2025/06/29/obituaries/d-wayne-lukas-dead.html",
    "summary": "He earned purses of more than $300 million in a Hall of Fame career that revolutionized thoroughbred racing with a modern-day corporate approach."
  }
]