[
  {
    "title": "Iran Is at Work on Missile and Nuclear Sites, Satellite Images Show",
    "link": "https://www.nytimes.com/2026/02/06/world/middleeast/iran-missile-nuclear-repairs.html",
    "summary": "Repairs at key missile sites began soon after they were hit by Israeli and U.S. strikes last year, but work at Iran’s nuclear facilities has been slower."
  },
  {
    "title": "U.S. and Iran Set for Talks in Oman",
    "link": "https://www.nytimes.com/2026/02/06/world/europe/us-iran-talks-oman.html",
    "summary": "Middle Eastern diplomats see a chance for progress on Iran’s nuclear program, but they are pessimistic about other U.S. demands."
  },
  {
    "title": "The Growing List of Names in the Epstein Files, and the Federal Investigation into D.E.I. at Nike",
    "link": "https://www.nytimes.com/2026/02/06/podcasts/the-headlines/epstein-files-nike-dei-investigation.html",
    "summary": "Plus, the Friday news quiz."
  },
  {
    "title": "The Olympics Are a Show Of Global Harmony. The World is Anything But.",
    "link": "https://www.nytimes.com/2026/02/06/world/europe/olympics-world-order-war.html",
    "summary": "The Winter Games, which officially open in Italy on Friday, are rooted in international cooperation. That feels out of place to some in a world where old rules no longer apply."
  },
  {
    "title": "The Dark Side of A.I. Weighs on the Stock Market",
    "link": "https://www.nytimes.com/2026/02/06/business/the-dark-side-of-ai-weighs-on-the-stock-market.html",
    "summary": "The prospect of disruptions from artificial intelligence has hung over the economy for years. But this week advances in software tools precipitated a sell-off on Wall Street."
  },
  {
    "title": "It’s Time to Rethink the Standard Investment Advice. But Not Too Much.",
    "link": "https://www.nytimes.com/2026/02/06/business/market-risk-investing-index-funds.html",
    "summary": "With signs of trouble popping up in financial markets, investors need to decide whether they can ignore the turmoil, our columnist says."
  },
  {
    "title": "Bitcoin Drops to Lowest Price Since Trump Was Elected as Crypto Faces Slump",
    "link": "https://www.nytimes.com/2026/02/05/technology/bitcoin-price-drop-crypto-market.html",
    "summary": "The price of Bitcoin is now lower than when President Trump was elected in 2024, raising concerns of a new “crypto winter\" in the industry."
  },
  {
    "title": "‘Gang Stuff’ and ‘Illicit Trysts’: How Epstein Sought Leverage With the Wealthy",
    "link": "https://www.nytimes.com/2026/02/06/us/jeffrey-epstein-leverage.html",
    "summary": "Jeffrey Epstein drafted letters to men like the retail billionaire Leslie Wexner in which he hinted at shared secrets."
  },
  {
    "title": "Norway Rallies Behind Royals, Despite Dismay Over Epstein Links",
    "link": "https://www.nytimes.com/2026/02/06/world/europe/epstein-revelations-norway-royal-support.html",
    "summary": "The future queen’s links to Jeffrey Epstein, and her son’s rape trial, have disappointed many Norwegians. But there is still widespread support for the monarchy."
  },
  {
    "title": "My Dog Tintin’s Trans-Atlantic Voyage on the Queen Mary 2",
    "link": "https://www.nytimes.com/2026/02/06/travel/queen-mary-dog.html",
    "summary": "How would a 10-year-old terrier mutt, averse to flying, fare during eight days at sea?"
  },
  {
    "title": "Trump’s Immigration Policy Is 100 Years Old",
    "link": "https://www.nytimes.com/2026/02/06/magazine/trump-miller-immigration-ice.html",
    "summary": "The White House seems to be mining the Coolidge era for inspiration. But America is not the country it was in 1924."
  },
  {
    "title": "How the Black Panthers’ Playbook Helped Minneapolis Activists Fight Trump",
    "link": "https://www.nytimes.com/2026/02/06/us/politics/minneapolis-protest-black-panthers.html",
    "summary": "The monitoring of law enforcement has a long history, dating back to the 1960s, when leftist groups like the Black Panthers began police patrols."
  },
  {
    "title": "As Minnesota Reels Amid Immigration Crackdown, a Sheriff Agonizes Over Her Role",
    "link": "https://www.nytimes.com/2026/02/06/us/dawanna-witt-hennepin-sheriff.html",
    "summary": "Sheriff Dawanna Witt of Hennepin County says she thinks she could help end the crackdown by allowing some measure of cooperation with ICE. She also knows that could cost her re-election."
  },
  {
    "title": "What to Know About Minnesota’s Immigration Policies Amid Federal Crackdown",
    "link": "https://www.nytimes.com/2026/02/06/us/minnesota-sanctuary-immigration-ice.html",
    "summary": "The Trump administration has criticized state and local “sanctuary” policies during its Minnesota immigration crackdown. The reality on the ground is complicated."
  },
  {
    "title": "Senators Clash Over Immigration Enforcement, Risking a D.H.S. Shutdown",
    "link": "https://www.nytimes.com/2026/02/05/us/politics/senate-immigration-enforcement-dhs-shutdown.html",
    "summary": "With eight days until a deadline to keep the Department of Homeland Security running, bipartisan talks on reining in federal immigration agents’ tactics appeared to sputter before they had even gotten underway."
  },
  {
    "title": "Argentina and U.S. Sign Sweeping Trade Deal as Alliance Deepens",
    "link": "https://www.nytimes.com/2026/02/05/world/americas/argentina-us-trade-deal-trump-milei.html",
    "summary": "The deal reduces reciprocal tariffs and expands quotas for key trading goods, including Argentine beef — a flashpoint for American ranchers."
  },
  {
    "title": "Smithsonian Folklife Festival Gives Way to Trump’s Patriotic Fair",
    "link": "https://www.nytimes.com/2026/02/05/arts/smithsonian-folklife-festival-great-american-state-fair.html",
    "summary": "The summer festival, held annually since 1967, will not take place as usual on the National Mall, which will instead host the president’s Great American State Fair."
  },
  {
    "title": "Alexandria Ocasio-Cortez Steps Onto a Wider Stage",
    "link": "https://www.nytimes.com/2026/02/06/us/politics/aoc-run-for-president-or-senate-2028.html",
    "summary": "The progressive lawmaker is taking a larger role in Democratic politics, supporting moderate candidates and helping drive the party’s economic message. Now she is planning a major trip abroad."
  },
  {
    "title": "Muslims Move to Assert Political Power in New York City",
    "link": "https://www.nytimes.com/2026/02/05/nyregion/muslims-nyc-political-power.html",
    "summary": "Zohran Mamdani’s ascension to mayor has given Muslim organizers and faith leaders the impetus to insert themselves into more formal political alliances and networks."
  },
  {
    "title": "New Jersey House Primary Remains Too Close to Call",
    "link": "https://www.nytimes.com/2026/02/06/nyregion/new-jersey-special-election-results-congress.html",
    "summary": "Two Democrats, Analilia Mejia and Tom Malinowski, were leading in a race for their party’s nomination to replace Gov. Mikie Sherrill in the House."
  },
  {
    "title": "Uber Found Liable in Rape by Driver, Setting Stage for Thousands of Cases",
    "link": "https://www.nytimes.com/2026/02/05/business/uber-safety-rape-verdict.html",
    "summary": "In a federal bellwether case, the jury ordered the ride-hailing giant to pay $8.5 million to Jaylynn Dean, who said one of its drivers assaulted her in 2023."
  },
  {
    "title": "Bad Bunny’s All-American, All-Spanish, All-Eyes-on-Him Super Bowl",
    "link": "https://www.nytimes.com/2026/02/06/arts/music/bad-bunny-super-bowl-halftime-show.html",
    "summary": "Amid harsh rhetoric from the White House, the Puerto Rican superstar will take the stage on Sunday promising a message of unity: “The world will dance.”"
  },
  {
    "title": "The 2026 Super Bowl Ads (So Far), Ranked",
    "link": "https://www.nytimes.com/2026/02/06/arts/television/super-bowl-ads-ranked-2026.html",
    "summary": "Here is our critic’s survey of this year’s Super Bowl commercials, from best to worst to A.I."
  },
  {
    "title": "New York’s Next Archbishop Introduces Himself to ‘the Parish of America’",
    "link": "https://www.nytimes.com/2026/02/06/nyregion/archbishop-hicks.html",
    "summary": "On the eve of his installation, Bishop Ronald A. Hicks led a Vespers prayer service, conscious of the weight of representing more than 2.5 million Catholics."
  },
  {
    "title": "How the Capitalists Broke Capitalism",
    "link": "https://www.nytimes.com/2026/02/06/opinion/capitalism-industry-financialization.html",
    "summary": "Regulating the industry is useful. Shaming it is crucial."
  },
  {
    "title": "America’s Game",
    "link": "https://www.nytimes.com/2026/02/06/briefing/americas-game.html",
    "summary": "We tell you everything you need to know about this year’s Super Bowl."
  },
  {
    "title": "Late Night Finds Trump Out of Place at Prayer Breakfast",
    "link": "https://www.nytimes.com/2026/02/06/arts/television/late-night-trump-prayer-breakfast.html",
    "summary": "The annual National Prayer Breakfast “is supposed to be a normal, nonpartisan event,” Seth Meyers said, “but, of course, Donald Trump is incapable of being normal.”"
  },
  {
    "title": "Europe Accuses TikTok of ‘Addictive Design’ and Pushes for Change",
    "link": "https://www.nytimes.com/2026/02/06/business/tiktok-addictive-design-europe.html",
    "summary": "European Union regulators said the app’s infinite scroll and personalized algorithm led to “compulsive” behavior, especially among children."
  },
  {
    "title": "Toyota Names Kenta Kon C.E.O. as Automaker Faces Tariffs and Increasing Competition",
    "link": "https://www.nytimes.com/2026/02/06/business/toyota-ceo-kenta-kon.html",
    "summary": "The world’s biggest automaker has navigated the industry’s turbulent E.V. transition, but is looking to new leadership to manage intensifying geopolitical challenges."
  },
  {
    "title": "She’s Upending Japanese Politics With Two Words: ‘I’m Pregnant’",
    "link": "https://www.nytimes.com/2026/02/06/world/asia/japan-election-pregnant-candidate.html",
    "summary": "Hikaru Fujita, who’s running in Sunday’s parliamentary election, is a standout in a country where expectant mothers rarely enter national politics."
  }
]