[
  {
    "title": "Zelensky Is Under Pressure from Trump and Domestically",
    "link": "https://www.nytimes.com/2025/11/23/world/europe/ukraine-zelensky-war-russia.html",
    "summary": "Over nearly four years of wartime leadership, analysts say the Ukrainian leader has repeatedly played weak hands wisely. A U.S. peace plan may be his biggest test."
  },
  {
    "title": "Trump Calls Ukraine Ungrateful, Again, for U.S. Support in War With Russia",
    "link": "https://www.nytimes.com/2025/11/23/us/politics/trump-ukraine-criticism-russia.html",
    "summary": "President Trump renewed his criticism of Ukraine’s government as emissaries from Kyiv and Washington met to discuss a plan to end the war."
  },
  {
    "title": "Rubio Insists U.S. Authored the Ukraine Peace Plan",
    "link": "https://www.nytimes.com/2025/11/23/us/politics/rubio-us-author-ukraine-peace-plan.html",
    "summary": "The comment from Secretary of State Marco Rubio came after a group of U.S. lawmakers claimed that he said the plan was a Russian initiative, not a U.S. proposal."
  },
  {
    "title": "Patel Under Scrutiny for Use of SWAT Teams to Protect His Girlfriend",
    "link": "https://www.nytimes.com/2025/11/23/us/politics/kash-patel-girlfriend-fbi-protection.html",
    "summary": "The F.B.I. director’s travel on government jets has contributed to growing questions inside the administration about whether he is using taxpayer-funded resources inappropriately."
  },
  {
    "title": "At Harvard-Yale Game, Rivals Come Together Against Trump Administration Attacks",
    "link": "https://www.nytimes.com/2025/11/23/us/politics/yale-harvard-football-trump.html",
    "summary": "Students and alumni set aside rivalries at the 141st Harvard-Yale football game on Saturday to summon support against attacks on higher education under the Trump administration."
  },
  {
    "title": "Mamdani and Trump Tamp Down Fears Over National Guard in New York City",
    "link": "https://www.nytimes.com/2025/11/23/nyregion/mamdani-trump-national-guard-meet-the-press.html",
    "summary": "In a Sunday interview on “Meet the Press,” Zohran Mamdani, the mayor-elect, said he had made a forceful case to the president that troops were not needed in the city."
  },
  {
    "title": "Fact-Checking Trump’s Latest Claims on Affordability",
    "link": "https://www.nytimes.com/2025/11/23/us/politics/fact-check-trump-affordability.html",
    "summary": "The president has made misleading statements about the cost of a Thanksgiving meal, breakfast and gasoline and about prices in general."
  },
  {
    "title": "Tatiana Schlossberg, John F. Kennedy’s Granddaughter, Reveals Terminal Cancer Diagnosis",
    "link": "https://www.nytimes.com/2025/11/22/us/tatiana-schlossberg-kennedy-cancer.html",
    "summary": "Tatiana Schlossberg, a daughter of Caroline Kennedy, revealed a terminal cancer diagnosis in an essay published on the anniversary of her grandfather’s assassination."
  },
  {
    "title": "One Undocumented Worker Used a Stolen Identity. Two Men Paid the Price.",
    "link": "https://www.nytimes.com/2025/11/23/us/undocumented-worker-stolen-identity-dan-kluver.html",
    "summary": "Thousands of undocumented workers rely on fraudulent Social Security numbers. One of them belonged to Dan Kluver."
  },
  {
    "title": "Hedge Fund Titan Has a Turnaround Plan (for the Carolina Panthers)",
    "link": "https://www.nytimes.com/2025/11/23/business/david-tepper-carolina-panthers.html",
    "summary": "David Tepper, the founder of the $20 billion Appaloosa Management, may have finally cracked the winning code for his flagging N.F.L. team."
  },
  {
    "title": "How to Cook Thanksgiving Turkey",
    "link": "https://cooking.nytimes.com/article/how-to-cook-thanksgiving-turkey",
    "summary": "It’s also the easiest way."
  },
  {
    "title": "Best Thanksgiving Side Dishes | Thanksgiving Recipes 2025 | NYT Cooking",
    "link": "https://cooking.nytimes.com/article/best-thanksgiving-side-dishes",
    "summary": "Because we all know the green bean casserole, stuffing and mashed potatoes are the best part of the meal."
  },
  {
    "title": "The Real Epstein Cover-Up",
    "link": "https://www.nytimes.com/2025/11/22/opinion/epstein-women-feminist-rage.html",
    "summary": "Once again, we see how far this country will go to maintain the power of men at the expense of women’s bodies."
  },
  {
    "title": "America’s Housing Crisis, in One Chart",
    "link": "https://www.nytimes.com/2025/11/23/opinion/housing-crisis-america.html",
    "summary": "If we want more places for people to live, we’re going to have to get more creative."
  },
  {
    "title": "Meet the Beatles, Again",
    "link": "https://www.nytimes.com/2025/11/23/briefing/meet-the-beatles-again.html",
    "summary": "A music reporter revisits the documentary that made him fall in love with the Beatles, ahead of the film’s 30th-anniversary rerelease."
  },
  {
    "title": "We Want to Know: What Are Your Pressing Questions About How Your Life Has Changed This Year Under Trump?",
    "link": "https://www.nytimes.com/2025/11/21/us/we-want-to-know-what-are-your-pressing-questions-about-how-your-life-has-changed-this-year-under-trump.html",
    "summary": "Times journalists will bring you answers."
  },
  {
    "title": "F.B.I. Letters Send Shivers Through California’s Political Inner Circle",
    "link": "https://www.nytimes.com/2025/11/23/us/california-fbi-state-capitol-corruption.html",
    "summary": "The indictment of Gov. Gavin Newsom’s former chief of staff shocked many power players in California. Now, some wonder how far the investigation will spread."
  },
  {
    "title": "Titanic Passenger’s Pocket Watch Sells for $2.3 Million",
    "link": "https://www.nytimes.com/2025/11/23/world/asia/titanic-watch-auction.html",
    "summary": "The watch belonged to Isidor Straus, a co-owner of Macy’s who was traveling first class on the Titanic with his wife when it sank in April 1912."
  },
  {
    "title": "Retiring Before (or After) Your Partner? How to Navigate Money Issues",
    "link": "https://www.nytimes.com/2025/11/22/business/couples-retirement-planning.html",
    "summary": "Too many couples have “undiscussed assumptions” about how they’ll live and spend once they leave the work force, experts say."
  }
]