[
  {
    "title": "After a Chaotic Start, a U.S. Attorney’s Time May Be Running Out",
    "link": "https://www.nytimes.com/2025/07/20/nyregion/alina-habba-us-attorney-new-jersey.html",
    "summary": "Alina Habba, President Trump’s choice to run the U.S. attorney’s office in New Jersey, has pursued investigations against Democrats. Her tenure has damaged morale inside the office."
  },
  {
    "title": "A Kite Surfer, Navy SEAL and Makeup Artist: Freed in a U.S.-Venezuela Swap",
    "link": "https://www.nytimes.com/2025/07/19/world/americas/venezuela-us-prisoner-swap-families.html",
    "summary": "Over 260 people were released from prisons in El Salvador and Venezuela. Now they face the challenge of coming home."
  },
  {
    "title": "Number of Missing in Kerr County, Texas, After Floods Drops to 3",
    "link": "https://www.nytimes.com/2025/07/19/us/texas-floods-kerr-county-missing.html",
    "summary": "The new figure was a significant decline from 97 just days ago. The death toll in the county remained the same, and officials said many of the missing were reported safe."
  },
  {
    "title": "Heavy Rains in Washington Area Flood Roads and Prompt Water Rescues",
    "link": "https://www.nytimes.com/2025/07/19/us/maryland-washington-dc-flooding.html",
    "summary": "More than five inches fell in some suburbs of the capital. The authorities in Maryland rescued dozens of people, including some who were stranded in their cars."
  },
  {
    "title": "Inside the Long Friendship Between Trump and Epstein",
    "link": "https://www.nytimes.com/2025/07/19/us/politics/inside-trump-epstein-friendship.html",
    "summary": "For nearly 15 years, the two men socialized together in Manhattan and Palm Beach, Fla., before a falling out that preceded Mr. Epstein’s first arrest."
  },
  {
    "title": "What to Know About the Fallout Around the Epstein Files and the Trump Administration",
    "link": "https://www.nytimes.com/article/jeffrey-epstein-files-trump.html",
    "summary": "Here’s what to know about the disturbing facts and unsubstantiated suspicions that make Jeffrey Epstein, a registered sex offender, a politically potent obsession."
  },
  {
    "title": "Popular Podcasts Like Joe Rogan and Theo Von Are All Video Now. Who Is Watching?",
    "link": "https://www.nytimes.com/2025/07/20/style/podcast-video-audience.html",
    "summary": "An audio-only medium spawned a giant industry that is now largely focused on video."
  },
  {
    "title": "What Would a Real Friendship With A.I. Look Like? Maybe Like Hers.",
    "link": "https://www.nytimes.com/2025/07/20/magazine/ai-chatbot-friendship-character.html",
    "summary": "Chatbots can get scary if you suspend your disbelief. But MJ Cocking didn’t — and wound up in a relationship that was strangely, helpfully real."
  },
  {
    "title": "Israel Issues Evacuation Order for New Area in Gaza",
    "link": "https://www.nytimes.com/2025/07/20/world/middleeast/israel-gaza-military-evacuation.html",
    "summary": "The military told Palestinians to leave an area where many have sought refuge during the 21-month war and warned that it may expand operations."
  },
  {
    "title": "Inside the Reindustrialize Summit and Its Push to Revive U.S. Manufacturing",
    "link": "https://www.nytimes.com/2025/07/20/us/manufacturing-tech-trump-reindustrialize.html",
    "summary": "Trump cabinet officials mingled with tech investors and manufacturers in an effort to supercharge factories."
  },
  {
    "title": "As Trump Courts a More Assertive Beijing, China Hawks Are Losing Out",
    "link": "https://www.nytimes.com/2025/07/20/us/politics/trump-china-technology.html",
    "summary": "The Trump administration has dialed back aggressive measures against China and reversed its position on technology controls as the president angles for a Chinese trip later this year."
  },
  {
    "title": "China Exit Ban on Wells Fargo Executive Stokes Foreign Business Anxiety",
    "link": "https://www.nytimes.com/2025/07/20/business/china-exit-ban-business-anxiety.html",
    "summary": "The case comes around the same time a Japanese pharmaceutical executive was imprisoned, adding to growing unease even as Beijing tries to court overseas investors."
  },
  {
    "title": "Mamdani Won Over N.Y.C. Democratic Voters. Can He Charm Washington?",
    "link": "https://www.nytimes.com/2025/07/20/nyregion/mamdani-democratic-party.html",
    "summary": "National Democrats are grappling with how much to embrace Assemblyman Zohran Mamdani, a leftist who has become the party’s standard-bearer in America’s largest city."
  },
  {
    "title": "​A Trump-Themed Beach House vs. ‘the Hamptons of the South’",
    "link": "https://www.nytimes.com/2025/07/20/us/trump-signs-florida.html",
    "summary": "Local officials spent years trying to force Marvin Peavy to remove the giant pro-Trump banners from his home in the Florida Panhandle. This summer, Mr. Peavy is basking in victory."
  },
  {
    "title": "Should Food Stamps Pay for Soda?",
    "link": "https://www.nytimes.com/2025/07/19/upshot/soda-food-stamps-snap.html",
    "summary": "Colorado and Texas are among the states aiming to change what food and drink can be bought with SNAP benefits."
  },
  {
    "title": "Why American Jews No Longer Understand One Another",
    "link": "https://www.nytimes.com/2025/07/20/opinion/antisemitism-american-jews-israel-mamdani.html",
    "summary": "The consensus that held them together for generations is breaking down."
  },
  {
    "title": "I Teach Creative Writing. This Is What A.I. Is Doing to Students.",
    "link": "https://www.nytimes.com/2025/07/18/opinion/ai-chatgpt-school.html",
    "summary": "We need to reckon with what ChatGPT is doing to the classroom and to human expression."
  },
  {
    "title": "Investigators in L.A. Explosion Examine Condo for Link to Explosives",
    "link": "https://www.nytimes.com/2025/07/19/us/los-angeles-explosion-santa-monica-devices.html",
    "summary": "Officials were looking into whether the explosion, which killed three sheriff’s deputies, was caused by devices seized from a condo in Santa Monica a day before the blast."
  },
  {
    "title": "The Pelicot Trial Returns, This Time to the Stage",
    "link": "https://www.nytimes.com/2025/07/19/pelicot-trial-avignon-play.html",
    "summary": "Many of those who attended the trial returned to see a new play based on the case of Gisèle Pelicot, who confronted her ex-husband and dozens of men accused of raping her."
  },
  {
    "title": "The K-Pop Band Big Ocean Is Making Waves With Sign Language",
    "link": "https://www.nytimes.com/2025/07/20/world/asia/k-pop-sign-language.html",
    "summary": "Big Ocean, a boy band whose members are deaf or hard of hearing, has found success with a mix of singing and signing."
  }
]