[
  {
    "title": "How China Influences Elections in America’s Biggest City",
    "link": "https://www.nytimes.com/2025/08/25/nyregion/china-consulate-new-york-elections.html",
    "summary": "The Chinese consulate in Manhattan has mobilized community groups to defeat candidates who don’t fall in line with the authoritarian state."
  },
  {
    "title": "中共如何影响纽约的各级选举",
    "link": "https://www.nytimes.com/zh-hans/2025/08/25/nyregion/china-consulate-new-york-elections.html",
    "summary": "同乡会等团体已成为中国驻纽约领事馆干预纽约各级选举的工具。这些组织大力扶持那些持亲中共立场的候选人、阻挠那些反对北京的政治人物。"
  },
  {
    "title": "Red Envelopes With Cash Are Changing Hands at Adams Campaign Rallies",
    "link": "https://www.nytimes.com/2025/08/21/nyregion/eric-adams-chinese-cash-envelopes.html",
    "summary": "New York Times reporters witnessed supporters of Mayor Eric Adams handing out cash-filled envelopes. Sometimes, that money went to reporters from Chinese-language outlets."
  },
  {
    "title": "How China Is Influencing N.Y. Elections, and What Ghislaine Maxwell Told D.O.J. Officials",
    "link": "https://www.nytimes.com/2025/08/25/podcasts/the-headlines/china-ny-elections-ghislaine-maxwell.html",
    "summary": "Plus, Spotify playlists can spill your secrets."
  },
  {
    "title": "Trump Relies on Personal Diplomacy With Putin. The Result Is a Strategic Muddle.",
    "link": "https://www.nytimes.com/2025/08/25/us/politics/trump-diplomacy-putin-alaska-ukraine-war.html",
    "summary": "For President Trump, consistency is less important than leader-to-leader diplomacy."
  },
  {
    "title": "Expecting on the Front Lines: Motherhood in Ukraine’s Military",
    "link": "https://www.nytimes.com/2025/08/25/world/europe/ukraine-military-war-pregnancy.html",
    "summary": "Pregnant Ukrainian soldiers say they are fighting for the future of their country and for their children."
  },
  {
    "title": "What’s Next for Ukraine After All That Diplomacy?",
    "link": "https://www.nytimes.com/2025/08/25/world/europe/ukraine-russia-war-whats-next-summits.html",
    "summary": "After President Trump held talks with President Vladimir V. Putin, he said the Russian leader would be willing to meet with Ukraine’s president. That seems less and less likely."
  },
  {
    "title": "E1 Settlement in West Bank Tied to Greater Israel Goal",
    "link": "https://www.nytimes.com/2025/08/25/world/middleeast/west-bank-e1-israel.html",
    "summary": "Israel’s approval of a settlement project delayed for decades shows how far Prime Minister Benjamin Netanyahu has gone in dashing Palestinian aspirations."
  },
  {
    "title": "Four Journalists Among Those Killed in Israeli Strikes on Gaza Hospital, Officials Say",
    "link": "https://www.nytimes.com/2025/08/25/world/middleeast/gaza-hospital-journalists.html",
    "summary": "Gaza-based reporters said the four had worked for various international media outlets. The Israeli military confirmed its forces had struck the hospital area, without saying why."
  },
  {
    "title": "In Washington Crackdown, Making a Federal Case Out of Low-Level Arrests",
    "link": "https://www.nytimes.com/2025/08/24/us/politics/trump-dc-crime-takeover-federal-court.html",
    "summary": "A single afternoon in court illustrated the new ways in which laws are being enforced after President Trump’s takeover of the city’s police."
  },
  {
    "title": "China Looms Large as South Korea’s President Meets With Trump",
    "link": "https://www.nytimes.com/2025/08/24/world/asia/south-korea-president-trump-meeting-us-china.html",
    "summary": "Washington’s increasing focus on Beijing is straining the decades-old alliance between South Korea and the United States."
  },
  {
    "title": "Trump Threatens to Investigate Chris Christie Over ‘Bridgegate’",
    "link": "https://www.nytimes.com/2025/08/25/us/politics/trump-chris-christie-bridgegate.html",
    "summary": "President Trump floated the idea after the former governor of New Jersey, a onetime ally, criticized his use of the Justice Department."
  },
  {
    "title": "Katherine LaNasa Earned Her Role in ‘The Pitt’ the Hard Way",
    "link": "https://www.nytimes.com/2025/08/25/arts/television/katherine-lanasa-emmys-the-pitt.html",
    "summary": "The actress received an Emmy nod for her performance as a seasoned E.R. nurse, a woman who has seen it all and lived to keep fighting. So has LaNasa."
  },
  {
    "title": "The Real Reason Americans Worry About Trade",
    "link": "https://www.nytimes.com/2025/08/25/business/tariffs-layoffs-safety-net.html",
    "summary": "Behind the pushback to global trade is a deep economic anxiety that a meager social safety net has caused in the United States."
  },
  {
    "title": "Workers Who Lost Jobs to Trade Needed Help. Washington Cut the Funding.",
    "link": "https://www.nytimes.com/2025/08/25/business/trade-layoffs-job-assistance.html",
    "summary": "Trade Adjustment Assistance was supposed to help people whose jobs were threatened by overseas competition, but Congress eroded its support starting in the 1980s."
  },
  {
    "title": "What Does It Take to Get Men to See a Doctor?",
    "link": "https://www.nytimes.com/2025/08/25/magazine/mens-health-doctor-masculinity.html",
    "summary": "Men in the U.S. live six fewer years than women. One clinic is trying to persuade men that getting checked out could save their life."
  },
  {
    "title": "5 Years On, China’s Property Crisis Has No End in Sight",
    "link": "https://www.nytimes.com/2025/08/25/business/china-property-downturn.html",
    "summary": "The government had set out to slow speculation, kicking off a slowdown in real estate values that is still grinding on with wide economic consequences."
  },
  {
    "title": "China Evergrande Delisted From Hong Kong Stock Exchange",
    "link": "https://www.nytimes.com/2025/08/24/business/china-evergrande-delisted.html",
    "summary": "China Evergrande, delisted from the Hong Kong Stock Exchange on Monday, leaves behind a giant pile of debt and a long line of desperate creditors."
  },
  {
    "title": "Columbia Got Most of Its Research Funding Back. The Damage Goes Deeper.",
    "link": "https://www.nytimes.com/2025/08/25/nyregion/columbia-trump-federal-money-returned.html",
    "summary": "While the university was able to strike a deal with the Trump administration, the national outlook for federal science funding remains bleak."
  },
  {
    "title": "The Typical American College Student Is Not Who You Think It Is",
    "link": "https://www.nytimes.com/2025/08/25/us/us-typical-college-student.html",
    "summary": "As a fight over the future of elite higher education consumes university leaders and politicians, most college students live in a very different world with very different challenges."
  },
  {
    "title": "Dusky Gopher Frogs Are Making a Comeback in Mississippi",
    "link": "https://www.nytimes.com/2025/08/20/climate/mississippi-dusky-gopher-frog.html",
    "summary": "Fewer than 100 dusky gopher frogs were known to remain. Thanks to some very dedicated humans, numbers are now on the rise."
  },
  {
    "title": "Krispy Kreme Bets on Big-Box Stores to Stay Fresh",
    "link": "https://www.nytimes.com/2025/08/25/business/krispy-kreme-sales-revenue-stock.html",
    "summary": "Executives are racing to boost revenues at the struggling doughnut maker as sales slump and shares tumble."
  },
  {
    "title": "A Star in Russia’s Media World Joins Ukraine’s Army",
    "link": "https://www.nytimes.com/2025/08/25/opinion/russia-media-ukraine-army.html",
    "summary": "On the ground in Kharkiv, the choices are starkly different."
  },
  {
    "title": "If We Want a Better Congress, We Should Pay Its Members More",
    "link": "https://www.nytimes.com/2025/08/25/opinion/congress-salary-stock-trading.html",
    "summary": "Few are happy with how Congress is performing these days, including its members, with increasingly unpleasant jobs. It’s time to recruit better talent."
  },
  {
    "title": "Cases Closed",
    "link": "https://www.nytimes.com/2025/08/25/briefing/president-trump-law.html",
    "summary": "We explore how President Trump selectively enforces the law."
  },
  {
    "title": "Keurig Dr Pepper to Acquire Peet’s in $18 Billion Deal",
    "link": "https://www.nytimes.com/2025/08/25/business/keurig-drpepper-peets-coffee-drinks.html",
    "summary": "After the takeover, the company will split into two businesses, one focusing on coffee and one on soft drinks."
  },
  {
    "title": "Mamdani’s Voters Want Free Child Care. Here’s How He Could Do It.",
    "link": "https://www.nytimes.com/2025/08/25/nyregion/zohran-mamdani-free-child-care-nyc-mayor.html",
    "summary": "Zohran Mamdani’s coalition in the New York mayor’s race includes residents who have questioned whether they can afford to raise children in the city."
  },
  {
    "title": "North Korea’s Glossy New Surface: Apps, Beaches and a Fake Starbucks",
    "link": "https://www.nytimes.com/2025/08/25/world/asia/north-korea-foreign-tourism.html",
    "summary": "Videos taken by visitors to the isolated country provide a rare glimpse of how it’s mimicking the consumerism of the outside world."
  },
  {
    "title": "Philadelphia Transit Cuts Take Hold, and Commuters Begin to Feel the Pain",
    "link": "https://www.nytimes.com/2025/08/25/us/philadelphia-transit-cuts.html",
    "summary": "A budget shortfall has led the city’s transit authority to cut its bus and rail services by 20 percent."
  }
]