[
  {
    "title": "Amid the Gaza War, Israel Is More Divided and Isolated Than Ever",
    "link": "https://www.nytimes.com/2025/10/05/world/middleeast/israel-challenges-gaza-war.html",
    "summary": "The longest war of an endless Israeli-Palestinian conflict has come to challenge Israel’s own image and understanding of itself."
  },
  {
    "title": "Israel and Hamas Prepare for Talks on Trump’s Plan to End Gaza War",
    "link": "https://www.nytimes.com/2025/10/05/world/middleeast/trump-israel-hamas-gaza.html",
    "summary": "Indirect negotiations through mediators are planned for Monday in Egypt and are expected to focus on one main issue, swapping hostages for Palestinian prisoners. That may leave talks on other obstacles to ending the war until later."
  },
  {
    "title": "Not All National Parks Remain Open in the Shutdown. Here’s What to Know.",
    "link": "https://www.nytimes.com/2025/10/05/us/shutdown-national-parks.html",
    "summary": "Some underground attractions are closed, and many outdoor sites have reduced their services."
  },
  {
    "title": "Push for Military Coverage of I.V.F. Faces Challenge in Congress",
    "link": "https://www.nytimes.com/2025/10/05/us/politics/military-ivf-congress.html",
    "summary": "A proposal to expand the Defense Department’s health care plan to include in vitro fertilization is moving through Congress but could die behind closed doors, again."
  },
  {
    "title": "Judge Blocks Trump’s Deployment of National Guard in Portland, Ore.",
    "link": "https://www.nytimes.com/2025/10/04/us/politics/judge-blocks-national-guard-portland.html",
    "summary": "A federal judge appointed by President Trump issued a temporary restraining order, siding for now with Oregon and Portland lawyers who called federalizing the guard a presidential overreach."
  },
  {
    "title": "Can Conversion Therapy Be Banned? Supreme Court Will Decide on Colorado Law.",
    "link": "https://www.nytimes.com/2025/10/05/us/politics/supreme-court-conversion-therapy.html",
    "summary": "Colorado and more than 20 other states restrict therapists from trying to change the gender identity or sexual orientation of clients under age 18."
  },
  {
    "title": "A Pacific Gateway Shows the Kremlin’s Grip on Russia’s Vast Expanse",
    "link": "https://www.nytimes.com/2025/10/05/world/europe/vladivostok-moscow-kremlin-rule.html",
    "summary": "In a country where power is highly centralized, Moscow sets the tone for Vladivostok, 4,000 miles away, complicating longstanding ambitions to make it a trading powerhouse."
  },
  {
    "title": "Russia Targets Ukraine’s Energy Infrastructure With Deadly Bombardment",
    "link": "https://www.nytimes.com/2025/10/05/world/europe/russia-ukraine-strikes-energy-lviv.html",
    "summary": "At least five people were killed before dawn in another large-scale and wide-ranging assault."
  },
  {
    "title": "Cows Wear High-Tech Collars Now",
    "link": "https://www.nytimes.com/2025/10/05/technology/cows-ai-collars.html",
    "summary": "The wearables help dairy farmers gather more data so their animals are happier and produce more milk."
  },
  {
    "title": "The West Is Defined by Loss",
    "link": "https://www.nytimes.com/2025/10/05/opinion/west-europe-america-lost.html",
    "summary": "Loss has become a pervasive condition of life in Europe and America."
  },
  {
    "title": "They Have Waited Two Years for the Hostages. These Are Their Rituals.",
    "link": "https://www.nytimes.com/2025/10/05/opinion/israel-gaza-hostages-october-7-anniversary.html",
    "summary": "Families of captives in Gaza find private ways to stay connected to their loved ones."
  },
  {
    "title": "Donald Trump, the Sports Fan",
    "link": "https://www.nytimes.com/2025/10/05/world/hostage-deal-israel-hamas-portland-syria.html",
    "summary": "Today, we take a look at the president’s sports fandom and what it reveals about his worldview."
  },
  {
    "title": "Texas L.G.B.T.Q. Teenagers and Families Navigate a Public School Clampdown",
    "link": "https://www.nytimes.com/2025/10/05/us/politics/texas-lgbtq-schools.html",
    "summary": "Under a new state law, public schools can no longer sponsor gay and gender clubs or “assist” with transitioning, but implementation appears to be varying by the politics of the districts."
  },
  {
    "title": "A Chilling New Tactic in Nicaragua: Arrest, Then Silence",
    "link": "https://www.nytimes.com/2025/10/05/us/a-chilling-new-tactic-in-nicaragua-arrest-then-silence.html",
    "summary": "Nicaragua’s authoritarian government has begun holding dissidents without revealing their whereabouts or acknowledging their detention. Two have turned up dead."
  },
  {
    "title": "New York City Is Full of Green Space. You Just Have to Find It.",
    "link": "https://www.nytimes.com/2025/10/05/nyregion/new-york-city-green-space.html",
    "summary": "The city’s millions of residents are crammed together, competing for space to live, play, work and rest."
  }
]