[
  {
    "title": "Columbia and Brown to Disclose Admissions and Race Data in Trump Deal",
    "link": "https://www.nytimes.com/2025/08/05/nyregion/columbia-brown-admissions-trump.html",
    "summary": "A widely overlooked part of a settlement with the two universities could profoundly alter how elite schools determine who gets accepted."
  },
  {
    "title": "Trump’s Deal-Making With Other Elite Schools Scrambles Harvard Negotiations",
    "link": "https://www.nytimes.com/2025/08/04/us/politics/harvard-trump-brown.html",
    "summary": "The university was open to spending $500 million, but a $50 million settlement with Brown has prompted new debates in Cambridge."
  },
  {
    "title": "Inside Jeffrey Epstein’s Manhattan Townhouse: Birthday Letters, First Edition ‘Lolita’ and More",
    "link": "https://www.nytimes.com/2025/08/05/us/jeffrey-epstein-mansion-photos.html",
    "summary": "In his seven-story townhouse, the sex offender hosted the elite, displayed photos with presidents and showcased a first edition of “Lolita,” according to previously unreported photos and letters."
  },
  {
    "title": "Ghislaine Maxwell Opposes Request to Unseal Epstein Grand Jury Papers",
    "link": "https://www.nytimes.com/2025/08/05/nyregion/epstein-maxwell-grand-jury-unsealing.html",
    "summary": "The disgraced financier’s former companion said disclosure would harm her legal rights. “Jeffrey Epstein is dead,” her lawyers wrote. “Ghislaine Maxwell is not.”"
  },
  {
    "title": "House Oversight Committee Issues Subpoenas for Epstein Files",
    "link": "https://www.nytimes.com/2025/08/05/us/politics/epstein-files-subpoenas.html",
    "summary": "The committee’s Republican chairman requested that the documents from the Justice Department and former government officials be delivered by Aug. 19."
  },
  {
    "title": "E.P.A. Moves to Cancel $7 Billion in Grants for Solar Energy",
    "link": "https://www.nytimes.com/2025/08/05/climate/epa-cancels-solar-energy-grants.html",
    "summary": "If finalized, the move would escalate the Trump administration’s efforts to claw back billions of dollars in climate grants awarded under President Biden."
  },
  {
    "title": "Inside Trump’s New Tactic to Separate Immigrant Families",
    "link": "https://www.nytimes.com/2025/08/05/us/politics/trump-administration-family-separation.html",
    "summary": "The practice appears to be a more targeted version of the mass separation of migrant children from their parents from President Trump’s first term, which caused a global outcry."
  },
  {
    "title": "Trumps Claims Discrimination by Banks Ahead of ‘Debanking’ Crackdown",
    "link": "https://www.nytimes.com/2025/08/05/business/trump-debanking-jpmorgan.html",
    "summary": "JPMorgan and Bank of America rejected Trump Organization deposits, the president said, fueling his displeasure with Wall Street."
  },
  {
    "title": "Bite Club: The Fraternity That Awaits You After a Shark Attack",
    "link": "https://www.nytimes.com/2025/08/05/world/australia/shark-attack-bite-club.html",
    "summary": "Very few people know what it’s like to recover, physically and emotionally, from a shark bite. But some of the ones who do are ready to help."
  },
  {
    "title": "F.B.I. Is Asked to Arrest Texas Democrats in Battle Over House Seats",
    "link": "https://www.nytimes.com/2025/08/05/us/politics/fbi-texas-democrats.html",
    "summary": "It was unclear how the agency would respond. Democratic lawmakers left the state to stop Republicans from redrawing district maps to their advantage."
  },
  {
    "title": "G.O.P. Bets Big on Latino Voters With New Texas Map",
    "link": "https://www.nytimes.com/2025/08/05/us/politics/republican-redistricting-latinos.html",
    "summary": "In order to flip five U.S. House seats, Republicans are gambling that they can retain President Trump’s 2024 gains with Latinos and that voters won’t mind their hardball tactics."
  },
  {
    "title": "Does Japan Want American Cars? Trump’s Push to Open Foreign Markets Faces Test.",
    "link": "https://www.nytimes.com/2025/08/05/business/trump-tariffs-japan.html",
    "summary": "President Trump is celebrating deals that lower trade barriers on American staples like cars. Experts question how much of an effect this will have."
  },
  {
    "title": "What to Know About India’s Trade in Oil With Russia",
    "link": "https://www.nytimes.com/2025/08/05/business/india-russia-oil.html",
    "summary": "President Trump accused India of aiding Moscow’s war on Ukraine by purchasing Russian energy, derailing trade talks between India and the United States."
  },
  {
    "title": "U.S. Imports Slid in June on Higher Tariffs",
    "link": "https://www.nytimes.com/2025/08/05/business/economy/imports-data-trump-tariffs.html",
    "summary": "Imports from other countries fell around 4 percent from the previous month as President Trump’s steep tariffs discouraged businesses from ordering goods."
  },
  {
    "title": "UN Security Council to Discuss Israel-Gaza War and Hostages",
    "link": "https://www.nytimes.com/2025/08/05/world/middleeast/un-israel-gaza-war-hostages.html",
    "summary": "The Israeli government said it had allowed some private businesses to resume importing goods into Gaza, which has been gripped by severe hunger."
  },
  {
    "title": "How Tech Firms Like Google and Meta Are Embracing the Military",
    "link": "https://www.nytimes.com/2025/08/04/technology/google-meta-openai-military-war.html",
    "summary": "In a major shift, Google, OpenAI, Meta and venture capitalists — many of whom had once forsworn involvement in war — have embraced the military industrial complex."
  },
  {
    "title": "OpenAI to Open-Source Some of the A.I. Systems Behind ChatGPT",
    "link": "https://www.nytimes.com/2025/08/05/technology/openai-artificial-intelligence-chatgpt.html",
    "summary": "In a major shift, the company is “open sourcing” two A.I. systems, freely sharing the technology with outside researchers and businesses."
  },
  {
    "title": "China Wages War on Chikungunya Virus With Drones and ‘Elephant Mosquitoes’",
    "link": "https://www.nytimes.com/2025/08/05/world/asia/china-chikungunya-virus-mosquitoes-covid.html",
    "summary": "In a citywide campaign to curb a mosquito-borne virus, residents of Foshan face inspections and warnings for failure to comply."
  },
  {
    "title": "Titan Submersible Deaths Were Preventable, Coast Guard Report Says",
    "link": "https://www.nytimes.com/2025/08/05/us/titan-sub-implosion-coast-guard-report.html",
    "summary": "The 2023 implosion killed five people on a dive to the wreckage of the Titanic, prompting a sprawling search of the north Atlantic Ocean."
  },
  {
    "title": "Photos: What Atomic Bombs Did to Hiroshima and Nagasaki",
    "link": "https://www.nytimes.com/2025/08/05/world/asia/hiroshima-nagasaki-japan-nuclear-photos.html",
    "summary": "What the world’s only atomic bombings, carried out by Americans, did to Hiroshima and Nagasaki."
  },
  {
    "title": "Restaurant Review: Kwame Onwuachi’s Dōgon in Washington D.C.",
    "link": "https://www.nytimes.com/2025/08/05/dining/kwame-dogon-washington-dc-restaurant-review.html",
    "summary": "Dōgon is bigger and more polished than its New York cousin, and every bit as ambitious."
  },
  {
    "title": "The America We Knew Is Rapidly Slipping Away",
    "link": "https://www.nytimes.com/2025/08/04/opinion/columnists/friedman-trump-labor-firing.html",
    "summary": "When Trump fired the top labor statistics official, the aides responsible for running our economy went along for the ride."
  },
  {
    "title": "Trump Has Soured on Putin. Putin Couldn’t Care Less.",
    "link": "https://www.nytimes.com/2025/08/05/opinion/putin-trump-deadline-ukraine.html",
    "summary": "Vladimir Putin has lost faith in the very idea of reaching agreements with the United States."
  },
  {
    "title": "The Redistricting Clash in Texas, Explained",
    "link": "https://www.nytimes.com/2025/08/05/briefing/texas-house-democrats.html",
    "summary": "We take a look at the political fight over a redrawn map."
  },
  {
    "title": "Tennessee Inmate Executed Despite Ethical Health Concerns",
    "link": "https://www.nytimes.com/2025/08/05/us/politics/tennessee-execution-heart-implant.html",
    "summary": "Lawyers for Byron Black, found guilty of three murders, had argued that an execution may be more painful because of his heart implant."
  },
  {
    "title": "Jeju Air Plane Crash Highlights Decades of Blunders and Deadly Runway Wall",
    "link": "https://www.nytimes.com/2025/08/05/world/asia/jeju-air-crash-south-korea-investigation.html",
    "summary": "The New York Times identified a series of missteps that made a Jeju Air flight’s catastrophic end much more deadly."
  },
  {
    "title": "Ozzy Osbourne Died of a Heart Attack, Death Certificate Shows",
    "link": "https://www.nytimes.com/2025/08/05/arts/music/ozzy-osbourne-cause-of-death.html",
    "summary": "The document also notes that he suffered from Parkinson’s disease."
  },
  {
    "title": "The Raging Gifford Fire, Like Many, Began Near a Highway",
    "link": "https://www.nytimes.com/2025/08/05/us/california-gifford-fire-evacuation-orders.html",
    "summary": "The wildfire in the Los Padres National Forest grew to 82,000 acres on Tuesday. Officials are still trying to determine the cause."
  }
]