[
  {
    "title": "Tyler Robinson, Charlie Kirk Shooting Suspect, Went From Scholarship Winner to Wanted Man",
    "link": "https://www.nytimes.com/2025/09/12/us/politics/tyler-robinson-charlie-kirk.html",
    "summary": "Tyler Robinson, the man accused of shooting Charlie Kirk, was a stellar student in high school, raised in a Republican home in Southwest Utah and training to be an electrician."
  },
  {
    "title": "What Made Charlie Kirk Influential?",
    "link": "https://www.nytimes.com/video/us/politics/100000010393233/what-made-charlie-kirk-influential.html",
    "summary": "Ken Bensinger, a New York Times reporter covering media and politics who has interviewed Charlie Kirk several times, recalls his influence on right-wing activism and the American political landscape."
  },
  {
    "title": "Right-Wing Activists Urge Followers to Expose Those Celebrating Charlie Kirk Killing",
    "link": "https://www.nytimes.com/2025/09/12/us/politics/charlie-kirk-shooting-firings-celebration.html",
    "summary": "The widespread and fast-moving campaign has already resulted in lost jobs, suspensions and internal investigations, heightening tensions online between supporters and detractors of Charlie Kirk."
  },
  {
    "title": "Special Episode: A Suspect Is Caught in Charlie Kirk’s Assassination",
    "link": "https://www.nytimes.com/2025/09/12/podcasts/the-daily/charlie-kirk-news-suspect.html",
    "summary": "What we know about the arrest and the alleged killer’s motives."
  },
  {
    "title": "E.P.A. To Stop Collecting Emissions Data From Polluters",
    "link": "https://www.nytimes.com/2025/09/12/climate/epa-emissions-data-collection-halt.html",
    "summary": "The data, from thousands of coal-burning power plants, oil refineries, steel mills and other industrial facilities, is the country’s most comprehensive way to track greenhouse gases."
  },
  {
    "title": "Man Fatally Shot in Confrontation With ICE Officers in Chicago Area",
    "link": "https://www.nytimes.com/2025/09/12/us/ice-shooting-chicago.html",
    "summary": "The shooting took place during a federal crackdown on illegal immigration in the region. Officials said an ICE officer was dragged and injured."
  },
  {
    "title": "Former Judge Sushila Karki Named Nepal’s Leader After Gen Z Protests",
    "link": "https://www.nytimes.com/2025/09/12/world/asia/nepal-protests-leader-karki-gen-z.html",
    "summary": "Sushila Karki, a former chief justice, was the choice of the student protesters whose mass rallies led to violent clashes and toppled the government."
  },
  {
    "title": "Is ‘The Pitt’ Really an ‘ER’ Spinoff? Michael Crichton’s Estate Says It Is.",
    "link": "https://www.nytimes.com/2025/09/12/business/the-pitt-er-michael-crichton-lawsuit.html",
    "summary": "The estate of the best-selling author, which has intellectual property rights to “ER,” and the creators of the new hit TV show are waging a legal battle over whether it’s a stealth reboot."
  },
  {
    "title": "Mamdani, if Elected Mayor, Pledges to Order N.Y.P.D. to Arrest Netanyahu",
    "link": "https://www.nytimes.com/2025/09/12/nyregion/mamdani-arrest-netanyahu-nyc-mayor.html",
    "summary": "Zohran Mamdani expanded on his vow to arrest Prime Minister Benjamin Netanyahu, saying it would show that New York “stands up for international law.” Experts said the move would be impractical and likely illegal."
  },
  {
    "title": "For the First Time in the Mayor’s Race, Cuomo Campaigns at a Mosque",
    "link": "https://www.nytimes.com/2025/09/12/nyregion/andrew-cuomo-visits-mosque-nyc-mayor.html",
    "summary": "Andrew M. Cuomo, who has faced criticism for bypassing mosques as he seeks to become mayor, spoke of New York as a beacon of opportunity during an appearance in the Bronx."
  },
  {
    "title": "Trump Says It Looks Like Mamdani Is ‘Going to Win’",
    "link": "https://www.nytimes.com/2025/09/12/nyregion/trump-mamdani-nyc-mayor.html",
    "summary": "President Trump said on Friday that he believed Zohran Mamdani, the Democratic nominee for mayor of New York City, would win, likening that outcome to a “rebellion.”"
  },
  {
    "title": "NATO Steps Up Defenses After Russian Drones Violate Polish Airspace",
    "link": "https://www.nytimes.com/2025/09/12/world/europe/nato-eastern-europe-drone-defenses.html",
    "summary": "Increased air patrols, air defense systems and other protections will be mobilized over Eastern Europe."
  },
  {
    "title": "Roblox Sued for Wrongful Death After Teenager’s Suicide",
    "link": "https://www.nytimes.com/2025/09/12/technology/roblox-lawsuit-child-safety.html",
    "summary": "At age 7, Ethan Dallas began playing the online game, where he met Nate. Deadly abuse followed, said Ethan’s mother, who blames Roblox."
  },
  {
    "title": "Natalie Massenet and Erik Torstensson’s Messy Split, in Dueling Lawsuits",
    "link": "https://www.nytimes.com/2025/09/12/fashion/natalie-massenet-erik-torstensson-breakup-lawsuits.html",
    "summary": "In the messy, public split of the Net-a-Porter founder Natalie Massenet and Erik Torstensson, no accusations seem off limits."
  },
  {
    "title": "In High-Profile Closings, Los Angeles Restaurateurs See Trouble",
    "link": "https://www.nytimes.com/2025/09/11/dining/los-angeles-restaurants-closings.html",
    "summary": "The city’s turmoil, from wildfires to curfews, has exacted a toll on some of its best-loved restaurants and raised worries about the future."
  },
  {
    "title": "As Los Angeles Olympics Loom, Critics Worry Its Cultural Plan Is Lagging",
    "link": "https://www.nytimes.com/2025/09/11/arts/design/los-angeles-olympics-cultural-plan-lagging.html",
    "summary": "Planning and fund-raising for the “Cultural Olympiad,” the arts programming that is part of the 2028 games, should have been well underway by now, several experts say."
  },
  {
    "title": "As Missouri Redistricts, the Career of Rep. Emanuel Cleaver Teeters",
    "link": "https://www.nytimes.com/2025/09/12/us/missouri-redistricting-emanuel-cleaver-kansas-city.html",
    "summary": "The Missouri Senate passed new borders on Friday that Republicans believe would benefit their party by splitting up the district of Representative Emanuel Cleaver, a Democrat."
  },
  {
    "title": "Atlantic Settles Writer’s Suit Over Article It Retracted",
    "link": "https://www.nytimes.com/2025/09/12/business/media/atlantic-defamation-lawsuit-settlement.html",
    "summary": "The writer, Ruth Shalit Barrett, had accused the magazine of defaming her in a lengthy editor’s note."
  },
  {
    "title": "A Plea for President Trump With a Fragile Country on Edge",
    "link": "https://www.nytimes.com/2025/09/12/opinion/donald-trump-charlie-kirk-aftermath.html",
    "summary": "Even if it sounds unrealistic, Trump can do something important with the entire country frayed and on edge: push for calm and unity."
  },
  {
    "title": "‘I Was Wrong About Charlie Kirk’: Six Conservative Students on His Killing",
    "link": "https://www.nytimes.com/2025/09/12/opinion/campus-conservatives-charlie-kirk.html",
    "summary": "We Don’t Want Echo Chambers"
  },
  {
    "title": "Suspect Arrested in Killing of Charlie Kirk",
    "link": "https://www.nytimes.com/2025/09/12/briefing/suspect-arrested-in-killing-of-charlie-kirk.html",
    "summary": "Also, Trump said he would send the National Guard to Memphis. Here’s the latest at the end of Friday."
  },
  {
    "title": "Tesla Board Chair Defend’s Elon Musk’s Humongous Pay Proposal",
    "link": "https://www.nytimes.com/2025/09/12/business/tesla-elon-musk-pay-robyn-denholm.html",
    "summary": "Robyn Denholm, normally media shy, is campaigning to get shareholders to back the chief executive’s trillion-dollar compensation package."
  },
  {
    "title": "David Ellison’s Spending at Paramount Has Changed Hollywood’s Mood",
    "link": "https://www.nytimes.com/2025/09/12/business/ellison-paramount-warner-bros.html",
    "summary": "David Ellison has gotten off to a fast start as the owner of Paramount, at least when it comes to buying things."
  },
  {
    "title": "Ego Nwodim Leaves ‘S.N.L.’ After 7 Seasons",
    "link": "https://www.nytimes.com/2025/09/12/arts/television/ego-nwodim-leaving-snl.html",
    "summary": "Nwodim, known for characters including Lisa From Temecula, is the fifth cast member to leave the sketch comedy show this summer."
  },
  {
    "title": "Marilyn Diamond, Who Wrote a Blockbuster Diet Book, Dies at 81",
    "link": "https://www.nytimes.com/2025/09/12/books/marilyn-diamond-dead.html",
    "summary": "“Fit for Life,” which she wrote with her husband, was a best seller in the 1980s promoting good health ahead of weight loss. But doctors were critical."
  }
]