[
  {
    "title": "Trump Pulls Military Into Another Political Issue",
    "link": "https://www.nytimes.com/2025/08/11/us/politics/trump-military-washington.html",
    "summary": "The National Guard troops who will move into Washington, D.C., will not perform law enforcement tasks but may be able to detain people temporarily, officials said."
  },
  {
    "title": "Trump Takes Control of D.C. Police, Citing ‘Bloodthirsty Criminals.’ But Crime Is Down.",
    "link": "https://www.nytimes.com/2025/08/11/us/politics/trump-washington-dc-police.html",
    "summary": "The president has railed against crime in urban, largely liberal cities for decades, but Monday’s announcement was an extraordinary exertion of federal power over an American city."
  },
  {
    "title": "Does President Trump Want to Be Mayor, Too?",
    "link": "https://www.nytimes.com/2025/08/11/us/politics/trump-mayor-washington-dc-crime.html",
    "summary": "President Trump has long railed about crime in blue cities. Now he’s effectively put himself in charge of policing one of them."
  },
  {
    "title": "Trump Names EJ Antoni New BLS Commissioner",
    "link": "https://www.nytimes.com/2025/08/11/business/economy/trump-bls-commissioner.html",
    "summary": "President Trump fired the Bureau of Labor Statistics chief earlier this month after a downbeat jobs report. The move has raised concerns about the credibility of economic data going forward."
  },
  {
    "title": "Harvard Nears a Deal With the Trump Administration to Restore Funding",
    "link": "https://www.nytimes.com/2025/08/11/us/trump-harvard-settlement-negotiations.html",
    "summary": "A potential $500 million settlement would end a monthslong battle that pitted the nation’s wealthiest school against the Trump administration’s extraordinary crackdown on higher education."
  },
  {
    "title": "Trump Extends China Tariff Truce by Three Months",
    "link": "https://www.nytimes.com/2025/08/11/us/politics/us-china-trade-tariffs-deal.html",
    "summary": "President Trump’s order continues a reprieve from the threat of escalating tariffs and export controls, which rocked the global economy earlier this year."
  },
  {
    "title": "Brazil Clamped Down on Big Tech. Trump’s Tariffs Could Change That.",
    "link": "https://www.nytimes.com/2025/08/11/world/americas/brazil-big-tech-trump-tariffs.html",
    "summary": "With President Trump on their side, U.S. technology companies now have more leverage in Brazil, where they seek to influence new rules policing their platforms."
  },
  {
    "title": "Trump Says He’s Going to Alaska to See What Putin ‘Has in Mind’",
    "link": "https://www.nytimes.com/2025/08/11/us/politics/trump-putin-alaska-meeting.html",
    "summary": "President Trump set a low bar for his summit with President Vladimir V. Putin of Russia, saying he was ready to walk away if no deal was forthcoming."
  },
  {
    "title": "Foreign Recruits in Ukraine Military Are Killed in Russian Missile Strike",
    "link": "https://www.nytimes.com/2025/08/12/world/europe/foreign-soldiers-ukraine-russia-missile-attack.html",
    "summary": "Russia has repeatedly targeted soldiers assembled at military academies, barracks and parade grounds."
  },
  {
    "title": "3 Dead, 1 Injured After Target Shooting in Austin, Texas",
    "link": "https://www.nytimes.com/2025/08/11/us/austin-shooting.html",
    "summary": "The gunman fled and was caught after stealing two cars, the police said."
  },
  {
    "title": "Are Samosas Unhealthy? Some Indians Find Official Advice Hard to Swallow.",
    "link": "https://www.nytimes.com/2025/08/12/world/asia/india-samosas-unhealthy.html",
    "summary": "A government advisory noting the high fat and sugar levels in many popular snacks was seen by some as an attack on India’s beloved street food."
  },
  {
    "title": "Who Were the Al Jazeera Journalists Killed in an Israeli Strike in Gaza?",
    "link": "https://www.nytimes.com/2025/08/11/world/middleeast/al-jazeera-journalists-bios.html",
    "summary": "Officials accused Anas al-Sharif of being a Hamas operative posing as a reporter. Al Jazeera says he and the other four victims all worked for the network."
  },
  {
    "title": "What to Know About Al Jazeera, the Broadcaster Israel Accuses of Supporting Hamas",
    "link": "https://www.nytimes.com/2025/08/11/world/middleeast/al-jazeera-israel-criticism-ban.html",
    "summary": "Al Jazeera, five of whose reporters the broadcaster said were killed by an Israeli strike, has angered governments across the region that claim it gives voice to terrorists. The outlet denies that."
  },
  {
    "title": "How Rick Perry Became a Fervent Advocate for the Psychedelic Ibogaine",
    "link": "https://www.nytimes.com/2025/08/11/us/politics/rick-perry-drug-psychedelics-ibogaine.html",
    "summary": "The former Texas governor and Trump energy secretary has now dedicated his life to promoting the powerful psychedelic ibogaine."
  },
  {
    "title": "Judge Will Not Unseal Grand Jury Papers of Maxwell, Epstein’s Companion",
    "link": "https://www.nytimes.com/2025/08/11/nyregion/jeffrey-epstein-ghislaine-maxwell-transcripts.html",
    "summary": "President Trump has tried to subdue conspiracy theories by pushing to disclose the transcripts from the cases of Jeffrey Epstein, who abused teenage girls, and Ghislaine Maxwell, who assisted him."
  },
  {
    "title": "Sheila Jordan, Fearless Vocal Improviser, Is Dead at 96",
    "link": "https://www.nytimes.com/2025/08/12/arts/music/sheila-jordan-dead.html",
    "summary": "She was revered in the jazz world as a chance taker who communicated an effervescent joy in the pure act of singing."
  },
  {
    "title": "The Reasons Israelis Have Closed Their Eyes to Gaza",
    "link": "https://www.nytimes.com/2025/08/12/opinion/israel-gaza-starvation-aid.html",
    "summary": "Multiple factors have caused the starvation ravaging Gaza. But Israel must accept that its actions are the main cause."
  },
  {
    "title": "A Right-Wing Influencer Tried to Be a Tradwife. It Almost Broke Her.",
    "link": "https://www.nytimes.com/2025/08/11/opinion/lauren-southern-tradwife-maga.html",
    "summary": "Being an anti-feminist, it turns out, is no shield against abusive male power."
  },
  {
    "title": "2 Killed in Explosion at U.S. Steel Plant in Pennsylvania",
    "link": "https://www.nytimes.com/2025/08/11/us/us-steel-explosion-pennsylvania.html",
    "summary": "Ten people were hospitalized after the blast at a coke plant in Clairton, Pa., near Pittsburgh. One person who had been missing was found dead late on Monday."
  },
  {
    "title": "The Fake Heiress, the Instagram Shoot and the Abandoned Bunnies",
    "link": "https://www.nytimes.com/2025/08/11/nyregion/anna-delvey-bunnies-abandoned-prospect-park.html",
    "summary": "Three rabbits used in a photo shoot featuring Anna Delvey, whose real name is Anna Sorokin, were found abandoned in Prospect Park in Brooklyn."
  },
  {
    "title": "Christophe de Menil, Art Patron and Designer, Is Dead at 92",
    "link": "https://www.nytimes.com/2025/08/11/arts/christophe-de-menil-dead.html",
    "summary": "A Parisian-born oil heiress, she collected art and supported major artists, designed costumes and moved in rarefied social and cultural circles."
  }
]