[
  {
    "title": "Texas House Approves Redistricting Maps, Just as Trump Wanted",
    "link": "https://www.nytimes.com/2025/08/20/us/politics/texas-republicans-redistricting-maps.html",
    "summary": "The State Senate will vote Thursday on maps intended to help the G.O.P. win five more U.S. House seats in the midterm elections. California Democrats will counter on the same day."
  },
  {
    "title": "Obama Endorses Newsom’s Redistricting Proposal as a ‘Responsible Approach’",
    "link": "https://www.nytimes.com/2025/08/20/us/politics/california-redistricting-newsom-obama.html",
    "summary": "The former president suggested that Democrats opposing G.O.P. efforts in Texas and elsewhere should advance their own gerrymandering plans."
  },
  {
    "title": "With Moves on West Bank and Gaza City, Israel Defies Global Outcry",
    "link": "https://www.nytimes.com/2025/08/20/world/middleeast/israel-hamas-gaza-city.html",
    "summary": "Israel approved new settlements in the occupied West Bank, while its troops have reached the outskirts of Gaza City. The developments raise questions about the viability of a cease-fire proposal."
  },
  {
    "title": "Israel Approves Settlements, a Blow to Faded Hopes for a Palestinian State",
    "link": "https://www.nytimes.com/2025/08/20/world/middleeast/israel-e1-settlement-west-bank.html",
    "summary": "The long-stalled project near Jerusalem, known as E1, further fragments West Bank lands envisioned as part of a Palestinian state, advancing a goal of Israeli hard-liners."
  },
  {
    "title": "Gazans Fear Looming Israeli Operation",
    "link": "https://www.nytimes.com/2025/08/20/world/middleeast/gaza-city-israeli-operation.html",
    "summary": "Israel’s plan to invade Gaza City, the most populous city in the northern Gaza Strip, has forced many families to consider uprooting themselves."
  },
  {
    "title": "Rubio Takes on Tricky Task of Drafting Security Guarantees for Ukraine",
    "link": "https://www.nytimes.com/2025/08/20/us/politics/marco-rubio-ukraine.html",
    "summary": "The secretary of state and national security adviser will meet with European counterparts on Thursday in an effort to advance a peace process that so far has gotten little traction."
  },
  {
    "title": "Russia Demands Role in Guaranteeing Ukraine’s Postwar Security",
    "link": "https://www.nytimes.com/2025/08/20/world/europe/ukraine-russia-security-guarantees.html",
    "summary": "European and Ukrainian officials call the idea ludicrous, showing the large gaps in peace negotiations."
  },
  {
    "title": "What Russia Is Doing to Grab Ukrainian Land While It Still Can",
    "link": "https://www.nytimes.com/2025/08/20/world/europe/ukraine-russia-battlefield.html",
    "summary": "As negotiations over the war carry on, President Vladimir V. Putin is pushing hard with tactics that have evolved over three and a half years."
  },
  {
    "title": "Two Big Law Firms Said to Be Doing Free Work for Trump Administration",
    "link": "https://www.nytimes.com/2025/08/20/us/politics/law-firms-free-work-trump-administration.html",
    "summary": "After making deals with the president to avoid punitive executive orders, Paul Weiss and Kirkland & Ellis are helping the Commerce Department."
  },
  {
    "title": "Deportation of 6-Year-Old Puts Spotlight on ICE’s Detention of Families",
    "link": "https://www.nytimes.com/2025/08/20/nyregion/ice-6-year-old-nyc.html",
    "summary": "Immigration authorities have detained about 50 children younger than 18 in the New York City area since January. At least 38 of them have been deported."
  },
  {
    "title": "Senate Adds Guardrails in an Effort to Force Trump to Obey Spending Bills",
    "link": "https://www.nytimes.com/2025/08/20/us/politics/senate-spending-guardrails-trump.html",
    "summary": "Leaders of the Appropriations Committee are trying to tighten up funding legislation to give the Trump administration less leeway to refuse to spend federal money."
  },
  {
    "title": "How Harry Potter Fans Are Driving the Romantasy Trend",
    "link": "https://www.nytimes.com/2025/08/20/style/harry-potter-fan-fiction-romantasy-manacled.html",
    "summary": "Romantasy is propping up the fiction market. Thanks to a generation that grew up reading about a boy wizard."
  },
  {
    "title": "More Adams Associates and Supporters Are Said to Face Corruption Charges",
    "link": "https://www.nytimes.com/2025/08/20/nyregion/adams-corruption-nyc-lewis-martin-charges.html",
    "summary": "Among those expected to surrender in the coming days is a close friend of Mayor Eric Adams whom the mayor installed in a powerful city position."
  },
  {
    "title": "Mamdani, Skeptical of Casinos, Won’t Try to Block Them in New York City",
    "link": "https://www.nytimes.com/2025/08/20/nyregion/mamdani-casinos-nyc-mayor.html",
    "summary": "Zohran Mamdani, the Democratic mayoral nominee, said that while he still had doubts about city casinos, he respected the views of voters who supported them."
  },
  {
    "title": "Judge Halts Texas Law Mandating the Ten Commandments in School",
    "link": "https://www.nytimes.com/2025/08/20/us/politics/ten-commandments-texas.html",
    "summary": "The state law had said public schools would have to display the Ten Commandments in a “conspicuous” location in every classroom in Texas by Sept. 1."
  },
  {
    "title": "Oklahoma Proposes ‘America First Test’ for Teachers From New York and California",
    "link": "https://www.nytimes.com/2025/08/20/education/oklahoma-woke-teacher-test.html",
    "summary": "The test is meant to filter out teachers who hold views “antithetical” to Oklahoma values."
  },
  {
    "title": "Why Covid Cases Are Up This Summer",
    "link": "https://www.nytimes.com/2025/08/20/well/why-covid-is-spreading-again-this-summer.html",
    "summary": "Researchers are seeing an uptick in cases, as they have every summer since the pandemic began. Here’s why."
  },
  {
    "title": "Even a Glancing Blow From Hurricane Erin May Cost the Outer Banks a Crucial Lifeline",
    "link": "https://www.nytimes.com/2025/08/20/weather/highway-12-ocracoke-hatteras-north-carolina-hurricane-erin.html",
    "summary": "Highway 12 is beloved for its scenic views. But it’s also prone to flooding."
  },
  {
    "title": "Hurricane Erin Brings Rip Current Risks From Florida to Maine",
    "link": "https://www.nytimes.com/2025/08/20/weather/hurricane-erin-rip-currents-beach-closures.html",
    "summary": "The storm, off North Carolina, was generating life-threatening surf and rip currents and causing beach closures along the East Coast."
  },
  {
    "title": "Gavin Newsom’s Latest Role: Social Media Troll",
    "link": "https://www.nytimes.com/2025/08/20/us/newsom-trump-social-media.html",
    "summary": "The California governor’s press office is mimicking President Trump’s distinctive Truth Social style on X. Liberals love it. The White House says it’s “just getting weird at this point.”"
  },
  {
    "title": "No Food, No Water, a Broken Leg: How a Hiker Survived a Harrowing Week in the Wild",
    "link": "https://www.nytimes.com/2025/08/20/world/europe/alec-luhn-missing-hiker-norway-found-interview.html",
    "summary": "Alec Luhn, 38, an American journalist, hopes the lessons he learned from his ordeal in a national park in Norway can help others."
  },
  {
    "title": "Everything You Need to Know About the 2025 U.S. Open",
    "link": "https://www.nytimes.com/2025/08/18/nyregion/us-open-2025-guide-tennis.html",
    "summary": "The tournament runs Aug. 24 to Sept. 7 at the Billie Jean King National Tennis Center in New York City."
  },
  {
    "title": "Amy Klobuchar: I Knew A.I. Deepfakes Were a Problem. Then I Saw One of Myself.",
    "link": "https://www.nytimes.com/2025/08/20/opinion/amy-klobuchar-deepfakes.html",
    "summary": "Deepfakes are getting more realistic, and more difficult to stop. Congress needs to take steps now."
  },
  {
    "title": "A.I. May Just Be Kind of Ordinary",
    "link": "https://www.nytimes.com/2025/08/20/opinion/ai-technology-chatgpt.html",
    "summary": "Artificial intelligence may change the world but probably won’t remake it."
  },
  {
    "title": "Trump Stepped Up His Attacks on the Fed",
    "link": "https://www.nytimes.com/2025/08/20/briefing/trump-fed-israel-gaza-city-origami.html",
    "summary": "Also, Israel is preparing an assault on Gaza City. Here’s the latest at the end of Wednesday."
  },
  {
    "title": "Camp Mystic Parents Demand Changes Before More Children Are Lost",
    "link": "https://www.nytimes.com/2025/08/20/us/politics/camp-mystic-parents.html",
    "summary": "A Texas Legislative Committee heard for the first time from the parents who demanded better flood warning systems, better training and equipment for camps near the river."
  },
  {
    "title": "Ousted Fire Chief in L.A. Claims Mayor Bass Retaliated Against Her in Legal Filing",
    "link": "https://www.nytimes.com/2025/08/20/us/los-angeles-fire-chief-mayor-bass.html",
    "summary": "The former chief, Kristin Crowley, claimed that Los Angeles leaders retaliated against her for publicly blaming them for refusing to properly fund the Fire Department."
  },
  {
    "title": "Southern California Faces a Combustible Mix of Heat and Fire Risk",
    "link": "https://www.nytimes.com/2025/08/20/weather/los-angeles-heat-fire-forecast.html",
    "summary": "A stretch of unusually hot weather combined with exceptionally dry vegetation will elevate the risk of wildfire."
  },
  {
    "title": "Fed Officials Split Over How to Read Economic Signals",
    "link": "https://www.nytimes.com/2025/08/20/business/federal-reserve-july-minutes.html",
    "summary": "Minutes from the Federal Reserve’s July meeting showed policymakers grappling with a slowing labor market and inflation that remains above the central bank’s target."
  }
]