[
  {
    "title": "Europe’s Leaders Headed Off Giveaway to Putin, but Emerged Without a Clear Path",
    "link": "https://www.nytimes.com/2025/08/19/world/europe/ukraine-trump-meeting-europe-leaders-war.html",
    "summary": "The leaders dropped everything to travel to Washington to ensure President Trump didn’t force a bad deal on Ukraine.  A road map for peace remains elusive."
  },
  {
    "title": "Securing Postwar Ukraine, Even With Trump’s Pledge to Help, Is Complex",
    "link": "https://www.nytimes.com/2025/08/19/world/europe/ukraine-security-guarantees-trump.html",
    "summary": "Russia seems unlikely to agree to Western troops in Ukraine as part of any deal to end the war."
  },
  {
    "title": "5 Takeaways From Trump’s Meeting With Zelensky and European Leaders",
    "link": "https://www.nytimes.com/2025/08/18/us/politics/takeaways-trump-zelensky-putin.html",
    "summary": "The leaders presented a relatively united front and appeared to agree on the next steps in the effort to halt the fighting between Ukraine and Russia. But much remained unresolved."
  },
  {
    "title": "Zelensky’s Charm Offensive, and Israel’s Push to Send Gazans to South Sudan",
    "link": "https://www.nytimes.com/2025/08/19/podcasts/the-headlines/zelensky-trump-israel-gazan-south-sudan.html",
    "summary": "Plus, the rise of rap on tour."
  },
  {
    "title": "In Pursuing Trump Rival, Weaponization Czar Sidesteps Justice Dept. Norms",
    "link": "https://www.nytimes.com/2025/08/19/us/politics/trump-letitia-james-weaponization-czar.html",
    "summary": "Edward R. Martin Jr.’s conduct is part of a pattern in which top administration officials try to use the vast powers of the government to cast the specter of criminality on President Trump’s enemies."
  },
  {
    "title": "Trump Administration Discusses Taking 10% Stake in Intel",
    "link": "https://www.nytimes.com/2025/08/18/technology/intel-trump-government-stake.html",
    "summary": "Federal officials are considering the move because Intel, the last leading-edge chipmaker in the United States, has been struggling."
  },
  {
    "title": "The Politics of Crime Are Perilous for Left and Right Alike",
    "link": "https://www.nytimes.com/2025/08/19/us/politics-gun-violence-mass-shootings-washington-dc.html",
    "summary": "President Trump has latched on to concerns about crime, as liberals point to its decline. The politics often flip when it comes to mass shootings."
  },
  {
    "title": "The Fight With Democrats That Trump Wants Now",
    "link": "https://www.nytimes.com/2025/08/18/us/politics/trump-washington-crime-democrats.html",
    "summary": "Crime is tricky territory for Democrats and President Trump knows it."
  },
  {
    "title": "Why Did Shari Redstone Give Up Control of Paramount?",
    "link": "https://www.nytimes.com/2025/08/19/business/media/shari-redstone-paramount-trump-settlement.html",
    "summary": "The media mogul spoke at length for the first time about selling her family’s empire, Paramount’s settlement with President Trump — and getting her reputation battered along the way."
  },
  {
    "title": "The Race to Rescue PBS and NPR Stations",
    "link": "https://www.nytimes.com/2025/08/19/business/the-race-to-rescue-pbs-and-npr-stations.html",
    "summary": "The Knight Foundation and other top organizations are aiming to provide $50 million to stabilize the stations most at risk from the recent federal government funding cuts."
  },
  {
    "title": "MSNBC’s Rebrand to MS NOW Invites Bemusement and Ridicule",
    "link": "https://www.nytimes.com/2025/08/19/business/msnbc-ms-now-rebranding.html",
    "summary": "The cable TV network’s new name, MS NOW, became the subject of mockery soon after it was announced on Monday."
  },
  {
    "title": "An Evening With the Central Park Coyotes",
    "link": "https://www.nytimes.com/2025/08/19/nyregion/central-park-coyotes.html",
    "summary": "Romeo and Juliet are shy and graceful, leaping over fences, hunting for rodents and catching at least one Canada goose."
  },
  {
    "title": "Air Canada and Striking Flight Attendants’ Union Reach Tentative Deal",
    "link": "https://www.nytimes.com/2025/08/19/world/canada/air-canada-strike-flight-attendants-union-deal.html",
    "summary": "Thousands of flight attendants must still approve the agreement. The walkout, which began Saturday, has disrupted half a million travelers’ plans, the airline said."
  },
  {
    "title": "Economic Data Has Taken a Dark Turn. That Doesn’t Mean a Crash Is Near.",
    "link": "https://www.nytimes.com/2025/08/19/business/economy/us-economic-trends-unemployment-inflation.html",
    "summary": "Inflation is up and job creation down, but the U.S. economy could still pull through without too much pain."
  },
  {
    "title": "Hurricane Erin Brings Rip Currents Closing Jersey Shore and Rehoboth Beaches",
    "link": "https://www.nytimes.com/2025/08/19/nyregion/hurricane-erin-beach-closures-new-jersey.html",
    "summary": "Several beaches in New Jersey and Delaware were closed as the powerful storm churned in the Atlantic. Rip currents have been blamed for at least one death."
  },
  {
    "title": "Rip Current Survival Tips: What to Do if You Get Caught in One",
    "link": "https://www.nytimes.com/article/rip-current-survival-escape-tips.html",
    "summary": "From land, a rip current can appear relatively calm, as a strip of water that extends out between breaking waves. Its appearance can be deceiving."
  },
  {
    "title": "Majora’s Mask Had No Minor Characters",
    "link": "https://www.nytimes.com/2025/08/18/arts/majoras-mask-legend-zelda.html",
    "summary": "The sixth Legend of Zelda entry took narrative storytelling in video games to new heights by packing side quests with emotional depth."
  },
  {
    "title": "A Brief Note on the Difference Between Negotiation and Extortion",
    "link": "https://www.nytimes.com/2025/08/19/opinion/ukraine-russia-war-territory.html",
    "summary": "And while we’re at it, let’s think about the phrase “land swap.”"
  },
  {
    "title": "Netanyahu Faces Pressure From Far Right Over New Israel-Hamas Cease-Fire Proposal",
    "link": "https://www.nytimes.com/2025/08/19/world/middleeast/israel-hamas-cease-fire-talks.html",
    "summary": "Some members of Israel’s coalition have ruled out a proposed hostage deal with Hamas, but the prime minister has yet to state his position."
  },
  {
    "title": "Cases of Mosquito-Borne Chikungunya Virus Are Surging Globally: What to Know",
    "link": "https://www.nytimes.com/2025/08/19/health/chikungunya-virus-mosquitoes-what-to-know.html",
    "summary": "Chikungunya, which can disable victims for years, is spreading rapidly, including in China and other places that have not seen it before."
  },
  {
    "title": "In Maine, a Political Novice Makes a Long-Shot Bid to Oust Collins",
    "link": "https://www.nytimes.com/2025/08/19/us/politics/maine-senate-candidate-collins.html",
    "summary": "Democrats hope to recruit Governor Janet Mills to challenge the powerful Republican senator, but an oyster farmer with a working man’s pitch thinks he has a better chance."
  },
  {
    "title": "Vietnamese Are Helping Cuba With 38-Cent Donations. A Lot of Them.",
    "link": "https://www.nytimes.com/2025/08/19/world/asia/vietnam-cuba-fundraising.html",
    "summary": "Cuba sent doctors and food to Vietnam during the war. Now ordinary Vietnamese are sending cash to struggling Cubans."
  }
]