[
  {
    "title": "Trump, in an Escalation, Calls for Republicans to ‘Nationalize’ Elections",
    "link": "https://www.nytimes.com/2026/02/02/us/politics/trump-nationalize-elections.html",
    "summary": "The comments, made on a conservative podcast, follow a string of moves from his administration to try to exert more control over American elections."
  },
  {
    "title": "In Trump’s Fraud Crackdown, Political Foes Face Harshest Scrutiny",
    "link": "https://www.nytimes.com/2026/02/03/us/politics/trump-fraud-minnesota-snap-medicaid.html",
    "summary": "State officials say the president’s actions are a new form of retribution, even as the White House has pardoned allies charged with defrauding government."
  },
  {
    "title": "Trump Is Said to Have Dropped Demand for Cash From Harvard",
    "link": "https://www.nytimes.com/2026/02/02/us/politics/trump-harvard-payment.html",
    "summary": "Hours after The Times reported that President Trump had lowered the bar for a deal, he denied backtracking and made new threats against Harvard."
  },
  {
    "title": "Colombian President Gustavo Petro to Meet with Trump at the White House",
    "link": "https://www.nytimes.com/2026/02/03/us/politics/colombia-petro-trump-meeting.html",
    "summary": "President Trump was expected to meet privately with President Gustavo Petro of Colombia on Tuesday. They have clashed in the past, but there are signs that tensions are easing."
  },
  {
    "title": "Trump Says Republicans Should ‘Take Over’ Elections, and Clintons Agree to Testify in Epstein Inquiry",
    "link": "https://www.nytimes.com/2026/02/03/podcasts/the-headlines/trump-republicans-elections-clintons-epstein-inquiry.html",
    "summary": "Plus, a conservative group plans an alternate Super Bowl halftime show."
  },
  {
    "title": "‘They Couldn’t Break Me’: A Protester, the White House and a Doctored Photo",
    "link": "https://www.nytimes.com/2026/02/03/us/politics/nekima-levy-armstrong-minnesota-protest.html",
    "summary": "President Trump and the White House regularly circulate imagery that has been manipulated by A.I. But the photo of Nekima Levy Armstrong was different."
  },
  {
    "title": "Chaos in Minneapolis Exposes an Internet at War With Truth",
    "link": "https://www.nytimes.com/2026/02/03/technology/minneapolis-ai-disinformation-misinformation-truth.html",
    "summary": "Technological advances and an erosion of trust have transformed the way news unfolds online, distorting shared reality."
  },
  {
    "title": "Pretti Shooting Thrusts Border Patrol’s History of Aggressive Tactics Into View",
    "link": "https://www.nytimes.com/2026/02/03/us/politics/border-patrol-history-aggression.html",
    "summary": "Officials have struggled to provide oversight of the agency, even as local communities and civil rights groups have documented episodes of violence."
  },
  {
    "title": "Democrats Call on ICE Watchdog to Speed Up Use of Force Inquiry",
    "link": "https://www.nytimes.com/2026/02/03/us/politics/democrats-call-on-ice-watchdog-to-speed-up-use-of-force-inquiry.html",
    "summary": "The inspector general for the Department of Homeland Security is scrutinizing use of force by ICE, according to Democrats in Congress who requested the report."
  },
  {
    "title": "Clintons Capitulate on House Epstein Inquiry, Agreeing to Testify",
    "link": "https://www.nytimes.com/2026/02/02/us/politics/bill-hillary-clinton-epstein-comer-contempt.html",
    "summary": "Former President Bill Clinton and Hillary Clinton, the ex-secretary of state, agreed to depositions they had long resisted days before the House was to vote to hold them in contempt."
  },
  {
    "title": "N.F.L. Says It Will Look Into Steve Tisch’s Ties to Epstein",
    "link": "https://www.nytimes.com/2026/02/02/sports/nfl-steve-tisch-epstein-giants.html",
    "summary": "Recently released emails reveal that Jeffrey Epstein sought to connect Mr. Tisch, whose family is a part-owner of the New York Giants, with multiple women."
  },
  {
    "title": "How to Watch the 2026 Westminster Dog Show",
    "link": "https://www.nytimes.com/2026/02/03/style/westminster-dog-show-how-to-watch.html",
    "summary": "Everything you (and your dog) need to know about the competition, now in its 150th outing."
  },
  {
    "title": "Westminster Dog Show 2026: Behind-the-Scenes Photos",
    "link": "https://www.nytimes.com/2026/02/03/style/westminster-dog-show-photos.html",
    "summary": "Brushing, panting, licking and leaping: Here’s what we saw at the Javits Convention Center, where show dogs could let their fur down before taking to the ring."
  },
  {
    "title": "On Eve of Peace Talks, Russia Hits Power Plants in Frigid Ukraine",
    "link": "https://www.nytimes.com/2026/02/03/world/europe/ukraine-missiles-attack.html",
    "summary": "Missiles overnight targeted electrical facilities in Kyiv and other parts of the country, according to local authorities, despite President Trump’s request for a pause."
  },
  {
    "title": "The Global Economy’s Warning Signals Are Broken",
    "link": "https://www.nytimes.com/2026/02/03/business/economy/global-economy-forecasts.html",
    "summary": "From markets to spending to debt, usually reliable indicators that forecast where the economy is headed are proving deeply fallible."
  },
  {
    "title": "Trump Says He’s Only Renovating the Kennedy Center",
    "link": "https://www.nytimes.com/2026/02/02/us/politics/trump-kennedy-center-renovation.html",
    "summary": "Even though President Trump held a movie premiere for his wife’s new film there last week, he said the state of the building was “actually sort of dangerous.”"
  },
  {
    "title": "Trump’s Kennedy Center Shutdown Plan Jolts Workers and Performers",
    "link": "https://www.nytimes.com/2026/02/03/arts/music/trumps-kennedy-center-shutdown-plan-jolts-workers-and-performers.html",
    "summary": "The administration’s announcement to shut the center for a major overhaul led to a swirl of confusion and anxiety among performers and patrons about its future."
  },
  {
    "title": "From ‘Hamilton’ to Issa Rae to Philip Glass: Here’s a List of Kennedy Center Cancellations",
    "link": "https://www.nytimes.com/2026/02/02/arts/kennedy-center-performance-cancellations.html",
    "summary": "More than two dozen musicians, dancers, theater companies and other creative groups have pulled out of performing at the Kennedy Center since President Trump returned to the White House."
  },
  {
    "title": "Colleges See Major Racial Shifts in Student Enrollment",
    "link": "https://www.nytimes.com/2026/02/03/us/colleges-see-major-racial-shifts-in-student-enrollment.html",
    "summary": "An analysis finds that flagship state universities, as well as less selective colleges, had major increases in Black and Hispanic students following a ban on race-conscious admissions."
  },
  {
    "title": "A Hamas Hostage’s Secret Ordeal",
    "link": "https://www.nytimes.com/2026/02/03/world/middleeast/hamas-hostage-abuse.html",
    "summary": "Guy Gilboa-Dalal says he was sexually abused by one of his captors in the tunnels of Gaza and threatened with death if he said anything."
  },
  {
    "title": "Palestinians Return to Gaza for First Time in Nearly Two Years",
    "link": "https://www.nytimes.com/2026/02/03/world/middleeast/palestinians-gaza-return.html",
    "summary": "The returnees reunited with families but also said their homecomings carried symbolic weight — defying any notions of permanently displacing Gazans."
  },
  {
    "title": "After Maduro’s Capture, Venezuela’s Authoritarian System Shows Signs of Easing",
    "link": "https://www.nytimes.com/2026/02/03/world/americas/venezuela-rodriguez-maduro-authoritarian.html",
    "summary": "A sweeping amnesty proposal, tests of censorship limits and opposition leaders emerging from hiding are fueling hopes for democratic changes. But skepticism abounds."
  },
  {
    "title": "This is How Hard It Will Be to Get Around Italy’s Winter Olympics",
    "link": "https://www.nytimes.com/2026/02/03/world/europe/italy-winter-olympics-logistical-nightmare.html",
    "summary": "The Games in northern Italy, which start on Friday, will be spread across 8,500 square miles. Long distances, narrow roads, complex connections and snowfall will make it a logistical nightmare."
  },
  {
    "title": "Soylent Is Out. Food Pouches Are In.",
    "link": "https://www.nytimes.com/2026/02/02/dining/food-pouches-soylent.html",
    "summary": "It’s boom times for meal-replacement products that cater to the overwhelmed (and wellness-obsessed) millennial. But Soylent they are not."
  },
  {
    "title": "A Role Model for How to Die",
    "link": "https://www.nytimes.com/2026/02/03/nyregion/cancer-friend-death-role-model.html",
    "summary": "What if you really did live every day as if it were your last? That was Brian’s plan."
  },
  {
    "title": "‘Melania’ the Book Was Bad. ‘Melania’ the Movie Is Somehow Worse.",
    "link": "https://www.nytimes.com/2026/02/03/opinion/melania-trump-movie-memoir.html",
    "summary": "The surface is all there is."
  },
  {
    "title": "Is Your Social Life Missing Something? This Conversation Is for You.",
    "link": "https://www.nytimes.com/2026/02/03/opinion/ezra-klein-podcast-priya-parker.html",
    "summary": "Priya Parker, the author of “The Art of Gathering,” shares her advice for orchestrating more meaningful gatherings and why that matters for our civic life, as well as our social lives."
  },
  {
    "title": "Greenland Crisis Has Danes Chuckling, in Their Own Way",
    "link": "https://www.nytimes.com/2026/02/03/world/europe/denmark-trump-boycott.html",
    "summary": "A little teasing has helped Danes manage their anger and anxiety over American threats to take a part of their territory. A Trump pincushion, anyone?"
  },
  {
    "title": "A Phantom Humming Has a Connecticut City at Wit’s End",
    "link": "https://www.nytimes.com/2026/02/03/nyregion/west-haven-connecticut-humming-noise.html",
    "summary": "West Haven, Conn., has budgeted $16,000 for an acoustics expert to try to pinpoint the source of a low-frequency disturbance that has disrupted residents’ lives."
  },
  {
    "title": "Woodie King Jr., Impresario of Black Theater, Dies at 88",
    "link": "https://www.nytimes.com/2026/02/02/theater/woodie-king-jr-dead.html",
    "summary": "His New Federal Theater in New York provided a rare stage for Black playwrights and emerging actors, among them Denzel Washington, Phylicia Rashad and Chadwick Boseman."
  },
  {
    "title": "Third Candidate Enters Heated Race for Open House Seat",
    "link": "https://www.nytimes.com/2026/02/02/nyregion/julie-won-house-candidate.html",
    "summary": "Julie Won, a New York City councilwoman, will face two other Democrats, one backed by the departing incumbent, Nydia Velázquez, and the other by Mayor Zohran Mamdani."
  }
]