[
  {
    "title": "OpenAI Reaches A.I. Agreement With Defense Dept. After Anthropic Clash",
    "link": "https://www.nytimes.com/2026/02/27/technology/openai-agreement-pentagon-ai.html",
    "summary": "The deal came hours after President Trump had ordered federal agencies to stop using artificial intelligence technology made by Anthropic, an OpenAI rival."
  },
  {
    "title": "Trump Orders U.S. Agencies to Stop Using Anthropic AI Tech After Pentagon Standoff",
    "link": "https://www.nytimes.com/2026/02/27/us/politics/anthropic-military-ai.html",
    "summary": "The company had clashed with the military over how officials wanted to use its cutting-edge A.I. model. The order could vastly complicate intelligence analysis and defense work."
  },
  {
    "title": "Pentagon-Anthropic Standoff Is a Decisive Moment for How A.I. Will Be Used in War",
    "link": "https://www.nytimes.com/2026/02/27/technology/defense-department-anthropic-ai-safety.html",
    "summary": "The Pentagon’s contract dispute with Anthropic is part of a wider clash about the use of artificial intelligence for national security and who decides on any safeguards."
  },
  {
    "title": "Silicon Valley Rallies Behind Anthropic in A.I. Clash With Trump",
    "link": "https://www.nytimes.com/2026/02/27/technology/anthropic-trump-pentagon-silicon-valley.html",
    "summary": "Actions by the president and the Pentagon appeared to drive a wedge between Washington and the tech industry, whose leaders and workers spoke out for the start-up."
  },
  {
    "title": "Bill Clinton Testifies He ‘Saw Nothing’ of Epstein’s Misdeeds",
    "link": "https://www.nytimes.com/2026/02/27/us/politics/bill-clinton-epstein.html",
    "summary": "The former president sat for hours of questioning by members of both parties, in an appearance that Democrats signaled they would use as a precedent to force President Trump to do the same."
  },
  {
    "title": "L.A.U.S.D. Chief Alberto Carvalho Is Placed on Leave Following F.B.I. Raid",
    "link": "https://www.nytimes.com/2026/02/27/us/lausd-superintendent-alberto-carvalho-fbi.html",
    "summary": "Alberto Carvalho, superintendent of the Los Angeles Unified School District, was placed on paid leave after F.B.I. agents raided his home and district office this week."
  },
  {
    "title": "Trump ‘Not Happy’ With Iran Talks, but Says He Remains Undecided on Strikes",
    "link": "https://www.nytimes.com/2026/02/27/us/politics/trump-iran-talks.html",
    "summary": "President Trump said he had not made a final decision about whether to order military action against Iran."
  },
  {
    "title": "Inside the USS Ford, the Navy’s Newest Aircraft Carrier, as It Heads to Mideast",
    "link": "https://www.nytimes.com/2026/02/27/us/politics/uss-ford-iran.html",
    "summary": "The carrier has had mechanical problems throughout its eight-month deployment, but officials now say it is ready for battle. Take a look inside the ship."
  },
  {
    "title": "Iran’s Students Are Protesting Again. Here’s Why.",
    "link": "https://www.nytimes.com/2026/02/27/world/middleeast/iran-student-protests.html",
    "summary": "The unrest underlines the intensity of domestic discontent, even as Tehran’s government grapples with the threat of U.S. strikes. Here’s what to know."
  },
  {
    "title": "A Trump Call Ignited Saudi-U.A.E. Feud",
    "link": "https://www.nytimes.com/2026/02/27/world/middleeast/saudi-arabia-united-arab-emirates-feud-trump-call.html",
    "summary": "A request made to President Trump about the war in Sudan is at the heart of a diplomatic dispute between Saudi Arabia and the United Arab Emirates."
  },
  {
    "title": "Neil Sedaka, Singing Craftsman of Memorable Pop Songs, Dies at 86",
    "link": "https://www.nytimes.com/2026/02/27/arts/music/neil-sedaka-dead.html",
    "summary": "He sang and co-wrote some of the definitive teenage anthems of the 1950s and early ’60s, including “Breaking Up Is Hard to Do,” and then reinvented his career in the ’70s."
  },
  {
    "title": "Neil Sedaka: 14 Essential Songs",
    "link": "https://www.nytimes.com/2026/02/27/arts/music/neil-sedaka-songs.html",
    "summary": "The singer and songwriter, who died on Friday at 86, gave voice to teenage dreams, then executed one of music’s most unexpected comebacks."
  },
  {
    "title": "Kamala Harris Endorses Jasmine Crockett in Texas Senate Race",
    "link": "https://www.nytimes.com/2026/02/27/us/politics/kamala-harris-endorses-jasmine-crockett-texas-senate.html",
    "summary": "The endorsement from the former vice president, her most significant since leaving office, comes as Ms. Crockett is facing a competitive Democratic primary contest against James Talarico."
  },
  {
    "title": "‘We Got to Win the Midterms’: Trump Takes His State of the Union Message on the Road",
    "link": "https://www.nytimes.com/2026/02/27/us/politics/trump-midterms-state-of-the-union.html",
    "summary": "During a visit to Texas, President Trump made clear that he would be driving home his depiction of Democrats as out of step ahead of the elections in November."
  },
  {
    "title": "In Tuesday’s North Carolina Primaries, the Left Is Aiming for Democrats",
    "link": "https://www.nytimes.com/2026/02/27/us/politics/north-carolina-primaries-liberal-challengers.html",
    "summary": "From a Durham-area House race to three statehouse races, North Carolina liberals are signaling that their tolerance for Democratic stalwarts may be coming to an end."
  },
  {
    "title": "Student Remains in Honduras After ICE Vows to Deport Her Again",
    "link": "https://www.nytimes.com/2026/02/27/us/politics/college-student-honduras-deportation.html",
    "summary": "Any Lucia López Belloza was deported by mistake. A judge ordered her return by Friday. When the Trump administration sent a plane, she decided not to get on."
  },
  {
    "title": "Columbia Student Detained by ICE Promotes ‘Beauty’ and ‘Brains’ Online",
    "link": "https://www.nytimes.com/2026/02/27/nyregion/columbia-student-ice-influencer.html",
    "summary": "Elmina Aghayeva has 114,000 followers on Instagram and has seemingly never posted about politics, unlike other Columbia University students detained by immigration officers."
  },
  {
    "title": "Border Patrol Left a Refugee at a Cafe. Days Later, He Was Found Dead.",
    "link": "https://www.nytimes.com/2026/02/27/nyregion/myanmar-refugee-buffalo-border-patrol.html",
    "summary": "The disabled man had been released from jail when federal officers showed up and drove him to a coffee shop. His family searched for him for days."
  },
  {
    "title": "30 More Indicted in Cities Church Protest Against ICE in St. Paul",
    "link": "https://www.nytimes.com/2026/02/27/us/minnesota-ice-cities-church-indictment.html",
    "summary": "The newly indicted people join nine others, including Don Lemon, in facing charges in connection to a protest of President Trump’s immigration crackdown during a worship service."
  },
  {
    "title": "Carney Visiting India, Australia and Japan to Build Canada’s ‘Middle Power’ Bonds",
    "link": "https://www.nytimes.com/2026/02/28/world/canada/carney-asia-australia-visit.html",
    "summary": "Prime Minister Mark Carney visits India, Australia and Japan seeking deals to strengthen his country’s links to Indo-Pacific powers and break Canada’s dependence on the United States."
  },
  {
    "title": "In a Memoir Draft, Changpeng Zhao of Binance Details the Talks Leading to His Prison Time",
    "link": "https://www.nytimes.com/2026/02/27/technology/cz-changpeng-zhao-binance-memoir-prison.html",
    "summary": "In a draft of his memoir, Changpeng Zhao, the founder of Binance, laid out the secret negotiations that led to his imprisonment and a run-in with ICE."
  },
  {
    "title": "How David Zaslav Pulled Off the Sale of Warner Bros. Discovery to Paramount",
    "link": "https://www.nytimes.com/2026/02/27/business/media/david-zaslav-warner-bros-discovery-paramount.html",
    "summary": "Not long ago, Mr. Zaslav was widely criticized for his management of Warner Bros. Discovery. He overcame the doubters, cementing a blockbuster sale to Paramount."
  },
  {
    "title": "Henrietta Lacks’s Family Settles Suit With Novartis Over Use of Her Cells",
    "link": "https://www.nytimes.com/2026/02/27/us/novartis-settlement-henrietta-lacks-stolen-cells.html",
    "summary": "Ms. Lacks’s family accused Novartis of profiting from her cells, which were taken from her without her consent in 1951, when she was dying of cervical cancer."
  },
  {
    "title": "Fewer Detectives Will Hunt for Nancy Guthrie, Signaling a New Phase",
    "link": "https://www.nytimes.com/2026/02/27/us/nancy-guthrie-detectives.html",
    "summary": "After a month with little visible progress, the sheriff in Pima County, Ariz., is sending some deputies back to their regular units."
  },
  {
    "title": "Justice Thomas Bemoans Incivility as Security Prompts Cancellation of In-Person Speech",
    "link": "https://www.nytimes.com/2026/02/27/us/politics/supreme-court-thomas-security.html",
    "summary": "The justice participated remotely in a closed-door session of a legal conference, a reminder of the heightened threats facing jurists in recent years."
  },
  {
    "title": "The Rise and Fall of a 3-D Printing Empire",
    "link": "https://www.nytimes.com/2026/02/27/business/3d-printing-industry.html",
    "summary": "Desktop Metal, a billion-dollar start-up, promised to revolutionize manufacturing. It went bankrupt, and now has much humbler ambitions as the 3-D printing industry takes a sober turn."
  },
  {
    "title": "I Needed ‘Heated Rivalry’: Gay Romance Minus the Tragedy",
    "link": "https://www.nytimes.com/2026/02/27/arts/television/heated-rivalry-gay-representation-connor-storrie.html",
    "summary": "After a lifetime of settling for shame, secrecy and death onscreen, I had my doubts about “Heated Rivalry.” Then it seduced me, too."
  },
  {
    "title": "The Pentagon Can’t Afford This Fight",
    "link": "https://www.nytimes.com/2026/02/27/opinion/anthropic-pentagon-hegseth.html",
    "summary": "The military needs the very best A.I. to streamline its operations. It should find ways to work with these companies, not erect barriers."
  },
  {
    "title": "How Israel Lost Americans",
    "link": "https://www.nytimes.com/2026/02/27/opinion/israel-american-public-opinion.html",
    "summary": "Netanyahu and his government deserve the growing bipartisan opprobrium they’re receiving."
  },
  {
    "title": "Instagram to Alert Parents to Teens’ Self-Harm Searches",
    "link": "https://www.nytimes.com/2026/02/27/technology/meta-self-harm-notifications-parents.html",
    "summary": "Parents will receive notifications if a child has used the platform repeatedly to search for terms related to suicide or self-harm, but users must opt in to get them."
  },
  {
    "title": "An Update: Did a Brooklyn Couple Kill a Neighbor’s Trees for a Better View in Maine?",
    "link": "https://www.nytimes.com/2026/02/27/us/politics/maine-tree-poisoning.html",
    "summary": "On Friday, the state approved a settlement that included a $3,000 fine but no acknowledgment of guilt for a tree poisoning that riled people in scenic Rockport, Maine."
  },
  {
    "title": "Judge Approves $345 Million Verdict Against Greenpeace in Dakota Access Pipeline Suit",
    "link": "https://www.nytimes.com/2026/02/27/climate/greenpeace-energy-transfer-verdict-dakota-access.html",
    "summary": "Greenpeace has said the verdict could bankrupt it. The lawsuit was over the group’s role in protests against the Dakota Access Pipeline."
  },
  {
    "title": "Former U.S. Air Force Officer Is Accused of Training Chinese Military Pilots",
    "link": "https://www.nytimes.com/2026/02/28/us/air-force-pilot-china-arrest.html",
    "summary": "The former officer traveled to China to train pilots of the People’s Liberation Army Air Force without approval from the State Department, the Justice Department said."
  }
]