[
  {
    "title": "U.S. Botched a Deal to Swap Venezuelans in El Salvador for American Prisoners",
    "link": "https://www.nytimes.com/2025/07/08/world/americas/trump-venezuelan-migrants-us-prisoner-swap.html",
    "summary": "Secretary of State Marco Rubio and the U.S. envoy to Venezuela were both working on different deals and ended up at cross purposes."
  },
  {
    "title": "Trump and Bondi, Confronted Over Epstein Files, Tell Supporters to Move On",
    "link": "https://www.nytimes.com/2025/07/08/us/politics/trump-epstein.html",
    "summary": "A small but influential cohort of the president’s far-right political coalition spared him their ire but turned with a vengeance on the attorney general and the top officials at the F.B.I."
  },
  {
    "title": "Trump Uses Cabinet Meeting to Vent About Epstein, Putin and Powell",
    "link": "https://www.nytimes.com/2025/07/08/us/politics/trump-cabinet-meeting-decor.html",
    "summary": "The president held forth in public for 104 minutes, using a cabinet meeting to express much that is on his mind."
  },
  {
    "title": "L.A. Moves to Join Lawsuit Against Trump Administration’s Immigration Raids",
    "link": "https://www.nytimes.com/2025/07/08/us/politics/la-immigration-raids-trump-lawsuit.html",
    "summary": "The legal move came the day after federal agents and National Guard troops converged on a Los Angeles park in an extraordinary show of force."
  },
  {
    "title": "Supreme Court Clears Way for Trump Administration’s Mass Firings of Federal Workers",
    "link": "https://www.nytimes.com/2025/07/08/us/politics/supreme-court-federal-workers-layoffs.html",
    "summary": "The justices announced they were not ruling on the legality of the specific downsizing plans but they allowed the Trump administration to proceed for now with its restructuring efforts."
  },
  {
    "title": "Trump Got the Green Light to Fire Federal Workers. Now, They Wait.",
    "link": "https://www.nytimes.com/2025/07/08/us/politics/trump-federal-workers-firings.html",
    "summary": "A court-ordered pause in May covered nearly two dozen federal agencies at different stages of executing President Trump’s directive for mass layoffs. The Supreme Court said the administration could proceed."
  },
  {
    "title": "Trump’s Frustration With Putin Preceded Resumption of U.S. Weapons to Ukraine",
    "link": "https://www.nytimes.com/2025/07/08/us/politics/trump-putin-ukraine.html",
    "summary": "President Trump lashed out at the Russian leader on Tuesday, signaling a change in his posture toward the conflict."
  },
  {
    "title": "After Texas Flooding, Questions About FEMA’s Role and Fate Under Trump",
    "link": "https://www.nytimes.com/2025/07/08/climate/texas-flood-fema-trump.html",
    "summary": "President Trump wants to shutter the agency and shift responsibility and costs of emergency management to the states. In Texas, that process appears to already be underway."
  },
  {
    "title": "Two Found, Two Missing: An Agonizing Search After the Texas Floods",
    "link": "https://www.nytimes.com/2025/07/08/us/texas-flood-hill-country-search.html",
    "summary": "Four friends, all in their 20s, planned to spend the weekend in the Hill Country. Then the rains came."
  },
  {
    "title": "Abbott Calls Seeking Blame for Floods ‘the Word Choice of Losers’",
    "link": "https://www.nytimes.com/2025/07/08/us/abbott-blame-floods-losers-football.html",
    "summary": "As both the death toll and number of questions about official preparedness increased, the Texas governor invoked football metaphors, saying “every team makes mistakes.”"
  },
  {
    "title": "What Is a Trade Deal? Trump Takes an Expansive View.",
    "link": "https://www.nytimes.com/2025/07/08/us/politics/trump-trade-deal.html",
    "summary": "The president is deploying the word “deal” liberally, using the term to describe all kinds of trade arrangements, some very limited or one-sided."
  },
  {
    "title": "Wildfires Scar Syria Anew",
    "link": "https://www.nytimes.com/2025/07/09/world/middleeast/syria-wildfires-photos-videos.html",
    "summary": "The country is experiencing its worst drought in decades, which has set the conditions for the blazes to scorch an area the size of Washington, D.C."
  },
  {
    "title": "Wildfire on Edge of Marseille Injures More Than 100, Officials Say",
    "link": "https://www.nytimes.com/2025/07/09/world/europe/marseille-wildfires-france.html",
    "summary": "Firefighters worked to prevent the blaze from entering France’s second-biggest city, where ash and smoke had spread overnight."
  },
  {
    "title": "Research Suggests Climate Change Added Excess Deaths in European Heat Wave",
    "link": "https://www.nytimes.com/2025/07/09/climate/europe-heat-waves-deaths.html",
    "summary": "The rapid analysis by World Weather Attribution calculated that climate change might have tripled the death toll from the event."
  },
  {
    "title": "How Insularity Defined the Last Stages of Biden’s Career",
    "link": "https://www.nytimes.com/2025/07/08/us/politics/biden-aides-election-age.html",
    "summary": "The effort by Joseph R. Biden Jr.’s inner circle to limit access to him helps explain why it took him more than three weeks to drop his re-election bid after his disastrous debate performance."
  },
  {
    "title": "‘Superman’ Review: It’s a Bird, It’s a Plane, It’s a Reboot!",
    "link": "https://www.nytimes.com/2025/07/08/movies/superman-review.html",
    "summary": "Beginning again with the Man of Steel, this time in the hands of James Gunn."
  },
  {
    "title": "Antigovernment Protests Erupt Across Kenya, Killing Dozens",
    "link": "https://www.nytimes.com/2025/07/08/world/africa/kenya-antigovernment-protests-ruto.html",
    "summary": "Simmering anger against President William Ruto’s government has boiled over into clashes between protesters and the police, who have deployed live rounds, tear gas and water cannons."
  },
  {
    "title": "Should New York City Ditch Its Party Primaries in Favor of Open Races?",
    "link": "https://www.nytimes.com/2025/07/08/nyregion/open-primary-elections-nyc.html",
    "summary": "A panel created by Mayor Eric Adams wants to consider using an “open primary” system for elections in New York City. Here’s how the plan would work."
  },
  {
    "title": "Trash Overflows in Philadelphia as City Workers’ Strike Enters Second Week",
    "link": "https://www.nytimes.com/2025/07/08/us/trash-philadelphia-strike.html",
    "summary": "Pungent odors permeate the City of Brotherly Love as a contract impasse between the city and the American Federation of State, County and Municipal Employees continues."
  },
  {
    "title": "Bibi’s Empty Victory Lap",
    "link": "https://www.nytimes.com/2025/07/09/opinion/netanyahu-israel-war.html",
    "summary": "The 12-day war is over. But there’s no peace in sight."
  },
  {
    "title": "For Israel, It Pays to Be a Winner",
    "link": "https://www.nytimes.com/2025/07/08/opinion/israel-gaza-iran-netanyahu.html",
    "summary": "Diplomatic breakthroughs in the Middle East are the result of military victories."
  },
  {
    "title": "Flash Flooding in Ruidoso, New Mexico, Sweeps Homes Away and Forces Rescues",
    "link": "https://www.nytimes.com/2025/07/08/us/flooding-ruidoso-new-mexico.html",
    "summary": "Rescue efforts were underway after heavy rainfall pounded Ruidoso, N.M."
  },
  {
    "title": "Britain’s Economic Bind: Face Public Disapproval or Investor Wrath",
    "link": "https://www.nytimes.com/2025/07/09/business/uk-economy-reeves-starmer.html",
    "summary": "The Labour Party is starting its second year in control of the government with difficult choices over whether to curb spending or raise taxes."
  },
  {
    "title": "Grok, Elon Musk’s AI Chatbot, Shares Antisemitic Posts on X",
    "link": "https://www.nytimes.com/2025/07/08/technology/grok-antisemitism-ai-x.html",
    "summary": "The artificial intelligence chatbot, which has a dedicated account on X, praised Hitler after fielding a query about a user’s comments on the Texas flood."
  },
  {
    "title": "The Bayeux Tapestry, a British Masterpiece, Returns to England After 900 Years",
    "link": "https://www.nytimes.com/2025/07/08/world/europe/bayeux-tapestry-england-france-british-museum.html",
    "summary": "The embroidered work, depicting the Norman Conquest of England in 1066, is a loan from France. For the first time, it will be on exhibit in London."
  }
]