[
  {
    "title": "‘Murky Waters’ for Global Businesses After Trump’s Tariff Loss",
    "link": "https://www.nytimes.com/2026/02/21/business/economy/tariffs-supreme-court-global-busines-reaction.html",
    "summary": "Even after the Supreme Court invalidated many of the president’s levies, foreign leaders and executives assume that U.S. tariffs are here to stay, in one form or another."
  },
  {
    "title": "Trump Doubles Down on Closing Tax Loophole on Cheap Imports",
    "link": "https://www.nytimes.com/2026/02/21/business/trump-deminimis-loophole-closed.html",
    "summary": "The exemption was shut down last year by President Trump based, in part, on the same legal grounds as the tariffs that were invalidated by the Supreme Court."
  },
  {
    "title": "With Tariff Changes, Consumers May Be Stuck in a Waiting Game",
    "link": "https://www.nytimes.com/2026/02/20/business/economy/tariff-ruling-consumer-prices.html",
    "summary": "Some companies could decide to temper price increases, but the effect would take time to materialize."
  },
  {
    "title": "In Gorsuch’s Homage to Legislative Power, a Subtle Reproach of a Neutered Congress",
    "link": "https://www.nytimes.com/2026/02/21/us/politics/gorsuch-congress-trump-tariffs.html",
    "summary": "In his concurrence to the ruling invalidating President Trump’s tariffs, Justice Neil M. Gorsuch made a forceful case for the sanctity of the legislative process — and an implicit critique of its current dysfunction."
  },
  {
    "title": "Bench Presses, Pull Ups … Kid Rock? The White House Had a Very Manly Week.",
    "link": "https://www.nytimes.com/2026/02/20/us/politics/trump-hegseth-rfk-manliness.html",
    "summary": "President Trump’s top cabinet officials are pumping iron in public."
  },
  {
    "title": "Bridge Owner Donated $1 Million to MAGA Group Before Trump Blasted Competitor",
    "link": "https://www.nytimes.com/2026/02/20/us/politics/trump-canada-bridge-maga-inc-donation.html",
    "summary": "The PAC and the White House say the donation had nothing to do with President Trump’s tirade against a new bridge connecting Detroit and Windsor, Ontario."
  },
  {
    "title": "Longtime Virginia Lawyer Chosen by Judges as U.S. Attorney, and Then Fired",
    "link": "https://www.nytimes.com/2026/02/20/us/politics/us-attorney-eastern-district-of-virginia.html",
    "summary": "It was the second time this month that the administration had gotten rid of a top federal prosecutor appointed to his post by federal judges."
  },
  {
    "title": "Judge Rebukes U.S. Over Application to Search Washington Post Reporter’s Home",
    "link": "https://www.nytimes.com/2026/02/20/us/politics/washington-post-reporter-home-search.html",
    "summary": "A prosecutor apologized for failing to alert the magistrate to a 1980 law that restricts searches for reporting materials."
  },
  {
    "title": "Alysa Liu Trusted Her Artistry in Her Olympic Free Skate",
    "link": "https://www.nytimes.com/2026/02/20/arts/dance/alysa-liu-figure-skating-winter-olympics.html",
    "summary": "Competition can wreck a figure skater, but Liu and other Olympians shed the pressure and delivered transcendent performances focused on artistry."
  },
  {
    "title": "Los Angeles Olympics Have a Cloud of Concerns as Winter Games Close",
    "link": "https://www.nytimes.com/2026/02/21/us/la-olympics-casey-wasserman-epstein.html",
    "summary": "New details about the LA28 chairman’s ties to Jeffrey Epstein, as well as anxiety over key infrastructure projects, have thrown the planning into disarray."
  },
  {
    "title": "Why Attacking Iran Could Be Riskier Than Capturing Maduro",
    "link": "https://www.nytimes.com/2026/02/21/world/middleeast/iran-military-operation-venezuela.html",
    "summary": "Iran’s extensive military abilities and network of regional proxies could draw the United States into a prolonged conflict."
  },
  {
    "title": "U.S. Planes Land at Jordan Base, a Key Hub for Planning Possible Iran Strikes",
    "link": "https://www.nytimes.com/2026/02/20/us/politics/us-military-jordan-iran.html",
    "summary": "At least 60 attack aircraft are parked at the base, which has become a key hub for U.S. military planning for possible strikes on Iran."
  },
  {
    "title": "He Researched Dishonesty. He Got Friendly With Jeffrey Epstein.",
    "link": "https://www.nytimes.com/2026/02/21/business/jeffrey-epstein-dan-ariely-dishonesty.html",
    "summary": "Dan Ariely, a behavioral scientist at Duke, sought out the convicted sex offender for his research. Their yearslong correspondence suggests it wasn’t all business."
  },
  {
    "title": "Shocker! SCOTUS Schools POTUS",
    "link": "https://www.nytimes.com/2026/02/21/opinion/scotus-trump-tariffs-epstein.html",
    "summary": "The high court asserts itself as tariff sheriff."
  },
  {
    "title": "‘A Cocked Pistol Aimed at Iran’",
    "link": "https://www.nytimes.com/2026/02/21/opinion/iran-epstein-power.html",
    "summary": "Three Opinion writers on Iran, Epstein and what power really looks like."
  },
  {
    "title": "At A.I. Summit, India Tries to Find a Way Between the U.S. and China",
    "link": "https://www.nytimes.com/2026/02/21/world/asia/ai-summit-india-foreign-policy.html",
    "summary": "India is using technology as a tool of foreign policy, casting itself as a moral voice for smaller, developing countries."
  },
  {
    "title": "Another Winter Storm Could Deliver More Snow to the Northeast This Weekend",
    "link": "https://www.nytimes.com/2026/02/20/weather/new-york-snow-forecast.html",
    "summary": "Forecasts on Friday began to make another major snowstorm look far more likely. Snow is expected to begin falling Sunday."
  },
  {
    "title": "Ruben Ray Martinez Was Killed in an Undisclosed ICE Shooting in March, His Family Says",
    "link": "https://www.nytimes.com/2026/02/20/us/ruben-ray-martinez-ice-shooting-texas.html",
    "summary": "A 23-year-old American was shot last March in South Padre Island. ICE’s involvement in the shooting was not disclosed until this week."
  },
  {
    "title": "These Skiers Cleared Out as Group That Would Be Hit by Avalanche Arrived",
    "link": "https://www.nytimes.com/2026/02/20/us/avalanche-tahoe-huts.html",
    "summary": "If the party had waited out the storm in their cabins, one of the skiers said, the outcome might have been different."
  }
]