[
  {
    "title": "N.S.A.’s Acting Director Tried to Save Top Scientist From Purge",
    "link": "https://www.nytimes.com/2025/08/20/us/politics/security-clearances-scientist-fired.html",
    "summary": "Vinh Nguyen, an expert in artificial intelligence and advanced mathematics, was among the current and former officials whose security clearances were revoked by the president."
  },
  {
    "title": "Senate Adds Guardrails in an Effort to Force Trump to Obey Spending Bills",
    "link": "https://www.nytimes.com/2025/08/20/us/politics/senate-spending-guardrails-trump.html",
    "summary": "Leaders of the Appropriations Committee are trying to tighten up funding legislation to give the Trump administration less leeway to refuse to spend federal money."
  },
  {
    "title": "Trump’s Tactics Mean Many International Students Won’t Make It to Campus",
    "link": "https://www.nytimes.com/2025/08/20/us/trump-visa-vetting-international-students.html",
    "summary": "Students from some countries won’t make it to class this fall because of President Trump’s travel ban. Others can’t get visa appointments. Some are simply scared. Universities are panicking."
  },
  {
    "title": "More Adams Associates and Supporters Are Said to Face Corruption Charges",
    "link": "https://www.nytimes.com/2025/08/20/nyregion/adams-corruption-nyc-lewis-martin-charges.html",
    "summary": "Among those expected to surrender in the coming days are Mayor Eric Adams’s closest adviser and a friend whom the mayor installed in a powerful city position."
  },
  {
    "title": "What Russia Is Doing to Grab Ukrainian Land While It Still Can",
    "link": "https://www.nytimes.com/2025/08/20/world/europe/ukraine-russia-battlefield.html",
    "summary": "As negotiations over the war carry on, President Vladimir V. Putin is pushing hard with tactics that have evolved over three and a half years."
  },
  {
    "title": "Russia Demands Role in Guaranteeing Ukraine’s Postwar Security",
    "link": "https://www.nytimes.com/2025/08/20/world/europe/ukraine-russia-security-guarantees.html",
    "summary": "European and Ukrainian officials call the idea ludicrous, showing the large gaps in peace negotiations."
  },
  {
    "title": "Preparations for a Move on Gaza City Have Started, Israel’s Military Says",
    "link": "https://www.nytimes.com/2025/08/20/world/middleeast/israel-hamas-gaza-city.html",
    "summary": "Troops have reached the city’s outskirts, an Israeli official said, adding that more reservists are being asked to report for duty to cover for other soldiers who will be involved in going into Gaza City."
  },
  {
    "title": "Syrian and Israeli Officials Meet for U.S. Brokered Talks",
    "link": "https://www.nytimes.com/2025/08/20/world/middleeast/syrian-israel-meet-paris.html",
    "summary": "The talks in Paris brokered by the United States were the latest effort to reduce tensions between the two longstanding foes, and came after Israel launched airstrikes on the Syrian capital last month."
  },
  {
    "title": "Trump Calls Netanyahu a ‘War Hero’ and Adds: ‘I Guess I Am Too’",
    "link": "https://www.nytimes.com/2025/08/20/world/middleeast/trump-war-hero-netanyahu-iran.html",
    "summary": "President Trump praised Prime Minister Benjamin Netanyahu of Israel for bombing Iranian nuclear sites, and credited himself as well."
  },
  {
    "title": "Come One, Come All! Buy Your TV Subscriptions Here!",
    "link": "https://www.nytimes.com/2025/08/20/business/media/streaming-tv-subscription-bundle.html",
    "summary": "A battle is heating up in the streaming world as millions of Americans sign up for multiple services through a single provider instead of separate apps."
  },
  {
    "title": "Judge Halts Texas Law Mandating the Ten Commandments in School",
    "link": "https://www.nytimes.com/2025/08/20/us/politics/ten-commandments-texas.html",
    "summary": "The state law had said public schools would have to display the Ten Commandments in a “conspicuous” location in every classroom in Texas by Sept. 1."
  },
  {
    "title": "Oklahoma Proposes ‘America First Test’ for Teachers From New York and California",
    "link": "https://www.nytimes.com/2025/08/20/education/oklahoma-woke-teacher-test.html",
    "summary": "The test is meant to filter out teachers who hold views “antithetical” to Oklahoma values."
  },
  {
    "title": "How Harry Potter Fans Are Driving the Romantasy Trend",
    "link": "https://www.nytimes.com/2025/08/20/style/harry-potter-fan-fiction-romantasy-manacled.html",
    "summary": "Romantasy is propping up the fiction market. Thanks to a generation that grew up reading about a boy wizard."
  },
  {
    "title": "Trump’s Tariffs Push U.S. Businesses Into ‘Survival Mode’",
    "link": "https://www.nytimes.com/2025/08/20/business/trump-china-tariffs-american-importers.html",
    "summary": "A 90-day pause on additional tariffs on China offers no relief to American companies already facing extraordinarily high import taxes imposed by President Trump."
  },
  {
    "title": "How Tariffs Will Affect This Unique Cheese",
    "link": "https://www.nytimes.com/video/business/small-business/100000010283073/blue-cheese-stilton-tariffs-america.html",
    "summary": "Stilton is a special type of blue cheese that can be made in only three English counties. There are just four producers of Stilton left, but this one was crowned best cheese in the world, according to one of the industry’s top awards last year. Eshe Nelson, a business reporter for The New York Times, went to Clawson Farms, the producer of the award-winning Stilton, which is trying to expand its business in the United States, despite the higher costs imposed by the Trump administration’s tariff policy."
  },
  {
    "title": "Canada and Mexico Look to Team Up as Trump’s Tariff Threats Loom",
    "link": "https://www.nytimes.com/2025/08/20/world/americas/canada-mexico-tariffs-trump.html",
    "summary": "Mexico and Canada have long viewed each other with indifference or even distrust. They’re now talking about teaming up."
  },
  {
    "title": "No Food, No Water, a Broken Leg: How a Hiker Survived a Harrowing Week in the Wild",
    "link": "https://www.nytimes.com/2025/08/20/world/europe/alec-luhn-missing-hiker-norway-found-interview.html",
    "summary": "Alec Luhn, 38, an American journalist, hopes the lessons he learned from his ordeal in a national park in Norway can help others."
  },
  {
    "title": "Texas Republicans Poised to Pass New Redistricting Maps, Just as Trump Wanted",
    "link": "https://www.nytimes.com/2025/08/20/us/politics/texas-republicans-redistricting-maps.html",
    "summary": "The effort is intended to help the G.O.P. win five more U.S. House seats in the midterm elections. California will counter on Thursday."
  },
  {
    "title": "Zach Cherry on ‘Severance’ and His First Emmy Nomination",
    "link": "https://www.nytimes.com/2025/08/20/arts/television/zach-cherry-severance-emmy-nomination.html",
    "summary": "The actor’s improv background makes him more comfortable in comedy, but his performance in this twisty sci-fi mystery brought his first Emmy nomination."
  },
  {
    "title": "Why Covid Is Spreading Again This Summer",
    "link": "https://www.nytimes.com/2025/08/20/well/why-covid-is-spreading-again-this-summer.html",
    "summary": "Researchers are seeing an uptick in cases, as they have every summer since the pandemic began. Here’s why."
  },
  {
    "title": "Why Georgia, Once on Democracy’s Vanguard, Is Drifting Toward Russia",
    "link": "https://www.nytimes.com/2025/08/20/magazine/georgia-russia-autocracy-dictatorship.html",
    "summary": "Two decades after the Rose Revolution, the former Soviet satellite is turning away from the West and back toward Russia. What happened?"
  },
  {
    "title": "How Ian Fleming and His Spy Scheme Inspired a Broadway Show",
    "link": "https://www.nytimes.com/2025/08/19/theater/ian-fleming-operation-mincemeat-broadway.html",
    "summary": "The musical “Operation Mincemeat” tells the story of an absurd feat of deception dreamed up by this spy-turned-novelist. His real acts of espionage were even wilder."
  },
  {
    "title": "Amy Klobuchar: I Knew A.I. Deepfakes Were a Problem. Then I Saw One of Myself.",
    "link": "https://www.nytimes.com/2025/08/20/opinion/amy-klobuchar-deepfakes.html",
    "summary": "Deepfakes are getting more realistic, and more difficult to stop. Congress needs to take steps now."
  },
  {
    "title": "The New American Inequality: The Cooled vs. the Cooked",
    "link": "https://www.nytimes.com/2025/08/20/opinion/extreme-heat-class-divide.html",
    "summary": "Heat waves are increasingly dangerous for those without water, shade and air-conditioning."
  },
  {
    "title": "How We Vote",
    "link": "https://www.nytimes.com/2025/08/20/briefing/voting-machines-mailin-voting.html",
    "summary": "We explore President Trump effort to eliminate mailed ballots and voting machines."
  },
  {
    "title": "More Than 70 Afghans Returning From Iran Die in Fiery Bus Crash",
    "link": "https://www.nytimes.com/2025/08/20/world/asia/afghan-deportation-bus-crash.html",
    "summary": "The bus collided with two vehicles. The victims were among the 1.8 million Afghans expelled from Iran as the country vowed to deport undocumented residents en masse."
  },
  {
    "title": "Onionlike Space Explosion May Be a New Type of Supernova",
    "link": "https://www.nytimes.com/2025/08/20/science/supernova-layers-elements.html",
    "summary": "The rare blast peeled back the inner layers of a dying star, offering clues to how the elements that make up life on Earth were forged."
  },
  {
    "title": "Arkansas Housing Development Restricted to White Residents Sparks Legal Concerns",
    "link": "https://www.nytimes.com/2025/08/19/realestate/arkansas-white-housing-return-to-land.html",
    "summary": "Housing rights experts say a community restricted to white residents is illegal, but the creators believe they could win a potential challenge in court in the current political climate."
  }
]