[
  {
    "title": "Storm Poses Big Threats to Power Grids Across U.S.",
    "link": "https://www.nytimes.com/2026/01/23/business/energy-environment/storm-power-outage.html",
    "summary": "Managers of electric grids say freezing temperatures and ice and snow could lead to power outages in many places, potentially leaving millions in the dark."
  },
  {
    "title": "Mamdani Announces Snow Plans, Including No Snow Day for NYC Schools",
    "link": "https://www.nytimes.com/2026/01/23/nyregion/mamdani-snow-nyc.html",
    "summary": "Plenty of New York City mayors have faced blowback over their handling of blizzards. In several appearances this week, Mayor Zohran Mamdani has sought to show he is prepared."
  },
  {
    "title": "Hundreds of Minnesota Businesses on Strike in Protest Against ICE",
    "link": "https://www.nytimes.com/2026/01/23/us/minnesota-businesses-protest-ice.html",
    "summary": "After protesters called for a pause on economic activity and work to strike against the federal immigration crackdown, many business owners kept their doors shut on Friday."
  },
  {
    "title": "Voters Are Split on Deportations but Disapprove of ICE, Poll Finds",
    "link": "https://www.nytimes.com/2026/01/23/us/politics/poll-ice-immigration.html",
    "summary": "While roughly half of voters support President Trump’s handling of the border between the United States and Mexico, a sizable majority says that ICE’s tactics have “gone too far.”"
  },
  {
    "title": "The Whipple Building Is at the Center of Minnesota’s Immigration Drama",
    "link": "https://www.nytimes.com/2026/01/23/us/minnesota-immigration-whipple-building-minneapolis.html",
    "summary": "Just outside Minneapolis, the Whipple Building houses offices, a detention center and a courthouse — and has become the home base for immigration agents and protesters alike."
  },
  {
    "title": "White House Posts Altered Photo Showing Arrested Minnesota Protester Crying",
    "link": "https://www.nytimes.com/2026/01/22/us/politics/nekima-armstrong-photo-white-house.html",
    "summary": "The New York Times ran the image through an A.I. detection system and concluded that it showed signs of manipulation."
  },
  {
    "title": "Trump Withdraws Carney’s Invitation for Canada to Join His ‘Board of Peace’",
    "link": "https://www.nytimes.com/2026/01/23/us/politics/trump-carney-canada-board-peace.html",
    "summary": "The president appeared to be lashing out in response to stark, high-profile remarks by Prime Minister Mark Carney of Canada that rejected Mr. Trump’s efforts to dismantle the international order."
  },
  {
    "title": "U.K.’s Starmer Calls Trump’s Claims About NATO Soldiers in Afghanistan ‘Appalling’",
    "link": "https://www.nytimes.com/2026/01/23/world/europe/uk-soldiers-afghanistan-trump-nato.html",
    "summary": "President Trump said that NATO soldiers stayed “a little off the front lines” during the conflict. In Britain, which lost 457 soldiers in the war, the response was swift."
  },
  {
    "title": "Europe’s Leaders Scramble to Find a Path Forward With Trump",
    "link": "https://www.nytimes.com/2026/01/22/us/politics/europe-trump-greenland-tariffs-eu-meeting.html",
    "summary": "Leaders from across the European Union held an emergency summit in Brussels to discuss Greenland and, more broadly, their fragile relationship with America."
  },
  {
    "title": "After TikTok Deal, Chinese Firms Search for a New Global Path",
    "link": "https://www.nytimes.com/2026/01/23/business/tiktok-china-technology.html",
    "summary": "Chinese firms must contend with geopolitical tensions and mistrust to do business in the United States. Some are choosing to avoid the U.S. altogether."
  },
  {
    "title": "Will I Have to Download a New TikTok App? And Other Big Questions About The Deal.",
    "link": "https://www.nytimes.com/2026/01/22/business/media/tiktok-sold-app-content-algorithm.html",
    "summary": "The popular short form video app has a new corporate structure in the United States, which could result in some changes for the 200 million Americans who use TikTok."
  },
  {
    "title": "Here’s Who Just Bought TikTok",
    "link": "https://www.nytimes.com/2026/01/22/business/media/tiktok-investors-oracle-mgx-silver-lake-bytedance.html",
    "summary": "Several big companies and investment firms are part of the new American TikTok. Many have ties to one another and President Trump."
  },
  {
    "title": "Can Max Greyserman Achieve Golf Greatness by Thinking Like a Wall Street Trader?",
    "link": "https://www.nytimes.com/2026/01/23/magazine/max-greyserman-golf-pga-wall-street.html",
    "summary": "Max Greyserman is trying to climb to the top of the PGA Tour by using lessons from his father’s time as a quant."
  },
  {
    "title": "As Iran Grieves, Accounts Emerge of Disrespectful Treatment of Protest Victims",
    "link": "https://www.nytimes.com/2026/01/23/world/middleeast/iran-protests-victims-bodies.html",
    "summary": "Witness testimony and videos from Tehran’s largest cemetery show disrespectful treatment of the dead after a brutal government crackdown."
  },
  {
    "title": "Trump Says U.S. ‘Armada’ Is Heading to Iran, Raising Pressure on Regime",
    "link": "https://www.nytimes.com/2026/01/23/world/middleeast/trump-armada-iran-naval-force.html",
    "summary": "President Trump said the United States was “watching Iran” and sending a naval force there, despite also saying that his threats had halted executions."
  },
  {
    "title": "A Republican Vaccine Defender Fights to Hang On",
    "link": "https://www.nytimes.com/2026/01/23/us/politics/bill-cassidy-trump-louisiana-senate-race.html",
    "summary": "Senator Bill Cassidy of Louisiana, a physician, reluctantly voted to confirm Robert F. Kennedy Jr. as health secretary. It didn’t appease President Trump."
  },
  {
    "title": "Vaccine Panel Chair Says Polio and Other Shots Should Be Optional, Rejecting Decades of Science",
    "link": "https://www.nytimes.com/2026/01/23/health/milhoan-vaccines-optional-polio.html",
    "summary": "Dr. Kirk Milhoan, a pediatric cardiologist who leads the Advisory Committee on Immunization Practices, said a person’s right to refuse a vaccine outweighed concerns about illness or death from infectious diseases."
  },
  {
    "title": "Takeaways From Jack Smith’s Testimony on Trump Investigations",
    "link": "https://www.nytimes.com/2026/01/22/us/politics/takeaways-jack-smith-congress-testimony.html",
    "summary": "In his remarks, the former special counsel repeatedly denied that he had acted out of partisan animus and bemoaned the Trump administration’s efforts to go after the president’s perceived enemies."
  },
  {
    "title": "Ryan Wedding, Canadian Ex-Snowboarder Accused of Running Drug Ring, Is Arrested",
    "link": "https://www.nytimes.com/2026/01/23/world/canada/ryan-wedding-arrest.html",
    "summary": "Ryan Wedding, 44, who competed in the Winter Olympics in 2002, has been charged with murder and with smuggling cocaine into the United States."
  },
  {
    "title": "How Ryan Wedding, a Canadian Olympic Snowboarder, Turned into a Drug Lord",
    "link": "https://www.nytimes.com/2025/12/26/world/canada/ryan-wedding-olympic-snowboarder-drug-lord.html",
    "summary": "Ryan Wedding rose to fame as a Canadian Olympic athlete, but the authorities say he became one of the world’s biggest drug lords, who ordered an informant executed."
  },
  {
    "title": "Ukrainian, Russian and U.S. Officials to Meet in Abu Dhabi for Peace Talks",
    "link": "https://www.nytimes.com/2026/01/23/world/europe/ukraine-russia-war-us-peace-talks-abu-dhabi.html",
    "summary": "In the past, Ukrainian and Russian negotiators have relied on Americans to mediate, and it was unclear how the talks would play out."
  },
  {
    "title": "Increased Scrutiny Leads to an Improved Organ Transplant System",
    "link": "https://www.nytimes.com/2026/01/23/us/organ-donation.html",
    "summary": "A crackdown on problems with fairness and safety is achieving results, including a big drop in the number of sick patients being passed over for transplants."
  },
  {
    "title": "5 Arrested in Shooting of Indiana Judge Steven Meyer and His Wife",
    "link": "https://www.nytimes.com/2026/01/23/us/indiana-judge-steven-meyer-shooting-arrests.html",
    "summary": "Three people from Indiana and two from Kentucky are in custody, officials said. The judge, Steven Meyer, and his wife were injured but are recovering."
  },
  {
    "title": "Luke Thompson Finally Takes the ‘Bridgerton’ Spotlight",
    "link": "https://www.nytimes.com/2026/01/23/arts/television/luke-thompson-bridgerton-netflix.html",
    "summary": "As his character assumes the lead in a new season, Luke Thompson is bringing Shakespearean depth to one of the buzziest streaming shows of our time."
  },
  {
    "title": "The Trump Crackup",
    "link": "https://www.nytimes.com/2026/01/23/opinion/trump-authoritarian-power.html",
    "summary": "Events are being propelled by one man’s damaged psyche."
  },
  {
    "title": "Minneapolis Reveals Where Trump’s Deportation Agenda Is Going",
    "link": "https://www.nytimes.com/2026/01/23/opinion/ezra-klein-podcast-caitlin-dickerson.html",
    "summary": "Caitlin Dickerson, an immigration reporter, explains the different pieces of Trump’s deportation machine."
  },
  {
    "title": "A Big Storm",
    "link": "https://www.nytimes.com/2026/01/23/briefing/a-big-storm.html",
    "summary": "We explain what you can expect in the winter weather this week."
  },
  {
    "title": "For His Next Act, Darren Walker Is Heading to Hollywood",
    "link": "https://www.nytimes.com/2026/01/23/arts/design/darren-walker-anonymous-content.html",
    "summary": "Anonymous Content, a production company whose top investor is Laurene Powell Jobs’s Emerson Collective, has named Darren Walker as president and chief executive."
  },
  {
    "title": "Jasmine Crockett and James Talarico Face Off in a Texas Senate Primary Campaign",
    "link": "https://www.nytimes.com/2026/01/23/us/politics/jasmine-crockett-james-talarico-texas-senate-campaign.html",
    "summary": "Two of the Democrats’ rising stars, Jasmine Crockett and James Talarico, are seeing if a red state should be won courting disaffected Republicans or focusing on the party’s base."
  },
  {
    "title": "After Pleas From Mamdani and Hochul, Talks Resume in Nurses’ Strike",
    "link": "https://www.nytimes.com/2026/01/23/nyregion/nyc-nurses-strike-mamdani-hochul.html",
    "summary": "Nearly 15,000 health care workers in New York have been off the job since last week in a labor action affecting some of the city’s major hospitals."
  },
  {
    "title": "Democrats Seek Maxwell Prison Visit, Citing Preferential Treatment",
    "link": "https://www.nytimes.com/2026/01/23/us/politics/ghislaine-maxwell-prison-preferential-treatment.html",
    "summary": "House Democrats told the attorney general that more than a dozen whistle-blowers had come forward with reports of Ghislaine Maxwell receiving perks in prison."
  }
]