[
  {
    "title": "Ukrainians Are Cautiously Optimistic After Trump Says U.S. Will Send More Military Aid",
    "link": "https://www.nytimes.com/2025/07/08/world/europe/ukraine-russia-us-weapons-trump.html",
    "summary": "After President Trump’s announcement that the United States would send more military aid, some were grateful, others were skeptical, mindful of his seesawing policy."
  },
  {
    "title": "Land Mines, a Cold War Horror, Could Return to Fortify Europe’s Borders",
    "link": "https://www.nytimes.com/2025/07/08/world/europe/land-mines-treaty-russia-ukraine.html",
    "summary": "Five countries plan to revive the use of a weapon prohibited by treaty for more than a quarter of a century, hoping to strengthen their defenses against any Russian attack."
  },
  {
    "title": "The Wild Russian Plot to Burn a London Restaurant and Kidnap Its Owner",
    "link": "https://www.nytimes.com/2025/07/08/world/europe/hide-wagner-plot-kidnap-uk.html",
    "summary": "Court proceedings revealed how a criminal gang in Britain was directed to target Yevgeny Chichvarkin, a dissident Russian who owns Hide, a Michelin-starred restaurant in Mayfair."
  },
  {
    "title": "What We Saw in the Texas Flood Zone",
    "link": "https://www.nytimes.com/video/us/100000010271441/what-we-saw-in-the-texas-flood-zone.html",
    "summary": "Search-and-rescue teams have been hoping against hope to find signs of life after the Texas floods. Nicholas Bogel-Burroughs, an investigative reporter at The New York Times, describes what he has seen in Texas."
  },
  {
    "title": "Texas Flood Victims: What We Know",
    "link": "https://www.nytimes.com/2025/07/05/us/texas-flood-victims.html",
    "summary": "A beloved teacher, child and adult campers, camp directors and a counselor are among at least 109 people who have died in the flooding in Central Texas."
  },
  {
    "title": "How Insularity Defined the Last Stages of Biden’s Career",
    "link": "https://www.nytimes.com/2025/07/08/us/politics/biden-aides-election-age.html",
    "summary": "The effort by Joseph R. Biden Jr.’s inner circle to limit access to him helps explain why it took him more than three weeks to drop his re-election bid after his disastrous debate performance."
  },
  {
    "title": "Liberal Fund-Raising Drive Seeks $250 Million to Aid Pushback Against Trump",
    "link": "https://www.nytimes.com/2025/07/08/us/politics/freedom-together-deepak-bhargava.html",
    "summary": "Donors hope to raise huge sums of money to help those fighting what they see as a drift toward authoritarianism, but without attracting unwanted White House attention."
  },
  {
    "title": "Trump Hires Scientists Who Doubt the Consensus on Climate Change",
    "link": "https://www.nytimes.com/2025/07/08/climate/trump-climate-energy-department.html",
    "summary": "The three scientists joined the administration after it dismissed hundreds of experts who were assessing how global warming is affecting the country."
  },
  {
    "title": "State Dept. Is Investigating Messages Impersonating Rubio, Official Says",
    "link": "https://www.nytimes.com/2025/07/08/us/politics/rubio-ai-impersonation-investigation.html",
    "summary": "A person or people imitating the secretary of state used artificial intelligence to send text and voice messages to foreign diplomats and U.S. officials, the department said in a cable to employees."
  },
  {
    "title": "Against Illegal Immigration, but Married to Someone Here Illegally",
    "link": "https://www.nytimes.com/2025/07/08/us/trump-illegal-immigration-raids-arkansas.html",
    "summary": "Chris Allred’s views were shaped by economic changes. Now, facing an immigration crackdown, where do he and his wife go from here?"
  },
  {
    "title": "Trump’s New Trade Threats Set Off Global Scramble to Avoid Tariffs",
    "link": "https://www.nytimes.com/2025/07/08/business/economy/trump-tariffs-talks.html",
    "summary": "Many countries thought they were negotiating in good faith. The White House renewed its “reciprocal” tariff plan anyway, giving countries until Aug. 1 to make offers."
  },
  {
    "title": "Stock Markets Rise After Trump Extends Tariff Deadline",
    "link": "https://www.nytimes.com/2025/07/08/business/trump-tariffs-stock-markets-sp500.html",
    "summary": "The president noted that U.S. negotiators remained open to offers from trading partners, suggesting that tariffs could be reduced by — or even after — the deadline on Aug. 1."
  },
  {
    "title": "How Do You Self-Identify? For Many Americans, Checking a Box Won’t Do.",
    "link": "https://www.nytimes.com/2025/07/08/us/race-ethnicity-identity-americans.html",
    "summary": "The New York mayoral candidate Zohran Mamdani said that his background doesn’t fit neatly into simple categories. Others say they’ve struggled with the same issue."
  },
  {
    "title": "Sweden’s Secret to Well-Being? Tiny Urban Gardens.",
    "link": "https://www.nytimes.com/2025/07/08/well/sweden-urban-gardens.html",
    "summary": "Known as koloniträdgårdar, they provide city dwellers access to nature, fresh produce and community."
  },
  {
    "title": "With a Nobel Prize Nomination, Netanyahu Is the Latest to Use Flattery to Woo Trump",
    "link": "https://www.nytimes.com/2025/07/08/world/europe/trump-diplomacy-flattery-world-leaders.html",
    "summary": "Prime Minister Benjamin Netanyahu of Israel handed a letter to President Trump nominating him for the Nobel Peace Prize. But it’s not clear whether stroking the president’s ego has long-lasting effects."
  },
  {
    "title": "Netanyahu Nominates Trump for Nobel Peace Prize",
    "link": "https://www.nytimes.com/2025/07/08/us/politics/netanyahu-trump-nobel-peace-prize.html",
    "summary": "Prime Minister Benjamin Netanyahu of Israel praised President Trump’s role in his country’s establishment of diplomatic relations with some Arab states. But Mr. Trump has supported Israeli actions that have strained those ties."
  },
  {
    "title": "How Do Israel and Hamas Negotiate in Qatar?",
    "link": "https://www.nytimes.com/2025/07/08/world/middleeast/how-do-israel-and-hamas-negotiate-in-qatar.html",
    "summary": "The ongoing presence of negotiators from Hamas and Israel in the Qatari capital, Doha, suggests that both sides are serious about clinching a deal."
  },
  {
    "title": "Attack on Cargo Ship in the Red Sea Kills 2 Crew Members",
    "link": "https://www.nytimes.com/2025/07/08/world/middleeast/red-sea-ship-attack.html",
    "summary": "The incident occurred a day after Houthi militants in Yemen targeted another vessel, their first assault on shipping since President Trump announced a truce with them."
  },
  {
    "title": "Inside the Collapse of the F.D.A.",
    "link": "https://www.nytimes.com/2025/07/08/magazine/fda-collapse-rfk-kennedy.html",
    "summary": "How the new health secretary, Robert F. Kennedy Jr., is dismantling the agency."
  },
  {
    "title": "What to Know About the Collapse of the F.D.A.",
    "link": "https://www.nytimes.com/2025/07/08/magazine/fda-collapse-rfk-takeaways.html",
    "summary": "The regulatory agency confronts a future determined by a health secretary hostile to its mission."
  },
  {
    "title": "‘Diddy Parties’ Became a Meme. The Combs Case Was About Something Else.",
    "link": "https://www.nytimes.com/2025/07/08/arts/music/sean-combs-diddy-trial-hotels-white-parties.html",
    "summary": "The sweep of graphic lawsuits accusing Sean Combs of sex abuse led to a sense that his criminal case might examine celebrity debauchery in the music industry. It did not."
  },
  {
    "title": "How to Make Senate Republicans Pay for Their Awful Bill",
    "link": "https://www.nytimes.com/2025/07/08/opinion/dan-osborn-tax-bill.html",
    "summary": "As Dan Osborn begins a new Senate campaign, he thinks some Republicans have buyer’s remorse."
  },
  {
    "title": "The Last Words of a Dying Glacier",
    "link": "https://www.nytimes.com/2025/07/08/opinion/climate-change-melting-glacier.html",
    "summary": "A glacier is disappearing. An artist is trying to preserve its sound."
  },
  {
    "title": "A Lost Summer Idyll",
    "link": "https://www.nytimes.com/2025/07/08/briefing/camp-mystic-texas-floods.html",
    "summary": "We explore the particular horror of a disaster at a summer camp."
  },
  {
    "title": "Wildfires Burn in Spain and France After Blistering Heat Wave",
    "link": "https://www.nytimes.com/2025/07/08/world/europe/france-spain-wildfires-heat-wave.html",
    "summary": "A blaze in southern France forced the closure of the Marseille airport, and weather agencies issued warnings for other parts of Europe where temperatures were expected to climb this week."
  },
  {
    "title": "I.C.C. Seeks Arrests of Taliban Leaders Over Persecution of Women",
    "link": "https://www.nytimes.com/2025/07/08/world/asia/icc-arrest-warrant-taliban.html",
    "summary": "The arrest warrants, for Afghanistan’s leader and its top justice official, say the restrictions on women and girls are evidence of crimes against humanity."
  },
  {
    "title": "The French Seaside Factory Trying to Break China’s Chokehold on Rare Earths",
    "link": "https://www.nytimes.com/2025/07/08/world/europe/eu-china-rare-earth-minerals-metals.html",
    "summary": "The continent wants to reduce the risks of depending so heavily on China for the valuable minerals. The question is how."
  },
  {
    "title": "Ivar Giaever, Nobel Winner in Quantum Physics, Dies at 96",
    "link": "https://www.nytimes.com/2025/07/08/science/ivar-giaever-dead.html",
    "summary": "A former “D” student from Norway, he made his mark at G.E.’s Research Lab in the U.S., in part by confirming a pivotal theory about superconductivity."
  }
]