[
  {
    "title": "The Firing of Educators Over Kirk Comments Follows a Familiar Playbook",
    "link": "https://www.nytimes.com/2025/09/22/us/firing-educators-kirk-free-speech.html",
    "summary": "Conservative efforts to call out and punish educators over liberal ideas have grown for years, led in part by Charlie Kirk himself."
  },
  {
    "title": "How Trump’s Approach Echoes China’s Crackdown on Dissent",
    "link": "https://www.nytimes.com/2025/09/22/business/china-censorship-jimmy-kimmel.html",
    "summary": "In China, journalism and public debate were opening up, and then a leader took over and used a series of steps to dictate speech."
  },
  {
    "title": "Trump’s Tax Cut Is Underwater. Can a ‘Refund Boom’ Save It?",
    "link": "https://www.nytimes.com/2025/09/22/us/politics/trump-tax-cuts.html",
    "summary": "Republicans are hoping a new name, along with larger refunds for many Americans next year, can buoy an economic agenda that polls show is unpopular."
  },
  {
    "title": "American Investors Will License and Oversee TikTok’s U.S. Version, White House Says",
    "link": "https://www.nytimes.com/2025/09/22/us/politics/tiktok-deal-algorithm-trump.html",
    "summary": "The change is part of a deal to bring TikTok under U.S. ownership to avert a looming ban."
  },
  {
    "title": "Miran Says Interest Rates Should Fall to 2.5 Percent This Year",
    "link": "https://www.nytimes.com/2025/09/22/business/trump-fed-interest-rates.html",
    "summary": "Stephen Miran, who joined the central bank last week, said he believed rates should be around 2.5 percent, or about two percentage points lower than they now are."
  },
  {
    "title": "Trump Announcement Said to Focus on Unproven Link Between Tylenol and Autism",
    "link": "https://www.nytimes.com/2025/09/22/health/kennedy-autism-tylenol-trump.html",
    "summary": "A federal report on Monday is expected to point to acetaminophen, the active ingredient in painkillers like Tylenol. But research into a possible connection has yielded mixed results."
  },
  {
    "title": "Trump Appointees Roll Back Enforcement of Fair Housing Laws",
    "link": "https://www.nytimes.com/2025/09/22/realestate/trump-fair-housing-laws.html",
    "summary": "Interviews and internal documents show that signature civil rights protections in housing are being dismissed as ideologically driven and D.E.I. in disguise."
  },
  {
    "title": "With New Plan, Hochul Fast-Tracks Housing Supply",
    "link": "https://www.nytimes.com/2025/09/22/realestate/hochul-modular-housing.html",
    "summary": "A new program will put manufactured homes at the center of a statewide effort to make housing more affordable."
  },
  {
    "title": "The Wary, Warming, Wildly Consequential Alliance of Ocasio-Cortez and Mamdani",
    "link": "https://www.nytimes.com/2025/09/22/nyregion/ocasio-cortez-mamdani-new-york-mayor.html",
    "summary": "She was the ‘big sister’ he hoped to impress. He seemed inexperienced to her. Now, they’re the faces of a political movement — and New York is its test case."
  },
  {
    "title": "Europe Talks Big on Gaza but Struggles to Act",
    "link": "https://www.nytimes.com/2025/09/22/world/europe/europe-eu-gaza-israel.html",
    "summary": "Even as criticism of Israel ramps up and a growing number of countries say they’ll recognize a Palestinian state, concrete actions remain limited."
  },
  {
    "title": "For Arab Nations With Ties to Israel, Attacks on Qatar and Gaza City Raise Anxiety",
    "link": "https://www.nytimes.com/2025/09/22/world/middleeast/arab-israel-conflict-regional-palestinians.html",
    "summary": "The Middle Eastern states closest to Israel see the attack on Hamas officials in Qatar and the invasion of Gaza City as warning signs of potential threats to their own security."
  },
  {
    "title": "As U.N. General Assembly Gathers, Here’s What to Expect",
    "link": "https://www.nytimes.com/2025/09/22/world/americas/un-general-assembly-highlights.html",
    "summary": "A look at major figures who will appear during the week and what they might talk about."
  },
  {
    "title": "The Broadway Musical Is in Trouble",
    "link": "https://www.nytimes.com/2025/09/22/theater/broadway-musicals-finances.html",
    "summary": "With the cost of staging song-and-dance spectacles skyrocketing and audiences drawn to older hits, none of the musicals that opened last season have made a profit. Fewer are planned this season."
  },
  {
    "title": "These Patients Got the Cure. Then It Went Away.",
    "link": "https://www.nytimes.com/2025/09/22/health/gene-editing-rare-diseases-fda.html",
    "summary": "Gene therapies for rare diseases are frequently developed then discarded by drug companies because they can’t afford to produce the treatment for more patients."
  },
  {
    "title": "India Reels From Trump’s H-1B Visa Fee",
    "link": "https://www.nytimes.com/2025/09/22/business/trump-h-1b-visa-fee-india.html",
    "summary": "The H-1B visa lured a generation of Indian professionals to take part in the American dream. A $100,000 fee has forced a rethink of the route."
  },
  {
    "title": "When ICE Shows Up at a Factory, What Can a Governor Do?",
    "link": "https://www.nytimes.com/2025/09/22/nyregion/ice-raid-hochul.html",
    "summary": "“I’m used to being able to solve problems,” Gov. Kathy Hochul of New York said as she visited a factory where immigration officials arrested 57 people."
  },
  {
    "title": "Nvidia to Invest $100 Billion in OpenAI",
    "link": "https://www.nytimes.com/2025/09/22/technology/nvidia-openai-100-billion-investment.html",
    "summary": "The chipmaker’s investment in the San Francisco start-up is an indication of the wild financial figures being tossed around in the world of artificial intelligence."
  },
  {
    "title": "U.S. Asks Judge to Break Up Google’s Advertising Technology Monopoly",
    "link": "https://www.nytimes.com/2025/09/22/technology/google-ad-tech-monopoly.html",
    "summary": "The Justice Department argued that the best way to address the company’s unfair advantage was to force it sell off portions of its business."
  },
  {
    "title": "Amazon Faces Trial on F.T.C. Charges Related to Prime Service",
    "link": "https://www.nytimes.com/2025/09/22/technology/amazon-ftc-subscription-practices.html",
    "summary": "A trial in federal court in Seattle will determine if millions of customers signed up for Prime because it’s a great deal, or because they were duped."
  },
  {
    "title": "High-Tech Greenhouse Brings Fresh Produce to Canada’s Arctic",
    "link": "https://www.nytimes.com/2025/09/22/world/canada/gjoa-haven-canada-greenhouse-plants-produce.html",
    "summary": "A high-tech greenhouse brings fresh produce to Gjoa Haven, an Inuit hamlet in Canada’s Arctic whose residents have little experience growing plants."
  },
  {
    "title": "Last Standing Proposal for a Casino in Manhattan Is Voted Down",
    "link": "https://www.nytimes.com/2025/09/22/nyregion/manhattan-casino-proposal-rejected.html",
    "summary": "The defeat of a plan to build a casino just south of the United Nations headquarters leaves five remaining proposals, all outside Manhattan."
  },
  {
    "title": "At a Queens Surf School, Kids’ Confidence Comes in Waves",
    "link": "https://www.nytimes.com/2025/09/22/nyregion/rockaway-black-surfing-kids.html",
    "summary": "Louis Harris’s free surfing school in Queens teaches more than just how to ride the waves."
  },
  {
    "title": "Can Jay Bhattacharya Save Science?",
    "link": "https://www.nytimes.com/2025/09/22/opinion/jay-bhattacharya-nih.html",
    "summary": "Can Jay Bhattacharya save science?"
  },
  {
    "title": "Democrats Are Picking the Wrong Shutdown Fight",
    "link": "https://www.nytimes.com/2025/09/22/opinion/democrats-shutdown-tariffs.html",
    "summary": "Tariffs, not health care, would be a better focal point for the opposition party."
  },
  {
    "title": "How Six World Leaders Are Confronting Climate Change",
    "link": "https://www.nytimes.com/2025/09/22/briefing/climate-change-world-leaders-kirk.html",
    "summary": "The leaders told us how they are facing a warming planet in a world where international collaboration on climate change is fraying."
  },
  {
    "title": "Super Typhoon Ragasa Hits the Philippines, Headed for Hong Kong",
    "link": "https://www.nytimes.com/2025/09/22/world/asia/super-typhoon-ragasa-hong-kong.html",
    "summary": "Thousands were evacuated and hundreds of flights canceled ahead of the major storm."
  },
  {
    "title": "Mamdani Cancels WABC Town Hall to Protest Kimmel Suspension",
    "link": "https://www.nytimes.com/2025/09/22/nyregion/mamdani-cancel-abc-town-hall-kimmel.html",
    "summary": "Zohran Mamdani, the front-runner in the New York City mayor’s race, said the suspension of Jimmy Kimmel’s talk show sent a chilling message about free speech."
  },
  {
    "title": "Louise Vincent, 49, Drug User Who Led Harm Reduction Movement, Dies",
    "link": "https://www.nytimes.com/2025/09/22/health/louise-vincent-dead.html",
    "summary": "She was instrumental in helping promote wider use of needle exchanges, naloxone and tests to assist drug users in identifying dangerous ingredients."
  }
]