[
  {
    "title": "A Timeline of Legal Battles Over Trump’s Use of the Alien Enemies Act",
    "link": "https://www.nytimes.com/article/alien-enemies-act-timeline.html",
    "summary": "Challenges to the administration’s use of the 18th-century wartime law have gone all the way to the Supreme Court. Here’s where they stand."
  },
  {
    "title": "An Intensified Push for the Epstein Files, and Google’s Big Monopoly Ruling",
    "link": "https://www.nytimes.com/2025/09/03/podcasts/the-headlines/epstein-files-google-monopoly-ruling.html",
    "summary": "Plus, a post-mortem on the summer box office."
  },
  {
    "title": "Claudia Sheinbaum Walks a Political Tightrope as Rubio Visits Mexico",
    "link": "https://www.nytimes.com/2025/09/03/world/americas/mexico-rubio-sheinbaum.html",
    "summary": "U.S. pressure to crack down on corrupt politicians has squeezed President Claudia Sheinbaum of Mexico ahead of her meeting with Secretary of State Marco Rubio."
  },
  {
    "title": "Trump Says U.S. Attacked Boat Carrying Venezuelan Gang Members, Killing 11",
    "link": "https://www.nytimes.com/2025/09/02/us/politics/trump-venezuela-boat-drugs-attack.html",
    "summary": "The vessel was transporting illegal narcotics through international waters to the United States, the president said."
  },
  {
    "title": "Xi Parades Firepower to Signal That China Won’t Be Bullied Again",
    "link": "https://www.nytimes.com/2025/09/02/world/asia/xi-putin-kim-parade.html",
    "summary": "The parade, attended by the leaders of Russia and North Korea, had a defiant message. President Trump fired back, accusing Xi Jinping of ignoring America’s role in World War II."
  },
  {
    "title": "Kim Jong-un Brings His Daughter and Potential Heir, Kim Ju-ae, to Beijing",
    "link": "https://www.nytimes.com/2025/09/02/world/asia/kim-jong-un-ju-ae-china.html",
    "summary": "Kim Ju-ae’s presence at a major gathering of world leaders is the latest sign that North Korea’s dictator considers her a successor, analysts said."
  },
  {
    "title": "China’s Military Spectacle",
    "link": "https://www.nytimes.com/2025/09/03/world/asia/china-military-parade.html",
    "summary": "China used a parade of fighter jets, missiles and goose-stepping troops to honor the country’s wartime sacrifice and issue a defiant warning to rivals."
  },
  {
    "title": "Google Must Share Search Data With Rivals, Judge Rules in Antitrust Case",
    "link": "https://www.nytimes.com/2025/09/02/technology/google-search-antitrust-decision.html",
    "summary": "Judge Amit P. Mehta said the company must hand over some of its search data to rivals, but did not force other big changes the U.S. wanted."
  },
  {
    "title": "What Will Happen to Google After the Antitrust Ruling?",
    "link": "https://www.nytimes.com/2025/09/02/technology/google-antitrust-case-ruling.html",
    "summary": "The judge’s decision positions Google to keep its search business running largely without interruption."
  },
  {
    "title": "What the Fixes for Google’s Search Monopoly Mean for You: It’s a ‘Nothingburger’",
    "link": "https://www.nytimes.com/2025/09/02/technology/personaltech/what-the-fixes-for-googles-search-monopoly-mean-for-you-its-a-nothingburger.html",
    "summary": "A federal judge’s remedy stops short of making meaningful changes to how we use our phones, computers and the web."
  },
  {
    "title": "As Zohran Mamdani’s Stature Grows, He Tries to Shed Some Past Stances",
    "link": "https://www.nytimes.com/2025/09/03/nyregion/zohran-mamdani-policy-shifts.html",
    "summary": "Zohran Mamdani, the Democratic nominee for mayor of New York City, once called for defunding the police and decriminalizing prostitution. He says he has changed."
  },
  {
    "title": "The Cloudy Outlook for New York City’s Economy",
    "link": "https://www.nytimes.com/2025/09/03/nyregion/nyc-economy-jobs.html",
    "summary": "Employers are adding far fewer jobs, and even the health care sector could soften. But the city’s economy appears stronger than those on the West Coast."
  },
  {
    "title": "Trump Responds to Rumors About His Health During Oval Office Press Conference",
    "link": "https://www.nytimes.com/2025/09/02/us/politics/trump-health-bruise-conspiracies.html",
    "summary": "In the world of presidential health, distrust and speculation run so rampant that even Mr. Trump’s online assurance that he was fine was immediately explained away as part of a cover-up."
  },
  {
    "title": "House Oversight Panel Releases Some Epstein Files as Pressure Mounts",
    "link": "https://www.nytimes.com/2025/09/02/us/politics/epstein-files-release-house-oversight.html",
    "summary": "The move came as Republican leaders pressed colleagues not to force a vote on disclosing all the material. Most of what was released on Tuesday was not new."
  },
  {
    "title": "Trump to Welcome Poland’s Right-Wing President to White House",
    "link": "https://www.nytimes.com/2025/09/03/us/politics/trump-poland-president-nawrocki-visit.html",
    "summary": "The meeting between President Trump and Poland’s largely ceremonial president, Karol Nawrocki, highlights divisions within the biggest economic and military power on the European Union’s eastern fringe."
  },
  {
    "title": "Years After Japan’s Nuclear Disaster, People With Cancer Seek Answers",
    "link": "https://www.nytimes.com/2025/09/03/world/asia/japan-fukushima-nuclear-cancer.html",
    "summary": "A survey has found hundreds of thyroid tumors, but Japanese officials say they are unrelated to the Fukushima meltdowns. Now they face a lawsuit."
  },
  {
    "title": "Dan Kleban Joins Maine Democratic Primary, Seeking to Unseat Senator Susan Collins",
    "link": "https://www.nytimes.com/2025/09/03/us/politics/democrats-maine-senate-race.html",
    "summary": "Dan Kleban enters a crowded Democratic primary as party leaders wait for Maine’s Democratic governor, Janet Mills, who is “seriously considering” a run for Senate."
  },
  {
    "title": "A Kennedy, a Protégé and a Progressive Star Eye Nadler’s N.Y. House Seat",
    "link": "https://www.nytimes.com/2025/09/02/nyregion/nadler-retire-successor-replace.html",
    "summary": "Representative Jerrold Nadler’s departure is still 16 months away, but Democrats are already testing the waters in what is expected to be a highly contested race."
  },
  {
    "title": "The Endangered Leopard Frog That Lives Next to an NYC Amazon Warehouse",
    "link": "https://www.nytimes.com/2025/09/03/nyregion/frog-atlantic-coast-leopard-endangered.html",
    "summary": "The Atlantic Coast leopard frog, first identified in an industrial section of Staten Island in 2012, is now on the state’s endangered species list. Conservation groups see an opportunity."
  },
  {
    "title": "Can Trump Build or Just Demolish? We’re About to Find Out.",
    "link": "https://www.nytimes.com/2025/09/03/opinion/trump-congress-term-president.html",
    "summary": "What comes next?"
  },
  {
    "title": "How to Rethink A.I.",
    "link": "https://www.nytimes.com/2025/09/03/opinion/ai-gpt5-rethinking.html",
    "summary": "Building bigger A.I. isn’t leading to better A.I."
  },
  {
    "title": "A Protest in China Doubles as Performance Art",
    "link": "https://www.nytimes.com/2025/09/03/briefing/a-protest-in-china-doubles-as-performance-art.html",
    "summary": "We explore an act of defiance in China. But first, a look at President Trump’s health."
  },
  {
    "title": "Far-right Israeli Minister Calls for West Bank Annexation",
    "link": "https://www.nytimes.com/2025/09/03/world/middleeast/israel-west-bank-annexations.html",
    "summary": "Bezalel Smotrich said Israel should take over most of the territory,  partly in response to growing international moves to recognize a Palestinian state."
  },
  {
    "title": "Missouri Legislators To Start Special Session on Redistricting",
    "link": "https://www.nytimes.com/2025/09/03/us/missouri-legislators-redistricting-special-session.html",
    "summary": "The lawmakers, led by a Republican majority, are expected to consider new maps that would help Republicans gain another seat in Congress. They already hold six of the state’s eight congressional seats."
  },
  {
    "title": "Wildfire Destroys Buildings in Gold Rush Town of Chinese Camp",
    "link": "https://www.nytimes.com/2025/09/03/us/wildfire-chinese-camp-california.html",
    "summary": "Fires, likely sparked by lightning strikes that hit California early Tuesday, razed over 9,000 acres in the foothills of the Sierra Nevada Mountains, officials said."
  },
  {
    "title": "Nemat Shafik, Columbia President During Protests, Takes Another Tough Job",
    "link": "https://www.nytimes.com/2025/09/03/world/europe/minouche-shafik-uk-columbia-starmer.html",
    "summary": "Dr. Shafik, who came under fire for her handling of pro-Palestinian campus protests last year, is now the chief economic adviser to Britain’s prime minister."
  }
]