[
  {
    "title": "Maduro Says He Is a Prisoner of War, Not a Defendant. The Words Matter.",
    "link": "https://www.nytimes.com/2026/01/05/world/americas/maduro-court-appearance-pow.html",
    "summary": "His simple statement in federal court was aimed directly at contradictions in the Trump administration’s actions in the Caribbean."
  },
  {
    "title": "Trump Officials Brief Top Lawmakers on Maduro Raid",
    "link": "https://www.nytimes.com/2026/01/05/us/politics/congress-venezuela-maduro.html",
    "summary": "The briefing for congressional leaders and the top members of the intelligence, defense and foreign policy panels came two days after the military operation."
  },
  {
    "title": "RFK Jr. Scales Back the Number of Vaccines Recommended for Children",
    "link": "https://www.nytimes.com/2026/01/05/health/children-vaccines-cdc-kennedy.html",
    "summary": "Federal health officials now recommend that children be routinely inoculated against 11 diseases, not 17, citing standards in other wealthy nations."
  },
  {
    "title": "What to Know About the New Childhood Vaccine Schedule",
    "link": "https://www.nytimes.com/2026/01/05/well/childhood-vaccine-schedule-cdc-changes.html",
    "summary": "The U.S. federal government slashed the number of diseases that all children are advised to be vaccinated against to 11 from 17."
  },
  {
    "title": "Appeals Court Upholds Prohibition on Trump’s Medical Research Cuts",
    "link": "https://www.nytimes.com/2026/01/05/us/politics/trump-nih-grant-cuts-court.html",
    "summary": "The ruling on Monday upheld a lower court’s judgment in April that the Trump administration could not drastically slash funding from the National Institutes of Health."
  },
  {
    "title": "For Many Jan. 6 Rioters, a Pardon From Trump Wasn’t Enough",
    "link": "https://www.nytimes.com/2026/01/05/us/politics/trump-jan-6-pardons-rioters.html",
    "summary": "Some pardoned rioters have been rearrested. Others returned to poverty and mental health challenges. And many became consumed by resentment and demands for payback."
  },
  {
    "title": "Hegseth Starts Proceedings Against Sen. Mark Kelly Over His Remarks",
    "link": "https://www.nytimes.com/2026/01/05/us/politics/hegseth-mark-kelly.html",
    "summary": "Defense Secretary Pete Hegseth blasted the senator for “seditious” remarks. Mr. Kelly said he had done nothing wrong and cited similar comments by Mr. Hegseth."
  },
  {
    "title": "Corporation for Public Broadcasting Votes to Shut Down",
    "link": "https://www.nytimes.com/2026/01/05/business/media/corporation-for-public-broadcasting.html",
    "summary": "Executives debated whether to allow the corporation to lie dormant after federal funding ended last year, but decided against it."
  },
  {
    "title": "White House to Present Updated Plans for Trump’s Ballroom",
    "link": "https://www.nytimes.com/2026/01/05/us/politics/white-house-updated-plans-ballroom.html",
    "summary": "After pressure from preservationists, the administration is expected to present the plans to a planning commission and make them public for the first time."
  },
  {
    "title": "Man in Custody After JD Vance’s Ohio Home Is Vandalized",
    "link": "https://www.nytimes.com/2026/01/05/us/jd-vance-home-damage-cincinnati-arrest.html",
    "summary": "Authorities arrested a man early Monday and later charged him. The vice president and his family were away from the personal residence in Cincinnati at the time, officials said."
  },
  {
    "title": "Minnesota Gov. Tim Walz Abandons Re-election Bid, and Amy Klobuchar May Run Instead",
    "link": "https://www.nytimes.com/2026/01/05/us/walz-governor-fraud-klobuchar.html",
    "summary": "Mr. Walz said a growing scandal over fraud in social services programs led him to abandon his run for a third term as governor of Minnesota."
  },
  {
    "title": "Republican Lawmakers Like MTG Have Criticized Trump as They Depart Congress",
    "link": "https://www.nytimes.com/article/trump-republican-critics-lawmakers-exit.html",
    "summary": "It turns out that few things liberate Republicans to speak their minds about President Trump like the fact that they are departing Congress."
  },
  {
    "title": "Six Big Political Questions for 2026",
    "link": "https://www.nytimes.com/2026/01/05/us/politics/trump-democrats-gop-midterms-venezuela-economy.html",
    "summary": "A wildly important midterm year is off to a chaotic start, with a raid in Venezuela, an uneasy economy and more. Here’s what we’re curious about."
  },
  {
    "title": "Lia Smith Hoped to Start Fresh At Middlebury. In Trump’s America, It Seemed Impossible.",
    "link": "https://www.nytimes.com/2026/01/05/us/middlebury-college-trans-student-suicide.html",
    "summary": "Lia Smith was a senior at Middlebury College, a transgender woman and, for a time, an athlete on the school’s diving team. But she struggled to feel accepted, and in October, she took her own life."
  },
  {
    "title": "Israel’s Stinging Retort to Mamdani Was Meant as Retaliation in Kind",
    "link": "https://www.nytimes.com/2026/01/05/world/middleeast/israel-mamdani-antisemitism.html",
    "summary": "After Mayor Zohran Mamdani of New York scrapped two executive orders on antisemitism and boycotts, the Israeli Foreign Ministry issued an aggressive response to what it saw as an aggressive act."
  },
  {
    "title": "Zohran Mamdani Targets Junk Fees and Hidden Charges in Executive Orders",
    "link": "https://www.nytimes.com/2026/01/05/nyregion/mamdani-affordability-consumer-protections.html",
    "summary": "Trying to protect consumers by going after deceptive business practices has been an early focus of the new mayor’s administration."
  },
  {
    "title": "Nvidia Details New A.I. Chips and Autonomous Car Project With Mercedes",
    "link": "https://www.nytimes.com/2026/01/05/technology/nvidia-chips-mercedes.html",
    "summary": "At the CES conference, Jensen Huang, the company’s chief executive, said the more efficient and powerful chip would begin shipping later this year."
  },
  {
    "title": "Waymo Has Come for the Kids in Los Angeles",
    "link": "https://www.nytimes.com/2026/01/05/us/waymo-kids-los-angeles.html",
    "summary": "Because families have complicated schedules."
  },
  {
    "title": "Dance Moves From the Street, City Edition",
    "link": "https://www.nytimes.com/2026/01/05/arts/dance/dance-moves-from-the-street-city-edition.html",
    "summary": "Dancers from Detroit, Chicago and Philadelphia demonstrate the fundamentals of their styles, revealing deep historical roots."
  },
  {
    "title": "Trump Is Unleashing Forces Beyond His Control",
    "link": "https://www.nytimes.com/2026/01/05/opinion/trump-venezuela-maduro-clausewitz-aquinas.html",
    "summary": "The high cost of forgetting what world war is really like."
  },
  {
    "title": "Don’t Call It Regime Change. This Is Something Else Entirely.",
    "link": "https://www.nytimes.com/2026/01/05/opinion/trump-venezuela-regime-change.html",
    "summary": "To understand what’s unfolding in Venezuela, you have to look to the mob, not traditional foreign policy doctrines."
  },
  {
    "title": "Maduro Pleads Not Guilty",
    "link": "https://www.nytimes.com/2026/01/05/briefing/maduro-pleads-not-guilty.html",
    "summary": "Also, health officials scaled back the number of vaccines recommended for children. Here’s the latest at the end of Monday."
  },
  {
    "title": "Hilton ‘Maliciously Canceled’ Immigration Agents’ Reservations, DHS Says",
    "link": "https://www.nytimes.com/2026/01/05/travel/hilton-hotel-reservations-minneapolis-minnesota-immigration.html",
    "summary": "As the U.S. ramps up deportation efforts in Minnesota, the Department of Homeland Security claimed on social media that a Hampton Inn had canceled agents’ bookings."
  },
  {
    "title": "David R. Young, 89, Is Dead; Nixon Aide Steered the Watergate ‘Plumbers’",
    "link": "https://www.nytimes.com/2026/01/05/us/david-r-young-dead.html",
    "summary": "He took part in White House machinations to stop damning leaks of classified information and directed the break-in at the Democrats’ headquarters that undid a presidency."
  },
  {
    "title": "Eva Schloss, Anne Frank’s Stepsister and Holocaust Survivor, Dies at 96",
    "link": "https://www.nytimes.com/2026/01/05/world/europe/eva-schloss-dead.html",
    "summary": "Freed from Auschwitz, she was silent about her ordeal for four decades. Then she decided to dedicate her life to educating people about the dangers of prejudice."
  },
  {
    "title": "Mamdani and Hochul Celebrate Congestion Pricing a Year After Contentious Debut",
    "link": "https://www.nytimes.com/2026/01/05/nyregion/nyc-congestion-pricing-anniversary-mamdani-hochul.html",
    "summary": "The tolling program, which charges motorists to enter Manhattan’s busiest streets, had a largely successful first year after a delayed start."
  }
]