[
  {
    "title": "The Status of the 20-Point Peace Plan for Ukraine",
    "link": "https://www.nytimes.com/2025/12/24/world/europe/what-is-in-the-20-point-ukraine-peace-plan.html",
    "summary": "The blueprint covers a broad range of issues, including territory, security guarantees and postwar reconstruction. But Russia has indicated little willingness to end the war."
  },
  {
    "title": "Zero Hour for the Middle East",
    "link": "https://www.nytimes.com/2025/12/28/world/middleeast/future-of-mideast.html",
    "summary": "After more than a decade of wars, from Syria to Gaza, the Middle East is exhausted by conflict. Is it ready to find another way?"
  },
  {
    "title": "Syrian Protests Over Lack of Security Leave 2 Dead",
    "link": "https://www.nytimes.com/2025/12/28/world/middleeast/syria-protests-alawite-two-killed.html",
    "summary": "Days after a bombing at a mosque in a predominantly Alawite area, members of the religious minority in Syria demonstrated for better protections."
  },
  {
    "title": "What America Might Look Like With Zero Immigration",
    "link": "https://www.nytimes.com/2025/12/28/business/us-immigration-trump-1920s.html",
    "summary": "The Trump administration’s efforts to reduce the foreign-born population are being felt in hospitals and soccer leagues and on Main Streets across the country, with hints of what’s to come."
  },
  {
    "title": "From A.I. to Chips, Big Tech Is Getting What It Wants From Trump",
    "link": "https://www.nytimes.com/2025/12/28/technology/tech-trump.html",
    "summary": "The president has backed policies that allow the industry to grow unfettered. The mutually beneficial alliance is causing concern among some conservatives."
  },
  {
    "title": "What to Know About Colombia’s Role in the Global Drug Trade Amid Trump’s Feud With Petro",
    "link": "https://www.nytimes.com/2025/12/28/world/americas/colombia-drug-trade-trump-petro.html",
    "summary": "President Gustavo Petro is locked in a war of words with President Trump over Colombia’s major role in the global drug trade. The issue is complicated."
  },
  {
    "title": "Brigitte Bardot, French Movie Icon Who Renounced Stardom, Dies at 91",
    "link": "https://www.nytimes.com/2025/12/28/movies/brigitte-bardot-dead.html",
    "summary": "“And God Created Woman” made her a world-famous sex symbol in the 1950s. She later gave up acting to devote her life to animal welfare."
  },
  {
    "title": "Brigitte Bardot: A Life in Pictures",
    "link": "https://www.nytimes.com/2025/12/28/movies/brigitte-bardot-photos.html",
    "summary": "The movies made the French actress a star, but photography sealed her stardom."
  },
  {
    "title": "From Sex Appeal to the Far Right, Brigitte Bardot Symbolized a Changing France",
    "link": "https://www.nytimes.com/2025/12/28/arts/brigitte-bardot-movies-songs-animal-rights.html",
    "summary": "In the decades after becoming a megastar, the French actress became as known for her politics as she once had been for her acting career."
  },
  {
    "title": "Five Brigitte Bardot Movies to Stream",
    "link": "https://www.nytimes.com/2025/12/28/movies/brigitte-bardot-movies-to-stream.html",
    "summary": "The actress, who died at 91, had what can’t be taught: charisma and attitude onscreen. Here are some highlights."
  },
  {
    "title": "The Double Life of Thomas Goldstein, a Supreme Court Lawyer",
    "link": "https://www.nytimes.com/2025/12/28/magazine/thomas-goldstein-supreme-court-gambling.html",
    "summary": "Thomas Goldstein was a superstar in the legal world. He was also a secret high-stakes gambler, whose wild 10-year run may now land him in prison."
  },
  {
    "title": "New College of Florida Was Progressive. Then Gov. DeSantis Overhauled It.",
    "link": "https://www.nytimes.com/2025/12/28/us/new-college-ron-desantis-florida-conservative.html",
    "summary": "At the state school, gender studies is out. ‘The Odyssey’ is required reading. A Charlie Kirk statue is coming. Has one ideological bubble replaced another?"
  },
  {
    "title": "How Cameroon Fought to Save Its Malaria Program After the U.S. Cut Critical Funding",
    "link": "https://www.nytimes.com/2025/12/28/health/malaria-cameroon-usaid-pmi.html",
    "summary": "When the Trump administration slashed foreign aid, it gutted a program that had reduced malaria deaths world wide. In northern Cameroon, health workers tried to protect children in one last rainy season."
  },
  {
    "title": "Twins’ Peaks: The Gilbertson Brothers Want to Rewrite Your Country’s Map",
    "link": "https://www.nytimes.com/2025/12/28/science/eric-matthew-gilbertson-mountains.html",
    "summary": "Two brothers, both mechanical engineers, are climbing many of the world’s tall peaks to prove they have been measured incorrectly."
  },
  {
    "title": "The Lure of a Rising Asian Metropolis? No Traffic.",
    "link": "https://www.nytimes.com/2025/12/28/world/asia/indonesia-nusantara-future-capital.html",
    "summary": "Indonesia is building a new, green city in the jungle. Its future is far from certain, but new residents like living there."
  },
  {
    "title": "How a Left-Right Social Media Tiff Pushed Texas to Fund Parks",
    "link": "https://www.nytimes.com/2025/12/28/us/politics/state-parks-texas.html",
    "summary": "An unusual partnership between an environmentalist and a Republican megadonor began with a fight on Twitter. It ended up in the creation of a $1 billion state fund to expand Texas park land."
  },
  {
    "title": "Opinionated Lists for an Overwhelming Year",
    "link": "https://www.nytimes.com/2025/12/27/opinion/the-year-in-lists.html",
    "summary": "As the year drew to a close, we reached out to Opinion columnists and contributors for personal lists."
  },
  {
    "title": "A Book Is Never Finished With Us",
    "link": "https://www.nytimes.com/2025/12/28/opinion/favorite-books-cleaning-out.html",
    "summary": "Consider that every book you have is a story of who you are."
  },
  {
    "title": "Don Bryant, 83, Dies; Co-Wrote ‘I Can’t Stand the Rain’ for His Wife",
    "link": "https://www.nytimes.com/2025/12/28/obituaries/don-bryant-dead.html",
    "summary": "He and Ann Peebles made up one of Southern soul’s most accomplished partnerships. He finally broke through as a solo act at 75."
  },
  {
    "title": "Pilot Is Dead After Helicopters Crash in New Jersey",
    "link": "https://www.nytimes.com/2025/12/28/nyregion/helicopters-crash-new-jersey.html",
    "summary": "Another pilot was in critical condition, according to the fire chief in Hammonton, N.J., where the crash took place."
  },
  {
    "title": "Winter Storm Batters Minnesota, Bringing ‘Potentially Life-Threatening Travel Conditions’",
    "link": "https://www.nytimes.com/2025/12/28/us/minnesota-winter-storm.html",
    "summary": "In Minnesota, forecasters warned of “potentially life-threatening travel conditions” as whiteout conditions reduced visibility. Heavy snow was expected over the Upper Midwest and Great Lakes."
  },
  {
    "title": "Man Charged in Fatal Shooting During Backyard Target Practice",
    "link": "https://www.nytimes.com/2025/12/28/us/oklahoma-shooting-neighbor-christmas.html",
    "summary": "The Oklahoma man had bought himself a Glock .45 handgun for Christmas and was shooting at an energy drink can when a woman nearby was fatally struck, officials said."
  }
]