[
  {
    "title": "Trump Halts Five Wind Farms Off the East Coast",
    "link": "https://www.nytimes.com/2025/12/22/climate/trump-offshore-wind-farms.html",
    "summary": "The Interior Department said the projects posed national security risks, without providing details. The decision imperils billions of dollars of investments."
  },
  {
    "title": "How Trump’s First Year Reshaped U.S. Energy and Climate Policy",
    "link": "https://www.nytimes.com/2025/12/22/climate/how-trumps-first-year-reshaped-us-energy-and-climate-policy.html",
    "summary": "The sweeping changes have affected everything from coal plant retirements to international diplomacy over shipping emissions."
  },
  {
    "title": "The Economy Survived 2025, But Many Americans Are Reeling",
    "link": "https://www.nytimes.com/2025/12/22/business/economy-unemployment-wages-affordability.html",
    "summary": "A feared recession didn’t materialize, but unemployment rose, wage growth slowed and affordability challenges are mounting."
  },
  {
    "title": "Jim Beam Halts Production at Flagship Distillery as Whiskey and Bourbon Markets Struggle",
    "link": "https://www.nytimes.com/2025/12/22/dining/jim-beam-production-pause-whiskey-bourbon.html",
    "summary": "The bourbon giant is closing its flagship distilling operation for all of 2026."
  },
  {
    "title": "What We Know About U.S. Interceptions of Oil Tankers in Venezuela",
    "link": "https://www.nytimes.com/2025/12/22/us/politics/trump-oil-tankers-venezuela.html",
    "summary": "A Venezuela-bound vessel fled after rebuffing an attempt by the Coast Guard to seize it, the latest twist in the escalating U.S. pressure campaign against the Maduro government."
  },
  {
    "title": "Larry Ellison Personally Guarantees Paramount Bid for Warner Bros.",
    "link": "https://www.nytimes.com/2025/12/22/business/larry-ellison-paramount-warner-brothers-bid.html",
    "summary": "Mr. Ellison’s personal guarantee is meant to address concerns that the Warner Bros. Discovery’s board had expressed about Paramount’s original offer."
  },
  {
    "title": "’60 Minutes’ Pulls Segment on Venezuelans Deported by Trump Administration, Drawing Criticism",
    "link": "https://www.nytimes.com/2025/12/21/business/60-minutes-trump-bari-weiss.html",
    "summary": "Sharyn Alfonsi, a “60 Minutes” correspondent, criticized the network’s decision to remove her reporting from Sunday’s edition of the show."
  },
  {
    "title": "What to Know on the Initial Release of Materials From the Epstein Files",
    "link": "https://www.nytimes.com/2025/12/19/us/politics/epstein-files-takeaways.html",
    "summary": "The Justice Department came under scrutiny for its handling of the documents and deletions online of some material. It said it would not remove mentions of Donald Trump from the files as they are released."
  },
  {
    "title": "Artists We Lost in 2025, in Their Words",
    "link": "https://www.nytimes.com/2025/12/22/arts/artists-who-died-in-2025.html",
    "summary": "Robert Redford, Roberta Flack, Diane Keaton and Brian Wilson are among the cultural luminaries who died this year."
  },
  {
    "title": "She Fell in Love With ChatGPT. Then She Ghosted It.",
    "link": "https://www.nytimes.com/2025/12/22/technology/ai-boyfriend-chatgpt.html",
    "summary": "The 29-year-old woman who created the “MyBoyfriendIsAI” community on Reddit isn’t dating (or sexting) her A.I. boyfriend anymore. She found something more fulfilling."
  },
  {
    "title": "She Is in Love With ChatGPT",
    "link": "https://www.nytimes.com/2025/01/15/technology/ai-chatgpt-boyfriend-companion.html",
    "summary": "A 28-year-old woman with a busy social life spends hours on end talking to her A.I. boyfriend for advice and consolation. And yes, they do have sex."
  },
  {
    "title": "A Conspicuous Gap May Undermine Trump’s Birthright Citizenship Plan",
    "link": "https://www.nytimes.com/2025/12/22/us/politics/trump-birthright-citizenship-congress.html",
    "summary": "A historical review shows lawmakers without certain familial records went unchallenged as citizens when the 14th Amendment was adopted. The finding appeared to undercut the president’s claims on birthright citizenship."
  },
  {
    "title": "In Congress and at Home, Omar Faces Trump’s Anti-Somali Attacks",
    "link": "https://www.nytimes.com/2025/12/22/us/politics/ilhan-omar-trump-attacks.html",
    "summary": "Representative Ilhan Omar, Democrat of Minnesota, has long been a target of racist insults by the president. Now her whole community faces an immigration crackdown."
  },
  {
    "title": "How U.S. Defense Industry Dodged a Rare-Earth Shortage After China’s Curbs",
    "link": "https://www.nytimes.com/2025/12/22/business/defense-industry-rare-earth-restrictions-china.html",
    "summary": "America’s ability to make precision-guided missiles was threatened during Trump’s tariff war. But experienced players have rescued the supply chain, for now."
  },
  {
    "title": "China Vanke Gets Temporary Lifeline to Prevent Debt Default",
    "link": "https://www.nytimes.com/2025/12/22/business/china-vanke-real-estate-default.html",
    "summary": "Bondholders for one of China’s biggest real estate developers extended a grace period to negotiate a delayed repayment of a $285 million bond."
  },
  {
    "title": "Goodbye (and Good Riddance?) to the MetroCard",
    "link": "https://www.nytimes.com/2025/12/22/nyregion/new-york-city-metrocard-end.html",
    "summary": "Thirty years ago, the newfangled method of paying for New York City’s buses and subways seemed like cutting-edge technology. Now, its days are numbered."
  },
  {
    "title": "What to Know About OMNY, MetroCard’s Tap-and-Go Successor",
    "link": "https://www.nytimes.com/2025/12/22/nyregion/omny-nyc-subway.html",
    "summary": "With the MetroCard retiring at the end of 2025, the OMNY system will become the only way to pay for most transit riders."
  },
  {
    "title": "Russian General Is Killed in Car Bombing in Moscow",
    "link": "https://www.nytimes.com/2025/12/22/world/europe/russia-moscow-general-killed.html",
    "summary": "The attack appeared to be the latest targeted assassination of a senior military official inside Russia’s borders."
  },
  {
    "title": "Christmas Is Back in Bethlehem, but Peace and Joy Have Yet to Arrive",
    "link": "https://www.nytimes.com/2025/12/22/world/middleeast/christmas-in-bethlehem-west-bank.html",
    "summary": "Palestinian Christians are reviving their seasonal public celebrations, hoping to bring light and holiday spirit at the end of a gloomy year in the West Bank."
  },
  {
    "title": "Christmas Trappings: New England Swoons Over Lobster Pot Trees",
    "link": "https://www.nytimes.com/2025/12/22/travel/lobster-trap-christmas-trees.html",
    "summary": "The trees have become a sought-after backdrop for social media posts, holiday cards and even marriage proposals."
  },
  {
    "title": "What Happened When I Asked ChatGPT to Solve an 800-Year-Old Italian Mystery",
    "link": "https://www.nytimes.com/2025/12/22/opinion/ai-florence-baptistery.html",
    "summary": "For centuries, nobody has known who built the Florence Baptistery. Could A.I. crack the mystery?"
  },
  {
    "title": "Washington State Faces Climate Change Reality After Storms",
    "link": "https://www.nytimes.com/2025/12/22/us/politics/pacific-northwest-floods.html",
    "summary": "Two weeks of “atmospheric river” deluges took a toll on business in Leavenworth, Wash., and beyond, reminding the region that a warming planet has brought new uncertainty."
  },
  {
    "title": "U.S. Housing Discrimination Complaints Rise as Support Network Thins",
    "link": "https://www.nytimes.com/2025/12/22/realestate/housing-discrimination-report-us-hud-cuts.html",
    "summary": "Accusations are up nearly 20 percent since 2014, according to a nonprofit, which warns that “the infrastructure for enforcing our nation’s fair housing laws is being dismantled.”"
  },
  {
    "title": "Betty Reid Soskin, Nation’s Oldest Park Ranger, Dies at 104",
    "link": "https://www.nytimes.com/2025/12/21/us/betty-reid-soskin-dead.html",
    "summary": "She began working as a park ranger at age 85, educating visitors about the women and people of color who served on the home front in World War II, herself among them."
  },
  {
    "title": "People Who Achieve the Most Later in Life Typically Start Off Dabbling in Disciplines, Study Shows",
    "link": "https://www.nytimes.com/2025/12/19/well/high-performers-multiple-disciplines-early-study.html",
    "summary": "A new study suggests that the people who reach the pinnacle of their fields typically dabbled in multiple disciplines when they were young."
  }
]