[
  {
    "title": "How Trump Deflected MAGA’s Wrath Over Epstein, at Least for Now",
    "link": "https://www.nytimes.com/2025/07/21/us/politics/trump-epstein-maga-base.html",
    "summary": "By tapping into other grievances, President Trump managed to turn one of the most fractious moments for his base into a unifying one."
  },
  {
    "title": "An Accuser’s Story Suggests How Trump Might Appear in the Epstein Files",
    "link": "https://www.nytimes.com/2025/07/20/us/politics/epstein-employee-trump-investigation.html",
    "summary": "A former Jeffrey Epstein employee said that she told the F.B.I. in 1996 and 2006 about what she considered a troubling encounter with Donald J. Trump."
  },
  {
    "title": "Republicans and Democrats Call for More Information on Epstein Case",
    "link": "https://www.nytimes.com/2025/07/20/us/politics/trump-epstein-files.html",
    "summary": "Members of Congress from both parties said they wanted to see more files released, while President Trump has encouraged his base to move on."
  },
  {
    "title": "Harvard’s Face-Off With the White House, and a Disturbing Pattern in Organ Donations",
    "link": "https://www.nytimes.com/2025/07/21/podcasts/the-headlines/harvard-white-house-organ-donations.html",
    "summary": "Plus, pop music and sign language."
  },
  {
    "title": "2 Deadly Shootings in 2 Days Highlight Dangers of Aid Distribution in Gaza",
    "link": "https://www.nytimes.com/2025/07/21/world/middleeast/shootings-aid-gaza-analysis.html",
    "summary": "On Saturday, Israeli soldiers shot Palestinians near an Israel-backed food site. On Sunday, they fired at people gathering near a U.N. convoy. Both incidents were symptoms of broader problems."
  },
  {
    "title": "Israel Refuses to Renew Visa of Top UN Humanitarian Official for Gaza",
    "link": "https://www.nytimes.com/2025/07/21/world/middleeast/israel-visa-un-gaza.html",
    "summary": "The head of the agency that helps oversee aid deliveries to the territory had previously criticized the impact of Israeli military attacks on civilians."
  },
  {
    "title": "Trump Administration and Harvard Face Crucial Court Test",
    "link": "https://www.nytimes.com/2025/07/21/us/trump-administration-harvard-hearing.html",
    "summary": "A hearing in Boston on Monday is expected to shape the future of negotiations between the White House and the nation’s oldest university."
  },
  {
    "title": "Disabled Americans Fear What Medicaid Cuts Could Do to Them",
    "link": "https://www.nytimes.com/2025/07/21/well/medicaid-bill-disabled-americans.html",
    "summary": "The White House says roughly $1 trillion in Medicaid cuts won’t limit home- and community-based care. Health care experts disagree."
  },
  {
    "title": "An Attack on the Medical Establishment Buried in an 1,800-Page Regulation",
    "link": "https://www.nytimes.com/2025/07/21/upshot/primary-care-doctors-salaries.html",
    "summary": "If approved, a new rule could end the entrenched pay advantages for specialists like surgeons over other doctors."
  },
  {
    "title": "Trump Urges Washington and Cleveland Sports Teams to Revert to Former Names",
    "link": "https://www.nytimes.com/2025/07/20/us/politics/trump-urges-washington-and-cleveland-sports-teams-to-revert-to-native-american-names.html",
    "summary": "The president threatened to block a deal for the Washington Commanders’ new stadium if the team did not bow to his demand."
  },
  {
    "title": "How Trump’s Tariffs and Foreign Policies Have Bolstered Support for the E.U.",
    "link": "https://www.nytimes.com/2025/07/21/world/europe/trump-europe-unity-eu-tariffs.html",
    "summary": "The European Union has its problems, but the bloc is gaining public trust and making new friends. President Trump’s attacks are one reason why."
  },
  {
    "title": "China’s Hardball Tactics Set Tone for Difficult Summit with Europe",
    "link": "https://www.nytimes.com/2025/07/21/world/asia/china-europe-trade-war.html",
    "summary": "Beijing is betting that economic pressure and diplomatic defiance will force concessions, but its stance could put more strain on its ties with Europe at a crucial time."
  },
  {
    "title": "Iran to Hold Nuclear Talks With European Governments",
    "link": "https://www.nytimes.com/2025/07/21/world/middleeast/iran-nuclear-talks-europe.html",
    "summary": "Iranian representatives will meet with negotiators from Britain, France and Germany on Friday, days after they threatened to restore sanctions."
  },
  {
    "title": "Ukraine Ups Its Arms Production, Asking Allies to Pay for It",
    "link": "https://www.nytimes.com/2025/07/21/world/europe/ukraine-weapons-industry.html",
    "summary": "There is a growing drive to make the country more self-reliant in weapons manufacturing as it faces Russia’s superior firepower. That requires a lot of money from Western backers."
  },
  {
    "title": "Russia Strikes Ukraine With Missiles and Drones",
    "link": "https://www.nytimes.com/2025/07/21/world/europe/russia-ukraine-missile-drone-strikes.html",
    "summary": "The strikes appear to have been the most intense since President Trump announced a new plan last week to send weapons to Ukraine."
  },
  {
    "title": "Italy Cancels Valery Gergiev’s Festival Appearance",
    "link": "https://www.nytimes.com/2025/07/21/arts/music/valery-gergiev-concert-canceled.html",
    "summary": "Some lawmakers in Italy had argued that Valery Gergiev’s planned appearance sent the wrong message as Europe strives to remain united in its support for Ukraine."
  },
  {
    "title": "Bangladesh Military Plane Crashes Into School, Killing at Least 19",
    "link": "https://www.nytimes.com/2025/07/21/world/asia/bangladesh-military-plane-crash.html",
    "summary": "Dozens were injured after the aircraft crashed in Dhaka, Bangladesh’s capital, according to national fire officials."
  },
  {
    "title": "How Did the Number of Missing After Texas Floods Drop So Drastically?",
    "link": "https://www.nytimes.com/2025/07/20/us/texas-floods-missing.html",
    "summary": "Last week, officials said 97 people were missing in Kerr County. Now, it’s down to three. The drop is substantial, but such wild fluctuations can happen after disasters."
  },
  {
    "title": "Chinese Officials Helped Cover Up Lead Poisoning of Children, Report Says",
    "link": "https://www.nytimes.com/2025/07/21/world/asia/china-lead-poisoning-scandal.html",
    "summary": "Health officials tampered with blood tests of some of the more than 200 children who were sickened by food tainted with lead, an investigation found."
  },
  {
    "title": "Dolly Parton Musical’s Nashville Debut Draws Flocks of Fans",
    "link": "https://www.nytimes.com/2025/07/20/theater/dolly-parton-musical-nashville.html",
    "summary": "Parton’s life and career have always been rooted in Tennessee. For her fans, it was only fitting to see the debut of her biographical musical here, too."
  },
  {
    "title": "Opinion: The Path to Peace in the Middle East (and a Nobel Prize for Trump)",
    "link": "https://www.nytimes.com/2025/07/21/opinion/iran-israel-trump-peace.html",
    "summary": "A possible path to peace in the Middle East."
  },
  {
    "title": "Ben Bernanke and Janet Yellen: The Fed Must Be Independent",
    "link": "https://www.nytimes.com/2025/07/21/opinion/federal-reserve-independence-trump.html",
    "summary": "Political pressure interferes with a mandate to work for stable prices and maximum employment."
  },
  {
    "title": "A.I. vs. A.I.",
    "link": "https://www.nytimes.com/2025/07/21/briefing/ai-vs-ai.html",
    "summary": "We examine how the technology is being used against itself."
  },
  {
    "title": "Alaska Airlines Resumes Operations After IT Outage",
    "link": "https://www.nytimes.com/2025/07/20/business/alaska-airlines-grounds-plane-fleet.html",
    "summary": "Alaska Airlines said it had ended the ground stop, which lasted about three hours and resulted from a software outage. “Residual impacts” to its operations were likely, it said."
  },
  {
    "title": "Obesity Prediction Could Be Guided by Genetic Risk Scores",
    "link": "https://www.nytimes.com/2025/07/21/health/obesity-genetic-risk-score.html",
    "summary": "Researchers hope that a better understanding of which genes contribute to excess weight could help with prevention starting in childhood."
  },
  {
    "title": "Venezuela Targets Economists as Inflation Surges Under Trump’s Sanctions",
    "link": "https://www.nytimes.com/2025/07/21/world/americas/venezuela-economists-inflation-maduro-trump.html",
    "summary": "As inflation surges under President Trump’s renewed sanctions, Venezuelan authorities are trying to keep a lid on the country’s worsening financial situation."
  },
  {
    "title": "Kenneth Colley, 87, ‘Star Wars’ Actor With a Commanding Presence, Dies",
    "link": "https://www.nytimes.com/2025/07/20/movies/kenneth-colley-dead.html",
    "summary": "A fixture onscreen and onstage, he became a fan favorite as Darth Vader’s ally, Admiral Piett, in “The Empire Strikes Back” and “Return of the Jedi.”"
  }
]