[
  {
    "title": "Trump, Long Erratic on the World Stage, Reaches a New Level",
    "link": "https://www.nytimes.com/2025/10/26/us/politics/trump-erratic-foreign-policy.html",
    "summary": "Whether because of his increasingly mercurial approach or despite it, President Trump has won some foreign policy victories in his second term. The question now is whether he can build on his record."
  },
  {
    "title": "Japan Deals With the Price of Playing to Trump: $550 Billion",
    "link": "https://www.nytimes.com/2025/10/26/business/japan-investment-trump-tariffs.html",
    "summary": "A new prime minister must decide whether to maintain the previous administration’s deferential negotiating strategy that secured a contentious trade deal."
  },
  {
    "title": "Chinese and U.S. Officials Reach Framework of a Trade Deal",
    "link": "https://www.nytimes.com/2025/10/26/business/china-us-trade.html",
    "summary": "Negotiators announced on Sunday they had preliminarily agreed on several issues ahead of an expected meeting between President Trump and Xi Jinping this week."
  },
  {
    "title": "How Canada Is Dealing With Its Latest Tussle With President Trump",
    "link": "https://www.nytimes.com/2025/10/26/us/politics/canada-tariffs-trump-carney.html",
    "summary": "Prime Minister Mark Carney is focusing on what the country can control, including looking for economic partnerships abroad, especially in Asia."
  },
  {
    "title": "‘No Idea How Long People Can Hold Out’: Federal Workers Feel Brunt of Shutdown",
    "link": "https://www.nytimes.com/2025/10/26/us/politics/federal-workers-shutdown-pay.html",
    "summary": "As more than one million government employees go without pay, many are turning to side jobs and food banks to make ends meet."
  },
  {
    "title": "Food Banks in U.S. Brace for Surging Demand as SNAP Aid Cutoff Looms",
    "link": "https://www.nytimes.com/2025/10/26/us/food-banks-snap-shutdown-hunger-trump.html",
    "summary": "Growing need and decreased resources are squeezing the charitable food system beyond its capacity, leaders say."
  },
  {
    "title": "Newsom Says He Will Consider a 2028 Presidential Run After the Midterms",
    "link": "https://www.nytimes.com/2025/10/26/us/politics/gavin-newsom-2028-race.html",
    "summary": "The California governor acknowledged in an interview Sunday on CBS that he would give the question serious thought after the 2026 elections."
  },
  {
    "title": "U.S. Assessment of Israeli Shooting of Journalist Divided American Officials",
    "link": "https://www.nytimes.com/2025/10/27/world/middleeast/shooting-palestinian-american-journalist.html",
    "summary": "A U.S. colonel has gone public with his concern that official findings about the 2022 killing of a Palestinian American reporter were soft-pedaled to appease Israel."
  },
  {
    "title": "Caribbean Braces for Hurricane Melissa",
    "link": "https://www.nytimes.com/2025/10/26/world/americas/hurricane-melissa-caribbean-rain-flood.html",
    "summary": "A fast-developing storm was expected to bring “unprecedented” amounts of rain to several countries, meteorologists said."
  },
  {
    "title": "How Hurricane Melissa Rapidly Intensified",
    "link": "https://www.nytimes.com/2025/10/26/weather/hurricane-melissa-rapid-intensification-jamaica.html",
    "summary": "Melissa grew from a tropical storm to a Category 4 hurricane in a matter of hours."
  },
  {
    "title": "Philip Pullman Brings Lyra’s Story to a Close in ‘The Rose Field’",
    "link": "https://www.nytimes.com/2025/10/26/books/review/philip-pullman-the-rose-field.html",
    "summary": "At 79, he is wrapping up the fantastical saga set in motion with “His Dark Materials,” while still loath to discuss how his work comments on current events."
  },
  {
    "title": "Javier Milei’s Party Triumphs in Argentina Midterm Election",
    "link": "https://www.nytimes.com/2025/10/26/world/americas/argentina-election-javier-milei.html",
    "summary": "The result, which gives Mr. Milei enough legislative support to keep his vetoes from being overturned, showed that many voters still back the president’s austerity policies."
  },
  {
    "title": "Burevestnik Nuclear Missile Tests Successful, Russia Says",
    "link": "https://www.nytimes.com/2025/10/26/world/europe/russia-burevestnik-missile.html",
    "summary": "Because of its power source, the Burevestnik can remain airborne far longer than other nuclear-armed missiles."
  },
  {
    "title": "In U.K., China Is a Threat and a Coveted Trade Partner",
    "link": "https://www.nytimes.com/2025/10/27/world/europe/britain-china-national-security-economy.html",
    "summary": "A botched spying case prompted accusations that the British government was soft on China, highlighting tensions between economic and national security interests."
  },
  {
    "title": "Diphtheria, a Once Vanquished Killer of Children, Is Resurgent",
    "link": "https://www.nytimes.com/2025/10/27/health/diptheria-somalia-vaccines.html",
    "summary": "A Somali hospital ward packed with gasping children shows how war, climate and mistrust of vaccines is fueling the disease’s return."
  },
  {
    "title": "Peace in Gaza Comes Down to This",
    "link": "https://www.nytimes.com/2025/10/27/opinion/israel-hamas-gaza-peace.html",
    "summary": "Washington must dedicate itself to making sure an international stabilization force is established for Gaza. It’s the linchpin."
  },
  {
    "title": "Labubus Ate My Daughter",
    "link": "https://www.nytimes.com/2025/10/26/opinion/labubu-parenting-consumerism.html",
    "summary": "I thought our frenzied quest to find the trendy doll would teach my daughter a lesson. It did, just not the one I expected."
  },
  {
    "title": "2 U.S. Navy Aircraft Go Down in South China Sea",
    "link": "https://www.nytimes.com/2025/10/27/world/asia/navy-aircraft-crash-south-china-sea.html",
    "summary": "A helicopter and a fighter jet went down in separate incidents while operating from a U.S. aircraft carrier on Sunday, the Navy said. The crews were rescued."
  },
  {
    "title": "Mamdani and the Left’s Biggest Stars Unite Before a Sea of Supporters",
    "link": "https://www.nytimes.com/2025/10/26/nyregion/mamdani-sanders-aoc-rally.html",
    "summary": "As Senator Bernie Sanders and Representative Alexandria Ocasio-Cortez joined Zohran Mamdani on Sunday at Forest Hills Stadium, a bigger test for the left may still lie ahead."
  },
  {
    "title": "Drew Struzan, Masterly Painter of Movie Posters, Dies at 78",
    "link": "https://www.nytimes.com/2025/10/26/movies/drew-struzan-dead.html",
    "summary": "He created realistic imagery for the “Star Wars” franchise, the Indiana Jones films and the “Back to the Future” trilogy. He also put Alice Cooper in a tuxedo and tails for an album cover."
  }
]