[
  {
    "title": "Trump ‘Determined’ the U.S. Is Now in a War With Drug Cartels, Congress Is Told",
    "link": "https://www.nytimes.com/2025/10/02/us/politics/trump-drug-cartels-war.html",
    "summary": "A notice calls the people the U.S. military recently killed on suspicion of drug smuggling in the Caribbean Sea “unlawful combatants.”"
  },
  {
    "title": "Immigration Judge Rejects Abrego Garcia’s Efforts to Seek Asylum in U.S.",
    "link": "https://www.nytimes.com/2025/10/02/us/politics/abrego-garcia-asylum.html",
    "summary": "The decision foreclosed one of the options that lawyers for Kilmar Armando Abrego Garcia had tried in an effort to keep him in the country."
  },
  {
    "title": "Fed’s Independence in Jeopardy Despite Latest Lisa Cook Victory",
    "link": "https://www.nytimes.com/2025/10/02/business/federal-reserve-independence-lisa-cook.html",
    "summary": "A Supreme Court order keeping Lisa Cook on the Federal Reserve Board for now is “a time to exhale but not breathe easy,” one expert said."
  },
  {
    "title": "New Tariffs Could Worsen America’s Housing Crisis",
    "link": "https://www.nytimes.com/2025/10/02/business/tariffs-lumber-furniture-housing-crisis.html",
    "summary": "President Trump’s tariffs on timber, wood, furniture and kitchen cabinets could raise the cost of building and buying a home."
  },
  {
    "title": "Energy Dept. Cancels $7.5 Billion for Hundreds of Projects, Mostly in Blue States",
    "link": "https://www.nytimes.com/2025/10/02/climate/doe-clean-energy-programs-shutdown.html",
    "summary": "The cuts almost entirely affect Democratic-led states as the two parties fight over the shutdown of the federal government."
  },
  {
    "title": "Here Are the Dueling Plans Behind the Shutdown Impasse",
    "link": "https://www.nytimes.com/2025/10/02/us/politics/government-shutdown-spending-bill-impasse.html",
    "summary": "Republicans are proposing a straight extension of government spending, while Democrats are demanding the addition of over $1 trillion for health programs."
  },
  {
    "title": "Many Palestinians Say Hamas Must Accept U.S. Cease-Fire Plan",
    "link": "https://www.nytimes.com/2025/10/02/world/middleeast/palestinian-voices-hamas-cease-fire.html",
    "summary": "Interviews in Gaza suggest wide support for a proposal that calls for an immediate end to a war that has brought immense civilian suffering."
  },
  {
    "title": "Israel Intercepted the Flotilla Headed to Gaza: What to Know",
    "link": "https://www.nytimes.com/2025/10/01/world/middleeast/gaza-flotilla-aid-global-sumud-israel.html",
    "summary": "The Israeli government said it had detained activists who were trying to take humanitarian aid to the blockaded enclave."
  },
  {
    "title": "Italy Backs Trump’s Gaza Plan as Public Demands Support for Palestinians",
    "link": "https://www.nytimes.com/2025/10/02/world/europe/italy-palestinian-state-gaza-plan.html",
    "summary": "Italian lawmakers say they will recognize a Palestinian state if Hamas releases Israeli hostages and is kept out of any eventual government."
  },
  {
    "title": "Times/Siena Survey: Americans Worry Divisions Cannot Be Overcome",
    "link": "https://www.nytimes.com/2025/10/02/us/politics/times-siena-poll-political-polarization.html",
    "summary": "A new Times/Siena survey shows a significant shift among voters, as their concerns about the health of the political system overtake other issues."
  },
  {
    "title": "Why Support for Political Violence Is Not as High as It May Seem",
    "link": "https://www.nytimes.com/2025/09/20/upshot/polls-political-violence.html",
    "summary": "A tiny percentage of Americans support it in any meaningful sense, despite what some polls may show."
  },
  {
    "title": "We Finally Have Free Anti-Robocall Tools That Work",
    "link": "https://www.nytimes.com/2025/10/02/technology/personaltech/iphone-robocalls-screener-android.html",
    "summary": "A new feature for iPhones screens calls, similar to a technology available for Android users. Here’s how to activate it."
  },
  {
    "title": "Synagogue Attack on Yom Kippur in Manchester, UK: What We Know",
    "link": "https://www.nytimes.com/2025/10/02/world/europe/uk-manchester-synagogue-attack.html",
    "summary": "Two people were killed and at least three others were in serious condition after the vehicle ramming and stabbing attack on Yom Kippur. Police said the suspect was dead."
  },
  {
    "title": "Ophelia Disappeared: A Wall Street Analyst and a Deadly Shootout",
    "link": "https://www.nytimes.com/2025/10/02/us/zizians.html",
    "summary": "The group was passionately vegan, mostly transgender and highly educated. Seven of them are now in jail. This is the story of one who did not survive."
  },
  {
    "title": "At Saudi Comedy Festival, American Free Speech Becomes the Punchline",
    "link": "https://www.nytimes.com/2025/10/02/world/middleeast/saudi-comedy-festival-riyadh-free-speech.html",
    "summary": "American comics used Saudi Arabia’s first global comedy festival to skewer a debate raging at home. Critics said the event was part of Saudi efforts to draw attention away from a political crackdown."
  },
  {
    "title": "OpenAI’s Sora Video App Is Jaw-Dropping (for Better and Worse)",
    "link": "https://www.nytimes.com/2025/10/02/technology/openai-sora-video-app.html",
    "summary": "Sora, OpenAI’s new video-generating app, is really a social network in disguise that can bring creative A.I. to the masses — and its problems, too."
  },
  {
    "title": "OpenAI Completes Deal That Values It at $500 Billion",
    "link": "https://www.nytimes.com/2025/10/02/technology/openai-deal-500-billion.html",
    "summary": "With the agreement, OpenAI becomes the world’s most valuable privately held company, surpassing the rocket maker SpaceX."
  },
  {
    "title": "Mamdani Says He Would Phase Out N.Y.C. Gifted Program for Early Grades",
    "link": "https://www.nytimes.com/2025/10/02/nyregion/mamdani-schools-gifted-and-talented-program.html",
    "summary": "Zohran Mamdani, the Democratic front-runner in the mayor’s race, plans if elected to replace the selective program, which became a symbol of segregation in public schools."
  },
  {
    "title": "Heading to L.A. for the Olympics? If You’re Into These Sports, You’re in the Wrong State.",
    "link": "https://www.nytimes.com/2025/10/02/us/los-angeles-olympics-oklahoma-city.html",
    "summary": "Much of the Summer Games in 2028 will take place in Southern California. But two events, softball and canoe slalom, will be held in Oklahoma."
  },
  {
    "title": "‘There Will Always Only Be One Jane Goodall’",
    "link": "https://www.nytimes.com/2025/10/01/science/jane-goodall-chimpanzees-career.html",
    "summary": "Scientists reflect on the life and work of a researcher whose discoveries made them rethink what it means to be human."
  },
  {
    "title": "What Jane Goodall Taught Us About Living a Long Life",
    "link": "https://www.nytimes.com/2025/10/02/well/jane-goodall-aging-long-life.html",
    "summary": "The scientist, who died at 91 on Wednesday, was a model for healthy aging."
  },
  {
    "title": "Taylor Swift’s ‘Life of a Showgirl’ Is Her Eras Tour Victory Lap",
    "link": "https://www.nytimes.com/2025/10/02/arts/music/taylor-swift-life-of-a-showgirl-eras-tour.html",
    "summary": "The star’s power and reach has grown with each of her releases. Now she’s following her record-breaking live show with her 12th original studio LP, “The Life of a Showgirl.”"
  },
  {
    "title": "How to Beat an Autocrat at the Ballot Box",
    "link": "https://www.nytimes.com/2025/10/02/opinion/poland-election-autocrat-russia-hungary.html",
    "summary": "Authoritarians have lost elections before, and they will again."
  },
  {
    "title": "Hasan Piker Is Flirting With the Revolution",
    "link": "https://www.nytimes.com/2025/10/02/opinion/hasan-piker-interesting-times-ross-douthat.html",
    "summary": "Meet the online star who likes to play with fire."
  },
  {
    "title": "The Shutdown, Explained",
    "link": "https://www.nytimes.com/2025/10/02/briefing/the-shutdown-explained.html",
    "summary": "It’s the second day of a shutdown of the federal government. We explain what’s happening."
  },
  {
    "title": "Tell us about your experience with early-onset cancer.",
    "link": "https://www.nytimes.com/2025/10/01/well/tell-us-about-your-experience-with-early-onset-cancer.html",
    "summary": "We want to hear your stories of living with cancer as a younger adult."
  },
  {
    "title": "An Embarrassment of Riches for Mexico’s Party of the Poor",
    "link": "https://www.nytimes.com/2025/10/02/world/americas/mexico-morena-wealth-poor.html",
    "summary": "Mexico’s dominant party, Morena, rose to power by championing the poor. Now it is having to explain the luxurious lifestyles of some of its most prominent members."
  },
  {
    "title": "Two Planes Collide on LaGuardia Airport Taxiway",
    "link": "https://www.nytimes.com/2025/10/02/nyregion/delta-plane-collision-laguardia.html",
    "summary": "A plane that was preparing to take off struck a plane that had landed, the authorities said. One flight attendant was injured, and the F.A.A. was investigating."
  },
  {
    "title": "The Dinosaur Sale Is Not a Joke",
    "link": "https://www.nytimes.com/2025/10/01/nyregion/new-jersey-dinosaur-sale.html",
    "summary": "A popular theme park is closing. That’s good news for dinosaur fans who want their own life-size animatronic attraction."
  },
  {
    "title": "No More Signs of Life From Rubble of Collapsed School in Indonesia",
    "link": "https://www.nytimes.com/2025/10/02/world/asia/indonesia-school-collapse.html",
    "summary": "Rescuers saved five more students from under the building on Thursday but said they would end the search three days after the deadly accident."
  }
]