[
  {
    "title": "Britain, Australia and Canada Recognize a Palestinian State",
    "link": "https://www.nytimes.com/2025/09/21/world/europe/starmer-uk-recognize-palestinian-state.html",
    "summary": "The announcements came on the eve of the annual gathering of the U.N. General Assembly, ramping up pressure on Israel and putting three allies at odds with the Trump administration."
  },
  {
    "title": "What Would Recognizing a Palestinian State Mean?",
    "link": "https://www.nytimes.com/2025/07/29/world/middleeast/palestinian-statehood-israel.html",
    "summary": "The announcements by Australia, Britain and Canada reflect frustration with Israel’s conduct in Gaza and the occupied West Bank, experts say."
  },
  {
    "title": "U.N. Gathers Amid Its 80th Anniversary and a ‘Free Fall’",
    "link": "https://www.nytimes.com/2025/09/21/world/middleeast/un-general-assembly-80th-anniversary.html",
    "summary": "The wars in Ukraine, Gaza and Sudan will hang over the annual gathering of the U.N. General Assembly next week in New York. So, too, will budget and identity crises."
  },
  {
    "title": "Israel Keeps Border Crossing to Jordan Closed After Attack",
    "link": "https://www.nytimes.com/2025/09/21/world/middleeast/israel-jordan-allenby-crossing.html",
    "summary": "The Allenby Bridge border crossing is the main gateway for Palestinians to leave the Israeli-occupied West Bank."
  },
  {
    "title": "In Assault on Free Speech, Trump Targets Speech He Hates",
    "link": "https://www.nytimes.com/2025/09/21/us/politics/trump-free-speech.html",
    "summary": "The president’s complaints about negative coverage undermine the rationales offered by his own officials."
  },
  {
    "title": "Trump Demands That Bondi Move ‘Now’ to Prosecute Foes",
    "link": "https://www.nytimes.com/2025/09/20/us/politics/trump-justice-department-us-attorneys.html",
    "summary": "His demand came a day after he ousted the federal prosecutor who failed to charge two of his most-reviled adversaries, Letitia James and James B. Comey."
  },
  {
    "title": "Trump Justice Dept. Closed Investigation Into Tom Homan for Accepting Bag of Cash",
    "link": "https://www.nytimes.com/2025/09/20/us/politics/tom-homan-fbi-trump.html",
    "summary": "Mr. Homan came under scrutiny after he was said to be recorded last year taking $50,000 in cash from undercover F.B.I. agents."
  },
  {
    "title": "Trump Is Expanding the National Guard’s Role. Some Former Generals Worry.",
    "link": "https://www.nytimes.com/2025/09/21/us/national-guard-crime-washington-cities.html",
    "summary": "Responding to crises at home is part of the Guard’s mission. Helping crack down on crime in U.S. cities isn’t, say some former leaders, who fear this shift could hurt the force."
  },
  {
    "title": "For Erika Kirk, a Husband’s Life Cut Short by Violence He Seemed to Foresee",
    "link": "https://www.nytimes.com/2025/09/21/us/politics/erika-kirk.html",
    "summary": "In an interview, the wife of the conservative activist Charlie Kirk said she had implored him to wear a bulletproof vest. But she sees divine work in his death."
  },
  {
    "title": "Political Violence Isn’t New. But Something About This Moment Is.",
    "link": "https://www.nytimes.com/2025/09/19/magazine/tyler-robinson-political-violence.html",
    "summary": "Charlie Kirk’s assassination fits into American history. How does it fit into our politics?"
  },
  {
    "title": "Trump’s $100,000 H1-B Visa Fee Spurs Confusion and Chaos for Companies",
    "link": "https://www.nytimes.com/2025/09/20/business/trump-h1b-visas-fee-employees.html",
    "summary": "The White House sought to clarify the proclamation on Saturday, but many companies remained cautious. “We are still flying in somewhat foggy conditions,” one attorney said."
  },
  {
    "title": "The H-1B Visa: Why Is Trump Adding a $100,000 Fee?",
    "link": "https://www.nytimes.com/2025/09/20/us/politics/h1b-visa-trump-immigration.html",
    "summary": "President Trump signed a proclamation on Friday adding a $100,000 fee to visas for skilled foreign workers. Immigration hard-liners have criticized the program for replacing American workers."
  },
  {
    "title": "What Dwayne ‘The Rock’ Johnson Knows About Pain",
    "link": "https://www.nytimes.com/2025/09/21/magazine/dwayne-johnson-the-rock-smashing-machine.html",
    "summary": "In “The Smashing Machine,” Johnson gives a new kind of performance, one that required him to face his fears."
  },
  {
    "title": "Can the Galápagos Adapt to Airbnb?",
    "link": "https://www.nytimes.com/2025/09/21/business/galapagos-airbnb.html",
    "summary": "The islands that Charles Darwin made famous have become more accessible. Too accessible, say some residents and researchers, who fear nature is imperiled."
  },
  {
    "title": "Ukraine Counterattacks, Scoring Rare, if Modest, Success in Northeast",
    "link": "https://www.nytimes.com/2025/09/21/world/europe/ukraine-sumy-advances.html",
    "summary": "The gains could help counter Moscow’s narrative that Russian advances are unstoppable and that Kyiv should settle for a peace deal, even if it means giving up territory."
  },
  {
    "title": "How Russia’s Sanctions Evasion Could Create Lasting Costs",
    "link": "https://www.nytimes.com/2025/09/20/world/europe/russia-shadow-fleet-oil-sanctions-ukraine-war.html",
    "summary": "Restrictions have made it expensive for Moscow to ship oil by sea. They have also expanded the illicit shipping economy."
  },
  {
    "title": "Trump’s Tariffs on Switzerland Prompt Identity Crisis for Swiss Army Knife",
    "link": "https://www.nytimes.com/2025/09/21/business/swiss-army-knife-trump-tariffs.html",
    "summary": "President Trump’s 39 percent tariff on Switzerland has forced some companies to consider whether they could produce in the United States while still retaining their Swiss identity."
  },
  {
    "title": "Meet the Young Professionals Voting for Zohran Mamdani",
    "link": "https://www.nytimes.com/2025/09/21/business/zohran-mamdani-voters.html",
    "summary": "Despite their high salaries, some tech workers, lawyers and financiers are concerned by New York’s rising cost of living, and are betting on Zohran Mamdani for mayor."
  },
  {
    "title": "The Songs of the 2025 New York Mayoral Race",
    "link": "https://www.nytimes.com/2025/09/21/nyregion/mayor-songs-campaign-nyc.html",
    "summary": "Music can be a powerful way for political candidates to connect with voters and convey a message. Here are the songs the New York City mayoral candidates chose."
  },
  {
    "title": "They Were Building a Homeless Shelter. But the Land had a Grim Past.",
    "link": "https://www.nytimes.com/2025/09/21/nyregion/inwood-homeless-shelter.html",
    "summary": "The search for a place to build a shelter in Manhattan resurfaced New York’s often overlooked history of slavery."
  },
  {
    "title": "America Has Entered an Entirely New Situation",
    "link": "https://www.nytimes.com/video/opinion/100000010411235/jimmy-kimmel-and-the-rise-of-corporate-censorship.html",
    "summary": "Jimmy Kimmel’s suspension exposes a chilling new reality of the media bowing to political pressure from the Trump administration, the New York Times Opinion columnist M. Gessen argues. “The only way for the media to resist is to band together to create a joint strategy to agree, for example, never to settle Trump’s lawsuits, to agree to defend one another, to provide individuals with institutional backing even if they weren’t working for a large institution when they were sued,” says Gessen."
  },
  {
    "title": "Eric Adams, Donald Trump and the Case That Broke American Justice",
    "link": "https://www.nytimes.com/2025/09/20/opinion/trump-eric-adams-corruption.html",
    "summary": "This is not just a New York story."
  },
  {
    "title": "The W.N.B.A.’s Growing Fan-Base",
    "link": "https://www.nytimes.com/2025/09/21/us/wnba-fans-charlie-kirk-memorial.html",
    "summary": "Boys and men now love women’s basketball, too."
  },
  {
    "title": "We Want Your Best Breakup Lines",
    "link": "https://www.nytimes.com/2025/09/18/style/modern-love-we-want-your-best-breakup-lines.html",
    "summary": "For a special Modern Love project, we’re looking for your most unforgettable lines from a breakup, either delivered or received — kind, bizarre, profound, haunting or funny."
  },
  {
    "title": "A Maternity Ward in Chad Reaches Its Breaking Point as U.S. Aid Dries Up",
    "link": "https://www.nytimes.com/2025/09/21/world/africa/maternity-ward-sudan-refugees-us-aid.html",
    "summary": "The fallout of the war in Sudan has led to one of the world’s worst humanitarian crises, but aid to its victims is vanishing. Pregnant women’s lives are in the balance."
  },
  {
    "title": "Man Is Charged in Shooting at Sky Meadow Country Club in New Hampshire",
    "link": "https://www.nytimes.com/2025/09/20/us/new-hampshire-country-club-shooting.html",
    "summary": "A 23-year-old was charged with murder after a shooting at a country club left one dead and two wounded. The suspect had no known connection to the victim."
  },
  {
    "title": "They Held a Rally for Charter Schools. Then Came the Backlash.",
    "link": "https://www.nytimes.com/2025/09/21/nyregion/charter-schools-new-york-city.html",
    "summary": "A large demonstration — and a hostile response — could signal a resurgence of a political battle over the publicly funded but privately run schools."
  },
  {
    "title": "This Geriatrics Training Program Escaped the Ax. For Now.",
    "link": "https://www.nytimes.com/2025/09/21/health/geriatrics-training-funding.html",
    "summary": "The Trump administration has restored promised funds to a program that teaches people in health care how to work with aging Americans."
  }
]