[
  {
    "title": "U.S. Attacked Boat With Aircraft That Looked Like a Civilian Plane",
    "link": "https://www.nytimes.com/2026/01/12/us/politics/us-boat-attacks-law.html",
    "summary": "Even accepting the Trump administration’s claim that there is an armed conflict with suspected drug runners, the laws of war bar “perfidy.”"
  },
  {
    "title": "Russian Missiles Failed in Venezuela During U.S. Attack",
    "link": "https://www.nytimes.com/2026/01/12/world/americas/venezuela-russian-weapons-fail.html",
    "summary": "The Venezuelan regime had high-powered air defense systems from its allies in the Kremlin, but failed to set much of it up."
  },
  {
    "title": "In Venezuela, Amnesty for Political Prisoners Stokes Hope and Frustration",
    "link": "https://www.nytimes.com/2026/01/12/world/americas/venezuela-political-prisoners-amnesty.html",
    "summary": "Venezuela’s new leaders and President Trump have alluded to a major release of political prisoners, but the liberations have been slow to come."
  },
  {
    "title": "Lawyer Whom Maduro Didn’t Hire Is Booted From His Case",
    "link": "https://www.nytimes.com/2026/01/12/nyregion/maduro-lawyers-bruce-fein.html",
    "summary": "Last week, a lawyer came forward claiming to represent the unseated president of Venezuela, Nicolás Maduro. The judge overseeing the case settled the matter on Monday."
  },
  {
    "title": "FBI’s ICE Shooting Inquiry Examines Renee Good’s Possible Ties to Activist Groups",
    "link": "https://www.nytimes.com/2026/01/12/us/politics/fbi-renee-good-ice-shooting.html",
    "summary": "Former department officials warned that such a broad inquiry raised the specter that forms of political protests could be criminalized."
  },
  {
    "title": "Trump Officials Are Sending 1,000 More Immigration Officers to Minnesota",
    "link": "https://www.nytimes.com/2026/01/12/us/politics/border-patrol-minnesota-surge.html",
    "summary": "The Customs and Border Protection officers are joining 2,000 other officers and agents at the Department of Homeland Security who have recently been deployed to the Minneapolis region."
  },
  {
    "title": "Minnesota and Illinois Sue Trump Administration Over ICE Deployments",
    "link": "https://www.nytimes.com/2026/01/12/us/minnesota-llinois-lawsuit-ice-trump-administration.html",
    "summary": "The two Democratic-led states claimed in separate lawsuits that the immigration enforcement campaigns violated the Constitution."
  },
  {
    "title": "DOJ Charges Luis Nino-Moncada, Who Was Shot by Border Patrol in Portland",
    "link": "https://www.nytimes.com/2026/01/12/us/politics/portland-border-patrol-immigration-shooting.html",
    "summary": "Last week’s shooting of two Venezuelan immigrants put the city on edge. Federal officials said the man who was shot had repeatedly backed into a Border Patrol car."
  },
  {
    "title": "Fed Changes Course and Takes On Trump’s Political Fight",
    "link": "https://www.nytimes.com/2026/01/12/business/federal-reserve-changes-course-trump-administration.html",
    "summary": "The Justice Department’s decision to open up a criminal investigation of Jerome H. Powell, the chair of the Federal Reserve, is a major escalation in the pressure campaign against the central bank to cut interest rates."
  },
  {
    "title": "What to Know About the Criminal Investigation of Fed Chair Jerome Powell",
    "link": "https://www.nytimes.com/2026/01/12/us/politics/jerome-powell-investigation-fed-renovations.html",
    "summary": "The Justice Department’s probe into whether Jerome H. Powell, the chair of the Federal Reserve, lied about renovations to the central bank’s headquarters has raised alarms."
  },
  {
    "title": "Top Fed Official Conveys Little Urgency for Immediate Rate Cuts",
    "link": "https://www.nytimes.com/2026/01/12/business/federal-reserve-john-williams-rates.html",
    "summary": "The Federal Reserve is likely to hold interest rates steady when it meets at the end of the month, keeping tensions high with President Trump."
  },
  {
    "title": "Kelly Sues Pentagon Over Threats of Punishment From Hegseth",
    "link": "https://www.nytimes.com/2026/01/12/us/politics/mark-kelly-pentagon-hegseth-suit.html",
    "summary": "Senator Mark Kelly, Democrat of Arizona, asked a federal judge to block the Trump administration from disciplining him for a video warning about illegal military orders."
  },
  {
    "title": "Federal Prosecutor Is Fired Amid Further Turmoil in Comey Case",
    "link": "https://www.nytimes.com/2026/01/12/us/politics/mcbride-halligan-us-attorney-trump.html",
    "summary": "Robert K. McBride had been serving as the top deputy to Lindsey Halligan, who has continued to act as the U.S. attorney for the Eastern District of Virginia."
  },
  {
    "title": "Judge Blocks Trump Effort to Stop Rhode Island’s Revolution Wind Project",
    "link": "https://www.nytimes.com/2026/01/12/climate/judge-strikes-down-trumps-latest-effort-to-stop-offshore-wind.html",
    "summary": "The ruling means that construction can continue on Revolution Wind, a $6.2 billion project off the coast of Rhode Island, at least for now."
  },
  {
    "title": "E.P.A. to Stop Considering Lives Saved by Limiting Air Pollution",
    "link": "https://www.nytimes.com/2026/01/12/climate/trump-epa-air-pollution.html",
    "summary": "In a reversal, the agency plans to calculate only the cost to industry when setting pollution limits, and not the monetary value of saving human lives, documents show."
  },
  {
    "title": "Meta Plans to Cut 10% to 15% of Employees in Reality Labs Business",
    "link": "https://www.nytimes.com/2026/01/12/technology/meta-layoffs-reality-labs.html",
    "summary": "The layoffs are set to be announced this week and would affect Meta’s work on the metaverse, as the company spends heavily on building artificial intelligence."
  },
  {
    "title": "Apple Teams Up With Google for A.I. in Its Products",
    "link": "https://www.nytimes.com/2026/01/12/technology/apple-google-ai-partnership.html",
    "summary": "Apple was facing increasing questions about its plans for artificial intelligence as other big tech companies invested tens of billions in the technology."
  },
  {
    "title": "Trump Explores Diplomacy With Iran While Weighing Strikes, Officials Say",
    "link": "https://www.nytimes.com/2026/01/12/us/politics/trump-iran-options-diplomacy-strikes.html",
    "summary": "Abbas Araghchi, the foreign minister of Iran, said his government was ready to negotiate with the United States. Iranian security forces are cracking down on protests."
  },
  {
    "title": "Iran Says It Is Prepared for War but Ready to Negotiate After Trump’s Warnings",
    "link": "https://www.nytimes.com/2026/01/12/world/middleeast/iran-protests-trump-us.html",
    "summary": "The comments came after President Trump said he was “ looking at some very strong options” to curb the Iranian authorities’ harsh repression of anti-government protests."
  },
  {
    "title": "Duke Webb, a Green Beret, Went on a Shooting Rampage. Is the Army at Fault?",
    "link": "https://www.nytimes.com/2026/01/12/us/blast-brain-injury-green-beret-shooting-duke-webb.html",
    "summary": "High-tempo Special Operations training can cause brain injuries that accumulate unnoticed. One soldier says that is why he snapped and killed three people."
  },
  {
    "title": "Inside Democrats’ Brewing Debate Over Which States Should Vote First in 2028",
    "link": "https://www.nytimes.com/2026/01/12/us/politics/state-vote-democrats-president-2028.html",
    "summary": "Does Iowa deserve another shot? Is South Carolina too red? New Hampshire too white? Nevada too far-flung? Democrats are starting their calendar from scratch, and there’s a lot to consider."
  },
  {
    "title": "With Democrats at a Crossroads, Elizabeth Warren Urges a Left Turn",
    "link": "https://www.nytimes.com/2026/01/12/us/politics/elizabeth-warren-democrats.html",
    "summary": "The Massachusetts senator signaled alarm about her party’s movement toward the center, warning in a speech that Democrats should not cozy up to the wealthy and the powerful."
  },
  {
    "title": "Arson Suspect Targeted Mississippi Synagogue for Its ‘Jewish Ties,’ F.B.I. Says",
    "link": "https://www.nytimes.com/2026/01/12/us/mississippi-synagogue-arson.html",
    "summary": "The suspect, Stephen Spencer Pittman, was turned in by his father, who said his son had laughed as he confessed to the fire that damaged the synagogue, investigators said."
  },
  {
    "title": "The Weimar Republic Shaped the 20th Century. Can Today’s Leaders Avoid Its Fate?",
    "link": "https://www.nytimes.com/2026/01/12/world/europe/weimar-germany-democracy-failure-warning.html",
    "summary": "A fragile democracy, the Weimar Republic, briefly took hold in Germany before the Nazis seized power. Now, Weimar’s collapse is seen as a warning."
  },
  {
    "title": "In This Town, the Groundhog May Never See Its Shadow Again",
    "link": "https://www.nytimes.com/2026/01/12/nyregion/new-jersey-groundhog-day-veto.html",
    "summary": "Since Milltown Mel died, a New Jersey town has faced a groundhog crisis. Now the governor has vetoed an effort to bring in out-of-state replacements."
  },
  {
    "title": "Trump’s Attack on the Federal Reserve Is Already Backfiring",
    "link": "https://www.nytimes.com/2026/01/12/opinion/trump-jerome-powell-federal-reserve.html",
    "summary": "And the market is gently shrugging."
  },
  {
    "title": "This Rural Congresswoman Thinks Democrats Have Lost Their Minds. She Has a Point.",
    "link": "https://www.nytimes.com/2026/01/12/opinion/marie-gluesenkamp-perez.html",
    "summary": "Marie Gluesenkamp Perez thinks too many members of her party miss what’s really driving the alienation and anger in our society."
  },
  {
    "title": "Notable Republicans Criticize Investigation of Fed Chair",
    "link": "https://www.nytimes.com/2026/01/12/briefing/fed-chair-investigation-iran-protests.html",
    "summary": "Also, Iran said it is ready for war, but open to negotiate. Here’s the latest at the end of Monday."
  },
  {
    "title": "World Court Hears Groundbreaking Genocide Case Against Myanmar",
    "link": "https://www.nytimes.com/2026/01/12/world/asia/myanmar-icj-rohingya.html",
    "summary": "The case was brought to the World Court by a country not directly affected by the alleged genocide of the Rohingya, a precedent for similar claims against other countries, including Israel."
  },
  {
    "title": "Leaders of Historians’ Group Veto Resolutions Critical of Israel",
    "link": "https://www.nytimes.com/2026/01/12/arts/american-historical-association-gaza.html",
    "summary": "The executive council of the American Historical Association said the resolutions, including one accusing Israel of ‘scholasticide’ in Gaza, would put the group at risk."
  },
  {
    "title": "Nearly 15,000 Nurses Go on Strike at Major New York City Hospitals",
    "link": "https://www.nytimes.com/2026/01/12/nyregion/nurses-strike-hospitals-nyc.html",
    "summary": "Workers are demanding more robust staffing levels and higher pay. The strike comes three years after a smaller job action won significant gains."
  },
  {
    "title": "Former Congressional Employee Accused of Stealing 240 Phones",
    "link": "https://www.nytimes.com/2026/01/12/us/congressional-employee-stolen-phones.html",
    "summary": "A Maryland man used his government job to order new cellphones worth over $150,000 and then sell them to a pawnshop, federal prosecutors said."
  }
]