[
  {
    "title": "Trump Uses Shutdown to Maximize Pain for Democrats and Move Forward With Layoffs",
    "link": "https://www.nytimes.com/2025/10/01/us/politics/white-house-shutdown-punishment.html",
    "summary": "The Trump administration forged ahead with plans to conduct mass layoffs, as the fiscal standoff appeared to intensify."
  },
  {
    "title": "Trump to Withhold $18 Billion for New York-Area Transit Projects",
    "link": "https://www.nytimes.com/2025/10/01/nyregion/trump-nyc-subway-gateway-infrastructure-funding.html",
    "summary": "Funds for two of the nation’s largest infrastructure projects, the Second Avenue subway and Hudson River tunnels, are being held up in apparent attempts to pressure Democrats amid a government shutdown."
  },
  {
    "title": "‘Dangerous Cities,’ the Military, Trump and the Founding Fathers",
    "link": "https://www.nytimes.com/2025/10/01/us/politics/trump-military-founding-fathers.html",
    "summary": "The U.S. armed services have long sought to preserve the tradition of a nonpartisan military."
  },
  {
    "title": "Drones, Helicopters, Hundreds of Arrests: Trump’s Immigration Crackdown in Chicago So Far",
    "link": "https://www.nytimes.com/2025/10/01/us/trump-chicago-immigration-national-guard.html",
    "summary": "The administration announced a federal operation in the Chicago area more than three weeks ago. Agents have appeared along downtown streets, and National Guard troops are expected."
  },
  {
    "title": "How Washington Became a Testing Ground for ICE",
    "link": "https://www.nytimes.com/2025/10/01/us/politics/washington-dc-ice.html",
    "summary": "A series of arrests captured on video reveal how immigration officers have worked with other law enforcement agencies to identify migrants during stops for minor infractions."
  },
  {
    "title": "The Dodgers United Los Angeles. Then the ICE Raids Began.",
    "link": "https://www.nytimes.com/2025/10/01/magazine/los-angeles-dodgers-trump-latinos.html",
    "summary": "For decades, the Dodgers have been the pride of L.A.’s Latino community. Trump’s immigration raids are testing that."
  },
  {
    "title": "‘There Will Always Only Be One Jane Goodall’",
    "link": "https://www.nytimes.com/2025/10/01/science/jane-goodall-chimpanzees-career.html",
    "summary": "Scientists reflect on the life and work of a researcher whose discoveries made them rethink what it means to be human."
  },
  {
    "title": "Jane Goodall, Revered Chimpanzee Expert and Conservationist, Dies at 91",
    "link": "https://www.nytimes.com/2025/10/01/obituaries/jane-goodall-dead.html",
    "summary": "Her discoveries as a primatologist in the 1960s about how chimpanzees behave in the wild were hailed as “one of the Western world’s great scientific achievements.”"
  },
  {
    "title": "Jane Goodall: A Life in Pictures",
    "link": "https://www.nytimes.com/2025/10/01/science/jane-goodall-photos.html",
    "summary": "The primatologist gained scientific acclaim for her work with chimpanzees and then later used her fame to champion conservation."
  },
  {
    "title": "Jane Goodall’s Thoughts for a Reporter: ‘Hope Isn’t Just Wishful Thinking’",
    "link": "https://www.nytimes.com/2025/10/01/climate/jane-goodall-interviews.html",
    "summary": "A Times correspondent who interviewed Dr. Goodall recalled their conversations about the state of the planet."
  },
  {
    "title": "Trump Administration Asks Colleges to Sign ‘Compact’ to Get Funding Preference",
    "link": "https://www.nytimes.com/2025/10/02/us/politics/trump-college-funding.html",
    "summary": "Demands sent to nine top schools included pledging to freeze tuition for five years and to commit to strict definitions of gender."
  },
  {
    "title": "Trump Fires Members of Humanities Council",
    "link": "https://www.nytimes.com/2025/10/01/arts/trump-neh-firings.html",
    "summary": "The White House told members of a group of scholars who advise the National Endowment for the Humanities that their positions had been terminated."
  },
  {
    "title": "Israel Intercepts Boats Headed to Gaza With Humanitarian Aid",
    "link": "https://www.nytimes.com/2025/10/01/world/middleeast/gaza-flotilla-israel.html",
    "summary": "The boats were part of a flotilla, carrying Greta Thunberg and other activists, that was organized to break Israel’s blockade and protest the war."
  },
  {
    "title": "How Social Media Is Changing the Narrative of the Israel-Gaza War",
    "link": "https://www.nytimes.com/2025/10/01/business/israel-gaza-war-social-media.html",
    "summary": "Nearly two years into the conflict, social media is increasingly capturing the day-to-day toll in Gaza, as U.S. public opinion on the war shifts."
  },
  {
    "title": "Did the Yankees Try to Keep Red Sox Fans Out of the Bronx?",
    "link": "https://www.nytimes.com/2025/10/01/nyregion/yankees-red-sox-wild-card-bronx.html",
    "summary": "Not exactly, but to the thousands of Boston fans who attended the first game of the Wild Card series at Yankee Stadium, it was a welcome reason to root against the home team."
  },
  {
    "title": "In East Timor, U.S. Retreats From Plan to Build ‘Lifesaving’ Sewage Plant",
    "link": "https://www.nytimes.com/2025/10/01/world/asia/east-timor-us-aid-sewage.html",
    "summary": "A U.S. aid agency had committed hundreds of millions of dollars to the project, which could help provide clean water. Now its board wants to pull out of the agreement."
  },
  {
    "title": "When Taylor Swift Met Her ‘Life of a Showgirl’ Partner Max Martin",
    "link": "https://www.nytimes.com/2025/10/01/arts/music/taylor-swift-max-martin-shellback-showgirl.html",
    "summary": "The pop star and the Swedish producer connected on her 2012 LP, “Red.” They’ve reunited (with his collaborator Shellback) for “The Life of a Showgirl.”"
  },
  {
    "title": "Brussels Is the Heart of Europe, and It’s Not Going Well",
    "link": "https://www.nytimes.com/2025/10/02/opinion/brussels-belgium-european-union.html",
    "summary": "Brussels is nearing the end of its experiment in urban autonomy."
  },
  {
    "title": "How to Beat an Autocrat at the Ballot Box",
    "link": "https://www.nytimes.com/2025/10/02/opinion/poland-election-autocrat-russia-hungary.html",
    "summary": "Authoritarians have lost elections before, and they will again."
  },
  {
    "title": "How Broken Politics Breaks Courts",
    "link": "https://www.nytimes.com/2025/10/01/world/courts-polarized-gaza-flotilla-israel-blockade-jane-goodall.html",
    "summary": "We look at the difficult position of independent courts and judges at a time when countries around the world are deeply divided."
  },
  {
    "title": "Two Planes Collide on LaGuardia Airport Taxiway",
    "link": "https://www.nytimes.com/2025/10/02/nyregion/delta-plane-collision-laguardia.html",
    "summary": "A plane that was preparing to take off struck a plane that had landed, the authorities said. One passenger was injured."
  },
  {
    "title": "She Loved Eric Adams. She Kept It a Secret. Now She’s Talking.",
    "link": "https://www.nytimes.com/2025/10/01/nyregion/jasmine-ray-memoir-eric-adams.html",
    "summary": "Jasmine Ray, who served at City Hall in a $160,000-a-year job, had an undisclosed romance with Eric Adams years before he became mayor. In her memoir, she describes their relationship."
  },
  {
    "title": "Edward T. Blake, 80, Dies; Forensic Expert Sparked Innocence Movement",
    "link": "https://www.nytimes.com/2025/10/01/science/edward-t-blake-dead.html",
    "summary": "He was the first to use PCR testing on crime-scene DNA, inspiring a practice that has freed thousands of wrongfully convicted people."
  },
  {
    "title": "‘She Could Have Killed Me’: Scientist Survives Shark Bite to His Head",
    "link": "https://www.nytimes.com/2025/10/01/world/americas/marine-biologist-shark-bite-costa-rica.html",
    "summary": "“My whole head was inside of her mouth,” Mauricio Hoyos, a marine scientist from Mexico, said from a hospital in Costa Rica."
  }
]