[
  {
    "title": "Texas’ Blue-State Deployments Shred Relations Between Governors",
    "link": "https://www.nytimes.com/2025/10/08/us/politics/national-guard-governors.html",
    "summary": "State leaders have prided themselves on finding bipartisan consensus, but President Trump’s deployment of National Guard troops from Texas to Illinois has ripped the veneer off that image."
  },
  {
    "title": "Before Trump Ordered in Troops, Federal Officers Called Portland Protests ‘Low Energy’",
    "link": "https://www.nytimes.com/2025/10/08/us/politics/trump-portland-troops.html",
    "summary": "Oregon officials say the atmosphere outside an ICE building that has drawn daily demonstrations since June has grown worse since the president’s threats."
  },
  {
    "title": "Jonathan Rinderknecht Arrested in Connection With Palisades Fire in Los Angeles",
    "link": "https://www.nytimes.com/2025/10/08/us/los-angeles-palisades-fire-arrest.html",
    "summary": "Officials say that Jonathan Rinderknecht, 29, of Melbourne, Fla., had intentionally set a fire that rekindled a week later into a devastating blaze that killed 12 people."
  },
  {
    "title": "What Ignited California’s Most Destructive Fires",
    "link": "https://www.nytimes.com/2025/10/08/us/california-wildfires-worst-most-destructive.html",
    "summary": "California wildfires have become particularly devastating in recent decades, but their origins vary."
  },
  {
    "title": "Key Moments From the Final New Jersey Governor’s Debate",
    "link": "https://www.nytimes.com/2025/10/08/nyregion/new-jersey-governors-debate-ciattarelli-sherrill.html",
    "summary": "Jack Ciattarelli, the Republican nominee, and Representative Mikie Sherrill, the Democrat, described starkly different visions for the state in their debate Wednesday."
  },
  {
    "title": "‘Les Misérables’ at 40: The Unlikely Story of a Hit",
    "link": "https://www.nytimes.com/2025/10/08/theater/les-miserables-40th-anniversary.html",
    "summary": "Critics initially panned it, but public love for the musical with songs like “One Day More” and “On My Own” has kept it going strong for four decades — and counting."
  },
  {
    "title": "James Comey, Former FBI Director, Pleads Not Guilty and Will Seek to Dismiss Charges as Vindictive",
    "link": "https://www.nytimes.com/2025/10/08/us/politics/james-comey-arraignment.html",
    "summary": "The former F.B.I. director appeared in a brief hearing in federal court. His lawyers sought clarity on the details of a case filed under pressure from President Trump."
  },
  {
    "title": "Comey’s Two Legal Challenges to His Indictment, Explained",
    "link": "https://www.nytimes.com/2025/10/08/us/politics/comey-legal-challenges-explained.html",
    "summary": "A lawyer for the former F.B.I. director said he would accuse the Justice Department of malicious and selective prosecution and contend that a U.S. attorney was illegally appointed."
  },
  {
    "title": "These Democrats Could Hold the Key to Ending the Shutdown",
    "link": "https://www.nytimes.com/2025/10/08/us/politics/key-democrats-ending-shutdown.html",
    "summary": "As the federal closure slides into a second week, Republicans are working to peel off five more Democratic senators to join them in voting to reopen the government."
  },
  {
    "title": "Inside the Capitol, a Heated Spat Over the Shutdown and Epstein",
    "link": "https://www.nytimes.com/2025/10/08/us/politics/mike-johnson-spat-democrats-shutdown-epstein.html",
    "summary": "A pair of Democratic senators confronted the Republican speaker of the House over his refusal to swear in a colleague during the shutdown."
  },
  {
    "title": "Stephen Miller Cited ‘Plenary Authority,’ Then Paused. Conspiracies Started Flying.",
    "link": "https://www.nytimes.com/2025/10/08/business/media/stephen-miller-plenary-authority-cnn-conspiracies.html",
    "summary": "Online skeptics wondered if Mr. Miller had caught himself saying something he did not mean to. CNN says there was a technical glitch."
  },
  {
    "title": "The Harvard ‘Die-in’ That Set Off a Debate Over Protest and Punishment",
    "link": "https://www.nytimes.com/2025/10/08/us/harvard-palestinian-protest-die-in-lawsuit.html",
    "summary": "An Israeli American student said he was assaulted during a protest. Two years later, Republicans continue to raise the episode in their campaign to force schools to punish the student protesters."
  },
  {
    "title": "How Zohran Mamdani Came to Embrace the Palestinian Cause",
    "link": "https://www.nytimes.com/2025/10/08/nyregion/zohran-mamdani-israel-palestine.html",
    "summary": "As Mr. Mamdani seeks to reassure New York City he is open to compromise, his views on Israel and Palestinians have been the biggest exception."
  },
  {
    "title": "Mamdani Rides Slow Bus to ‘Fast and Free’ Buses Event",
    "link": "https://www.nytimes.com/2025/10/08/nyregion/mamdani-bus-plan-nyc-mayor.html",
    "summary": "Zohran Mamdani, the leading candidate in the race to be New York City’s next mayor, held a campaign event on a bus that crawled across Midtown Manhattan to highlight a signature proposal."
  },
  {
    "title": "How Nepal’s Gen Z Revolution Spiraled Out of Control",
    "link": "https://www.nytimes.com/2025/10/08/world/asia/nepal-gen-z-revolution.html",
    "summary": "Young people in Nepal rose up against corruption and inequality. But they say they did not expect the bloodshed, arson and government downfall that followed."
  },
  {
    "title": "Qatar Pushes U.S.-Venezuela Diplomacy as Trump Focuses on Military Action",
    "link": "https://www.nytimes.com/2025/10/08/us/politics/venezuela-trump-qatar.html",
    "summary": "The Pentagon has deployed 10,000 U.S. troops to the region, most of them to bases in Puerto Rico, a senior military official said."
  },
  {
    "title": "MacArthur Foundation Announces 2025 ‘Genius Grant’ Winners",
    "link": "https://www.nytimes.com/2025/10/08/arts/design/macarthur-foundation-2025-genius-grant-winners.html",
    "summary": "Twenty-two people in a broad spectrum of the arts and sciences were awarded the fellowship, which comes with an $800,000 stipend."
  },
  {
    "title": "Oakland, California, Residents Are Fed Up With Illegal Dumping",
    "link": "https://www.nytimes.com/2025/10/08/us/oakland-california-trash-garbage.html",
    "summary": "Many residents say that illegal dumping has inundated Oakland, Calif., a city with more garbage than almost anywhere else."
  },
  {
    "title": "What Civil Society Can Do to Beat Trumpism",
    "link": "https://www.nytimes.com/2025/10/08/opinion/trump-universities-compact-civil-society.html",
    "summary": "People and institutions of civil society must coordinate against him."
  },
  {
    "title": "ICE May Not Be a Secret Police, but They Sure Look Like One",
    "link": "https://www.nytimes.com/2025/10/08/opinion/ice-masks-immigration.html",
    "summary": "Authoritarian creep reaches a new phase."
  },
  {
    "title": "Comey Pleaded Not Guilty",
    "link": "https://www.nytimes.com/2025/10/08/briefing/comey-not-guilty-plea-national-guard-chicago.html",
    "summary": "Also, National Guard troops assembled near Chicago and Portland. Here’s the latest at the end of Wednesday."
  },
  {
    "title": "Can’t Find the Right Holiday Gift? We Can Help!",
    "link": "https://www.nytimes.com/2025/10/06/t-magazine/holiday-gifts-presents.html",
    "summary": "Ahead of the holidays, we’re responding to readers’ hardest gifting quandaries."
  },
  {
    "title": "California Will Ban Certain Ultraprocessed Foods in Schools",
    "link": "https://www.nytimes.com/2025/10/08/well/eat/gavin-newsom-ultraprocessed-food-ban-california.html",
    "summary": "A new state law creates the first legal definition of the foods, and may prompt changes in other states."
  },
  {
    "title": "Texts from Jay Jones, Democratic Attorney General Candidate, Roil Virginia Governor’s Race",
    "link": "https://www.nytimes.com/2025/10/08/us/jay-jones-text-messages-va-attorney-general.html",
    "summary": "In the messages, the Democratic candidate for attorney general, Jay Jones, discusses the hypothetical killing of a Republican lawmaker."
  },
  {
    "title": "Derrick Groves, Last of 10 New Orleans Escapees, Is Captured in Atlanta",
    "link": "https://www.nytimes.com/2025/10/08/us/derrick-groves-new-orleans-escapee-captured-atlanta.html",
    "summary": "Derrick Groves, a convicted murderer who escaped with nine other inmates in May, was taken into custody after a brief standoff with the police."
  },
  {
    "title": "Dolly Parton Addresses Health Fears After Sister’s Plea for Prayers",
    "link": "https://www.nytimes.com/2025/10/08/arts/music/dolly-parton-health.html",
    "summary": "In a video post on social media, the country music superstar, who is 79, played down the recent health challenges that prompted her to delay her Las Vegas residency."
  }
]