[
  {
    "title": "New Reports on Russian Interference Show Trump’s Claims on Obama Are Overblown",
    "link": "https://www.nytimes.com/2025/07/25/us/trump-obama-russia.html",
    "summary": "The administration’s claims are overblown, but newly declassified information provides some messy details about a January 2017 intelligence assessment of Moscow’s election interference."
  },
  {
    "title": "Trump Administration to Release $5.5 Billion in Frozen Schools Funding",
    "link": "https://www.nytimes.com/2025/07/25/us/education-funds-released-white-house.html",
    "summary": "The Trump administration had faced growing pressure from within his own party to release the money."
  },
  {
    "title": "Behind Trump’s War With Powell: A Battering Ram With 3 Million Followers",
    "link": "https://www.nytimes.com/2025/07/25/business/trump-powell-bill-pulte.html",
    "summary": "The director of the Federal Housing Finance Agency has made the removal of the Fed chair his personal mission."
  },
  {
    "title": "After Ghislaine Maxwell Interview, Concerns Mount Over Possibility of a Trump Pardon",
    "link": "https://www.nytimes.com/2025/07/25/us/politics/ghislaine-maxwell-trump-pardon.html",
    "summary": "President Trump, asked whether he would consider pardoning her, said, “I’m allowed to do it, but it’s something I haven’t thought about.”"
  },
  {
    "title": "As Consumers Lose Their Appetite, Food Brands Fight to Keep Wall St. Happy",
    "link": "https://www.nytimes.com/2025/07/25/business/kraft-heinz-ferrero-food-brand-deals.html",
    "summary": "Packaged food companies are struggling to adjust — and profit — as tastes, waistlines and wallets change."
  },
  {
    "title": "The First ‘Fantastic Four’: The Superhero Movie That Never Was",
    "link": "https://www.nytimes.com/2025/07/25/movies/fantastic-four-forgotten-film.html",
    "summary": "The first attempt at making a film about the superheroes was an extremely low-budget affair that was shot, abandoned and mostly forgotten about in the 1990s."
  },
  {
    "title": "States Look to Europe to Improve U.S. Prison Conditions",
    "link": "https://www.nytimes.com/2025/07/25/us/prison-improvements-oklahoma-germany.html",
    "summary": "States of all political stripes, including Oklahoma, North Dakota and Massachusetts, have sent officials to tour prisons in Germany in search of ways to improve conditions for American inmates."
  },
  {
    "title": "Under Siege From Trump and Musk, a Top Liberal Group Falls Into Crisis",
    "link": "https://www.nytimes.com/2025/07/25/us/politics/media-matters-musk-crisis.html",
    "summary": "Scrambling to pay legal fees, Media Matters has dialed back its criticism, trimmed its staff and contemplated closing entirely."
  },
  {
    "title": "Macron Recognizes a Palestinian State. But to What End?",
    "link": "https://www.nytimes.com/2025/07/25/world/middleeast/macron-france-palestinian-statehood.html",
    "summary": "The French president, expressing a moral obligation to address suffering in Gaza, made clear he had lost patience with the United States and Israel. The question is what effect he will have."
  },
  {
    "title": "He Placated Regulators to Buy Paramount. But Can He Fix the Business?",
    "link": "https://www.nytimes.com/2025/07/25/business/media/skydance-paramount-david-ellison.html",
    "summary": "Paramount’s cable business has cratered. The news division is in turmoil. A.I. is coming for movies. And those are just the obvious challenges facing David Ellison as he takes control."
  },
  {
    "title": "Two Democratic Governors Say if Texas Redraws Congressional Maps, They May Too",
    "link": "https://www.nytimes.com/2025/07/25/us/politics/texas-democrats-redistricting.html",
    "summary": "After meetings with Democrats from the Texas House, Gavin Newsom and JB Pritzker suggested their states could counter a gerrymander by Texas Republicans."
  },
  {
    "title": "The Manmade Clouds That Could Help Save the Great Barrier Reef",
    "link": "https://www.nytimes.com/2025/07/25/magazine/manmade-clouds-coral-barrier-reef.html",
    "summary": "Inside a bold — and controversial — effort to cool the water around this beloved ecosystem."
  },
  {
    "title": "The Gen Z New Yorkers Selling Their Parents on Mamdani",
    "link": "https://www.nytimes.com/2025/07/25/nyregion/zohran-mamdani-older-voters.html",
    "summary": "Young voters went for Zohran Mamdani by a large margin. Can they persuade their parents to do the same?"
  },
  {
    "title": "Election Officials Allege Possible Voter Fraud in Republican Primary",
    "link": "https://www.nytimes.com/2025/07/25/nyregion/election-fraud-new-york-city-council.html",
    "summary": "The New York City Board of Elections asked prosecutors to investigate potential ballot stuffing in a City Council race in southern Brooklyn."
  },
  {
    "title": "The Line Trump Crossed by Accusing Obama of Treason",
    "link": "https://www.nytimes.com/2025/07/25/opinion/obama-treason-trump.html",
    "summary": "President Trump’s history of intemperate remarks has earned him a perverse kind of immunity; the more outrageous his statement, the faster it is often dismissed."
  },
  {
    "title": "Is Decarbonization Dead?",
    "link": "https://www.nytimes.com/2025/07/25/opinion/ezra-klein-podcast-jesse-jenkins-jane-flegal.html",
    "summary": "Trump just shredded America’s most ambitious climate policy. Jane Flegal and Jesse Jenkins discuss what this means for the future of renewable energy in the U.S."
  },
  {
    "title": "Taiwan Votes in Recall Campaign That Tests China’s Nerves",
    "link": "https://www.nytimes.com/2025/07/25/world/asia/taiwans-recall-china.html",
    "summary": "An unprecedented recall vote could hand President Lai Ching-te more power by ousting legislative opponents. It could also prompt a response from China."
  },
  {
    "title": "Outrage After Alabama 3-Year-Old Dies in Hot Car While in State’s Care",
    "link": "https://www.nytimes.com/2025/07/25/us/alabama-boy-death-hot-car.html",
    "summary": "The boy, who was in foster care, was being transported between a supervised visit and day care, his aunt said. State lawmakers said they were seeking answers and the police were investigating."
  },
  {
    "title": "Why Zelensky Backtracked on His Controversial Law",
    "link": "https://www.nytimes.com/video/world/europe/100000010301803/ukraine-mass-protests-zelensky.html",
    "summary": "Facing growing pressure amid nationwide protests, President Volodymyr Zelensky of Ukraine backtracked on controversial legislation that would have weakened the country’s independent anticorruption institutions. Katrin Bennhold, a senior writer, and Marc Santora, an international news editor for The New York Times, explain the events that led to the reversal."
  },
  {
    "title": "2 Crew Members Are Hurt as Southwest Plane Plunges Abruptly After Takeoff",
    "link": "https://www.nytimes.com/2025/07/25/us/southwest-flight-burbank-injuries.html",
    "summary": "The sudden maneuver was made during a Friday flight out of California after two collision safety alerts sounded in the cockpit, causing the pilots to take evasive action, the airline said."
  },
  {
    "title": "U.S. Conducts Rare Raid in Syria, Killing a Senior Islamic State Leader",
    "link": "https://www.nytimes.com/2025/07/25/us/politics/us-raid-syria-isis.html",
    "summary": "The military gave few details on the ground operation, but counterterrorism raids have typically involved helicopter-borne Special Operations commandos."
  }
]