[
  {
    "title": "The World Wants More Vaccines. An Anti-Vaccine America Isn’t Helping.",
    "link": "https://www.nytimes.com/2025/09/15/world/asia/anti-vaccine-america-world-covid.html",
    "summary": "Most governments are trying to fight vaccine hesitancy with science and investment, while the United States heads in the opposite direction."
  },
  {
    "title": "In an Era of Deep Polarization, Unity Is Not Trump’s Mission",
    "link": "https://www.nytimes.com/2025/09/14/us/politics/trump-kirk-polarization-unity.html",
    "summary": "President Trump does not subscribe to the traditional notion of being president for all Americans."
  },
  {
    "title": "Kirk Shooting Suspect Held ‘Leftist Ideology,’ Utah Governor Says",
    "link": "https://www.nytimes.com/2025/09/14/us/kirk-shooting-suspect-ideology-partner.html",
    "summary": "Gov. Spencer Cox said the suspect had been “radicalized” but did not go into specifics about the suspect’s views."
  },
  {
    "title": "White House Seeks More Supreme Court Security Funding After Kirk Killing",
    "link": "https://www.nytimes.com/2025/09/14/us/politics/trump-security-supreme-court-congress.html",
    "summary": "In a notice to Congress, the Trump administration said the additional $58 million would go to the U.S. Marshals Service. It also said it supported additional security for lawmakers."
  },
  {
    "title": "Did Britain Win the Trade War? Why It’s Tough to Declare a Victor.",
    "link": "https://www.nytimes.com/2025/09/15/business/economy/britain-european-union-tariffs-winner.html",
    "summary": "Popular products from Britain and the European Union show how uneven and unpredictable U.S. tariffs have become, even when part of trade deals."
  },
  {
    "title": "Tariffs Are Uniting Two Whiskey Heavyweights: Scotch and Bourbon",
    "link": "https://www.nytimes.com/2025/09/15/business/trump-tariffs-scotch-whisky-bourbon.html",
    "summary": "Whiskey distillers say their industry is so intertwined that U.S. tariffs will hurt producers on both sides of the Atlantic."
  },
  {
    "title": "15 Best Red Carpet Looks at the Emmys: Pedro Pascal, Selena Gomez, Lisa & More",
    "link": "https://www.nytimes.com/2025/09/14/style/emmys-fashion-red-carpet-looks.html",
    "summary": "Power suits, pixie cuts, bedazzled bodies and more."
  },
  {
    "title": "Emmy Awards Winners 2025: The Full List",
    "link": "https://www.nytimes.com/2025/09/14/arts/television/emmy-winners-list.html",
    "summary": "Here are the winners from the 77th Emmy Awards, which took place Sunday night."
  },
  {
    "title": "Trump’s State Visit Will be Biggest UK Security Operation Since Coronation",
    "link": "https://www.nytimes.com/2025/09/14/world/europe/trump-uk-state-visit-security.html",
    "summary": "The fatal shooting of Charlie Kirk has intensified consideration about potential threats, experts said. British authorities had already made extensive security plans."
  },
  {
    "title": "Trump Administration Claims Vast Powers as It Races to Fire Fed Governor Before Meeting",
    "link": "https://www.nytimes.com/2025/09/14/us/politics/trump-lisa-cook-fed.html",
    "summary": "Trump has forged ahead with his attempts to fire Lisa Cook even as new documents call his claims of mortgage fraud into question."
  },
  {
    "title": "U.S. and China Resume Talks on Tariffs and TikTok",
    "link": "https://www.nytimes.com/2025/09/14/business/us-china-trade-tiktok-negotiations.html",
    "summary": "Economic officials meeting in Madrid are seeking to head off a November tariff deadline."
  },
  {
    "title": "Starvation and Bombs in Besieged Sudanese City As Residents Cry for Help",
    "link": "https://www.nytimes.com/2025/09/15/world/africa/sudan-starving-children.html",
    "summary": "At least 260,000 civilians trapped in El Fasher face a dire choice: risk being starved or bombed if they stay, and raped or killed if they flee."
  },
  {
    "title": "Russia Made Drone Production a Supreme Priority. Now It Swarms the Skies.",
    "link": "https://www.nytimes.com/2025/09/14/world/europe/russia-ukraine-drone-attacks-production.html",
    "summary": "Ukraine is struggling to defend itself against the growing number of attack drones that Moscow has started using in its onslaughts."
  },
  {
    "title": "Pope Leo Says He Cannot Broker a Peace Deal for Ukraine",
    "link": "https://www.nytimes.com/2025/09/14/world/europe/pope-leo-ukraine-peace.html",
    "summary": "Pope Leo XIV said that while popes can be advocates for peace, it was less “realistic” for them to serve as mediators."
  },
  {
    "title": "Romania Says Russian Drone Entered Its Airspace",
    "link": "https://www.nytimes.com/2025/09/14/world/europe/romania-drone-russia-ukraine.html",
    "summary": "It was the second time in less than a week that a Russian drone had flown through a NATO member’s airspace. Last week, NATO scrambled fighter jets to shoot down Russian drones in Polish airspace."
  },
  {
    "title": "Arriving in Israel, Rubio Meets Netanyahu at Jerusalem’s Western Wall",
    "link": "https://www.nytimes.com/2025/09/14/us/politics/israel-rubio-netanyahu-gaza.html",
    "summary": "The secretary of state is visiting Israel to consult with officials on security issues including the war in Gaza, which is testing relations with the United States."
  },
  {
    "title": "Hochul Endorses Mamdani for Mayor of New York",
    "link": "https://www.nytimes.com/2025/09/14/nyregion/hochul-mamdani-mayor-endorsement.html",
    "summary": "Gov. Kathy Hochul of New York backed Zohran Mamdani, the Democratic nominee for mayor, in a New York Times essay. Her support comes as Democrats are starting to coalesce around him."
  },
  {
    "title": "The Insult Comic Who Sells Million-Dollar Homes",
    "link": "https://www.nytimes.com/2025/09/14/business/florida-real-estate-comic.html",
    "summary": "In minute-long video tours of Florida real estate, Breanna Banaciski lampoons the rich — and the upscale houses she wants you to buy."
  },
  {
    "title": "Finding God in the App Store",
    "link": "https://www.nytimes.com/2025/09/14/us/chatbot-god.html",
    "summary": "Millions of people are turning to chatbots to confess their darkest secrets and seek guidance from on high. “Is this actually God I am talking to?”"
  },
  {
    "title": "Introducing: Believing, Our Newsletter on Religion and Spirituality",
    "link": "https://www.nytimes.com/2025/09/14/briefing/charlie-kirk-religion-spirituality.html",
    "summary": "Each week, we’ll be covering how faith shapes our politics, culture and society — and how it’s appearing in new forms."
  },
  {
    "title": "Kathy Hochul: Why I Am Endorsing Zohran Mamdani",
    "link": "https://www.nytimes.com/2025/09/14/opinion/hochul-endorsement-mamdani.html",
    "summary": "I am confident that Mamdani has the courage, urgency and optimism New York City needs to lead it through the challenges of this moment."
  },
  {
    "title": "How Trump Can Prevent a War Over Taiwan",
    "link": "https://www.nytimes.com/2025/09/15/opinion/taiwan-china-war-trump.html",
    "summary": "The current collision course was never inevitable, and Trump’s penchant for defying norms could help ensure peace."
  },
  {
    "title": "Protests Against an Israeli Cycling Team Shut Down a Major Race",
    "link": "https://www.nytimes.com/2025/09/14/world/canada/cycling-palestinian-protests.html",
    "summary": "The final day of the three-week long Vuelta a España came to a premature end as pro-Palestinian protesters blocked streets."
  },
  {
    "title": "Postcard Sent From the U.N. Is Returned to Sender After 72 Years",
    "link": "https://www.nytimes.com/2025/09/14/us/lost-postcard-united-nations.html",
    "summary": "Alan Ball sent the postcard to his family during the summer of 1953. Last week, it arrived at his home in Idaho."
  },
  {
    "title": "Bobby Hart, Who Helped Give the Monkees Their Music, Dies at 86",
    "link": "https://www.nytimes.com/2025/09/14/obituaries/bobby-hart-dead.html",
    "summary": "The hit songwriting duo he and Tommy Boyce formed in the 1960s was best known for the unexpectedly popular tunes of a made-for-TV band."
  },
  {
    "title": "Zoom’s Boom Days Are Over. What Comes Next?",
    "link": "https://www.nytimes.com/2025/09/14/business/zoom-meetings-eric-yuan.html",
    "summary": "Eric Yuan, who saw the firm he founded become a household name during the pandemic, is trying to change the way people use the platform."
  }
]