[
  {
    "title": "Bondi Suspects Were in Southern Philippines, Where ISIS Is Active",
    "link": "https://www.nytimes.com/2025/12/16/world/asia/bondi-shooting-gunmen-philippines-isis.html",
    "summary": "It remains unclear what the two men did there last month."
  },
  {
    "title": "In Sydney Suburb Where Suspects Lived, Neighbor Saw ‘No Dramas’",
    "link": "https://www.nytimes.com/2025/12/16/world/australia/sydney-bondi-suspects-neighborhood-bonnyrigg.html",
    "summary": "He said the people in the house were relatively new to the area and largely kept to themselves."
  },
  {
    "title": "At a Dark Moment, Jews in New York Celebrate the Festival of Lights",
    "link": "https://www.nytimes.com/2025/12/15/nyregion/hanukkah-menorah-nyc-jews-australia.html",
    "summary": "After the mass shooting at a Hanukkah celebration in Sydney, Australia, Jewish New Yorkers said they felt the need to stand up for their community."
  },
  {
    "title": "ISIS ‘Ideology’ Is Linked to Australia Killings, and Trump Files New $10 Billion Lawsuit",
    "link": "https://www.nytimes.com/2025/12/16/podcasts/the-headlines/isis-australia-trump-lawsuit.html",
    "summary": "Plus, how foreign patients are paying for U.S. organs."
  },
  {
    "title": "Nick Reiner’s Struggles With Drugs Left His Parents ‘Desperate’",
    "link": "https://www.nytimes.com/2025/12/15/movies/nick-reiner-drugs-rehab-heroin-cocaine.html",
    "summary": "Mr. Reiner, who was arrested in connection with the deaths of Rob and Michele Reiner, once estimated he had been in drug treatment 18 times as a teenager."
  },
  {
    "title": "Trump’s Post Attacking Rob Reiner After Stabbing Death Draws Immediate Outrage",
    "link": "https://www.nytimes.com/2025/12/15/us/politics/trump-rob-reiner.html",
    "summary": "The president attributed the killing to “Trump derangement syndrome,” but his disparaging comments drew backlash even from conservative allies who said they were inappropriate."
  },
  {
    "title": "Venezuela’s Oil Is a Focus of Trump’s Campaign Against Maduro",
    "link": "https://www.nytimes.com/2025/12/16/us/politics/trump-maduro-venezuela-oil-tanker.html",
    "summary": "In public, the White House says it is confronting Venezuela to curb drug trafficking. Behind the scenes, gaining access to the country’s vast oil reserves is a priority."
  },
  {
    "title": "U.S. Strikes 3 More Boats in Eastern Pacific, Killing 8",
    "link": "https://www.nytimes.com/2025/12/15/us/politics/drug-boat-strikes-pacific.html",
    "summary": "The attacks brought the number killed since the Trump administration began the strikes on suspected drug smugglers to at least 95."
  },
  {
    "title": "Donald Trump Jr. Is Engaged to Bettina Anderson, a Palm Beach Socialite",
    "link": "https://www.nytimes.com/2025/12/15/us/donald-trump-jr-engaged-bettina-anderson.html",
    "summary": "The relationship between the president’s son and Ms. Anderson had been the subject of tabloid speculation during his previous engagement to Kimberly Guilfoyle."
  },
  {
    "title": "The Untold Story of How Jeffrey Epstein Got Rich",
    "link": "https://www.nytimes.com/2025/12/16/magazine/jeffrey-epstein-money-scams-investigation.html",
    "summary": "For years, rumors swirled about where his wealth came from. A Times investigation reveals the truth of how a college dropout clawed his way to the pinnacle of American finance and society."
  },
  {
    "title": "How Jeffrey Epstein Made His Money: Six Takeaways From The Times’ Investigation",
    "link": "https://www.nytimes.com/2025/12/16/magazine/jeffrey-epstein-wealth-origins-investigation-takeaways.html",
    "summary": "The sources of Epstein’s fortune have long been a source of speculation. Here are six takeaways from a Times investigation that found that he built it through scams, theft and lies."
  },
  {
    "title": "Who Is the Ultimate Onscreen Mr. Darcy From ‘Pride and Prejudice’?",
    "link": "https://www.nytimes.com/2025/12/16/books/mr-darcy-pride-and-prejudice-jane-austen.html",
    "summary": "Welcome to our Regency Thunderdome, where we will endeavor to answer this question once and for all."
  },
  {
    "title": "Brown Shooting Tests a Fragile Trust on Campus",
    "link": "https://www.nytimes.com/2025/12/16/us/brown-shooting-campus-trust.html",
    "summary": "The Ivy League school has faced a series of challenges related to protests and politics. Through it all, it has kept its gates open to the city and tried to heal divisions on campus."
  },
  {
    "title": "Days After Brown University Shooting, a Community Is in a Standstill",
    "link": "https://www.nytimes.com/2025/12/16/us/brown-university-shooting-students-providence.html",
    "summary": "As a manhunt for a gunman who killed two and injured nine at Brown University stretched into a third day, residents and officials alike were growing weary."
  },
  {
    "title": "FBI Director Kash Patel, Eager for Spotlight, Casts Aside Caution in Social Media Posts",
    "link": "https://www.nytimes.com/2025/12/15/us/politics/kash-patel-fbi.html",
    "summary": "Kash Patel’s impulse to publicize the work of the bureau under his leadership has revived questions about his competence and his future in the administration."
  },
  {
    "title": "Jobs Data Is Finally Back. But the Economic Picture Is Still Blurry.",
    "link": "https://www.nytimes.com/2025/12/16/business/jobs-data-economy.html",
    "summary": "November’s job report may be distorted as a result of the government shutdown, limiting how much it will influence the Federal Reserve’s next interest rate decision in January."
  },
  {
    "title": "U.S. Transplant Hospitals Court Patients Overseas Despite Organ Shortage",
    "link": "https://www.nytimes.com/2025/12/16/us/organ-transplants-international-patients.html",
    "summary": "International patients can bring a hospital as much as $2 million for a transplant. In recent years, they have typically gotten organs faster than U.S. patients."
  },
  {
    "title": "A Push for More Organ Transplants Is Putting Donors at Risk",
    "link": "https://www.nytimes.com/2025/07/20/us/organ-transplants-donors-alive.html",
    "summary": "People across the United States have endured rushed or premature attempts to remove their organs. Some were gasping, crying or showing other signs of life."
  },
  {
    "title": "This Week Is Pivotal for Ukraine, and for Europe’s Voice in Its Future",
    "link": "https://www.nytimes.com/2025/12/16/world/europe/ukraine-war-europe-russia-frozen-assets.html",
    "summary": "Often left out by the United States in peace negotiations, European countries are working to assert their leadership and bolster Ukraine with an ambitious funding plan. But can they agree?"
  },
  {
    "title": "Ukraine Claims First Strike by Underwater Drone on Russian Submarine",
    "link": "https://www.nytimes.com/2025/12/15/world/europe/ukraine-russia-submarine-drones.html",
    "summary": "As it tries to demonstrate its continuing ability to fight, Ukraine said it had used drones to inflict serious damage on a Russian Kilo-class submarine at a Black Sea port."
  },
  {
    "title": "Ukraine and Allies Agree on Security Guarantee for Peace Proposal",
    "link": "https://www.nytimes.com/2025/12/15/world/europe/zelensky-berlin-ukraine-witkoff-russia-peace-talks.html",
    "summary": "Crucial details on the future security of Ukraine remain unsettled as negotiators seek a deal that Russia will approve."
  },
  {
    "title": "Volkswagen to End Production at German Plant, a First in Company History",
    "link": "https://www.nytimes.com/2025/12/16/business/volkswagen-dresden-factory-closed.html",
    "summary": "The auto giant stopped making cars at the plant in Dresden, which opened in 2001, as it faces weaker demand and steep U.S. tariffs."
  },
  {
    "title": "Ford Will Take $19.5 Billion Hit as It Rolls Back E.V. Plans",
    "link": "https://www.nytimes.com/2025/12/15/business/ford-electric-vehicles-hybrids.html",
    "summary": "Ford Motor said the costs came from its decision to make fewer electric vehicles than it had planned and more hybrids that use both gasoline engines and batteries."
  },
  {
    "title": "Joe Ely, Texas-Born Troubadour of the Open Road, Dies at 78",
    "link": "https://www.nytimes.com/2025/12/15/obituaries/joe-ely-dead.html",
    "summary": "Thanks to his eclectic style and tireless touring, he was among the most influential artists in the early days of Americana and alt-country music."
  },
  {
    "title": "Three Opinion Writers Chat About Rob Reiner’s Life and Work",
    "link": "https://www.nytimes.com/2025/12/16/opinion/rob-reiner-career-movies-hollywood-roundtable.html",
    "summary": "Jamelle Bouie, Michelle Cottle and Ross Douthat chat with Stephen Stromberg about Rob Reiner’s legacy."
  },
  {
    "title": "Why Both Republicans and Democrats Are Wrong About Health Care",
    "link": "https://www.nytimes.com/2025/12/16/opinion/republicans-democrats-health-care.html",
    "summary": "The real issue is how to address overall cost. Haggling over Obamacare subsidies or what might replace them isn’t the solution."
  },
  {
    "title": "Late Night Pays Tribute to Rob Reiner",
    "link": "https://www.nytimes.com/2025/12/16/arts/television/late-night-tribute-rob-reiner.html",
    "summary": "Seth Meyers also scorned President Trump’s Truth Social post about the celebrated filmmaker’s death."
  },
  {
    "title": "Uber and DoorDash Try to Halt N.Y.C. Law That Encourages Tipping",
    "link": "https://www.nytimes.com/2025/12/16/nyregion/uber-doordash-nyc-tipping.html",
    "summary": "The two food-delivery app companies filed a lawsuit against new rules, starting in January, that require food-delivery apps  to provide a tipping option at checkout."
  },
  {
    "title": "Anthony Geary, Luke on ‘General Hospital,’ Dies at 78",
    "link": "https://www.nytimes.com/2025/12/15/arts/television/anthony-geary-dead.html",
    "summary": "Portraying Luke Spencer, he was one of the best-known soap opera stars in American television. His onscreen romance with Laura Webber, played by Genie Francis, changed the landscape of daytime television."
  },
  {
    "title": "In New Dementia Trials, Ozempic’s ‘Miracle Drug’ Image Takes a Hit",
    "link": "https://www.nytimes.com/2025/12/16/well/dementia-alzheimers-ozempic-glp-1.html",
    "summary": "The drug failed to slow the progression of early Alzheimer’s. Experts are trying to understand why."
  },
  {
    "title": "Flu Cases Skyrocket in New York City, Earlier Than Expected",
    "link": "https://www.nytimes.com/2025/12/16/nyregion/flu-cases-nyc.html",
    "summary": "The city and surrounding region have some of the highest levels of flu-like illness in the United States."
  }
]