[
  {
    "title": "Judge Tosses Criminal Charges Against James Comey and Letitia James",
    "link": "https://www.nytimes.com/2025/11/24/nyregion/james-comey-case-dismissed.html",
    "summary": "The decision is a setback for the president’s efforts to wield the criminal justice system against his perceived enemies."
  },
  {
    "title": "U.S. and Ukraine Hail Progress on Peace Plan to End War With Russia",
    "link": "https://www.nytimes.com/2025/11/24/world/europe/ukraine-zelensky-rubio-russia-peace-plan.html",
    "summary": "Washington and Kyiv said that “highly productive” discussions over a proposal to end the war between Russia and Ukraine would continue."
  },
  {
    "title": "Army Chief Says France Must ‘Accept Losing Our Children,’ Igniting Uproar",
    "link": "https://www.nytimes.com/2025/11/24/world/europe/france-voluntary-military-service.html",
    "summary": "The furor erupted as President Emmanuel Macron is expected to present a plan for paid, voluntary military service to bolster the armed forces against the threat from Russia."
  },
  {
    "title": "Trump Is Considering Push to Extend Obamacare Subsidies",
    "link": "https://www.nytimes.com/2025/11/24/us/politics/trump-obamacare-subsidies-health-care.html",
    "summary": "President Trump has not made a final decision. But he is under pressure to address the cost of health care, which for many Americans will jump if the subsidies expire."
  },
  {
    "title": "How the Coast Guard Revised Its Policy on Swastikas, Nooses and Bullying",
    "link": "https://www.nytimes.com/2025/11/24/us/coast-guard-hate-policy.html",
    "summary": "After days of backlash, the Homeland Security Department said hateful and violent behavior would not be tolerated."
  },
  {
    "title": "Xi Presses Trump on Taiwan as They Agree to Meet in China in April",
    "link": "https://www.nytimes.com/2025/11/24/business/economy/trump-xi-meeting-china.html",
    "summary": "In an unusual move, Xi Jinping, the leader of China, called President Trump. The two spoke about trade, Taiwan and Ukraine, according to separate official statements."
  },
  {
    "title": "Easy Thanksgiving Recipes | Thanksgiving Recipes 2025 | NYT Cooking",
    "link": "https://cooking.nytimes.com/article/easy-thanksgiving-recipes",
    "summary": "These simple recipes for roast turkey, stuffing, pie crust and more will set you up for a spectacular meal."
  },
  {
    "title": "An Auto Holy Grail: Motors That Don’t Rely on Chinese Rare Earths",
    "link": "https://www.nytimes.com/2025/11/24/business/automakers-rare-earth-minerals-magnets.html",
    "summary": "Weary of being captive to geopolitics, car companies are looking for ways to replace powerful rare-earth magnets in electric motors."
  },
  {
    "title": "Amid GPS and Ride-Hailing, the Allure of London’s Black Cab Endures",
    "link": "https://www.nytimes.com/2025/11/24/world/europe/london-black-cab-taxi-driving-test.html",
    "summary": "In a world of GPS and car-hailing apps, some Londoners still want to drive a traditional black cab. First, they must memorize thousands of city streets."
  },
  {
    "title": "Venezuelan Diaspora Divided on Trump’s Military Strategy",
    "link": "https://www.nytimes.com/2025/11/24/us/venezuelan-diaspora-critics-us-military-intervention.html",
    "summary": "President Trump’s military actions and immigration policies have divided Venezuelans in South Florida, many of whom fled the Maduro regime."
  },
  {
    "title": "Health Issues in Middle Age Can Be Linked to Pregnancy Years Earlier",
    "link": "https://www.nytimes.com/2025/11/24/well/pregnancy-complications-heart-health.html",
    "summary": "Women with common pregnancy complications are at increased risk for cardiovascular and metabolic health problems later in life. But many patients remain unaware of the connection."
  },
  {
    "title": "Sleep Apnea Linked to Parkinson’s Disease, New Study Finds",
    "link": "https://www.nytimes.com/2025/11/24/well/mind/sleep-apnea-parkinsons-disease.html",
    "summary": "Those with the sleep condition were more likely to develop Parkinson’s disease. But one treatment was found to help."
  },
  {
    "title": "Ozempic Drug Fails to Quell Alzheimer’s in Novo Nordisk Trials",
    "link": "https://www.nytimes.com/2025/11/24/health/ozempic-wegovy-alzheimers-novo-nordisk.html",
    "summary": "The studies were a significant setback for the optimistic view that semaglutide and other GLP-1 drugs could help prevent a number of brain diseases."
  },
  {
    "title": "Viola Fletcher, Oldest Survivor of the Tulsa Race Massacre, Dies at 111",
    "link": "https://www.nytimes.com/2025/11/24/us/viola-fletcher-dead.html",
    "summary": "At 7, she bore witness to one of American history’s most violent spasms of racial violence. She was 106 when the nation reckoned with the crime."
  },
  {
    "title": "Ted Danson and Mary Steenburgen Star in a Love Story, Onscreen and Off",
    "link": "https://www.nytimes.com/2025/11/24/arts/television/ted-danson-and-mary-steenburgen-man-on-the-inside.html",
    "summary": "Married for three decades, the actors get together as characters in the second season of “A Man on the Inside.”"
  },
  {
    "title": "In Nebraska, Makeovers for Buildings That Don’t Price Out the Locals",
    "link": "https://www.nytimes.com/2025/11/18/climate/nebraska-energy-efficiency.html",
    "summary": "In a struggling area of Lincoln, a program pays for repairs and energy efficiency upgrades in rental buildings. In return, landlords must keep rents affordable."
  },
  {
    "title": "5 Minutes That Will Make You Love Musicals",
    "link": "https://www.nytimes.com/2025/11/24/theater/musicals-broadway-theater-hamilton.html",
    "summary": "Andrew Lloyd Webber, Sara Bareilles, Joshua Henry, Jeanine Tesori, Jason Robert Brown and New York Times writers and editors pick 13 songs to seal the deal."
  },
  {
    "title": "The Incomprehensible March Toward Regime Change in Venezuela",
    "link": "https://www.nytimes.com/2025/11/24/opinion/venezuela-trump-regime-change.html",
    "summary": "The administration’s drug war rhetoric seems like a pretext. But a pretext for what?"
  },
  {
    "title": "America’s Caregivers Are in Crisis",
    "link": "https://www.nytimes.com/2025/11/24/opinion/caregiving-crisis.html",
    "summary": "Caregivers are at the brink of despair."
  },
  {
    "title": "Judge dismisses Comey and James cases",
    "link": "https://www.nytimes.com/2025/11/24/briefing/comey-ukraine-cliff.html",
    "summary": "Also, why kids in American classrooms are struggling. Here’s the latest at the end of Monday."
  },
  {
    "title": "Shoppers, Tell Us About Customs Duties on Items Bought From Overseas",
    "link": "https://www.nytimes.com/2025/11/21/business/shopping-customs-costs-overseas.html",
    "summary": "It’s gift-giving season, and we want to speak to people in the United States who are buying items from other countries."
  },
  {
    "title": "Former Senator Doug Jones Enters Alabama Governor’s Race",
    "link": "https://www.nytimes.com/2025/11/24/us/politics/doug-jones-alabama-governors-race.html",
    "summary": "The move sets up a possible rematch between Mr. Jones, the last Democrat to win statewide office in Alabama, and Tommy Tuberville, the Republican who ousted him from the Senate in 2020."
  },
  {
    "title": "Gaza Humanitarian Foundation Is Closing",
    "link": "https://www.nytimes.com/2025/11/24/world/middleeast/ghf-gaza-closing.html",
    "summary": "The Gaza Humanitarian Foundation said it had succeeded in delivering million of meals in the war-torn enclave, but some Palestinians were killed trying to obtain them."
  },
  {
    "title": "Here’s Where Weather May Slow Your Thanksgiving Travel This Week",
    "link": "https://www.nytimes.com/2025/11/24/weather/thanksgiving-forecast-snow-cold-rain.html",
    "summary": "Some storms could make for sloppy travel before the holiday."
  },
  {
    "title": "‘Queen of Versailles’ to Close as New Broadway Musicals Struggle",
    "link": "https://www.nytimes.com/2025/11/24/theater/queen-of-versailles-broadway-closing.html",
    "summary": "The show, starring Kristin Chenoweth, will remain open through the holidays. The announcement comes just two weeks after the musical opened."
  }
]