[
  {
    "title": "D.H.S.’s Role Questioned as Immigration Officers Flood U.S. Cities",
    "link": "https://www.nytimes.com/2026/01/18/us/dhs-cities-bush-sept-11.html",
    "summary": "The Department of Homeland Security was formed after 9/11 amid international terrorism threats. Now, its most visible targets are domestic."
  },
  {
    "title": "Inside Trump’s Deportation Machine",
    "link": "https://www.nytimes.com/video/us/politics/100000010652139/inside-trumps-deportation-machine.html",
    "summary": "Data obtained by The New York Times illustrates the differences between President Trump’s and President Biden’s approaches to deportations. Our data reporter Albert Sun describes what we found."
  },
  {
    "title": "Conservative Influencer Chased From Minneapolis Streets by Counterprotesters",
    "link": "https://www.nytimes.com/2026/01/17/us/minneapolis-protests-immigration-fraud.html",
    "summary": "A protest at City Hall was organized by a conservative influencer to draw attention to a fraud scandal in the state. He was chased by counterprotesters lobbing water balloons in frigid temperatures."
  },
  {
    "title": "National Anger Spills Into Target Stores, Again",
    "link": "https://www.nytimes.com/2026/01/17/business/target-immigration-minneapolis.html",
    "summary": "Videos of immigration officers dragging an employee out of a store near Minneapolis, the retailer’s hometown, set off renewed political debate after years of boycotts."
  },
  {
    "title": "After Trump Reignites a Trade War Over Greenland, Europe Weighs Going All-Out",
    "link": "https://www.nytimes.com/2026/01/18/world/europe/greenland-us-trade-war.html",
    "summary": "Europe’s dependence on the United States for NATO security limits its options. Its strongest response could be retaliating with its own trade “bazooka.”"
  },
  {
    "title": "Under Patel, F.B.I. Scours Its Records to Discredit Trump Opponents",
    "link": "https://www.nytimes.com/2026/01/18/us/politics/kash-patel-grassley-payback.html",
    "summary": "As the F.B.I. has added payback to its portfolio, Republican lawmakers like Senator Charles E. Grassley have emerged as a clearinghouse for leaks and whistle-blowers."
  },
  {
    "title": "White House Warns CBS: Air Trump Interview in Full, or ‘We’ll Sue’",
    "link": "https://www.nytimes.com/2026/01/17/business/media/cbs-news-trump-interview.html",
    "summary": "In previously unreported remarks, the White House press secretary Karoline Leavitt told CBS News that Mr. Trump would “sue” the news outlet if it did not air an interview unedited."
  },
  {
    "title": "Greenlanders Protest Trump’s Takeover Plans",
    "link": "https://www.nytimes.com/2026/01/17/world/europe/greenland-denmark-protest-trump-takeover.html",
    "summary": "Protests erupted in several Greenlandic cites and in Denmark as President Trump intensified his efforts to take control of the Arctic island."
  },
  {
    "title": "The Biggest Challenge in Venezuela Is Soaring Food Prices",
    "link": "https://www.nytimes.com/2026/01/18/world/americas/venezuela-economy-food-prices.html",
    "summary": "Economic instability in Venezuela after the U.S. raid to capture its president is deepening inflation and rattling the currency, sending grocery bills soaring for millions of people."
  },
  {
    "title": "Mamdani Said He’d Make Buses Faster and Free. Now It’s This Guy’s Job to Do It.",
    "link": "https://www.nytimes.com/2026/01/18/nyregion/mike-flynn-nyc-transportation-commissioner.html",
    "summary": "Mike Flynn, a former intern who rose to the top of the agency, will be under a microscope, but far from the spotlight."
  },
  {
    "title": "Psst, Mayor Mamdani: The Upper East Side Is More Fun Than People Think",
    "link": "https://www.nytimes.com/2026/01/18/nyregion/zohran-mamdani-upper-east-side.html",
    "summary": "Beyond stuffy old money and noisy sports bars, hidden gems abound."
  },
  {
    "title": "One Year of Trump. The Time to Act Is Now, While We Still Can.",
    "link": "https://www.nytimes.com/2026/01/18/opinion/trump-one-year-later.html",
    "summary": "The United States is broken, but not in every way."
  },
  {
    "title": "Trump’s Greenland Threats Will Boomerang on America",
    "link": "https://www.nytimes.com/2026/01/18/opinion/trump-greenland-nato.html",
    "summary": "A territorial grab by the United States would mean the end of NATO."
  },
  {
    "title": "These Are the 12 States Vying to Kick Off Democrats’ 2028 Contest",
    "link": "https://www.nytimes.com/2026/01/17/us/politics/2028-democratic-primary-states-iowa-south-carolina-nevada-new-hampshire.html",
    "summary": "There were a few surprises, and subtle regional digs, as Democratic state parties angled for early spots on the next presidential primary calendar. The New York Times reviewed their applications."
  },
  {
    "title": "France’s Embassy in Iraq Is a Spoil of Antisemitism, Jewish Family Charges",
    "link": "https://www.nytimes.com/2026/01/18/world/middleeast/jewish-family-iraq-embassy-.html",
    "summary": "A Jewish family that fled Iraq generations ago rented its home to France for use as an embassy, but Paris long ago stopped paying it rent, after Iraq stripped Jews of property."
  },
  {
    "title": "How a Screwdriver Salesman Helped Fuel U.S. Airstrikes in Nigeria",
    "link": "https://www.nytimes.com/2026/01/18/world/africa/nigeria-christmas-bombing-republicans.html",
    "summary": "Spotty research from a Christian activist has been used by Republican lawmakers to justify U.S. intervention in the country."
  }
]