[
  {
    "title": "Some Americans Are Starting to Feel the Impact of the Government Shutdown",
    "link": "https://www.nytimes.com/2025/10/11/us/politics/government-shutdown-effects.html",
    "summary": "The Trump administration said over 4,000 workers would be laid off. Farmers trying to plan next year’s crops don’t have all the tools they need. Some medical services have been curtailed in Native communities."
  },
  {
    "title": "How the Government Shutdown Will Be Felt",
    "link": "https://www.nytimes.com/video/us/politics/100000010447931/how-the-government-shutdown-will-be-felt.html",
    "summary": "The effects of a shutdown tend to unfold in stages. As agencies, departments and federal employees figure out how to weather the storm, Karoun Demirjian, a Times reporter, explains what to know."
  },
  {
    "title": "Trump’s Shutdown Layoffs Deepen Impasse, Angering Democrats",
    "link": "https://www.nytimes.com/2025/10/11/us/politics/trump-government-shutdown-layoffs-democrats.html",
    "summary": "The president’s move to fire federal workers and his threats to make others go without pay were aimed at pressuring Democrats to cut a deal to reopen the government. The tactics have fueled Democrats’ resolve."
  },
  {
    "title": "The Trump Split Screen: A Peacemaker Abroad, a Retribution Campaign at Home",
    "link": "https://www.nytimes.com/2025/10/10/us/politics/trump-peace-retribution.html",
    "summary": "President Trump’s dueling personas were on display this week, providing endless ammunition to his allies and his enemies alike."
  },
  {
    "title": "Trump’s Aides and Officials Take Political Battles Online",
    "link": "https://www.nytimes.com/2025/10/10/style/trump-officials-social-media.html",
    "summary": "President Trump’s long, avid embrace of social media has been eagerly adopted by his top aides, replacing longstanding governmental norms with online ones."
  },
  {
    "title": "A Memo in a Bunker, Intercepted Communications and Hamas’s Oct. 7 Plans",
    "link": "https://www.nytimes.com/2025/10/11/world/middleeast/israel-hamas-plans.html",
    "summary": "A directive, which Israeli officials believe was written by Yahya Sinwar, the powerful leader of Hamas in Gaza, and recordings called for fighters to target soldiers and civilian communities — and to broadcast the violent acts."
  },
  {
    "title": "Thousands Return to Northern Gaza, Hopeful, but Faced With Devastation",
    "link": "https://www.nytimes.com/2025/10/11/world/middleeast/return-gaza-city-ceasefire.html",
    "summary": "With the cease-fire holding overnight, many Palestinians continued to travel toward Gaza City on Saturday to learn what remained of their lives and homes."
  },
  {
    "title": "At the Center of Letitia James’s Indictment, a House in Norfolk, Virginia",
    "link": "https://www.nytimes.com/2025/10/11/us/politics/letitia-james-indictment-house.html",
    "summary": "Attorney General Letitia James of New York purchased the $137,000 home for a grandniece who needed tranquillity. Prosecutors say it is an impermissible investment property."
  },
  {
    "title": "China Flexed. Trump Hit Back. So Much for the Thaw.",
    "link": "https://www.nytimes.com/2025/10/11/world/asia/china-trump-tariff-threat.html",
    "summary": "Beijing’s trade curbs and President Trump’s tariff threats show how quickly calm can give way to confrontation between the two largest economies."
  },
  {
    "title": "Trump Threatens 100% Tariffs on Chinese Goods",
    "link": "https://www.nytimes.com/2025/10/10/us/politics/trump-xi-china-tariffs-rare-earth.html",
    "summary": "The president made the threat after Beijing imposed new global restrictions on the use of rare earth minerals, which are vital supplies for U.S. makers of chips and batteries."
  },
  {
    "title": "How China Powers Its Electric Cars and High-Speed Trains",
    "link": "https://www.nytimes.com/2025/10/11/business/china-electric-grid.html",
    "summary": "China is building a network of ultrahigh-voltage power lines to carry solar and wind energy hundreds and even thousands of miles as few citizens dare to protest."
  },
  {
    "title": "Search After Tennessee Explosion Finds No Survivors, Officials Say",
    "link": "https://www.nytimes.com/2025/10/11/us/tennessee-munitions-plant-explosion-deaths.html",
    "summary": "Local authorities said earlier that 18 people were missing after the blast at the ammunition plant. On Saturday, they said they were looking for remains."
  },
  {
    "title": "Tennessee Plant Where Explosion Took Place Employs Many in the Region",
    "link": "https://www.nytimes.com/2025/10/11/us/tennessee-plant-explosion-hickman-humphreys-counties.html",
    "summary": "The plant owned by Accurate Energetic Systems has long been an economic bedrock for families in rural Hickman and Humphreys Counties."
  },
  {
    "title": "Peace in Trump’s Time — Except Here",
    "link": "https://www.nytimes.com/2025/10/11/opinion/trump-nobel-peace-prize.html",
    "summary": "Peace abroad and war at home — not very America first!"
  },
  {
    "title": "Our Beautiful Portland Hellscape",
    "link": "https://www.nytimes.com/2025/10/11/opinion/portland-trump-troops.html",
    "summary": "With the millions being used to deploy troops to Portland, Trump could help with treatment for substance use, with emergency housing, with education."
  },
  {
    "title": "Following Through",
    "link": "https://www.nytimes.com/2025/10/11/briefing/following-through.html",
    "summary": "We love it when people cancel plans, but the cost may be steeper than we realize."
  },
  {
    "title": "At Least 4 Dead, 12 Wounded in Mississippi Shooting After Homecoming Game, Official Says",
    "link": "https://www.nytimes.com/2025/10/11/us/leland-mississippi-mass-shooting.html",
    "summary": "It was unclear what led to the shooting in Leland, Miss., which happened as the city was celebrating homecoming weekend, the mayor said."
  },
  {
    "title": "Nor’Easter Forecast: A Strong Storm Threatens the East Coast With Flooding",
    "link": "https://www.nytimes.com/2025/10/11/weather/new-york-noreaster-nj-east-coast-forecast.html",
    "summary": "Messy weather is headed for New York City and New Jersey, with up to three inches of rain possible. Power failures and road closures are possible with this storm, forecasters said."
  },
  {
    "title": "Biden Is Receiving Radiation Therapy for Cancer",
    "link": "https://www.nytimes.com/2025/10/11/us/politics/biden-cancer-radiation.html",
    "summary": "The former president, who was diagnosed with an aggressive form of prostate cancer in May, also had a cancerous lesion removed from his forehead recently."
  }
]