[
  {
    "title": "What We Know About a Second Fatal ICE Shooting in Minneapolis",
    "link": "https://www.nytimes.com/2026/01/24/us/politics/second-ice-shooting-minneapolis.html",
    "summary": "Federal agents shot and killed a 37-year-old Minneapolis resident on Saturday, the city’s police chief said."
  },
  {
    "title": "Scenes From the Winter Storm",
    "link": "https://www.nytimes.com/2026/01/24/us/winter-storm-snow-photos-videos.html",
    "summary": "Images from across much of the country illuminate snow-covered streets and preparations for worse still to come."
  },
  {
    "title": "Major U.S. Public Transit Systems Brace for Storm With Detours and Warnings",
    "link": "https://www.nytimes.com/2026/01/25/weather/winter-storm-public-transit-new-york-philadelphia.html",
    "summary": "Officials in several cities, including Boston, New York and Philadelphia, advised residents to avoid traveling if possible through the weekend."
  },
  {
    "title": "The Woman Who Stands Between Donald Trump and Greenland",
    "link": "https://www.nytimes.com/2026/01/25/world/europe/mette-frederiksen-denmark-greenland.html",
    "summary": "Mette Frederiksen, Denmark’s leader, has taken big risks standing up to Mr. Trump. It might just be working — for now."
  },
  {
    "title": "Trump Pushes A.I. Data Centers, but the G.O.P. Is Cool to One in Alabama",
    "link": "https://www.nytimes.com/2026/01/25/us/politics/trump-ai.html",
    "summary": "Residents also oppose a data center the size of 18 Walmarts that is set to be built in pristine woodland outside Bessemer, Ala. “All this will be gone,” one said."
  },
  {
    "title": "How Iran Crushed a Citizen Uprising With Lethal Force",
    "link": "https://www.nytimes.com/2026/01/25/world/middleeast/iran-how-crackdown-was-done.html",
    "summary": "After scattered protests started last month, Iranians revolted en masse. The security forces cracked down, and the death toll has now reached 5,200."
  },
  {
    "title": "He Helped Make Mamdani. Can He Make Others?",
    "link": "https://www.nytimes.com/2026/01/25/style/morris-katz-political-strategest-mamdani.html",
    "summary": "Part casting director, part media guru, Morris Katz is behind the biggest Democratic campaigns this cycle."
  },
  {
    "title": "State Terror Has Arrived",
    "link": "https://www.nytimes.com/2026/01/24/opinion/state-terror-has-arrived.html",
    "summary": "Minneapolis has made it plain."
  },
  {
    "title": "Trump Just Proved Mark Carney’s Point",
    "link": "https://www.nytimes.com/2026/01/25/opinion/trump-carney-davos-canada-greenland.html",
    "summary": "Canada’s prime minister sees the president all too well."
  },
  {
    "title": "In Venezuela, Families Search for Relatives Who Are Detained and Missing",
    "link": "https://www.nytimes.com/2026/01/25/world/americas/in-venezuela-families-search-for-relatives-who-are-detained-and-missing.html",
    "summary": "Even as dozens of political prisoners have been freed, at least 66 people taken by state authorities and never heard from again remain missing, relatives and rights groups say."
  },
  {
    "title": "Why Japan’s Leader Won’t Enter the Male-Dominated Sumo Ring",
    "link": "https://www.nytimes.com/2026/01/25/world/asia/japan-takaichi-sumo-gender.html",
    "summary": "Sanae Takaichi, the first woman to lead Japan as prime minister, skipped a sumo awards ceremony, reflecting her cautious approach to gender issues."
  },
  {
    "title": "Alex Honnold Climbs Taipei 101 Skyscraper in Taiwan",
    "link": "https://www.nytimes.com/2026/01/23/world/asia/climbing-buildings-skyscrapers-alex-honnold.html",
    "summary": "Alex Honnold, who climbed a 1,667-foot-tall skyscraper in Taiwan on Sunday, is one of a dozen or so known skyscraper climbers worldwide."
  },
  {
    "title": "Pro-Israel Group Targets a Former Ally in an Early Congressional Race",
    "link": "https://www.nytimes.com/2026/01/25/nyregion/new-jersey-malinowski-israel-aipac.html",
    "summary": "A super PAC affiliated with the American Israel Public Affairs Committee is running ads against Tom Malinowski, who is hoping to replace Gov. Mikie Sherrill of New Jersey in the House."
  }
]