[
  {
    "title": "At Turning Point Fest, Vance Refuses to Take Sides in Fight Over Bigotry",
    "link": "https://www.nytimes.com/2025/12/21/us/politics/vance-republicans-trump-antisemitism.html",
    "summary": "The vice president’s plea for a big-tent coalition at an annual conservative gathering belied the cracks in his party over antisemitism, racism and conspiracy theories."
  },
  {
    "title": "‘60 Minutes’ Pulled a Segment. A Correspondent Calls It ‘Political.’",
    "link": "https://www.nytimes.com/2025/12/21/business/60-minutes-trump-bari-weiss.html",
    "summary": "Sharyn Alfonsi, a “60 Minutes” correspondent, criticized the network’s decision to remove her reporting from Sunday’s edition of the show."
  },
  {
    "title": "What to Know About the Latest Epstein Files, and a Flood of U.S. Guns to Canada",
    "link": "https://www.nytimes.com/2025/12/22/podcasts/the-headlines/epstein-files-american-guns-in-canada.html",
    "summary": "Plus, a day of Waymo chaos in San Francisco."
  },
  {
    "title": "What We Know About U.S. Interceptions of Oil Tankers in Venezuela",
    "link": "https://www.nytimes.com/2025/12/22/us/politics/trump-oil-tankers-venezuela.html",
    "summary": "A Venezuela-bound vessel fled after rebuffing an attempt by the Coast Guard to seize it, the latest twist in the escalating U.S. pressure campaign against the Maduro government."
  },
  {
    "title": "What to Know on the Initial Release of Materials From the Epstein Files",
    "link": "https://www.nytimes.com/2025/12/19/us/politics/epstein-files-takeaways.html",
    "summary": "The Justice Department came under scrutiny for its handling of the documents and deletions online of some material. It said it would not remove mentions of Donald Trump from the files as they are released."
  },
  {
    "title": "Artists We Lost in 2025, in Their Words",
    "link": "https://www.nytimes.com/2025/12/22/arts/artists-who-died-in-2025.html",
    "summary": "Robert Redford, Roberta Flack, Diane Keaton and Brian Wilson are among the cultural luminaries who died this year."
  },
  {
    "title": "A Conspicuous Gap May Undermine Trump’s Birthright Citizenship Plan",
    "link": "https://www.nytimes.com/2025/12/22/us/politics/trump-birthright-citizenship-congress.html",
    "summary": "A historical review shows lawmakers without certain familial records went unchallenged as citizens when the 14th Amendment was adopted. The finding appeared to undercut the president’s claims on birthright citizenship."
  },
  {
    "title": "Sikh Truckers Found Refuge In Trucking Until The Trump Administration’s Crackdown",
    "link": "https://www.nytimes.com/2025/12/21/business/sikhs-truckers-trump-crackdown.html",
    "summary": "Two high-profile crashes and a Trump administration crackdown have brought worry, and wariness, to the community."
  },
  {
    "title": "Goodbye (and Good Riddance?) to the MetroCard",
    "link": "https://www.nytimes.com/2025/12/22/nyregion/new-york-city-metrocard-end.html",
    "summary": "Thirty years ago, the newfangled method of paying for New York City’s buses and subways seemed like cutting-edge technology. Now, its days are numbered."
  },
  {
    "title": "What to Know About OMNY, MetroCard’s Tap-and-Go Successor",
    "link": "https://www.nytimes.com/2025/12/22/nyregion/omny-nyc-subway.html",
    "summary": "With the MetroCard retiring at the end of 2025, the OMNY system will become the only way to pay for most transit riders."
  },
  {
    "title": "Their Death Sentences Were Commuted by Biden. They Could Face Execution Again.",
    "link": "https://www.nytimes.com/2025/12/22/us/death-penalty-biden-trump-south-carolina.html",
    "summary": "At least four of the 37 men whose sentences were commuted last year could face the death penalty at the state level after a push from the Trump administration."
  },
  {
    "title": "Washington State Faces Climate Change Reality After Storms",
    "link": "https://www.nytimes.com/2025/12/22/us/politics/pacific-northwest-floods.html",
    "summary": "Two weeks of “atmospheric river” deluges took a toll on business in Leavenworth, Wash., and beyond, reminding the region that a warming planet has brought new uncertainty."
  },
  {
    "title": "At Least 1 Killed as Heavy Rains Bring Floods to Northern California",
    "link": "https://www.nytimes.com/2025/12/21/us/flooding-shasta-count-california.html",
    "summary": "Floodwaters swept Shasta County on Sunday, killing at least one person. Forecasters warned that Central California would receive heavy rain later in the week."
  },
  {
    "title": "Puzzle Designers Search for That ‘Satisfying Click’",
    "link": "https://www.nytimes.com/2025/12/22/science/games-puzzle-design.html",
    "summary": "For prizewinning puzzle creators, the devilish ideas are in the details."
  },
  {
    "title": "The U.S. Must End China’s Rare Earth Dominance",
    "link": "https://www.nytimes.com/2025/12/22/opinion/the-us-must-end-chinas-rare-earth-dominance.html",
    "summary": "The world’s democracies cannot depend on the most powerful authoritarian state — and an increasingly aggressive one — for critical minerals."
  },
  {
    "title": "Russian General Is Killed in Car Bombing in Moscow",
    "link": "https://www.nytimes.com/2025/12/22/world/europe/russia-moscow-general-killed.html",
    "summary": "The attack appeared to be the latest targeted assassination of a senior military official inside Russia’s borders."
  },
  {
    "title": "Guns from the United States are Pouring into Canada, Fueling a Spike in Gun Violence",
    "link": "https://www.nytimes.com/2025/12/21/world/americas/canada-gun-violence-us.html",
    "summary": "The proliferation of illegal firearms from the United States has fueled a spike in gun violence in Canada, where most guns used in crimes are smuggled across the border."
  },
  {
    "title": "Betty Reid Soskin, Nation’s Oldest Park Ranger, Dies at 104",
    "link": "https://www.nytimes.com/2025/12/21/us/betty-reid-soskin-dead.html",
    "summary": "She began working as a park ranger at age 85, educating visitors about the women and people of color who served on the home front in World War II, herself among them."
  },
  {
    "title": "People Who Achieve the Most Later in Life Typically Start Off Dabbling in Disciplines, Study Shows",
    "link": "https://www.nytimes.com/2025/12/19/well/high-performers-multiple-disciplines-early-study.html",
    "summary": "A new study suggests that the people who reach the pinnacle of their fields typically dabbled in multiple disciplines when they were young."
  }
]