[
  {
    "title": "Jamaican Officials Worry That Not Enough People Are Evacuating Ahead of Melissa",
    "link": "https://www.nytimes.com/2025/10/27/weather/jamaica-evacuation-orders-shelters.html",
    "summary": "As Hurricane Melissa barrels toward the island nation, only a fraction of residents have headed to evacuation centers."
  },
  {
    "title": "Beyond Trade War, China’s Xi Looks to Press Trump on Taiwan",
    "link": "https://www.nytimes.com/2025/10/28/world/asia/trump-tariffs-china-taiwan.html",
    "summary": "China’s leader wants to weaken American support for Taiwan. But first he will want clarity about President Trump’s stance toward the island."
  },
  {
    "title": "Trump’s China Deal May Avert a Crisis of His Own Making",
    "link": "https://www.nytimes.com/2025/10/27/us/politics/trump-china-trade-deal-talks.html",
    "summary": "The Trump administration is hailing a potential deal that may return the U.S.-China relationship to where it was before the president began a trade war against Beijing."
  },
  {
    "title": "Bill Gates Says Climate Change ‘Will Not Lead to Humanity’s Demise’",
    "link": "https://www.nytimes.com/2025/10/28/climate/bill-gates-climate-change-humanity.html",
    "summary": "In a memo, the Microsoft co-founder warned against a “doomsday outlook” and appears to have shifted some of his views about climate change."
  },
  {
    "title": "Jeremy Allen White and the Anxiety of Playing Springsteen",
    "link": "https://www.nytimes.com/2025/10/26/movies/jeremy-allen-white-springsteen-deliver-me-from-nowhere.html",
    "summary": "The star never imagined he’d be performing as the Boss in front of the Boss. But the head-spinning nature of the role has paid off."
  },
  {
    "title": "AFGE, Top Federal Workers’ Union, Sides With Republicans on Shutdown",
    "link": "https://www.nytimes.com/2025/10/27/us/politics/afge-federal-workers-union-government-shutdown.html",
    "summary": "The American Federation of Government Employees, in a shift, called on Congress to immediately reopen the government without the health care measures sought by Democratic lawmakers."
  },
  {
    "title": "Government Shutdown Imperils SNAP and Other Antipoverty Programs",
    "link": "https://www.nytimes.com/2025/10/27/us/politics/trump-shutdown-snap-food-stamps-aid.html",
    "summary": "Within days, tens of millions of low-income Americans may lose assistance for food, child care and utilities if the federal government remains shut down."
  },
  {
    "title": "Trump Argues in Formal Appeal That His Conviction Was ‘Fatally Marred’",
    "link": "https://www.nytimes.com/2025/10/28/nyregion/trump-hush-money-appeal.html",
    "summary": "In 2024, a jury found that Donald J. Trump approved a scheme to falsify business records to conceal a hush-money payment to a porn star. He became the first felon president."
  },
  {
    "title": "Trump Keeps Musing About a 3rd Term Despite Constitutional Limits",
    "link": "https://www.nytimes.com/2025/10/27/us/politics/trump-third-term-politics.html",
    "summary": "A president who has chafed at the limits on his power sees political benefit in talking about remaining in office."
  },
  {
    "title": "Milei’s Win in Argentina Signals Rebuke of the Past and Trump’s Impact",
    "link": "https://www.nytimes.com/2025/10/27/world/americas/argentina-milei-election.html",
    "summary": "President Javier Milei emerged from the election with an even tighter bond with the United States and a bigger mandate to pass transformative economic plans."
  },
  {
    "title": "Why America’s Debate Over Which Children Are ‘Gifted’ Won’t Go Away",
    "link": "https://www.nytimes.com/2025/10/27/nyregion/gifted-programs-controversial.html",
    "summary": "Gifted programs could be shutting out millions of high-performing Black and Latino children from low-income families. Can districts fix their advanced education problem?"
  },
  {
    "title": "At Mamdani Rally, a Moment of Unity Goes Sideways for Hochul",
    "link": "https://www.nytimes.com/2025/10/27/nyregion/hochul-mamdani-rally.html",
    "summary": "Gov. Kathy Hochul received a tepid response from a stadium filled with Zohran Mamdani supporters, whose chants of “Tax the rich” interrupted her speech."
  },
  {
    "title": "A New Era of Strongman Rulers Has Begun",
    "link": "https://www.nytimes.com/2025/10/28/opinion/us-china-strongmen.html",
    "summary": "The meeting in South Korea will be between two powerful men who govern by impulse, not institutions — and that’s dangerous."
  },
  {
    "title": "The Insidious Joviality of Nigel Farage",
    "link": "https://www.nytimes.com/2025/10/27/opinion/nigel-farage-britain-reform.html",
    "summary": "His rise is both a symptom and a cause of the newly febrile mood in Britain."
  },
  {
    "title": "The Harvard Salient Invoked Hitler. Now It Has Been Suspended.",
    "link": "https://www.nytimes.com/2025/10/27/us/harvard-salient-hitler-suspended-magazine.html",
    "summary": "The Harvard Salient, a conservative outlet, used a phrase that was similar to a speech given by Hitler. Its independent board paused its operations over material it called “reprehensible, abusive and demeaning.”"
  },
  {
    "title": "Jack DeJohnette, Revered Jazz Drummer, Dies at 83",
    "link": "https://www.nytimes.com/2025/10/27/arts/music/jack-dejohnette-dead.html",
    "summary": "Endowed with spectacular range, he played with Miles Davis, led New Directions and Special Edition, and spent decades with Keith Jarrett’s Standards Trio."
  },
  {
    "title": "Which Is Better, One Long Walk or Many Short Ones?",
    "link": "https://www.nytimes.com/2025/10/27/well/move/long-short-walks-health.html",
    "summary": "A new analysis is one of the first to study whether spacing steps out or consolidating them was linked to better health outcomes."
  }
]