[
  {
    "title": "The most urgent alerts came in the middle of the night.",
    "link": "https://www.nytimes.com/live/2025/07/04/us/texas-floods-guadalupe-river/weather-alerts-rivers-flooding",
    "summary": ""
  },
  {
    "title": "Camp Mystic in Texas, Where 20 Children Are Missing, Is Nearly a Century Old",
    "link": "https://www.nytimes.com/2025/07/04/us/camp-mystic-texas.html",
    "summary": "Camp Mystic, on the banks of the Guadalupe River in Hunt, Texas, has been operated by generations of the same family since the 1930s."
  },
  {
    "title": "The mother of two rescued campers relays their story.",
    "link": "https://www.nytimes.com/live/2025/07/04/us/texas-floods-guadalupe-river/the-mother-of-two-rescued-campers-relays-their-story",
    "summary": ""
  },
  {
    "title": "States Brace for Added Burdens of Trump’s Tax and Spending Law",
    "link": "https://www.nytimes.com/2025/07/04/us/politics/states-trump-bill.html",
    "summary": "With the president’s domestic policy law signed, states will have to administer many of the cuts and decide how much they can spend to keep their citizens insured and fed."
  },
  {
    "title": "Court Rejects Effort to Keep Migrants From Being Sent to South Sudan",
    "link": "https://www.nytimes.com/2025/07/04/us/politics/trump-migrants-lawsuit-sudan.html",
    "summary": "After the Supreme Court ruled that the deportations could move forward, a last-ditch attempt to block them with a new lawsuit faltered."
  },
  {
    "title": "Hamas Says It’s Ready to ‘Immediately” Return to Truce Negotiations",
    "link": "https://www.nytimes.com/2025/07/04/world/middleeast/hamas-israel-ceasefire.html",
    "summary": "It was not immediately clear whether the group was demanding any significant changes to the plan for a 60-day truce, hostage-for-prisoner swaps and talks on a permanent end to the Gaza war."
  },
  {
    "title": "China Has Paid a High Price for Its Dominance in Rare Earths",
    "link": "https://www.nytimes.com/2025/07/05/business/china-rare-earth-environment.html",
    "summary": "Dust and groundwater contaminated with heavy metals and radioactive chemicals pose a health threat that the authorities have been trying to address for years."
  },
  {
    "title": "China’s Rare Earth Origin Story, Explained",
    "link": "https://www.nytimes.com/2025/07/05/business/china-rare-earth-history.html",
    "summary": "Low environmental standards helped China become the world’s low-cost producer of rare earths, but Beijing was also focused on helping the industry."
  },
  {
    "title": "Celebrating the Fourth of July Across the Country",
    "link": "https://www.nytimes.com/2025/07/04/us/july-4th-photos-videos.html",
    "summary": "Displays of patriotism were evident at parades and hot dog eating contests, even at a time of deep political divisions among Americans."
  },
  {
    "title": "Some Ways Fireworks Impact Animals and People",
    "link": "https://www.nytimes.com/2025/07/04/climate/fireworks-animals-pollution.html",
    "summary": "Firework displays can harm animals and create bursts of pollution with lingering effects, but there are ways to mitigate them."
  },
  {
    "title": "Joey Chestnut Returns to Nathan’s Hot Dog Eating Contest",
    "link": "https://www.nytimes.com/2025/07/04/nyregion/joey-chestnut-nathans-hot-dog-contest.html",
    "summary": "Mr. Chestnut, who was barred last year over an endorsement deal with a vegan-meat company, and Miki Sudo easily won their respective contests but did not break records."
  },
  {
    "title": "A Solid Report Card for the Markets, Despite Shock and Worry",
    "link": "https://www.nytimes.com/2025/07/04/business/markets-investment-returns-trump.html",
    "summary": "While the Trump administration has engaged in continual disruptions, most investors have prospered."
  },
  {
    "title": "Canadian Buyers Are Dropping Out of the U.S. Housing Market",
    "link": "https://www.nytimes.com/2025/07/04/realestate/canada-tariffs-home-sales.html",
    "summary": "Search activity for American listings has plummeted in the wake of President Trump’s unpredictable trade war, according to new data."
  },
  {
    "title": "Madre Fire Grows to 70,800 Acres, Prompting Evacuations in California",
    "link": "https://www.nytimes.com/2025/07/03/us/madre-wildfire-san-luis-obispo-california.html",
    "summary": "The blaze is burning in a rural area of San Luis Obispo County, in the central coast, but its smoke has spread to nearby counties."
  },
  {
    "title": "Brief but Violent Storms in New Jersey Leave 3 Dead",
    "link": "https://www.nytimes.com/2025/07/04/nyregion/new-jersey-storm.html",
    "summary": "Powerful gusts blew down trees in central New Jersey on Thursday, killing three people who were in their cars."
  },
  {
    "title": "Tropical Depression Forms Just Off the Southeastern U.S.",
    "link": "https://www.nytimes.com/2025/07/03/weather/florida-tropical-depression-storm-rain.html",
    "summary": "The storm is expected to bring heavy rain to South Carolina through the weekend. Forecasters expect it to become a tropical storm on Saturday."
  },
  {
    "title": "Joseph Giordano, Surgeon Who Helped Save Reagan’s Life, Dies at 84",
    "link": "https://www.nytimes.com/2025/07/04/us/joseph-giordano-dead.html",
    "summary": "He had built one of the country’s leading trauma centers in Washington, which made it possible for his team to respond quickly after the president was shot."
  },
  {
    "title": "Move Over, $100 Lobster Salad. In the Hamptons, These Melons Cost $400.",
    "link": "https://www.nytimes.com/2025/07/04/nyregion/hamptons-grocery-prices.html",
    "summary": "Gourmet grocery stores are upping their game in the Hamptons, serving a welcoming wealthy clientele."
  },
  {
    "title": "Mamdani Once Claimed to Be Asian and African American. Should It Matter?",
    "link": "https://www.nytimes.com/2025/07/04/nyregion/mamdani-college-black-reaction.html",
    "summary": "Zohran Mamdani’s responses on a 2009 college application were criticized by his mayoral rivals. The blowback was dismissed by his supporters as a politically motivated attack."
  },
  {
    "title": "We Want to Hear From You: Are You Frustrated by Census and Racial Categories?",
    "link": "https://www.nytimes.com/2025/07/04/us/census-racial-categories.html",
    "summary": "Americans are routinely asked to check off boxes about their race and ethnicity, but many say they do not see themselves reflected in the options."
  },
  {
    "title": "What Tourists in Martha’s Vineyard Showed Me About Being Indigenous",
    "link": "https://www.nytimes.com/2025/07/04/opinion/wampanoag-marthas-vineyard-native.html",
    "summary": "In my parents’ gift shop, I learned about being Native."
  },
  {
    "title": "Top Hochul Aide Resigns After Being Accused of Sexual Harassment",
    "link": "https://www.nytimes.com/2025/07/04/nyregion/hochul-press-secretary-small-resigns-sexual-harassment.html",
    "summary": "Avi Small, who had served as Gov. Kathy Hochul’s longtime press secretary, was accused of inappropriately touching another male aide."
  },
  {
    "title": "Fatally Injured Teenager Is Discovered on Top of a N.Y.C. Subway Car",
    "link": "https://www.nytimes.com/2025/07/04/nyregion/subway-car-dead-7-train.html",
    "summary": "A 15-year-old boy could be the latest victim of subway surfing, a dangerous practice of riding on the roofs of train cars that has lured New York City youth for decades."
  },
  {
    "title": "Anna Ornstein, Psychoanalyst Who Survived the Holocaust, Dies at 98",
    "link": "https://www.nytimes.com/2025/07/04/health/anna-ornstein-dead.html",
    "summary": "Despite the unspeakable horror of her youth, she embraced a school of psychotherapy that stresses empathy and the belief that everyone can change for the better."
  }
]