[
  {
    "title": "The A.I. Boom Is Driving the Economy. What Happens if It Falters?",
    "link": "https://www.nytimes.com/2025/11/22/business/the-ai-boom-economy.html",
    "summary": "A windfall for companies that build data centers and their suppliers is overshadowing weakness in other industries."
  },
  {
    "title": "What to Know About the Nearly 10% Climb in a Key Medicare Expense for 2026",
    "link": "https://www.nytimes.com/2025/11/22/business/what-to-know-about-the-nearly-10-climb-in-a-key-medicare-expense-for-2026.html",
    "summary": "The rapidly rising premium for Part B, which covers retirees’ outpatient services, reflects the fast pace of growth for health care costs nationally."
  },
  {
    "title": "Eli Lilly, Drug Maker of Zepbound and Mounjaro, Reaches $1 Trillion in Value",
    "link": "https://www.nytimes.com/2025/11/21/health/eli-lilly-one-trillion-value-pharmaceuticals.html",
    "summary": "The 150-year-old drugmaker is the first company in health care to hit the milestone."
  },
  {
    "title": "‘Fascist’? ‘Communist’? For an Afternoon, Trump and Mamdani Were Just 2 Guys From Queens.",
    "link": "https://www.nytimes.com/2025/11/21/us/politics/trump-mamdani-scene.html",
    "summary": "Acid insults were set aside as New York’s mayor-elect and the president promoted their shared goals."
  },
  {
    "title": "The Trump-Mamdani Buddy Movie? It’s Getting Mixed Reviews.",
    "link": "https://www.nytimes.com/2025/11/21/nyregion/mamdani-trump-reaction-meeting.html",
    "summary": "Zohran Mamdani and President Trump seemed to cast aside their months of traded insults, a development that seemed good for New York City but odd to some followers."
  },
  {
    "title": "Marjorie Taylor Greene Says She Will Resign in January, After Break From Trump",
    "link": "https://www.nytimes.com/2025/11/21/us/politics/marjorie-taylor-greene-resigns.html",
    "summary": "Ms. Greene, who was elected in 2020, had positioned herself as a die-hard Trump supporter until a series of recent ruptures with the president, who recently unendorsed her."
  },
  {
    "title": "Supreme Court, For Now, Keeps in Place Texas Republican-Friendly Congressional Map",
    "link": "https://www.nytimes.com/2025/11/21/us/politics/supreme-court-texas-congressional-map.html",
    "summary": "State officials have asked the justices to allow it to use a newly redrawn map for the 2026 midterms, part of a nationwide redistricting push by President Trump."
  },
  {
    "title": "In One Week, Trump Moves to Reshape U.S. Environmental Policy",
    "link": "https://www.nytimes.com/2025/11/22/climate/trump-environmental-policy-week.html",
    "summary": "The Trump administration this week moved to weaken the Clean Water Act and the Endangered Species Act, two bedrock laws, among other deregulatory moves."
  },
  {
    "title": "What to Know: Trump Labels Nigeria’s Christian Violence a ‘Genocide’",
    "link": "https://www.nytimes.com/2025/11/21/world/africa/nigeria-trump-genocide-claims.html",
    "summary": "There are widespread attacks across the country affecting many religious and ethnic groups. Many of them defy a simple explanation."
  },
  {
    "title": "Trump Offers a Ukraine Peace Plan the Kremlin Can Love",
    "link": "https://www.nytimes.com/2025/11/22/us/politics/trump-ukraine-russia-peace-plan-kremlin.html",
    "summary": "While President Trump at times suggested he was willing to bolster support for Ukraine, he has repeatedly accommodated Russia’s demands."
  },
  {
    "title": "Ukrainians Wait in Pain as Hope to Find Strike Survivors Fades",
    "link": "https://www.nytimes.com/2025/11/22/world/europe/russia-ukraine.html",
    "summary": "Russian missiles hit apartment buildings in Ternopil this week, far from the war’s front line. Dozens of civilians, including children, were killed."
  },
  {
    "title": "The Aftermath of a Deadly Strike in Western Ukraine",
    "link": "https://www.nytimes.com/video/world/europe/100000010538311/the-aftermath-of-a-deadly-strike-in-western-ukraine.html",
    "summary": "At the site of an apartment building in western Ukraine where a Russian strike killed dozens of people, the New York Times reporter Kim Barker heard reactions to a 28-point U.S. proposal to end the war."
  },
  {
    "title": "European Leaders to Discuss Support for Ukraine in Response to U.S. Peace Plan",
    "link": "https://www.nytimes.com/2025/11/22/world/africa/g20-south-africa-ukraine-russia-united-states.html",
    "summary": "The meeting is scheduled for Saturday afternoon on the sidelines of the G20 summit in South Africa. The White House plan calls for Ukraine to make significant concessions to Russia."
  },
  {
    "title": "What Is Trump’s 28-Point Plan to End Russia’s War in Ukraine?",
    "link": "https://www.nytimes.com/2025/11/22/world/europe/trump-russia-ukraine-peace-plan.html",
    "summary": "President Trump is pressing Kyiv to accept an outcome that yields to President Vladimir V. Putin’s demands."
  },
  {
    "title": "Trump Claims a White ‘Genocide’ in South Africa. Here’s What’s Really Happening.",
    "link": "https://www.nytimes.com/2025/11/22/world/africa/south-africa-crime.html",
    "summary": "An audacious effort joined two disparate communities, who say they all suffer from the staggering violence and crime affecting the country."
  },
  {
    "title": "How Olivia Nuzzi and Ryan Lizza Became Main Characters on Social Media",
    "link": "https://www.nytimes.com/2025/11/21/style/olivia-nuzzi-ryan-lizza-rfk-jr-affair.html",
    "summary": "Love, politics and ethics collided as Olivia Nuzzi and Ryan Lizza went at it in a media sphere that rewards private revelations."
  },
  {
    "title": "Vanity Fair Is Reviewing Its Ties to Olivia Nuzzi",
    "link": "https://www.nytimes.com/2025/11/21/style/vanity-fair-olivia-nuzzi.html",
    "summary": "The magazine, which recently hired the journalist, said it had been “taken by surprise” by new claims in an essay by her former fiancé, Ryan Lizza."
  },
  {
    "title": "Piggy Gets Polite",
    "link": "https://www.nytimes.com/2025/11/22/opinion/trump-piggy-mamdani.html",
    "summary": "Trump, remarkably, finds a new low."
  },
  {
    "title": "Epstein and the #MeToo of It All",
    "link": "https://www.nytimes.com/2025/11/22/opinion/epstein-women-victims-politics.html",
    "summary": "“You need this renewal. You need new figures who are untouched, who were never part of these awful power games,” the columnist Lydia Polgreen argues."
  },
  {
    "title": "Pushing Off",
    "link": "https://www.nytimes.com/2025/11/22/briefing/pushing-off.html",
    "summary": "Thanksgiving’s this coming week. How can we keep a busy holiday season from overwhelming us?"
  },
  {
    "title": "U.S. Defends Decision to Seek Death Penalty for Luigi Mangione",
    "link": "https://www.nytimes.com/2025/11/22/nyregion/luigi-mangione-death-penalty.html",
    "summary": "Prosecutors argue that Mr. Mangione can receive a fair trial, despite his lawyers’ concerns about “damaging” statements from the attorney general about the murder case."
  },
  {
    "title": "Texas A&M Wrong to Fire Professor Melissa McCoul Over Gender Lesson, Panel Rules",
    "link": "https://www.nytimes.com/2025/11/21/us/texas-am-professor-gender-lesson-panel-ruling.html",
    "summary": "The firing put the school at the center of national debates over gender identity and academic freedom. A faculty panel ruled unanimously against the termination."
  },
  {
    "title": "Cargo Ship Fire in L.A. Threatens City With Hazardous Smoke",
    "link": "https://www.nytimes.com/2025/11/22/us/cargo-ship-fire-los-angeles-port.html",
    "summary": "People near the Port of Los Angeles were told to stay indoors and close their windows as firefighters battled the blaze overnight."
  },
  {
    "title": "Germans Are Going Off Beer. That’s Forcing Brewers to Adapt or Go Bust.",
    "link": "https://www.nytimes.com/2025/11/22/world/europe/germany-alcohol-consumption-breweries.html",
    "summary": "More young people are steering clear of alcohol. The deepening cultural shift has spawned an epidemic of brewery closures."
  }
]