[
  {
    "title": "RFK Jr. Says He Instructed CDC to Change Vaccines and Autism Language on Website",
    "link": "https://www.nytimes.com/2025/11/21/us/politics/rfk-jr-cdc-vaccines-autism-website.html",
    "summary": "In an interview, Health Secretary Robert F. Kennedy Jr. cited gaps in vaccine safety research. His critics say he is ignoring a larger point: Vaccines save lives."
  },
  {
    "title": "Comey Seeks to Dismiss Charges Based on Grand Jury Errors",
    "link": "https://www.nytimes.com/2025/11/21/us/politics/comey-halligan-dismiss-charges.html",
    "summary": "The request to dismiss the case came after Lindsey Halligan acknowledged she had never shown a final version of the indictment to the entire grand jury for a vote."
  },
  {
    "title": "Texas Asks Supreme Court to Clear Way for Republican-Friendly Congressional Map",
    "link": "https://www.nytimes.com/2025/11/21/us/politics/supreme-court-texas-congressional-map.html",
    "summary": "State officials are seeking to use a newly redrawn map for the 2026 midterms, part of a nationwide redistricting push by President Trump."
  },
  {
    "title": "Sean Duffy Asks Travelers to ‘Bring Civility Back’ to Airports in New PSA",
    "link": "https://www.nytimes.com/2025/11/21/travel/sean-duffy-airlines-manners-video.html",
    "summary": "The secretary of transportation kicked off a new civility campaign on Wednesday called “The Golden Age of Travel Starts With You.”"
  },
  {
    "title": "As Trump Pushes on Russia-Ukraine Peace Plan, Zelensky’s Options Are Narrowing",
    "link": "https://www.nytimes.com/2025/11/21/world/europe/ukraine-russia-us-peace-plan.html",
    "summary": "The Ukrainian president’s options are narrowing as he is confronted with a 28-point proposal drafted by American and Russian envoys."
  },
  {
    "title": "To Many Ukrainians, U.S. Peace Plan Looks Like ‘Capitulation’",
    "link": "https://www.nytimes.com/2025/11/21/world/europe/ukraine-russia-peace-plan-capitulation.html",
    "summary": "While the White House has cautioned that the proposal is still in “flux,” its contours reflect maximalist demands made by Russia throughout the war that Ukraine has consistently rejected."
  },
  {
    "title": "Former Reform U.K. Politician Sent to Prison for Taking Pro-Russia Bribes",
    "link": "https://www.nytimes.com/2025/11/21/world/europe/reform-uk-nathan-gill-russia-bribes.html",
    "summary": "Nathan Gill was sentenced to 10 and a half years on Friday after admitting he was paid to make pro-Russian speeches in the European Parliament."
  },
  {
    "title": "Lawrence Krauss, Martin Nowak: The Professors Who Stayed Close With Epstein",
    "link": "https://www.nytimes.com/2025/11/21/us/professors-jeffrey-epstein-relationships.html",
    "summary": "Even as the disgraced financier’s crimes were revealed, newly released emails show how academics at top universities stuck by Jeffrey Epstein, often seeking his help and offering it in return."
  },
  {
    "title": "A War Photographer for Whom the Battle Continues",
    "link": "https://www.nytimes.com/2025/11/21/arts/design/al-rockoff-war-photography-killing-fields.html",
    "summary": "Rockoff, who risked his life to photograph the brutality of the Khmer Rouge, has struggled ever since. Now he says his historic negatives have been taken from him."
  },
  {
    "title": "Texas Gov. Greg Abbott Moves to Restrict Muslims, Leaving Some Concerned",
    "link": "https://www.nytimes.com/2025/11/21/us/abbott-texas-muslim-investigation.html",
    "summary": "Two decisions by the Texas governor this week, including directing authorities to investigate an Islamic organization, come as the state sees an increase in anti-Muslim rhetoric."
  },
  {
    "title": "Eli Lilly, Drug Maker of Zepbound and Mounjaro, Reaches $1 Trillion in Value",
    "link": "https://www.nytimes.com/2025/11/21/health/eli-lilly-one-trillion-value-pharmaceuticals.html",
    "summary": "The 150-year-old drugmaker is the first company in health care to hit the milestone."
  },
  {
    "title": "Satellite Data Reveals How the U.S. Navy Is Deployed Near Venezuela",
    "link": "https://www.nytimes.com/2025/11/21/world/americas/us-navy-venezuela-satellite-data.html",
    "summary": "The Times identified nearly 100 locations traversed by naval vessels across a two-and-a-half-month period to determine what the military pressure campaign against Venezuela looks like at sea."
  },
  {
    "title": "Watch a ‘Wonderful’ Moment From ‘Wicked: For Good’",
    "link": "https://www.nytimes.com/2025/11/21/movies/wicked-for-good-clip.html",
    "summary": "The director Jon M. Chu narrates a sequence from his film featuring Ariana Grande, Cynthia Erivo and Jeff Goldblum performing the song “Wonderful.”"
  },
  {
    "title": "How 2 New Songs Made Their Way Into ‘Wicked: For Good’",
    "link": "https://www.nytimes.com/2025/11/21/movies/wicked-for-good-new-songs.html",
    "summary": "Each witch gets a new number as part of an effort to flesh out the arc of the stage show’s second act."
  },
  {
    "title": "‘Wicked: For Good’ — Ariana Grande and Cynthia Erivo’s Never-Ending Press Tour",
    "link": "https://www.nytimes.com/2025/11/21/movies/wicked-for-good-2-ariana-grande-cynthia-erivo.html",
    "summary": "The pink-and-green-themed promotions were everywhere, with all the advantages and limitations that kind of marketing push entails."
  },
  {
    "title": "At Least 52 Kidnapped From Nigeria School in Second Mass Abduction This Week",
    "link": "https://www.nytimes.com/2025/11/21/world/africa/nigeria-school-abduction.html",
    "summary": "Students and teachers were taken captive from a Catholic school in the latest in a wave of such attacks in the country."
  },
  {
    "title": "The Moon Was an Inside Job",
    "link": "https://www.nytimes.com/2025/11/20/science/moon-collision-earth-theia.html",
    "summary": "New research suggests that Theia, the object whose collision with Earth is theorized to have caused the formation of the moon, came from closer to the sun."
  },
  {
    "title": "Saturn’s Rings Seem as if They’re About to Disappear: Here’s Why",
    "link": "https://www.nytimes.com/2025/11/21/science/saturn-rings-disappear.html",
    "summary": "During the weekend, the orbits of Earth and Saturn will combine to create an interplanetary optical illusion for anyone with a good telescope and clear skies."
  },
  {
    "title": "America Is Setting a Trap for Itself",
    "link": "https://www.nytimes.com/2025/11/21/opinion/america-china-trump-g20.html",
    "summary": "The United States, not China, seems determined to upend the global order."
  },
  {
    "title": "I’m in Venezuela. This Is the True Cost of Trump’s Gunboat Diplomacy.",
    "link": "https://www.nytimes.com/2025/11/21/opinion/venezuela-trump-maduro-machado-regime-change.html",
    "summary": "Trump’s show of force toward Venezuela has created a disastrous political trap — for Venezuelans most of all."
  },
  {
    "title": "Just Two Guys From Queens",
    "link": "https://www.nytimes.com/2025/11/21/briefing/trump-mamdani-ukraine-peace-plan.html",
    "summary": "Also, Ukraine faces a “difficult choice” on the U.S. peace plan. Here’s the latest at the end of Friday."
  },
  {
    "title": "Vanity Fair Is Reviewing Its Ties to Olivia Nuzzi",
    "link": "https://www.nytimes.com/2025/11/21/style/vanity-fair-is-reviewing-its-ties-to-olivia-nuzzi.html",
    "summary": "The magazine, which recently hired the journalist, said it had been “taken by surprise” by new claims in an essay by her former fiancé, Ryan Lizza."
  },
  {
    "title": "3 Children Are Injured in Grizzly Bear Attack in British Columbia",
    "link": "https://www.nytimes.com/2025/11/21/world/canada/canada-bear-attack-children.html",
    "summary": "The children were among 11 people who were hurt when a grizzly attacked a school group in a remote part of British Columbia, the authorities said."
  },
  {
    "title": "A Colossal, Hidden Pile of Trash Ignites Outcry in Britain",
    "link": "https://www.nytimes.com/2025/11/21/world/europe/trash-britain-illegal-dumping.html",
    "summary": "The discovery of a mountain of garbage near a highway is the latest example of what experts say is a growing problem of criminal organizations profiting from illegal dumping."
  }
]