[
  {
    "title": "China’s Trade Surplus Climbs Past $1 Trillion for First Time",
    "link": "https://www.nytimes.com/2025/12/07/business/china-trade-surplus.html",
    "summary": "President Trump’s tariffs weren’t enough to hold back the global export flood by China, which pushed past last year’s record in just 11 months."
  },
  {
    "title": "China’s Weak Currency Is Powering Its Exports and Drawing Criticism",
    "link": "https://www.nytimes.com/2025/12/07/business/china-rmb-currency.html",
    "summary": "China’s renminbi is lagging the currencies of key trading partners, making Chinese goods and services cheap and helping to drive exports."
  },
  {
    "title": "Democrats Call for Releasing Video of Deadly Boat Strike in the Caribbean",
    "link": "https://www.nytimes.com/2025/12/07/us/politics/democrats-boat-strike-video-release.html",
    "summary": "Top Democratic lawmakers who have seen the footage said Sunday that making the video public would provide transparency around the strikes that killed two survivors on Sept. 2."
  },
  {
    "title": "U.S. Deports Second Planeload of Iranians, Officials Say",
    "link": "https://www.nytimes.com/2025/12/07/world/middleeast/us-deports-second-planeload-iranians.html",
    "summary": "The plane, carrying about 50 Iranians and other deportees, took off from Arizona on Sunday, under a deal the Trump administration reached with Iran two months ago."
  },
  {
    "title": "Trump Hosts the Kennedy Center Honors, Breaking Tradition",
    "link": "https://www.nytimes.com/2025/12/07/us/politics/trump-kennedy-center-honors.html",
    "summary": "Past presidents have attended the marquee event, but on Sunday Mr. Trump was the first to host it, putting his cultural takeover of Washington in sharp relief."
  },
  {
    "title": "Presidential Power Gets Tested Before Supreme Court After Long Conservative Project to Shrink Agencies",
    "link": "https://www.nytimes.com/2025/12/07/us/politics/supreme-court-trump-independent-agencies.html",
    "summary": "President Trump has repeatedly ousted leaders of independent agencies despite federal laws meant to shield those regulators from politics."
  },
  {
    "title": "For Landmark Test of Executive Power, Echoes of a 1930s Supreme Court Battle",
    "link": "https://www.nytimes.com/2025/12/07/us/politics/supreme-court-humphrey-roosevelt.html",
    "summary": "Franklin D. Roosevelt’s efforts to oust a Federal Trade Commission leader offer parallels to the current fight over President Trump’s actions."
  },
  {
    "title": "How Biden Lost Americans’ Faith in Immigration",
    "link": "https://www.nytimes.com/2025/12/07/us/politics/biden-immigration-trump.html",
    "summary": "The Democratic president and his top advisers rejected recommendations that could have eased the border crisis that helped return Donald Trump to the White House."
  },
  {
    "title": "4 Takeaways From The Times’s Reporting on Biden’s Immigration Record",
    "link": "https://www.nytimes.com/2025/12/07/us/politics/biden-immigration-policy-takeaways.html",
    "summary": "A New York Times review of President Joseph R. Biden Jr.’s actions on immigration showed that they created an opening for a more aggressive Trump administration agenda."
  },
  {
    "title": "A Small Illinois City at the Center of a Seismic Shift in Abortion Access",
    "link": "https://www.nytimes.com/2025/12/07/us/politics/abortion-carbondale.html",
    "summary": "Carbondale, Ill., a liberal enclave within driving distance of 10 states with abortion bans, has become a hub for the procedure. Last year there were nearly 11,000 abortions in this city of 21,000."
  },
  {
    "title": "He Was a Russian Activist in Exile. His Own Wife Accused Him of Spying.",
    "link": "https://www.nytimes.com/2025/12/08/world/europe/russia-spy-poland.html",
    "summary": "Poland has charged a little-known Russian opposition figure with espionage and participating in a bomb plot. His friends are perplexed."
  },
  {
    "title": "Cold Case Inquiries Stall After Ancestry.com Revisits Policy for Users",
    "link": "https://www.nytimes.com/2025/12/07/nyregion/ancestry-dna-police.html",
    "summary": "The genealogy site’s clarification of its terms and conditions has barred those working on unsolved crimes from access to the company’s vast trove of records."
  },
  {
    "title": "Social Security at 70? Why the Gold Standard Advice Works for Only a Few",
    "link": "https://www.nytimes.com/2025/12/07/business/social-security-70-retirement.html",
    "summary": "The standard advice is to hold off, but most retirees claim the benefit as soon as they can, at age 62. Here’s what to know when you’re planning the unplannable."
  },
  {
    "title": "Dogs in Kimonos: Japan Reinvents a Children’s Holiday With Pets in Mind",
    "link": "https://www.nytimes.com/2025/12/08/world/asia/japan-pets-festival.html",
    "summary": "A traditional Japanese festival is being adapted for poodles and Pomeranians, amid a booming pet industry and a dearth of children."
  },
  {
    "title": "Not All Targeted Killings Are the Same. Hegseth’s Boat Strikes Are Illegal.",
    "link": "https://www.nytimes.com/2025/12/07/opinion/hegseth-boat-strikes-killings.html",
    "summary": "A former secretary of homeland security on the illegality of Trump’s boat strikes."
  },
  {
    "title": "The One Child Policy’s Legacy: A Surplus of Single Men",
    "link": "https://www.nytimes.com/2025/12/04/opinion/china-dating-men-one-child-policy.html",
    "summary": "A decade after the end of the one-child policy, China has over 30 million so-called surplus men. Can this dating boot camp help them find love?"
  },
  {
    "title": "United Nations Cuts Its 2026 Emergency Aid Budget in Half",
    "link": "https://www.nytimes.com/2025/12/08/world/united-nations-humanitarian-aid-cuts.html",
    "summary": "Huge reductions in foreign aid by the United States and Europe have led the U.N.’s emergency relief coordinator to slash its fund-raising targets for next year."
  },
  {
    "title": "Hundreds Rally for Boy, 6, Who Was Separated From His Father by ICE",
    "link": "https://www.nytimes.com/2025/12/07/nyregion/queens-migrant-boy-detained-rally.html",
    "summary": "“Taking children from their families is not normal,” a speaker told the crowd in Queens, where Yuanxin Zheng attended school until being detained."
  },
  {
    "title": "Fern Michaels, Prolific Author of Romance Novels, Dies at 92",
    "link": "https://www.nytimes.com/2025/12/07/obituaries/fern-michaels-dead.html",
    "summary": "In her 40s, the self-described New Jersey housewife started building a women’s fiction empire, churning out dozens of popular books."
  },
  {
    "title": "Katy Perry Posts Photos With Justin Trudeau Amid Romance Rumors",
    "link": "https://www.nytimes.com/2025/12/07/world/canada/katy-perry-justin-trudeau-relationship-japan.html",
    "summary": "Ms. Perry and Mr. Trudeau, the former prime minister of Canada, posed together in photos and videos on Instagram, making them “Instagram official.”"
  }
]