[
  {
    "title": "Assad, Ousted Syrian Ruler, Leads Life of Luxury in Russia",
    "link": "https://www.nytimes.com/2025/12/22/world/middleeast/assad-syria-exile-luxury.html",
    "summary": "Bashar al-Assad’s long, brutal reign ended swiftly, but he and his close circle have had a soft landing in Russia."
  },
  {
    "title": "After the Assad Regime’s Fall, His Enforcers Are Lying Low and Living Large",
    "link": "https://www.nytimes.com/2025/12/22/world/middleeast/assad-syria-enforcers-lives-now.html",
    "summary": "A Times investigation into the whereabouts of top Syrian officials who fled after the regime’s fall shows many remain free — shielded by wealth and accommodating host nations."
  },
  {
    "title": "Trump Administration Oil Tanker Seizures Are Meant to Force Maduro Out, Officials Say",
    "link": "https://www.nytimes.com/2025/12/22/world/americas/trump-venezuela-oil-tankers-maduro.html",
    "summary": "Homeland Security Secretary Kristi Noem said the ship seizures were meant to force Venezuela’s president Nicolás Maduro from power."
  },
  {
    "title": "Trump Halts 5 Wind Farms Off the East Coast",
    "link": "https://www.nytimes.com/2025/12/22/climate/trump-offshore-wind-farms.html",
    "summary": "The Interior Department said the projects posed national security risks, without providing details. The decision imperils billions of dollars of investments."
  },
  {
    "title": "Ex-C.I.A. Chief Wants to Block Judge Cannon From Inquiry Pushed by Trump’s Allies",
    "link": "https://www.nytimes.com/2025/12/22/us/politics/trump-doj-investigation-judge-cannon-brennan-cia.html",
    "summary": "The request, addressed to the top federal judge in Miami, sought to block a U.S. attorney from pursuing a politically charged inquiry before Judge Aileen Cannon, who has repeatedly decided in President Trump’s favor."
  },
  {
    "title": "Larry Ellison Personally Guarantees Paramount Bid for Warner Bros.",
    "link": "https://www.nytimes.com/2025/12/22/business/larry-ellison-paramount-warner-brothers-bid.html",
    "summary": "Mr. Ellison’s personal guarantee is meant to address concerns that the Warner Bros. Discovery’s board had expressed about Paramount’s original offer."
  },
  {
    "title": "’60 Minutes’ Pulls Segment on Venezuelans Deported by Trump Administration, Drawing Criticism",
    "link": "https://www.nytimes.com/2025/12/21/business/60-minutes-trump-bari-weiss.html",
    "summary": "Sharyn Alfonsi, a “60 Minutes” correspondent, criticized the network’s decision to remove her reporting from Sunday’s edition of the show."
  },
  {
    "title": "Jim Beam Halts Production at Flagship Distillery as Whiskey and Bourbon Markets Struggle",
    "link": "https://www.nytimes.com/2025/12/22/dining/jim-beam-production-pause-whiskey-bourbon.html",
    "summary": "The bourbon giant is closing its flagship distilling operation for all of 2026."
  },
  {
    "title": "As Trump Clings to Tariffs, His Argentine Ally Is Opening Up to Trade",
    "link": "https://www.nytimes.com/2025/12/22/world/americas/argentina-trade.html",
    "summary": "President Javier Milei is eliminating barriers to what had been a closed-off economy, moving in the opposite direction of his main political ally, President Trump."
  },
  {
    "title": "The Economy Survived 2025, But Many Americans Are Reeling",
    "link": "https://www.nytimes.com/2025/12/22/business/economy-unemployment-wages-affordability.html",
    "summary": "A feared recession didn’t materialize, but unemployment rose, wage growth slowed and affordability challenges are mounting."
  },
  {
    "title": "Artists We Lost in 2025, in Their Words",
    "link": "https://www.nytimes.com/2025/12/22/arts/artists-who-died-in-2025.html",
    "summary": "Robert Redford, Roberta Flack, Diane Keaton and Brian Wilson are among the cultural luminaries who died this year."
  },
  {
    "title": "At Turning Point USA’s AmericaFest, Attendees Find Conservative Squabbling Distracting",
    "link": "https://www.nytimes.com/2025/12/22/style/americafest-turning-point-usa-charlie-kirk.html",
    "summary": "“It’s creating division instead of building a movement that keeps everyone together.”"
  },
  {
    "title": "Mistrial in Case of N.Y. Official Charged With Working for China",
    "link": "https://www.nytimes.com/2025/12/22/nyregion/linda-sun-mistrial.html",
    "summary": "Linda Sun was accused by federal prosecutors of selling her allegiance and being rewarded handsomely for influence peddling."
  },
  {
    "title": "She Fell in Love With ChatGPT. Then She Ghosted It.",
    "link": "https://www.nytimes.com/2025/12/22/technology/ai-boyfriend-chatgpt.html",
    "summary": "The 29-year-old woman who created the “MyBoyfriendIsAI” community on Reddit isn’t dating (or sexting) her A.I. boyfriend anymore. She found something more fulfilling."
  },
  {
    "title": "She Is in Love With ChatGPT",
    "link": "https://www.nytimes.com/2025/01/15/technology/ai-chatgpt-boyfriend-companion.html",
    "summary": "A 28-year-old woman with a busy social life spends hours on end talking to her A.I. boyfriend for advice and consolation. And yes, they do have sex."
  },
  {
    "title": "Vince Zampella, Formative Designer of Call of Duty Games, Dies at 55",
    "link": "https://www.nytimes.com/2025/12/22/arts/vince-zampella-dead.html",
    "summary": "Mr. Zampella co-founded two game studios and worked on the Medal of Honor, Titanfall, Apex Legends and Battlefield franchises."
  },
  {
    "title": "Epstein Victims Ask Congress to Ensure Justice Dept. Releases All Files",
    "link": "https://www.nytimes.com/2025/12/22/business/epstein-victims-justice-dept-files-released.html",
    "summary": "More than a dozen women called for congressional hearings to ensure that the Justice Department is fully complying with the Epstein Files Transparency Act."
  },
  {
    "title": "F.D.A. Approves Wegovy Weight-Loss Pill",
    "link": "https://www.nytimes.com/2025/12/22/well/fda-approves-wegovy-weight-loss-pill.html",
    "summary": "The agency greenlit an oral version of the obesity drug Wegovy."
  },
  {
    "title": "Record-Breaking Warm Temperatures Forecast for Christmas Across the U.S.",
    "link": "https://www.nytimes.com/2025/12/22/weather/warm-christmas-forecast.html",
    "summary": "Unseasonably warm temperatures are expected across the United States this week, with many places hitting record highs and record-high lows."
  },
  {
    "title": "How U.S. Defense Industry Dodged a Rare-Earth Shortage After China’s Curbs",
    "link": "https://www.nytimes.com/2025/12/22/business/defense-industry-rare-earth-restrictions-china.html",
    "summary": "America’s ability to make precision-guided missiles was threatened during Trump’s tariff war. But experienced players have rescued the supply chain, for now."
  },
  {
    "title": "What Happened When I Asked ChatGPT to Solve an 800-Year-Old Italian Mystery",
    "link": "https://www.nytimes.com/2025/12/22/opinion/ai-florence-baptistery.html",
    "summary": "For centuries, nobody has known who built the Florence Baptistery. Could A.I. crack the mystery?"
  },
  {
    "title": "Trump Halts Offshore Wind Farms",
    "link": "https://www.nytimes.com/2025/12/22/briefing/wind-farms-assad.html",
    "summary": "Plus, Assad’s luxurious life in Moscow. Here’s the latest at the end of Monday."
  },
  {
    "title": "Ella Cook, Brown University Shooting Victim, Is Mourned at Funeral in Alabama",
    "link": "https://www.nytimes.com/2025/12/22/us/ella-cook-funeral-brown-shooting.html",
    "summary": "At a funeral in Alabama, the Brown University student was mourned as a gifted musician and protective sister who was committed to her faith."
  },
  {
    "title": "Barry Manilow Is Diagnosed With Lung Cancer",
    "link": "https://www.nytimes.com/2025/12/22/arts/music/barry-manilow-lung-cancer-surgery.html",
    "summary": "The “Mandy” and “Copacabana” singer said he would undergo surgery to remove a cancerous spot on his left lung, and he postponed several concert dates."
  },
  {
    "title": "Did Charlie Javice’s 147-Member Legal Team Expense $529 in Gummy Bears?",
    "link": "https://www.nytimes.com/2025/12/22/business/charlie-javice-jpmorgan-legal-bills.html",
    "summary": "JPMorgan has had to pay tens of millions in legal costs for the convicted fraudster. It wants the public to see a newly unredacted list of itemized expenses."
  }
]