[
  {
    "title": "Trump’s Withering Criticism of Powell Puts Fed Decisions Under Microscope",
    "link": "https://www.nytimes.com/2025/07/18/business/trump-fed-interest-rates-powell.html",
    "summary": "The central bank is poised to hold interest rates steady this month, but there could be a path to cut as early as September."
  },
  {
    "title": "Trump’s War With Powell Throws a Little-Known Planning Board Into Scrutiny",
    "link": "https://www.nytimes.com/2025/07/18/us/politics/trump-powell-fed-renovation.html",
    "summary": "The National Capital Planning Commission has become pivotal in the administration’s campaign to discredit Jerome H. Powell, the chairman of the Federal Reserve."
  },
  {
    "title": "NPR and PBS Face Federal Funding Cuts: What to Know",
    "link": "https://www.nytimes.com/2025/07/14/business/media/npr-pbs-funding-cuts.html",
    "summary": "Cutting funding from the Corporation for Public Broadcasting could be catastrophic for local stations, particularly those in rural areas."
  },
  {
    "title": "Trump’s NPR and PBS Funding Cuts Were Decades in the Making",
    "link": "https://www.nytimes.com/2025/07/18/business/media/npr-pbs-funding-cuts-republicans.html",
    "summary": "The cuts speak to President Trump’s grip on his party but also to the sweeping changes in media."
  },
  {
    "title": "House Republicans Dangle Possible Vote on Epstein Files, After Voter Backlash",
    "link": "https://www.nytimes.com/2025/07/17/us/politics/epstein-files-house-republicans-vote.html",
    "summary": "The House Rules Committee laid the groundwork for an eventual vote to call for release of the Epstein files, reflecting Republican uneasiness with the president’s refusal to divulge information from the investigation."
  },
  {
    "title": "A Timeline of What We Know About Trump and Epstein",
    "link": "https://www.nytimes.com/2025/07/17/us/politics/timeline-trump-epstein.html",
    "summary": "Donald Trump was friendly for at least 15 years with Jeffrey Epstein, the multimillionaire financier and convicted sex offender who died in prison in 2019."
  },
  {
    "title": "Why Is Stephen Colbert’s ‘Late Show’ Getting Canceled?",
    "link": "https://www.nytimes.com/2025/07/18/arts/television/stephen-colbert-late-show-canceled-why.html",
    "summary": "Maybe the “Late Show” decision is purely financial. But after Paramount’s cave over “60 Minutes,” it is hard to trust."
  },
  {
    "title": "Truemed, a Start-Up Run by an RFK. Jr. Aide, Gives Tax Breaks for Meat and Mattresses",
    "link": "https://www.nytimes.com/2025/07/18/business/truemed-fsa-hsa-calley-means-maha.html",
    "summary": "The start-up, called Truemed, helps people buy meat and mattresses with money that isn’t subject to federal income tax. But does the tax break apply?"
  },
  {
    "title": "Bolsonaro, Brazil’s Former President, Ordered to Wear Ankle Monitor Before Trial",
    "link": "https://www.nytimes.com/2025/07/18/world/americas/brazil-president-bolsonaro-ankle-monitor.html",
    "summary": "Brazil’s Supreme Court ordered Jair Bolsonaro, the former president, to stay home most hours, defying President Trump’s demands that charges against him be dropped."
  },
  {
    "title": "Trump Diagnosed With Chronic Venous Insufficiency After Leg Swelling. What Is It?",
    "link": "https://www.nytimes.com/2025/07/17/us/politics/trump-chronic-venous-insufficiency.html",
    "summary": "The condition, which can cause swelling and pain, is common among older adults."
  },
  {
    "title": "UK, France and Germany Plan for a Post-U.S. Future",
    "link": "https://www.nytimes.com/2025/07/18/world/europe/macron-starmer-merz-trump-eu.html",
    "summary": "The leaders of France, Germany and Britain are building parallel diplomatic institutions to defend Europe as President Trump retreats from the continent."
  },
  {
    "title": "Heath Insurers Are Denying More Drug Claims, Data Shows",
    "link": "https://www.nytimes.com/2025/07/18/health/health-insurance-prescription-claim-denials.html",
    "summary": "Offering a rare glimpse inside the hidden world of rejected insurance claims, new data shows a steady uptick among major private insurers."
  },
  {
    "title": "How a Video Studio Embraced A.I. and Stormed the Internet",
    "link": "https://www.nytimes.com/2025/07/18/technology/dor-video-studio-ai.html",
    "summary": "The Dor Brothers are indie filmmakers whose viral videos are generated entirely by artificial intelligence."
  },
  {
    "title": "Debate Ignites at U.S. School Over Netanyahu’s Hall of Fame Status",
    "link": "https://www.nytimes.com/2025/07/18/us/politics/netanyahu-alma-mater-cheltenham.html",
    "summary": "Recent comments by the Israeli prime minister and a Fox News commentator about Cheltenham High School, their alma mater in suburban Philadelphia, have inflamed a debate."
  },
  {
    "title": "Who Are the Druse? The Religious Minority at the Center of Israel and Syria’s Tensions",
    "link": "https://www.nytimes.com/2025/07/18/world/middleeast/who-are-druse-syria-israel-clashes.html",
    "summary": "Spread across Syria, Lebanon and Israel, the secretive religious minority has long balanced integration and independence. Now, members are at the heart of the region’s shifting power struggles."
  },
  {
    "title": "Trump Tariffs on Russia Could Hurt Wary U.S. Farmers",
    "link": "https://www.nytimes.com/2025/07/18/business/trump-tariffs-russia-us-farmers.html",
    "summary": "President Trump’s plan to impose a 100 percent tariff on Russian goods could raise the cost of urea, a key fertilizer in corn and other row crops."
  },
  {
    "title": "One of These BRICS Is Not Like the Others",
    "link": "https://www.nytimes.com/2025/07/18/business/trump-brics-india.html",
    "summary": "President Trump’s attacks on the group of emerging economies, which includes Brazil, Russia and China, have put one member — India — in an uncomfortable spot."
  },
  {
    "title": "‘A Chorus Line’ and ‘Chicago’ at 50: Who Won?",
    "link": "https://www.nytimes.com/2025/07/18/theater/chicago-chorus-line-theater.html",
    "summary": "The slinky jailbirds and Broadway hopefuls in these two classic shows have been fighting it out since 1975."
  },
  {
    "title": "The Moves That Make ‘Chicago’ and ‘A Chorus Line’ So Special",
    "link": "https://www.nytimes.com/2025/07/18/theater/broadway-robyn-hurder-choreography-chicago.html",
    "summary": "To celebrate the shows’ golden anniversaries, the Broadway star Robyn Hurder demonstrates what makes their choreography so special."
  },
  {
    "title": "Felix Baumgartner, Skydiver Who Jumped From the Edge of Space, Dies Paragliding at 56",
    "link": "https://www.nytimes.com/2025/07/18/world/europe/felix-baumgartner-dead.html",
    "summary": "Nicknamed “Fearless Felix,” he jumped from the edge of space in 2012."
  },
  {
    "title": "The Seductions of A.I. for the Writer’s Mind",
    "link": "https://www.nytimes.com/2025/07/18/opinion/ai-chatgpt-school.html",
    "summary": "We need to reckon with what ChatGPT is doing to the classroom and to human expression."
  },
  {
    "title": "Why Trump Can’t Shake Jeffrey Epstein",
    "link": "https://www.nytimes.com/2025/07/17/opinion/ezra-klein-podcast-will-sommer.html",
    "summary": "The journalist Will Sommer examines the perfect storm of the Epstein files, Trump, QAnon and MAGA."
  },
  {
    "title": "Should Teens Vote?",
    "link": "https://www.nytimes.com/2025/07/18/briefing/should-teens-vote.html",
    "summary": "We examine the voting age around the world."
  },
  {
    "title": "Explosion at Los Angeles Training Center Kills 3 Sheriff’s Deputies",
    "link": "https://www.nytimes.com/2025/07/18/us/los-angeles-sheriff-center-explosion-deaths.html",
    "summary": "It was not immediately clear what caused the blast at the Los Angeles County Sheriff’s Department’s Biscailuz Training Academy center."
  },
  {
    "title": "Alan Bergman, Half of a Prolific Lyric-Writing Team, Dies at 99",
    "link": "https://www.nytimes.com/2025/07/18/arts/music/alan-bergman-dead.html",
    "summary": "With his wife, Marilyn, he wrote the words to memorable TV theme songs and the Oscar-winning “The Way We Were” and “The Windmills of Your Mind.”"
  },
  {
    "title": "Chevron Buys Hess After Beating Exxon in Dispute Over One of World’s Hottest Oil Projects",
    "link": "https://www.nytimes.com/2025/07/18/business/energy-environment/exxon-chevron-hess-guyana.html",
    "summary": "Chevron completed its purchase of Hess after prevailing in a legal dispute with Exxon over one of the most promising oil projects in the world."
  },
  {
    "title": "What to Know About the TSA’s Possible End to Its Liquid Size Limits",
    "link": "https://www.nytimes.com/2025/07/17/travel/tsa-liquids-sizes.html",
    "summary": "Kristi Noem, the homeland security secretary, has said that the next major airport security screening announcement could target limits on liquids. How likely is that?"
  }
]