[
  {
    "title": "Silicon Valley’s Man in the White House Is Benefiting Himself and His Friends",
    "link": "https://www.nytimes.com/2025/11/30/technology/david-sacks-white-house-profits.html",
    "summary": "David Sacks, the Trump administration’s A.I. and crypto czar, has helped formulate policies that aid his Silicon Valley friends and many of his own tech investments."
  },
  {
    "title": "In Announcing Pardon of Drug Trafficker While Threatening Venezuela, Trump Displays Contradictions",
    "link": "https://www.nytimes.com/2025/11/29/us/politics/trump-honduras-venezuela.html",
    "summary": "President Trump’s statements on social media less than 24 hours apart showed the dissonance in his campaign against drug trafficking."
  },
  {
    "title": "The Ex-President Whom Trump Plans to Pardon Flooded America With Cocaine",
    "link": "https://www.nytimes.com/2025/11/29/nyregion/honduras-hernandez-drug-trafficking.html",
    "summary": "Juan Orlando Hernández, whom Mr. Trump called a victim of persecution, helped orchestrate a decades-long trafficking conspiracy. It ravaged his Central American country."
  },
  {
    "title": "Top Trump Aides to Meet With Ukrainians in Florida on Sunday",
    "link": "https://www.nytimes.com/2025/11/29/us/politics/trump-aides-ukraine-florida-meeting.html",
    "summary": "Secretary of State Marco Rubio, Steve Witkoff and Jared Kushner plan to discuss peace terms again after an uproar over a 28-point proposal drafted with Russian input."
  },
  {
    "title": "The Political Price Shock of Data Centers and Electric Bills",
    "link": "https://www.nytimes.com/2025/11/30/us/politics/the-new-price-of-eggs-the-political-shocks-of-data-centers-and-electric-bills.html",
    "summary": "Democrats zeroed in on utilities and affordability to win Republican support in upset elections in Georgia and Virginia. Can the same playbook work in 2026?"
  },
  {
    "title": "Mamdani, a Sharp Critic of Police Surveillance, Will Soon Oversee It",
    "link": "https://www.nytimes.com/2025/11/30/nyregion/mamdani-tisch-nypd-surveillance.html",
    "summary": "Zohran Mamdani, New York’s mayor-elect, has criticized the N.Y.P.D.’s surveillance tactics. He reappointed the police commissioner who helped create a ubiquitous web of monitoring."
  },
  {
    "title": "Fed Up With the Taliban, Pakistan Expels Masses of Afghans",
    "link": "https://www.nytimes.com/2025/11/30/world/asia/pakistan-afghans-mass-expulsions.html",
    "summary": "Labeling Afghans a national security threat, Pakistan has forced out about a million this year, depriving them of a haven from Afghanistan’s turmoil."
  },
  {
    "title": "E-Bikes Are Surging in Popularity. What Will It Take to Rein Them in?",
    "link": "https://www.nytimes.com/2025/11/30/magazine/e-bikes-accidents-safety-legislation-california.html",
    "summary": "Unregulated e-bikes are a growing danger on American streets. In one Bay Area town, a terrible accident finally led to reform."
  },
  {
    "title": "America Has Sidelined Education. You Can Help.",
    "link": "https://www.nytimes.com/2025/11/30/opinion/communities-fund-charitable-giving.html",
    "summary": "The New York Times Communities Fund has partnered with charities that invest in education at critical junctures across people’s life spans."
  },
  {
    "title": "The Medical Case That Still Haunts Me",
    "link": "https://www.nytimes.com/2025/11/30/opinion/medical-decision-pacemaker-doctor-patient.html",
    "summary": "A doctor grapples with a patient’s incomprehensible medical decision."
  },
  {
    "title": "Israel’s Netanyahu Requests Pardon in Corruption Cases",
    "link": "https://www.nytimes.com/2025/11/30/world/middleeast/netanyahu-pardon-request-israel.html",
    "summary": "The move comes two weeks after President Trump wrote to Israel’s president urging a pardon for Prime Minister Benjamin Netanyahu."
  },
  {
    "title": "4 Dead After Shooting at Banquet Hall in California",
    "link": "https://www.nytimes.com/2025/11/29/us/shooting-stockton-california.html",
    "summary": "The shooting in Stockton, a city in California’s Central Valley, left 10 others wounded. The authorities said they were looking for a suspect."
  },
  {
    "title": "Deadly Floods in Indonesia Leave Hundreds Missing",
    "link": "https://www.nytimes.com/2025/11/30/world/asia/flooding-indonesia-thailand-southeast-asia.html",
    "summary": "Hundreds of people have been killed and millions displaced as extreme weather has ravaged Southeast Asia this month. Indonesia’s heavy rain was linked to two tropical cyclones."
  },
  {
    "title": "Cory Booker Weds Alexis Lewis in a Private Ceremony",
    "link": "https://www.nytimes.com/2025/11/30/style/cory-booker-wedding-alexis-lewis.html",
    "summary": "The couple legally married at a courthouse in Newark days before hosting an intimate wedding in Washington, D.C. on Saturday. They shared their wedding details exclusively with The New York Times."
  }
]