[
  {
    "title": "Trump’s Big Policy Bill Puts U.S. on Perilous Fiscal Path",
    "link": "https://www.nytimes.com/2025/07/01/us/politics/republican-policy-bill-perilous-fiscal-path.html",
    "summary": "Among the most expensive pieces of legislation in years, the Republican legislation could reshape the country’s finances for a generation."
  },
  {
    "title": "Poorest Americans Would Be Hurt By Trump’s Big Bill",
    "link": "https://www.nytimes.com/2025/07/01/business/poor-americans-senate-legislation.html",
    "summary": "Small improvements in taxes are overshadowed by cuts to health insurance and other federal aid, resulting in a package favoring the wealthy."
  },
  {
    "title": "Penn Agrees to Limit Participation of Transgender Athletes",
    "link": "https://www.nytimes.com/2025/07/01/us/penn-title-ix-transgender-swimmer-trump.html",
    "summary": "In a deal with the Trump administration, the University of Pennsylvania will not allow transgender women to participate in women’s sports."
  },
  {
    "title": "Trump Withholds Nearly $7 Billion for Schools, With Little Explanation",
    "link": "https://www.nytimes.com/2025/07/01/us/trump-education-funds.html",
    "summary": "The money, which was allocated by Congress, helps pay for after-school programs, support for students learning English and other services."
  },
  {
    "title": "On Pivotal Day for His Bill, Trump Leaves Washington for ‘Alligator Alcatraz’",
    "link": "https://www.nytimes.com/2025/07/01/us/elections/trump-bill-alligator-alcatraz.html",
    "summary": "President Trump’s visit to the migrant detention center in the Everglades was meant to highlight the issue that binds his party to him more than anything else — immigration."
  },
  {
    "title": "Social Security Backs Off Listing Living Migrants as Dead",
    "link": "https://www.nytimes.com/2025/07/01/us/politics/social-security-immigrants-dead.html",
    "summary": "Instead, the agency is flagging as “unverified” the Social Security numbers of thousands of people who lost their temporary legal status."
  },
  {
    "title": "Jury in Sean ‘Diddy’ Combs Trial Reaches Verdict on All Counts but Racketeering Conspiracy",
    "link": "https://www.nytimes.com/2025/07/01/arts/music/sean-combs-diddy-trial-partial-verdict.html",
    "summary": "The jury will keep deliberating on a racketeering conspiracy charge in the morning after saying there were “unpersuadable opinions on both sides.”"
  },
  {
    "title": "Zohran Mamdani Wins N.Y.C. Mayoral Primary in Decisive 12-Point Victory",
    "link": "https://www.nytimes.com/2025/07/01/nyregion/mamdani-wins-mayor-primary-nyc.html",
    "summary": "Mr. Mamdani roundly defeated Andrew M. Cuomo in the Democratic contest, widening his primary-night lead by a significant margin once ranked-choice tabulations were run."
  },
  {
    "title": "New Yorkers Embraced Ranked-Choice Voting. Mamdani’s Win Proves It.",
    "link": "https://www.nytimes.com/2025/07/01/nyregion/ranked-choice-voting-nyc-mayor.html",
    "summary": "Here are five takeaways from New York City’s second experience with ranked-choice voting, and how it helped Zohran Mamdani secure a decisive victory."
  },
  {
    "title": "Trump Falsely Claims Mamdani Is an Illegal Immigrant and Threatens to Arrest Him",
    "link": "https://www.nytimes.com/2025/07/01/us/politics/trump-zohran-mamdani.html",
    "summary": "President Trump claimed that the New York mayoral candidate, a naturalized U.S. citizen, was “here illegally,” his latest effort to promote false conspiracy theories about political opponents."
  },
  {
    "title": "An Offhand Remark About Gold Bars, Secretly Recorded, Upended His Life",
    "link": "https://www.nytimes.com/2025/07/01/climate/gold-bars-titanic-epa-date.html",
    "summary": "Brent Efron’s “boring” Tinder date wanted to hear all about his work at the Environmental Protection Agency, so Mr. Efron talked. If only he’d seen the hidden camera."
  },
  {
    "title": "Under a Drone-Swarmed Sky: Surviving in Eastern Ukraine",
    "link": "https://www.nytimes.com/2025/07/01/world/europe/ukraine-russia-frontline.html",
    "summary": "Towns and troops long accustomed to merciless bombardment are adjusting to an even denser pattern of attacks."
  },
  {
    "title": "Denmark Begins Drafting Women as Russian Threat Looms",
    "link": "https://www.nytimes.com/2025/07/01/world/europe/denmark-military-draft-women-russia.html",
    "summary": "The Nordic country for the first time has extended a lottery for compulsory military service to women in its latest move to expand its armed forces."
  },
  {
    "title": "Ali Shamkhani, Top Iran Official, Survived Israeli Strike",
    "link": "https://www.nytimes.com/2025/07/01/world/middleeast/iran-shamkhani-israel-attack.html",
    "summary": "Rear Adm. Ali Shamkhani was seen struggling to walk with a cane at a funeral procession this weekend for military commanders killed in the 12-day war."
  },
  {
    "title": "Columbia Will Pay $9 Million to Settle Lawsuit Over U.S. News Ranking",
    "link": "https://www.nytimes.com/2025/07/01/nyregion/columbia-university-us-news-ranking.html",
    "summary": "Students said they had been overcharged for their educations as a result of incorrect data that they said the school had used to artificially inflate its ranking."
  },
  {
    "title": "Columbia Cyberattack Appears Politically Motivated, University Says",
    "link": "https://www.nytimes.com/2025/07/01/nyregion/columbia-university-hacker.html",
    "summary": "The attacker, described as a “hacktivist,” shut down computer systems and stole student data last week."
  },
  {
    "title": "Jimmy Swaggart, Passionate Televangelist Ousted by Scandal, Dies at 90",
    "link": "https://www.nytimes.com/2025/07/01/us/the-rev-jimmy-lee-swaggart-dead.html",
    "summary": "A fire-and-brimstone preacher, he reached millions and made millions in a global enterprise before tumbling from grace over his encounters with a prostitute."
  },
  {
    "title": "Kodak, Once the Picture of a Dying Brand, Is Having a Moment",
    "link": "https://www.nytimes.com/2025/06/30/nyregion/the-kodak-brand-gets-a-second-life.html",
    "summary": "The company’s name has become synonymous with a failure to adapt to the digital revolution. But overseas, its logo has become an unlikely retro fashion statement."
  },
  {
    "title": "What ‘Globalize the Intifada’ Really Means",
    "link": "https://www.nytimes.com/2025/07/01/opinion/mamdani-intifada-israel.html",
    "summary": "Will liberals keep making excuses for Mamdani?"
  },
  {
    "title": "Trump’s Deportation Program Is About Control. Even if You Are a U.S. Citizen.",
    "link": "https://www.nytimes.com/2025/07/01/opinion/trump-deportation-immigration-control.html",
    "summary": "You cannot control outsiders without controlling insiders."
  },
  {
    "title": "The Senate Muscled Through Trump’s Big Policy Bill",
    "link": "https://www.nytimes.com/2025/07/01/briefing/senate-trump-policy-bill-ai-scrapers.html",
    "summary": "Also, heat waves are punishing India. Here’s the latest at the end of Tuesday."
  },
  {
    "title": "Storms Threaten to Bring Heavy Rain Across the Mid-Atlantic on Tuesday",
    "link": "https://www.nytimes.com/2025/07/01/weather/flood-warnings-storms-maryland-pennsylvania.html",
    "summary": "Forecasters warned of flash flooding across Maryland, Pennsylvania and New Jersey."
  },
  {
    "title": "Richard A. Boucher, Veteran State Department Spokesman, Dies at 73",
    "link": "https://www.nytimes.com/2025/07/01/us/politics/richard-a-boucher-dead.html",
    "summary": "Working for six secretaries of state, he was known for explaining and defending U.S. foreign policy in a noncombative tone, without interjecting his own opinion."
  },
  {
    "title": "The U.S. Sends Lots of Plastic Trash Overseas. Malaysia Just Said No Thanks.",
    "link": "https://www.nytimes.com/2025/07/01/climate/plastic-recycling-malaysia-import-ban.html",
    "summary": "No country receives more discarded plastic from wealthy countries, but shipments from the United States are no longer welcome."
  },
  {
    "title": "Lucy the Pig, a Celebrity on Staten Island, Can Stay at Home for Now",
    "link": "https://www.nytimes.com/2025/07/01/nyregion/lucy-pig-staten-island.html",
    "summary": "Health officials told Lucy’s owners that she would have to leave the city. After the family, the neighborhood and its political representatives protested, a temporary reprieve emerged."
  }
]