[
  {
    "title": "Trump Loyalists Push ‘Grand Conspiracy’ as New Subpoenas Land",
    "link": "https://www.nytimes.com/2025/11/09/us/politics/trump-conspiracy-probe-subpoenas.html",
    "summary": "The Justice Department moved an inquiry that appeared initially focused on the former C.I.A. director John O. Brennan to South Florida and is beginning to recruit line prosecutors."
  },
  {
    "title": "A Timeline of the Legal Saga Surrounding SNAP Payments",
    "link": "https://www.nytimes.com/2025/11/08/us/politics/snap-payments-timeline.html",
    "summary": "Weeks of uncertainty during the longest government shutdown in American history have left some states struggling to issue payments to food stamp recipients."
  },
  {
    "title": "Airport Disruptions May Get Worse This Week Amid Shutdown",
    "link": "https://www.nytimes.com/2025/11/09/business/airport-flights-cancellations.html",
    "summary": "The fact that planes are generally less full in early November have helped to ease the impact. That will change as Thanksgiving nears."
  },
  {
    "title": "Where Democrats Will Duel Next for the Party’s Future",
    "link": "https://www.nytimes.com/2025/11/09/us/politics/democrats-midterms-senate-house.html",
    "summary": "In Michigan, Maine and many other states, primary candidates will decide the party’s direction on a host of policy issues, and ultimately whether it has a center-left or left-wing vision."
  },
  {
    "title": "Mamdani, Mofongo and Rum: Democratic Squabbles Fade Away, for Now",
    "link": "https://www.nytimes.com/2025/11/09/nyregion/mamdani-somos-puerto-rico.html",
    "summary": "At an annual gathering in Puerto Rico for New York’s political class, former foes of Zohran Mamdani put aside their differences and tried to get information about his inner circle."
  },
  {
    "title": "With a Mayor-Elect From Queens, Mamdani’s Borough Is Having a Moment",
    "link": "https://www.nytimes.com/2025/11/09/nyregion/mamdani-queens-mayor.html",
    "summary": "When Zohran Mamdani is sworn in as New York City’s 111th mayor, he will be the first with such an intimate connection to Queens."
  },
  {
    "title": "Gavin Newsom, Eyeing 2028, Tries to Mess With Texas",
    "link": "https://www.nytimes.com/2025/11/08/us/politics/newsom-2028-texas-rally-abbott-trump.html",
    "summary": "Celebrating his recent redistricting victory, the California governor swooped into a state led by a Republican rival and sent the latest signal about his presidential ambitions."
  },
  {
    "title": "The Dangerous Stalemate Over Iran’s Nuclear Program",
    "link": "https://www.nytimes.com/2025/11/09/world/middleeast/iran-nuclear-program-israel.html",
    "summary": "With no negotiations, no oversight and no clarity about Iran’s stock of nuclear material, many in the region fear another war with Israel is inevitable."
  },
  {
    "title": "Hamas Hands Over Body of Israeli Soldier Held Since 2014",
    "link": "https://www.nytimes.com/2025/11/09/world/middleeast/hamas-hadar-goldin-israel.html",
    "summary": "Hamas returned to Israel the remains of Lt. Hadar Goldin, who was killed in a 2014 war in Gaza."
  },
  {
    "title": "Israeli Academics Find Themselves Isolated Despite Gaza Cease-Fire",
    "link": "https://www.nytimes.com/2025/11/09/world/middleeast/boycotts-israel.html",
    "summary": "Boycotts of Israeli universities, largely imposed in Europe, have multiplied since the start of the war and reflect Israel’s international isolation over its conduct in Gaza."
  },
  {
    "title": "The MAHA-Fueled Rise of Natural Family Planning",
    "link": "https://www.nytimes.com/2025/11/09/us/politics/maha-natural-family-planning.html",
    "summary": "A growing coalition of conservatives are speaking out against hormonal birth control, while promoting a more “natural” alternative."
  },
  {
    "title": "The Celebrated Chef Who Robbed Banks",
    "link": "https://www.nytimes.com/2025/11/09/us/chef-bank-robber.html",
    "summary": "Valentino Luchin, 62, once owned an acclaimed Italian restaurant. Now he sits in a Bay Area jail."
  },
  {
    "title": "Cruelty, Bigotry and Rage. What’s Not to Like?",
    "link": "https://www.nytimes.com/2025/11/09/opinion/right-wing-america-politics-culture.html",
    "summary": "This is what happens when the fringe becomes the mainstream (and vice versa)."
  },
  {
    "title": "Josh Shapiro Knows What the Democrats Need",
    "link": "https://www.nytimes.com/2025/11/09/opinion/josh-shapiro-democratic-party.html",
    "summary": "The Democratic Party will not return to the White House, nor reclaim Congress, until it learns to embrace centrist politicians like Pennsylvania’s governor."
  },
  {
    "title": "Banning Social Media",
    "link": "https://www.nytimes.com/2025/11/09/briefing/banning-social-media.html",
    "summary": "More schools and governments are turning to tech bans to try to keep kids off screens. Do they work?"
  },
  {
    "title": "What Questions Do You Have About Climate Change?",
    "link": "https://www.nytimes.com/2025/11/09/world/ask-a-correspondent-somini-sengupta-climate-change.html",
    "summary": "“Ask a Correspondent” will take your questions to Somini Sengupta, our international climate reporter."
  },
  {
    "title": "Philippines Braces for Typhoon Fung-Wong, While Still Reeling From the Last Storm",
    "link": "https://www.nytimes.com/2025/11/09/world/asia/philippines-typhoon-fung-wong.html",
    "summary": "Typhoon Fung-wong made landfall on the main island of Luzon, prompting the evacuation of more than one million people, just days after an earlier storm killed over 200."
  },
  {
    "title": "Arctic Blast Is Sweeping East, Bringing First Snow of the Season",
    "link": "https://www.nytimes.com/2025/11/09/weather/cold-snow-weather-forecast.html",
    "summary": "Temperatures 10 to 20 degrees below normal are expected to reach as deep as the South, forecasters said. Snow is likely in the Great Lakes, parts of the Northeast and the Appalachians."
  },
  {
    "title": "Outkast, the White Stripes, Cyndi Lauper and Soundgarden Join the Rock & Roll Hall of Fame",
    "link": "https://www.nytimes.com/2025/11/09/arts/music/rock-and-roll-hall-of-fame-induction.html",
    "summary": "Gen X celebrated its heroes at the ceremony, where Soundgarden and Salt-N-Pepa were honored alongside Chubby Checker, Bad Company, Joe Cocker and Warren Zevon."
  },
  {
    "title": "Blue Origin to Launch NASA’s ESCAPADE Mission to Mars: How to Watch",
    "link": "https://www.nytimes.com/2025/11/09/science/blue-origin-new-glenn-launch.html",
    "summary": "This will be the second flight of the orbital rocket from Jeff Bezos’s space company and will include a key test of whether it can land a booster stage for later reuse."
  }
]