[
  {
    "title": "What Epstein’s Emails Claim About Trump’s Knowledge of His Conduct",
    "link": "https://www.nytimes.com/2025/11/12/us/politics/epstein-emails-trump.html",
    "summary": "The House Oversight Committee on Wednesday released more than 20,000 pages of documents from Jeffrey Epstein’s estate. Times reporters provide context on key emails."
  },
  {
    "title": "Epstein Bantered Regularly With Larry Summers",
    "link": "https://www.nytimes.com/2025/11/12/us/politics/epstein-larry-summers.html",
    "summary": "The former Treasury secretary corresponded routinely with Jeffrey Epstein. In one series of exchanges, he sought Mr. Epstein’s advice on how to handle a female acquaintance."
  },
  {
    "title": "Michael Wolff, Chronicler of Elites, Advised Epstein About Trump",
    "link": "https://www.nytimes.com/2025/11/12/us/michael-wolff-epstein-trump-emails.html",
    "summary": "Mr. Wolff, it turns out, was enough of an insider to provide advice to Jeffrey Epstein on how to handle his dealings with Donald J. Trump."
  },
  {
    "title": "By Not Funding Food Stamps, Trump Risks Lasting Damage to Safety Net",
    "link": "https://www.nytimes.com/2025/11/12/us/politics/trump-food-stamps-safety-net.html",
    "summary": "For the poorest Americans, the expected end to the longest shutdown in history has left doubt and anxiety around the benefits known as SNAP."
  },
  {
    "title": "What to Know About SNAP, America’s Main Food Aid Program",
    "link": "https://www.nytimes.com/2025/11/12/us/politics/snap-food-aid-government-shutdown.html",
    "summary": "The shutdown brought the scale of the federal food aid program into focus and raised questions about how such a rich country could have so many people on nutrition assistance."
  },
  {
    "title": "As Shutdown Nears End, When Will SNAP and Air Travel Be Back to Normal?",
    "link": "https://www.nytimes.com/2025/11/12/us/shutdown-travel-snap-backpay.html",
    "summary": "Some programs like SNAP could be restored within hours, while other effects could take longer to unravel."
  },
  {
    "title": "Catholic Bishops Rebuke Trump’s Immigration Tactics in Rare Statement",
    "link": "https://www.nytimes.com/2025/11/12/us/bishops-trump-immigration.html",
    "summary": "In a rare statement, the bishops framed the immigration crisis in starkly moral terms. “We feel compelled now in this environment to raise our voices in defense of God-given human dignity,” they said."
  },
  {
    "title": "Federal Judge Calls For Release of Some Immigrants Arrested in Chicago Area",
    "link": "https://www.nytimes.com/2025/11/12/us/immigrants-wrongful-detention-chicago-release.html",
    "summary": "The judge raised concerns that federal agents may have violated terms of a consent decree during their immigration enforcement crackdown in Illinois."
  },
  {
    "title": "City Council Approves Plan That Could Bring 14,700 Homes to Queens",
    "link": "https://www.nytimes.com/2025/11/12/nyregion/new-york-city-queens-rezoning.html",
    "summary": "The New York plan would open up 54 blocks of Long Island City, which are mostly warehouses and parking lots, to housing."
  },
  {
    "title": "Adams Makes It Harder for Mamdani to Build Over Elizabeth Street Garden",
    "link": "https://www.nytimes.com/2025/11/12/nyregion/elizabeth-street-garden-parkland.html",
    "summary": "Mayor Eric Adams’s administration is designating the garden as parkland, which could stymie Mayor-elect Zohran Mamdani in his vow to revive the fight to put affordable housing there."
  },
  {
    "title": "Massachusetts Offered a Solution to Housing Shortages. Is It Working?",
    "link": "https://www.nytimes.com/2025/11/12/business/massachusetts-housing-bill-seasonal-communities.html",
    "summary": "The Affordable Housing Act designated Cape Cod, Martha’s Vineyard, the Berkshires and other resort towns as “seasonal communities,” making it easier to build homes there for workers."
  },
  {
    "title": "U.S. Mint Presses Final Penny After More Than 200 Years",
    "link": "https://www.nytimes.com/2025/11/12/business/penny-coin-legacy.html",
    "summary": "A long decline into irrelevance ended on Wednesday in Philadelphia."
  },
  {
    "title": "He Died at a School for Disabled People. Decades Later, His Brother Sought Answers.",
    "link": "https://www.nytimes.com/2025/11/12/us/fernald-state-school-disabled-people.html",
    "summary": "John Scott was rarely spoken of in his family after he was placed in an institution. After a half-century, his youngest brother set out to learn who he was and what happened to him."
  },
  {
    "title": "Gustavo Petro, the Rebel Turned President Willing to Take on Trump",
    "link": "https://www.nytimes.com/2025/11/12/world/americas/gustavo-petro-colombia-trump.html",
    "summary": "From his guerrilla roots, Colombia’s president, Gustavo Petro, has long embraced a confrontational style. Now, he has incurred President Trump’s wrath and is facing political fallout at home."
  },
  {
    "title": "350 Teachers on How Screens Take Over Classrooms, as Early as Kindergarten",
    "link": "https://www.nytimes.com/2025/11/12/upshot/teachers-survey-chromebooks-class.html",
    "summary": "Even as schools have banned phones, a Times survey shows how the pandemic-era practice of giving students their own laptops and tablets is here to stay."
  },
  {
    "title": "Michelle Obama’s New Book Is a Historical Document Dressed Up as a Coffee-Table Tome",
    "link": "https://www.nytimes.com/2025/11/12/style/michelle-obama-the-look.html",
    "summary": "“The Look” should be studied by generations to come, not because of what it reveals about fashion, but politics."
  },
  {
    "title": "Sally Kirkland, Scene-Stealing Actress, Dies at 84",
    "link": "https://www.nytimes.com/2025/11/12/movies/sally-kirkland-dead.html",
    "summary": "She received an Oscar nomination for the 1987 film “Anna” but spent much of her prolific career as a go-to supporting actress in movies like “The Sting” and “JFK.”"
  },
  {
    "title": "Former Aide to Gavin Newsom Charged With Corruption",
    "link": "https://www.nytimes.com/2025/11/12/us/newsom-aide-corruption-charges.html",
    "summary": "Dana Williamson, a top Democratic consultant in California, was accused of conspiring to skim over $200,000 in campaign funds that belonged to a Biden administration official."
  },
  {
    "title": "Iraq’s Prime Minister Leads in Elections but May Struggle to Form a Government",
    "link": "https://www.nytimes.com/2025/11/12/world/middleeast/iraq-elections.html",
    "summary": "Mohammed al-Sudani pitches himself as someone who can keep Iranian influence in check, but his vote share may not be big enough to ensure a clear political victory."
  },
  {
    "title": "Greenhouse Gas Emissions Head for a Record in 2025, Global Carbon Project Reports",
    "link": "https://www.nytimes.com/2025/11/12/climate/greenhouse-gas-emissions-china.html",
    "summary": "But there are signs that greenhouse gas pollution in China might be slowing, according to a new analysis."
  },
  {
    "title": "Britain Gives Go-Ahead to Smaller Nuclear Reactor in Wales",
    "link": "https://www.nytimes.com/2025/11/12/business/britain-nuclear-power-plant.html",
    "summary": "The government pledged 2.5 billion pounds for initial site work, but the decision to build a small, modular design may disappoint others, including the U.S. nuclear industry."
  },
  {
    "title": "Tim Kaine on Why He Voted to End the Government Shutdown",
    "link": "https://www.nytimes.com/2025/11/12/opinion/tim-kaine-shutdown-vote.html",
    "summary": "Extending the government shutdown would not have worked."
  },
  {
    "title": "Democrats Sure Taught Trump a Lesson",
    "link": "https://www.nytimes.com/2025/11/12/opinion/shutdown-democrats-senate-midterms.html",
    "summary": "It’s one he is unlikely to forget."
  },
  {
    "title": "Jeffrey Epstein Discussed Trump in Emails Released by Congress",
    "link": "https://www.nytimes.com/2025/11/12/briefing/epstein-trump-congress-shutdown.html",
    "summary": "Also, the penny was officially retired. Here’s the latest at the end of Wednesday."
  },
  {
    "title": "Former Syrian Security Official Indicted in Austria",
    "link": "https://www.nytimes.com/2025/11/12/world/europe/syria-security-official-indicted-war-crimes.html",
    "summary": "Prosecutors say a Syrian security official accused of torture hid in plain sight in Europe for years, protected by Israeli and Austrian intelligence agents."
  },
  {
    "title": "Russian Humanoid Robot Falls on Its Face in Hyped Debut",
    "link": "https://www.nytimes.com/2025/11/12/technology/ai-robot-russia-falls.html",
    "summary": "The robot, known as AIDOL, staggered onstage during a technology showcase in Moscow. Organizers blamed the mishap on calibration and lighting issues."
  },
  {
    "title": "Lucas Museum of Narrative Art in Los Angeles Sets 2026 Opening Date",
    "link": "https://www.nytimes.com/2025/11/12/arts/design/lucas-museum-opening-septemeber-2026.html",
    "summary": "The 300,000-square-foot building will open Sept. 22 and showcase comic art, illustrations and more across 35 galleries. It began construction in 2018 but faced multiple delays."
  },
  {
    "title": "California Rain Forecast Suddenly Intensifies, Raising Flooding Risks",
    "link": "https://www.nytimes.com/2025/11/12/weather/california-storm-la-san-francisco-rain-forecast.html",
    "summary": "The storm is expected to move quickly through Northern California by Thursday morning, but forecasters are concerned that it will stall in the southern part of the state."
  }
]