[
  {
    "title": "NYC, Long a City of Contradictions, Is Still Turning Up New Ones",
    "link": "https://www.nytimes.com/2025/11/01/nyregion/nyc-mayoral-election-future.html",
    "summary": "New York City has often set the political, cultural and financial course of the country. Tuesday’s mayoral election — and a New Yorker watching from Washington — could scramble it all."
  },
  {
    "title": "Trump’s Team Offers to Keep Some Ballroom Donors Incognito",
    "link": "https://www.nytimes.com/2025/11/01/us/politics/trumps-team-offers-to-keep-some-ballroom-donors-incognito.html",
    "summary": "Many corporate interests that have donated to the president’s pet project have business before his administration."
  },
  {
    "title": "Trump Threatens Military Action in Nigeria Over Protections for Christians",
    "link": "https://www.nytimes.com/2025/11/01/world/africa/trump-nigeria-military.html",
    "summary": "Accusing Nigeria of not doing enough to protect Christians from violence, President Trump said he had ordered the Pentagon to prepare for action."
  },
  {
    "title": "Uncertainty Persists for Americans Waiting for Food Benefits After SNAP Ruling",
    "link": "https://www.nytimes.com/2025/10/31/us/snap-food-stamps-aid.html",
    "summary": "Judges on Friday ordered the federal government to continue providing food assistance during the shutdown. But benefits will still most likely be interrupted."
  },
  {
    "title": "Trump Administration Must Make Food Stamp Payments Within Days, Judge Says",
    "link": "https://www.nytimes.com/2025/11/01/us/politics/trump-food-stamp-payments.html",
    "summary": "The written order came one day after a court told the Trump administration it must pay benefits in the program known as SNAP during the shutdown."
  },
  {
    "title": "California Promised Insurance Relief, But Delivered Loopholes",
    "link": "https://www.nytimes.com/2025/11/01/us/los-angeles-california-fire-insurance-regulations.html",
    "summary": "New regulations were supposed to ensure that homeowners in fire zones would have coverage available. But companies can still avoid serving many high-risk areas, a Times investigation found."
  },
  {
    "title": "A Third Trump Term Is Not the Charm",
    "link": "https://www.nytimes.com/2025/11/01/opinion/trump-third-term-constitution.html",
    "summary": "The Constitution is not a word game."
  },
  {
    "title": "Dawn of the Zombie Mall",
    "link": "https://www.nytimes.com/2025/11/01/opinion/romero-zombie-monroeville-mall-dawn-of-the-dead.html",
    "summary": "What does it mean when a cultural epicenter is poised to be little more than a dearly departed corpse?"
  },
  {
    "title": "Explosion at Harvard Medical School Was ‘Intentional,’ Officials Say",
    "link": "https://www.nytimes.com/2025/11/01/us/harvard-medical-school-explosion.html",
    "summary": "Two people were seen running from the building afterward, the school said. No injuries were reported, the school police said."
  },
  {
    "title": "In One Jamaican Town, Hurricane Melissa Left Behind Floodwaters and Dead Livestock",
    "link": "https://www.nytimes.com/2025/10/31/world/americas/hurricane-melissa-jamaica-flooding.html",
    "summary": "The Category 5 storm ravaged western Jamaica and drenched the small community of New River, where residents were coping with a massive clean up. At least 19 people have died nationwide, officials said."
  },
  {
    "title": "Zoë Wicomb, Acclaimed South African Author, Dies at 76",
    "link": "https://www.nytimes.com/2025/10/31/books/zoe-wicomb-dead.html",
    "summary": "In novels and short stories, she delivered sharp observations of the constraints and contradictions of apartheid and its aftermath."
  },
  {
    "title": "NYC Marathon Guide 2025: The Route, Start Times and More",
    "link": "https://www.nytimes.com/2025/10/30/nyregion/2025-nyc-marathon-guide.html",
    "summary": "Everything you need to know about Sunday’s five-borough race."
  }
]