[
  {
    "title": "U.S. Government to Take Cut of Nvidia and AMD A.I. Chip Sales to China",
    "link": "https://www.nytimes.com/2025/08/10/technology/us-government-nvidia-amd-chips-china.html",
    "summary": "In a highly unusual arrangement with President Trump, the companies are expected to kick 15 percent of what they make in China to the U.S. government."
  },
  {
    "title": "What the Nvidia Chip Payoff Deal Says About Trump’s Trade War",
    "link": "https://www.nytimes.com/2025/08/11/business/dealbook/nvidia-amd-chip-payoff-trump.html",
    "summary": "A deal for Nvidia and AMD to give the Trump administration a cut of chip sales to China raises questions about national security and trade policy goals."
  },
  {
    "title": "China’s Automakers Are Taking a Shortcut to European Markets",
    "link": "https://www.nytimes.com/2025/08/11/business/china-electric-vehicles-red-sea.html",
    "summary": "Ships carrying Chinese cars are using the Red Sea and Suez Canal even as other vessels still sail around Africa in fear of attacks by the Houthi militia."
  },
  {
    "title": "Small Businesses Brace for the Punishing Side Effects of Trump’s Tariffs",
    "link": "https://www.nytimes.com/2025/08/11/business/economy/tariffs-small-businesses.html",
    "summary": "Large firms with big bank balances, workers already in jobs and households near the top of the income ladder will have an easier time navigating the economic waves."
  },
  {
    "title": "Trump Prepares to Meet Putin, and Al Jazeera Says Israel Killed Its Journalists in Gaza",
    "link": "https://www.nytimes.com/2025/08/11/podcasts/the-headlines/trump-putin-israel-journalists-gaza.html",
    "summary": "Plus, a Labubu heist."
  },
  {
    "title": "A Sidelined Zelensky Warns That Russia Will Try to Deceive the U.S.",
    "link": "https://www.nytimes.com/2025/08/11/world/europe/ukraine-russia-putin-zelensky-alaska-talks.html",
    "summary": "Ukraine fears that the Kremlin will try to convince President Trump at U.S.-Russian talks in Alaska that Ukraine, not Russia, is the obstacle to peace."
  },
  {
    "title": "Vance Says U.S. Is Working for a Meeting With Trump, Putin and Zelensky",
    "link": "https://www.nytimes.com/2025/08/10/us/politics/jd-vance-zelensky-trump-putin.html",
    "summary": "The vice president said the White House was trying to determine “when these three leaders could sit down and discuss an end to this conflict.”"
  },
  {
    "title": "The Harvard-Trained Lawyer Behind Trump’s Fight Against Top Universities",
    "link": "https://www.nytimes.com/2025/08/11/us/politics/harvard-trump-may-mailman.html",
    "summary": "May Mailman is credited as an animating force behind a strategy that has intimidated independent institutions and undercut years of medical and scientific research."
  },
  {
    "title": "This Ohio Farm Community Is a Mecca for the ‘MAHA Mom’",
    "link": "https://www.nytimes.com/2025/08/11/us/politics/ohio-maha-moms-farms.html",
    "summary": "In a neighborhood that appeals to people from both the right and the left, residents strive for a finely tuned state of political harmony."
  },
  {
    "title": "Kennedy’s Next Target: the Federal Vaccine Court",
    "link": "https://www.nytimes.com/2025/08/11/health/kennedy-vaccine-court.html",
    "summary": "The system for compensating people injured by vaccines needs significant reform. But the health secretary could alter it in ways that ultimately reduce vaccine access for everyone."
  },
  {
    "title": "Israel’s Plan for Gaza City Is Still Unclear",
    "link": "https://www.nytimes.com/2025/08/11/world/middleeast/israel-gaza-netanyahu.html",
    "summary": "The Israeli government said last week that it wanted to capture Gaza City, but how and when it will proceed has yet to be decided."
  },
  {
    "title": "Israeli Strike Kills 4 Al Jazeera Journalists, Network Says",
    "link": "https://www.nytimes.com/2025/08/10/world/middleeast/israel-gaza-journalists-killed.html",
    "summary": "Anas al-Sharif, a well-known correspondent, was among those killed. Israel said it had targeted Mr. al-Sharif, claiming he worked for Hamas, which he had denied."
  },
  {
    "title": "Australia to Recognize Palestinian Statehood",
    "link": "https://www.nytimes.com/2025/08/11/world/australia/australia-palestine-statehood.html",
    "summary": "After similar announcements by France, Britain and Canada, Australia said it would act at the United Nations General Assembly session next month."
  },
  {
    "title": "For Lupita and Junior Nyong’o, ‘Twelfth Night’ Is Child’s Play, Revisited",
    "link": "https://www.nytimes.com/2025/08/11/theater/lupita-nyongo-twelfth-night-shakespeare-delacorte.html",
    "summary": "The siblings “really enjoyed make-believe” as kids. Now they are playing Shakespeare under the stars at the newly reopened Delacorte Theater in Central Park."
  },
  {
    "title": "Why A.I. Should Make Parents Rethink Posting Photos of Their Children Online",
    "link": "https://www.nytimes.com/2025/08/11/technology/personaltech/ai-kids-photos.html",
    "summary": "Artificial intelligence apps generating fake nudes, amid other privacy concerns, make “sharenting” far riskier than it was just a few years ago."
  },
  {
    "title": "I Never Understood Our Data-Saturated Life Until a Hurricane Shut It Down",
    "link": "https://www.nytimes.com/2025/08/11/magazine/hurricane-disaster-information-media-blackout.html",
    "summary": "When Helene disconnected my part of North Carolina for weeks, my neighbors and I had to relearn old ways of knowing what was happening — and what wasn’t."
  },
  {
    "title": "Will Judges Approve Trump’s Choice for U.S. Attorney in Manhattan?",
    "link": "https://www.nytimes.com/2025/08/11/nyregion/jay-clayton-attorney-doj-trump.html",
    "summary": "Jay Clayton, the interim U.S. attorney for the Southern District, was named on an interim basis after Senator Chuck Schumer blocked his nomination."
  },
  {
    "title": "Mamdani Will Visit 5 Boroughs on Anti-Trump Tour",
    "link": "https://www.nytimes.com/2025/08/11/nyregion/mamdani-trump-cuomo-mayor-nyc.html",
    "summary": "Zohran Mamdani, the Democratic candidate for mayor, will seek to highlight the ways he believes President Trump’s agenda hurts New York City."
  },
  {
    "title": "Children Were Sexually Abused in New Hampshire State Care. How Much Are They Owed?",
    "link": "https://www.nytimes.com/2025/08/11/us/politics/new-hampshire-sexual-abuse-settlements.html",
    "summary": "New Hampshire is backing away from a promise to pay victims hundreds of millions of dollars. Other states are also rethinking payouts to those harmed under their care."
  },
  {
    "title": "A Haven for English in the Most French of North American Cities",
    "link": "https://www.nytimes.com/2025/08/11/world/canada/quebec-city-morrin-centre.html",
    "summary": "For Quebec City’s tiny English-speaking community, a former jail turned library serves as an essential sanctuary in a metropolis where the domination of French is enshrined in law."
  },
  {
    "title": "Clashing Visions of Syria’s Future Play Out in Ancient Alleys of Damascus",
    "link": "https://www.nytimes.com/2025/08/11/world/middleeast/syria-damascus-conservative.html",
    "summary": "Many in the capital worry that the secular freedoms they enjoyed under the Assad regime are under threat from the new Islamist government."
  },
  {
    "title": "How Short-Term Thinking Is Destroying America",
    "link": "https://www.nytimes.com/2025/08/11/opinion/america-short-term-thinking.html",
    "summary": "Trump may be able to escape the consequences of his actions; the rest of us cannot."
  },
  {
    "title": "The A.O.C. Deepfake Was Terrible. The Proposed Solution Is Delusional.",
    "link": "https://www.nytimes.com/2025/08/11/opinion/alexandria-ocasio-cortez-deepfake-ai.html",
    "summary": "Critical thinking is not going to save us."
  },
  {
    "title": "North Korea’s Next Leader?",
    "link": "https://www.nytimes.com/2025/08/11/briefing/north-koreas-succession-kim-jong-un.html",
    "summary": "Kim Jong-un’s daughter, Kim Ju-ae, is perhaps being primed to take control of the regime one day."
  },
  {
    "title": "AOL Will End Its Dial-Up Internet Service (Yes, It’s Still Operating)",
    "link": "https://www.nytimes.com/2025/08/11/business/aol-dial-up-internet.html",
    "summary": "The company said the service, synonymous with the early days of the internet, will be discontinued on Sept. 30."
  },
  {
    "title": "Miguel Uribe, Colombian Senator Shot at Campaign Event, Dies at 39",
    "link": "https://www.nytimes.com/2025/08/11/world/americas/miguel-uribe-turbay-dead-colombia-assassination.html",
    "summary": "Mr. Uribe, a presidential hopeful, was shot in June at a campaign rally in Bogotá in an attack that shocked the nation."
  },
  {
    "title": "Heavy Rains in Wisconsin Lead to Flooding and Early Closure of State Fair",
    "link": "https://www.nytimes.com/2025/08/10/us/wisconsin-flood-storms-rain.html",
    "summary": "Record-setting rainfall caused intense flooding in and around the Milwaukee area starting on Saturday night."
  },
  {
    "title": "Terry Reid, Rock Singer Known as ‘Superlungs,’ Dies at 75",
    "link": "https://www.nytimes.com/2025/08/10/arts/music/terry-reid-dead.html",
    "summary": "He missed his chance to be Led Zeppelin’s lead vocalist, but his solo work — and his otherworldly voice — drew raves from Aretha Franklin and others."
  }
]