[
  {
    "title": "U.S. Strikes ISIS in Nigeria After Trump Warned of Attacks on Christians",
    "link": "https://www.nytimes.com/2025/12/25/us/politics/trump-isis-nigeria-strike.html",
    "summary": "The attack comes after President Trump ordered the Defense Department last month to prepare to intervene militarily in Nigeria to protect Christians from Islamic militants."
  },
  {
    "title": "What to Know About U.S. Military Action in Nigeria",
    "link": "https://www.nytimes.com/2025/11/03/world/africa/trump-nigeria-military-christians.html",
    "summary": "Before the strikes on Thursday, President Trump said he would halt all aid and go in “guns-a-blazing” to target affiliates of a resurgent Islamic State."
  },
  {
    "title": "What to Know About ISIS Terror Attacks",
    "link": "https://www.nytimes.com/2025/01/01/world/middleeast/isis-islamic-state.html",
    "summary": "The terror group has lost its territorial stronghold, but it still orchestrates and inspires violence through affiliates across Africa and beyond."
  },
  {
    "title": "Zelensky Says He’ll Meet With Trump in the ‘Near Future’",
    "link": "https://www.nytimes.com/2025/12/26/world/europe/zelensky-trump-ukraine-russia.html",
    "summary": "There was no immediate confirmation from the White House about a meeting, which President Volodymyr Zelensky of Ukraine has sought since the latest U.S.-.led push for peace got underway."
  },
  {
    "title": "Trump Administration Emphasizes Religion in Official Christmas Messages",
    "link": "https://www.nytimes.com/2025/12/25/admin/trump-administration-religion-christmas.html",
    "summary": "Government officials have traditionally steered clear of such overtly religious language, as the Constitution prohibits the establishment of an official state religion."
  },
  {
    "title": "As A.I. Companies Borrow Billions, Debt Investors Grow Wary",
    "link": "https://www.nytimes.com/2025/12/26/business/ai-debt-investors.html",
    "summary": "Artificial intelligence companies looking to raise funds are being made to pay lofty interest rates, as debt investors become cautious."
  },
  {
    "title": "Data Center Surge Reaches India as American Tech Giants Invest Billions",
    "link": "https://www.nytimes.com/2025/12/26/business/india-data-centers-google-amazon-microsoft.html",
    "summary": "Megacities in southern India are attracting enormous investments to help build artificial intelligence infrastructure to serve the world’s most data-hungry country."
  },
  {
    "title": "One Gazan Girl’s Fight to Survive Extreme Hunger",
    "link": "https://www.nytimes.com/2025/12/26/world/middleeast/hoda-gaza-malnutrition-israel.html",
    "summary": "After Israel sealed Gaza’s borders, Hoda Abu al-Naja, 12, who suffered from celiac disease, spent months seeking the food and care she needed to combat malnutrition."
  },
  {
    "title": "From the Shadows to Power: How the Hindu Right Reshaped India",
    "link": "https://www.nytimes.com/2025/12/26/world/asia/india-hindu-right-rss-modi.html",
    "summary": "The far-right group known as the R.S.S., whose members include Prime Minister Narendra Modi, has spent a century trying to make India a Hindu-first nation."
  },
  {
    "title": "5 Key Moments in the Rise of India’s Hindu-First Powerhouse",
    "link": "https://www.nytimes.com/2025/12/26/world/asia/5-key-moments-in-the-rise-of-indias-hindu-first-powerhouse.html",
    "summary": "The Rashtriya Swayamsevak Sangh, known as the R.S.S., has survived bans and vilification to emerge as the force reshaping India’s secular republic into a Hindu nation."
  },
  {
    "title": "Northern California Conservatives Are Frustrated They Could Get a Democratic Representative",
    "link": "https://www.nytimes.com/2025/12/26/us/politics/california-redistricting-lamalfa-republicans.html",
    "summary": "The passage of Proposition 50, which redrew California’s congressional map, means that all of the state’s conservative north is likely to be represented by Democrats."
  },
  {
    "title": "A College Freshman Is the Unlikely Source of Alabama’s New Political Maps",
    "link": "https://www.nytimes.com/2025/12/26/us/alabama-redistricting-maps-college-student.html",
    "summary": "Daniel DiDonato, 19, has loved elections since he was in fourth grade. He also loves maps."
  },
  {
    "title": "When the Democratic Door-Knocker Has Something Unscripted to Say",
    "link": "https://www.nytimes.com/2025/12/26/us/politics/democrats-canvassing-door-knocking.html",
    "summary": "Zohran Mamdani’s campaign encouraged canvassers to ditch their scripts in pursuit of genuine, off-the-cuff-conversation. It’s a strategy that some Democratic strategists want to see more of."
  },
  {
    "title": "Myanmar’s Health Crisis Spills Over Borders",
    "link": "https://www.nytimes.com/2025/12/26/world/asia/myanmar-conflict-health-crisis.html",
    "summary": "Fighting has caused the spread of illnesses like malaria and cholera. In a worst-case scenario, the situation could threaten regional health security, experts say."
  },
  {
    "title": "New York City Braces for Heavy Snow as Winter Storm Approaches",
    "link": "https://www.nytimes.com/2025/12/25/nyregion/snow-storm-nyc-weather-forecast.html",
    "summary": "The region could see accumulations of up to 5 to 7 inches from late Friday into Saturday."
  },
  {
    "title": "California Prepares for More Rain After a Soggy Christmas",
    "link": "https://www.nytimes.com/2025/12/25/weather/rain-flooding-los-angeles-storm.html",
    "summary": "Officials warned that driving would remain hazardous across much of the state, with heavy rain still to fall in some places that broke records on Christmas Eve."
  },
  {
    "title": "What Can Hundreds of Pieces of Litter Tell Us About Manhattan?",
    "link": "https://www.nytimes.com/2025/12/26/nyregion/nyc-litter.html",
    "summary": "Shoes. A phone. Receipts. A comb. Traces of wild nights and hurried days are all around us."
  },
  {
    "title": "With Help of Lina Khan, Mamdani Looks to Quickly Cut Costs for New Yorkers",
    "link": "https://www.nytimes.com/2025/12/26/nyregion/lina-khan-mamdani-affordability-new-york-city.html",
    "summary": "Mayor-elect Zohran Mamdani’s signature plans for New York City will take time. Lina Khan, the former chair of the Federal Trade Commission, has ideas for making a swift impact."
  },
  {
    "title": "Feral Dogs on the Roof of the World",
    "link": "https://www.nytimes.com/2025/12/26/science/feral-dogs-wildlife-ladakh.html",
    "summary": "As many as 25,000 free-ranging dogs roam the cold, high-altitude desert of Ladakh, India. That’s a problem for wildlife and people alike."
  },
  {
    "title": "Trump Is Getting Weaker, and the Resistance Is Getting Stronger",
    "link": "https://www.nytimes.com/2025/12/26/opinion/trump-weaker-resistance-stronger.html",
    "summary": "It’s become easier to imagine the moment when Trump’s mystique finally evaporates."
  },
  {
    "title": "Sick of Trump News? I’m Here for You.",
    "link": "https://www.nytimes.com/2025/12/26/opinion/good-essays-news-sidneys.html",
    "summary": "Here are the best nonfiction essays of the year, according to me."
  },
  {
    "title": "Flu Cases Climb to Highest Levels in New York City in a Decade",
    "link": "https://www.nytimes.com/2025/12/26/nyregion/nyc-flu-cases.html",
    "summary": "The number of patients going to hospital emergency rooms with flulike symptoms has soared."
  },
  {
    "title": "6 Killed in Syria Mosque Blast, Government Says",
    "link": "https://www.nytimes.com/2025/12/26/world/middleeast/syria-homs-mosque-explosion.html",
    "summary": "No group has claimed responsibility for the explosion, which happened on a day when many worshipers attend mosque for Friday Prayer."
  },
  {
    "title": "Death Toll in UPS Plane Crash Rises to 15",
    "link": "https://www.nytimes.com/2025/12/25/us/ups-plane-crash-louisville-kentucky.html",
    "summary": "Alain Rodriguez Colina, who was injured when a cargo plane crashed into his Kentucky workplace more than a month ago, died on Christmas Day."
  },
  {
    "title": "No Power, No Heat, No Water: Odesa’s Days of Hell Under Russian Fire",
    "link": "https://www.nytimes.com/2025/12/25/world/europe/ukraine-odesa.html",
    "summary": "The toll on older people and those with disabilities is especially severe as Moscow’s forces repeatedly attack the port city’s infrastructure."
  }
]