[
  {
    "title": "As Minneapolis Rages, Legislators Move to Restrict ICE in Their States",
    "link": "https://www.nytimes.com/2026/01/28/us/politics/minneapolis-ice-states.html",
    "summary": "Efforts to curtail federal law enforcement tactics began last year, but with the deaths of Alex Pretti and Renee Good, Democratic lawmakers are pushing harder."
  },
  {
    "title": "D.H.S. Review Does Not Say Pretti Brandished Gun, As Noem Claimed",
    "link": "https://www.nytimes.com/2026/01/27/us/politics/pretti-shooting-minneapolis-dhs-report.html",
    "summary": "An initial report from an internal agency watchdog says the Minneapolis man was shot by law enforcement after resisting arrest, but makes no mention of the allegations leveled by a Trump administration official."
  },
  {
    "title": "Republicans Shift Tone After Killings, Criticizing Trump’s Immigration Push",
    "link": "https://www.nytimes.com/2026/01/27/us/republicans-shift-tone-immigration.html",
    "summary": "With the president signaling a pivot in his crackdown, G.O.P. lawmakers have felt freer to express concern. But it’s not clear what they are willing to do about it."
  },
  {
    "title": "Democrats Push to Impeach Kristi Noem, and Ilhan Omar Is Attacked in Minneapolis",
    "link": "https://www.nytimes.com/2026/01/28/podcasts/the-headlines/democrats-impeach-noem-ilhan-omar-attacked.html",
    "summary": "Plus, the woman who helped make GPS possible."
  },
  {
    "title": "Fed Meeting Comes at Pivotal Moment for Central Bank’s Independence",
    "link": "https://www.nytimes.com/2026/01/28/business/economy/fed-trump-powell-interest-rates.html",
    "summary": "The Trump administration has unleashed a barrage of attacks on the Federal Reserve, including a criminal investigation into its chair, Jerome H. Powell."
  },
  {
    "title": "A Municipal Debt Boom Is Driving Public Projects and Tax Breaks for Investors",
    "link": "https://www.nytimes.com/2026/01/28/business/economy/municipal-debt-market.html",
    "summary": "Municipal debt issuance surpassed $500 billion last year, a record that’s found a deep pool of buyers."
  },
  {
    "title": "What to Watch as the Federal Reserve Meets",
    "link": "https://www.nytimes.com/2026/01/28/business/economy/fed-interest-rates.html",
    "summary": "The central bank is expected to hold interest rates steady on Wednesday after a series of reductions in the latter half of 2025. The big question is how long the pause will last."
  },
  {
    "title": "Iran Killed Thousands of Protesters. Here Are Five of Their Stories.",
    "link": "https://www.nytimes.com/2026/01/28/world/middleeast/iran-protester-deaths.html",
    "summary": "“He went out for freedom,” said the cousin of one of those who was killed when Iranian authorities mounted a deadly crackdown on protests across the country."
  },
  {
    "title": "After Naval Drills With Iran, South Africa Faces New U.S. Attacks",
    "link": "https://www.nytimes.com/2026/01/28/world/africa/south-africa-iran-navy-drills-trump.html",
    "summary": "The exercises were the second time in six months that President Cyril Ramaphosa appeared to be blindsided by his own military regarding relations with Tehran."
  },
  {
    "title": "In Kherson, Ukraine, Every Step Outside Risks Death by Drone",
    "link": "https://www.nytimes.com/2026/01/28/world/europe/kherson-ukraine-drones-russia.html",
    "summary": "Russian attacks on civilians in Kherson, in southern Ukraine, have forced important aspects of life to go underground, offering a vision of a postapocalyptic future."
  },
  {
    "title": "Sundance Film Festival Says Goodbye to Park City, Utah",
    "link": "https://www.nytimes.com/2026/01/28/business/media/sundance-film-festival-park-city-boulder.html",
    "summary": "“It’s hard not to feel a disturbance in the force,” said Ethan Hawke, whose acting career took off after his early movies appeared at the Utah festival in the 1990s."
  },
  {
    "title": "Democrats Restore Minnesota House to Even Split Amid Immigration Turmoil",
    "link": "https://www.nytimes.com/2026/01/27/us/minnesota-house-special-elections.html",
    "summary": "In special elections on Tuesday, Democrats won two left-leaning districts, preventing Republicans from holding a majority in the State House of Representatives."
  },
  {
    "title": "Virginia Judge Blocks Democrats’ Efforts to Redraw Congressional Maps",
    "link": "https://www.nytimes.com/2026/01/27/us/virginia-court-ruling-redistricting.html",
    "summary": "Democratic leaders vowed to appeal the lower court ruling, which found that the legislative process behind the redistricting push was improper."
  },
  {
    "title": "Another Weekend Winter Storm? Forecast Details and Updates.",
    "link": "https://www.nytimes.com/2026/01/27/weather/next-winter-storm-forecast-snow-ice.html",
    "summary": "Meteorologists are watching another storm that could hit the East Coast this weekend."
  },
  {
    "title": "Loose Rules Let New York State Police Hand Out Lax Penalties for Serious Misconduct",
    "link": "https://www.nytimes.com/2026/01/28/us/new-york-state-police-discipline.html",
    "summary": "New York State troopers used the badge to settle personal scores and elicit favors. Still, they remained on the job, an investigation found."
  },
  {
    "title": "How We Tracked Down Thousands of Police Misconduct Files",
    "link": "https://www.nytimes.com/2026/01/28/us/how-we-tracked-down-thousands-of-police-misconduct-files.html",
    "summary": "Freedom of Information requests led to the discovery of varied offenses by officers around New York State."
  },
  {
    "title": "How the Online SAT May be Vulnerable to Cheating",
    "link": "https://www.nytimes.com/2026/01/28/us/politics/how-the-online-sat-may-be-vulnerable-to-cheating.html",
    "summary": "Sites in China are selling test questions, and online forums offer software that can bypass test protections, according to tutors and testing experts raising alarms."
  },
  {
    "title": "In Nigeria, a Catholic Bishop Tries to Tone Down the Uproar After U.S. Missile Strikes",
    "link": "https://www.nytimes.com/2026/01/28/world/africa/nigeria-catholic-bishop-muslims-trump.html",
    "summary": "Bishop Matthew Hassan Kukah, often called “the conscience of the nation,” has been trying to tone down the uproar after President Trump bombed a region in his diocese."
  },
  {
    "title": "These Democrats Want Clinton to Answer for Epstein. Good.",
    "link": "https://www.nytimes.com/2026/01/28/opinion/clinton-epstein-house-contempt.html",
    "summary": "As Democrats work to regain the public trust and to shed their image as the party of elites, they cannot be seen as treating elites in their party as above the law."
  },
  {
    "title": "Esther Perel on Why A.I. Intimacy Feels Safe but Isn’t Real",
    "link": "https://www.nytimes.com/2026/01/28/opinion/esther-perel-ai-chatbots-romance.html",
    "summary": "Perel, a renowned psychotherapist, doesn’t really think society can — or should — fall in love with a machine."
  },
  {
    "title": "Amazon to Cut 16,000 Jobs in Latest Round of Layoffs",
    "link": "https://www.nytimes.com/2026/01/28/technology/amazon-corporate-layoffs.html",
    "summary": "The e-commerce giant has been cutting costs while pouring resources into building data centers to compete in the race to dominate artificial intelligence."
  },
  {
    "title": "Safety Board Blames F.A.A. For Multiple Failures in D.C. Crash",
    "link": "https://www.nytimes.com/2026/01/27/us/politics/dca-plane-collision-faa.html",
    "summary": "The National Transportation Safety Board found the probable causes of the midair collision last year included poorly designed flight routes and ignored warnings about risks."
  },
  {
    "title": "The Rise and Fall of South Korean First Lady Kim Keon Hee",
    "link": "https://www.nytimes.com/2026/01/28/world/asia/korea-first-lady-kim-keon-hee-jail.html",
    "summary": "Kim Keon Hee is the first former presidential spouse in South Korea to be convicted on a criminal charge. Her downfall began after her husband declared martial law."
  }
]