[
  {
    "title": "Alina Habba, Trump’s Former Lawyer, Is Unlawful U.S. Attorney, Appeals Court Says",
    "link": "https://www.nytimes.com/2025/12/01/nyregion/alina-habba-unlawful.html",
    "summary": "The judges wrote that the Trump Administration appeared to have become frustrated by legal and political barriers that have prevented its preferred U.S. attorneys from leading federal prosecutors’ offices."
  },
  {
    "title": "For ‘No Tax on Tips,’ the I.R.S. Gets Intimate",
    "link": "https://www.nytimes.com/2025/12/01/us/politics/no-tax-on-tips-irs-exclusions.html",
    "summary": "The Trump administration wants to exclude earnings from “pornographic activity” from a new tax break for tips. Will the I.R.S. know it when it sees it?"
  },
  {
    "title": "Johnson and Trump Try to Avoid an Upset House Loss in Tennessee",
    "link": "https://www.nytimes.com/2025/12/01/us/politics/trump-tennessee-election.html",
    "summary": "Speaker Mike Johnson put the president on speakerphone during a Monday stop in the state, underscoring the unusual amount of national attention on a House special election."
  },
  {
    "title": "Despite Supreme Court Wins, Elite D.O.J. Unit Has Seen Mass Turnover",
    "link": "https://www.nytimes.com/2025/12/01/us/trump-solicitor-general-supreme-court.html",
    "summary": "Even with an exodus of lawyers, the Office of the Solicitor General has had remarkable success. But fiery rhetoric and close White House ties have raised concerns."
  },
  {
    "title": "Hong Kong Contractors Used Unsafe Netting at Fire Site, Officials Say",
    "link": "https://www.nytimes.com/2025/12/01/world/asia/hong-kong-fire.html",
    "summary": "Investigators say contractors wrapped the buildings in substandard scaffolding netting and then sought to hide it from inspectors. The toll from the fire rose to 151."
  },
  {
    "title": "Many Fighting Climate Change Worry They Are Losing the Information War",
    "link": "https://www.nytimes.com/2025/11/30/climate/climate-change-disinformation.html",
    "summary": "Shifting politics, intensive lobbying and surging disinformation online have undermined international efforts to respond to the threat."
  },
  {
    "title": "Love Clothes? We Want to Hear About Your Favorite Stores.",
    "link": "https://www.nytimes.com/2025/11/30/style/favorite-clothes-stores-us-share.html",
    "summary": "Tell us about the places big and small, new and old, where you have the most fun shopping in person."
  },
  {
    "title": "A Surprise When Your Package Arrives: You Have to Pay the Tariff",
    "link": "https://www.nytimes.com/2025/12/01/business/tariffs-customs-retail-shopping.html",
    "summary": "The end of a tariff exemption on goods worth $800 or less has left some U.S. shoppers with an extra shipping bill that must be paid before delivery."
  },
  {
    "title": "People Are Ordering Smaller Pizzas and Fewer Toppings. What Does That Tell Us?",
    "link": "https://www.nytimes.com/2025/12/01/business/consumers-pizza-sales.html",
    "summary": "Sales are softening at big chains and independent shops aren’t selling as many extras. Competition, diet trends and consumer anxiety may all be playing a part."
  },
  {
    "title": "Get Ready, America: Here Come China’s Food and Drink Chains",
    "link": "https://www.nytimes.com/2025/12/01/business/china-restaurants-america.html",
    "summary": "China’s fast-food and beverage brands have an opportunity to expand in the United States and escape cutthroat competition at home."
  },
  {
    "title": "U.S. Pushes U.K. to Spend More on Medicines in Deal to Avoid Tariffs",
    "link": "https://www.nytimes.com/2025/12/01/business/us-uk-pharma-tariffs-prices.html",
    "summary": "President Trump has complained that wealthy countries like Britain pay too little for drugs, leading America to bear much of the burden of the costs of medicines."
  },
  {
    "title": "The Transgender Cancer Patient and What She Heard on Tape",
    "link": "https://www.nytimes.com/2025/12/01/nyregion/transgender-patient-records-during-cancer-surgery.html",
    "summary": "Jennifer Capasso had endured multiple tumors. She wondered what might be said during her next cancer surgery. So, she hit record on her phone."
  },
  {
    "title": "Trump-Endorsed Candidate and Sportscaster Lead Honduran Presidential Race",
    "link": "https://www.nytimes.com/2025/11/30/world/americas/honduras-election.html",
    "summary": "Electoral authorities said partial results showed the two conservative candidates were virtually tied — and far ahead of the governing left-wing party."
  },
  {
    "title": "Lawmakers Suggest Follow-Up Boat Strike Could Be a War Crime",
    "link": "https://www.nytimes.com/2025/11/30/us/politics/trump-boat-strikes-war-crime.html",
    "summary": "Top Republicans have joined Democrats in demanding answers about the escalating military campaign the Trump administration says is aimed at targeting drug traffickers."
  },
  {
    "title": "The ‘Race Against Time’ to Save Music Legends’ Decaying Tapes",
    "link": "https://www.nytimes.com/2025/12/01/arts/music/iron-mountain-audio-tape-preservation.html",
    "summary": "New problems are plaguing old reels, putting decades of history at risk. One man, armed with hair dryers and a love of tinkering, is leading the charge to rescue them."
  },
  {
    "title": "Floods in Indonesia, Sri Lanka, Thailand and Vietnam Have Killed Over 1,200. Here’s What to Know.",
    "link": "https://www.nytimes.com/2025/12/01/world/asia/flooding-sri-lanka-indonesia-thailand-vietnam-cyclone-rain.html",
    "summary": "Hundreds more were still missing and millions have been displaced in the rain-drenched region, with Sri Lanka and Indonesia hit particularly hard."
  },
  {
    "title": "Sri Lanka Declares ‘Largest’ Disaster as Cyclone Death Toll Rises to 355",
    "link": "https://www.nytimes.com/2025/12/01/world/asia/sri-lanka-floods-cyclone.html",
    "summary": "The country’s president said the nationwide flooding after the storm hit last week was the most challenging natural disaster in the island nation’s history."
  },
  {
    "title": "Netanyahu’s Pardon Request Borrows From Trump’s Playbook",
    "link": "https://www.nytimes.com/2025/12/01/world/middleeast/netanyahu-pardon-corruption-israel-trump.html",
    "summary": "In many ways, Prime Minister Benjamin Netanyahu’s request mimics how President Trump has assailed his perceived enemies and attacked legal proceedings against him."
  },
  {
    "title": "Our 2025 Cookie Week Recipes Are Here",
    "link": "https://cooking.nytimes.com/article/2025-cookie-week-recipes",
    "summary": "This year’s Cookie Week recipes are inspired by the flavors of treats we love, like mint chocolate chip ice cream, Vietnamese coffee and gingery Dark ’n’ Stormy cocktails."
  },
  {
    "title": "College Students Choosing A.I. Majors Over Computer Science",
    "link": "https://www.nytimes.com/2025/12/01/technology/college-computer-science-ai-boom.html",
    "summary": "At M.I.T., a new program called “artificial intelligence and decision-making” is now the second-most-popular undergraduate major."
  },
  {
    "title": "Young Workers Learn to Embrace the Office",
    "link": "https://www.nytimes.com/2025/12/01/business/young-workers-office.html",
    "summary": "Remote work means less training and opportunity for advancement, especially for younger workers, research suggests. Some are getting the message."
  },
  {
    "title": "This Is the Story of How the Democrats Blew It on Gaza",
    "link": "https://www.nytimes.com/2025/12/01/opinion/democrats-israel.html",
    "summary": "It may be tempting to memory hole what happened in Gaza. That would only compound the mistake of ignoring, or rationalizing, an intolerable reality."
  },
  {
    "title": "Why Hepatitis B Vaccine Changes Would be Devastating",
    "link": "https://www.nytimes.com/2025/12/01/opinion/hepatitis-b-vaccine.html",
    "summary": "Changes to the vaccine recommendation could be disastrous."
  },
  {
    "title": "Your Drone Questions",
    "link": "https://www.nytimes.com/2025/12/01/briefing/your-drone-questions.html",
    "summary": "We asked readers of The Morning for their questions about drones. Today, Times journalists answer."
  },
  {
    "title": "Winter Storm Expected to Slam Northeast U.S. With Heavy Snow",
    "link": "https://www.nytimes.com/2025/12/01/us/snowstorm-noreaster-northeast-new-england.html",
    "summary": "Forecasters expected the storm to track up the Eastern Seaboard Monday night into Tuesday, leaving as much as a foot of snow in parts of the Northeast United States."
  },
  {
    "title": "Outdoor Concerts? Uncovered Hair? Shimmying in Public? Is This Iran?",
    "link": "https://www.nytimes.com/2025/12/01/world/middleeast/iran-loosening-social-restrictions.html",
    "summary": "Young people across Iran have been leading a dramatic change in social mores in recent months. “We have a fearless young generation that is breaking taboos.”"
  },
  {
    "title": "Luigi Mangione Appears in Court as His Lawyers Try to Exclude Evidence",
    "link": "https://www.nytimes.com/2025/12/01/nyregion/mangione-hearing-what-to-know.html",
    "summary": "Lawyers for Mr. Mangione, accused of killing a health insurance executive in Manhattan, are asking a judge to throw out materials gathered when he was arrested in Pennsylvania."
  },
  {
    "title": "Sean ‘Diddy’ Combs Had a Camera Follow Him. 50 Cent Has the Footage.",
    "link": "https://www.nytimes.com/2025/12/01/arts/music/sean-combs-diddy-50-cent-documentary.html",
    "summary": "The mogul’s spokesman said he was “deeply concerned” that video shot days before Mr. Combs’s 2024 arrest appears in a new documentary series produced by his rival."
  }
]