[
  {
    "title": "U.S. Strikes ISIS in Nigeria After Trump Warned of Attacks on Christians",
    "link": "https://www.nytimes.com/2025/12/25/us/politics/trump-isis-nigeria-strike.html",
    "summary": "The attack comes after President Trump ordered the Defense Department last month to prepare to intervene militarily in Nigeria to protect Christians from Islamic militants."
  },
  {
    "title": "What to Know About U.S. Military Action in Nigeria",
    "link": "https://www.nytimes.com/2025/11/03/world/africa/trump-nigeria-military-christians.html",
    "summary": "Before the strikes on Thursday, President Trump said he would halt all aid and go in “guns-a-blazing” to target militants."
  },
  {
    "title": "What to Know About ISIS Terror Attacks",
    "link": "https://www.nytimes.com/2025/01/01/world/middleeast/isis-islamic-state.html",
    "summary": "The terror group has lost its territorial stronghold, but it still orchestrates and inspires violence through affiliates across Africa and beyond."
  },
  {
    "title": "New York City Braces for Heavy Snow as Winter Storm Approaches",
    "link": "https://www.nytimes.com/2025/12/25/nyregion/snow-storm-nyc-weather-forecast.html",
    "summary": "The region could see accumulations of up to 5 to 7 inches from late Friday into Saturday."
  },
  {
    "title": "California Prepares for More Rain After a Soggy Christmas",
    "link": "https://www.nytimes.com/2025/12/25/weather/rain-flooding-los-angeles-storm.html",
    "summary": "Officials warned that driving would remain hazardous across much of the state, with heavy rain still to fall in some places that broke records on Christmas Eve."
  },
  {
    "title": "Trump Administration Emphasizes Religion in Official Christmas Messages",
    "link": "https://www.nytimes.com/2025/12/25/admin/trump-administration-religion-christmas.html",
    "summary": "Government officials have traditionally steered clear of such overtly religious language, as the Constitution prohibits the establishment of an official state religion."
  },
  {
    "title": "Kennedy Center’s Christmas Eve Jazz Show Canceled After Trump Name Added to Building",
    "link": "https://www.nytimes.com/2025/12/24/us/kennedy-center-christmas-eve-concert-trump.html",
    "summary": "Chuck Redd, a jazz musician, said he canceled his annual concert after President Trump’s name was affixed to the Washington building’s facade."
  },
  {
    "title": "Trump Has a New Auto Loan Tax Break. Here’s Who Could Benefit.",
    "link": "https://www.nytimes.com/2025/12/25/us/politics/trump-auto-loan-deduction-benefits.html",
    "summary": "Many Americans can take advantage of President Trump’s deduction on auto loan interest, but the tax break will provide only modest savings."
  },
  {
    "title": "Judge Blocks Detention of British Researcher Who Scrutinizes Online Hate",
    "link": "https://www.nytimes.com/2025/12/25/us/politics/imran-ahmed-judge-order.html",
    "summary": "Imran Ahmed, who runs an organization that chronicles disinformation, was among five Europeans the State Department had barred, claiming they promote censorship."
  },
  {
    "title": "No Power, No Heat, No Water: Odesa’s Days of Hell Under Russian Fire",
    "link": "https://www.nytimes.com/2025/12/25/world/europe/ukraine-odesa.html",
    "summary": "The toll on older people and those with disabilities is especially severe as Moscow’s forces repeatedly attack the port city’s infrastructure."
  },
  {
    "title": "That Old Classic Film in the Theater? It Might Be From This Man’s House.",
    "link": "https://www.nytimes.com/2025/12/25/nyregion/old-film-collector.html",
    "summary": "The artifacts of 20th-century cinema are being preserved in museums, and in the care of private film collectors like Brian Darwas, who has hundreds of movie prints at his home."
  },
  {
    "title": "From Pariah to Power: The Hindu Right’s 100-Year Quest to Reshape India",
    "link": "https://www.nytimes.com/2025/12/26/world/asia/india-hindu-right-rss-modi.html",
    "summary": "The far right juggernaut known as the R.S.S. and its most prominent member, Prime Minister Narendra Modi, are remaking secular India as a Hindu-first society, pushing aside minorities."
  },
  {
    "title": "5 Key Moments in the Rise of India’s Hindu-First Powerhouse",
    "link": "https://www.nytimes.com/2025/12/26/world/asia/5-key-moments-in-the-rise-of-indias-hindu-first-powerhouse.html",
    "summary": "The Rashtriya Swayamsevak Sangh, known as the R.S.S., has survived bans and vilification to emerge as the force reshaping India’s secular republic into a Hindu nation."
  },
  {
    "title": "Myanmar’s Health Crisis Spills Over Borders",
    "link": "https://www.nytimes.com/2025/12/26/world/asia/myanmar-conflict-health-crisis.html",
    "summary": "Fighting has caused the spread of illnesses like malaria and cholera. In a worst-case scenario, the situation could threaten regional health security, experts say."
  },
  {
    "title": "Prominent Leaders Amplify Disinformation About Brown University Shooting",
    "link": "https://www.nytimes.com/2025/12/25/technology/brown-university-shooting-disinformation-politicians.html",
    "summary": "Prominent business and government figures spread rumors about the attack on Brown University’s campus this month, reigniting questions about accountability in online discourse."
  },
  {
    "title": "The Class Where ‘Screenagers’ Train to Navigate Social Media and A.I.",
    "link": "https://www.nytimes.com/2025/12/25/business/media/social-media-teachers-ai.html",
    "summary": "New technologies are complicating efforts to teach the scrolling generation to think critically and defensively online."
  },
  {
    "title": "Why the Right Is Boycotting Havaianas Flip-Flops",
    "link": "https://www.nytimes.com/2025/12/25/world/americas/havaianas-brazil-flip-flops-boycott.html",
    "summary": "For decades, Havaianas flip-flops have been a beloved global symbol of Brazilian culture, worn by millions of people each day. They are now ensnared in a political fight."
  },
  {
    "title": "I’ve Been the U.N. High Commissioner for Refugees for a Decade. This Is the Crisis I See.",
    "link": "https://www.nytimes.com/2025/12/25/opinion/filippo-grandi-united-nations.html",
    "summary": "Populist rhetoric is numbing us to the plight of others."
  },
  {
    "title": "This May Be Our Last Chance to Get It Right in Venezuela",
    "link": "https://www.nytimes.com/2025/12/26/opinion/venezuela-america-maduro-security-strategy.html",
    "summary": "For the past decade, every administration in Washington has said Venezuela represents an extraordinary threat to the United States."
  },
  {
    "title": "Death Toll in UPS Plane Crash Rises to 15",
    "link": "https://www.nytimes.com/2025/12/25/us/ups-plane-crash-louisville-kentucky.html",
    "summary": "Alain Rodriguez Colina, who was injured when a cargo plane crashed into his Kentucky workplace more than a month ago, died on Christmas Day."
  },
  {
    "title": "Kimmel Tells U.K. Viewers ‘Tyranny Is Booming’ in America",
    "link": "https://www.nytimes.com/2025/12/25/world/europe/jimmy-kimmel-christmas-uk.html",
    "summary": "Chosen by a British TV station to give an “alternative” to the king’s speech, Jimmy Kimmel said it had been a great year for the U.S. “from a fascism perspective.”"
  },
  {
    "title": "John Carey, Literary Eminence Who Excoriated Snobbery, Dies at 91",
    "link": "https://www.nytimes.com/2025/12/25/books/john-carey-dead.html",
    "summary": "An Oxford professor and renowned critic, he was pugnacious, fearless and disdainful of the received wisdom of his intellectual milieu."
  },
  {
    "title": "$1.817 Billion Powerball Jackpot Won by Single Ticket in Arkansas",
    "link": "https://www.nytimes.com/2025/12/25/us/powerball-jackpot-win-ticket-arkansas.html",
    "summary": "A single ticket drawn Wednesday night won the second-largest U.S. lottery jackpot ever."
  }
]