[
  {
    "title": "How a Top Secret SEAL Team 6 Mission Into North Korea Fell Apart",
    "link": "https://www.nytimes.com/2025/09/05/us/navy-seal-north-korea-trump-2019.html",
    "summary": "The 2019 operation, greenlit by President Trump, sought a strategic edge. It left unarmed North Koreans dead."
  },
  {
    "title": "Labor Market Stalled This Summer, With August Data Adding to Slowdown",
    "link": "https://www.nytimes.com/2025/09/05/business/jobs-labor-slowdown.html",
    "summary": "Employers added 22,000 jobs in August. Revised data also showed that employment fell by 13,000 jobs in June, the first net loss since December 2020."
  },
  {
    "title": "Weak Jobs Report Strengthens Case for Fed to Cut Interest Rates",
    "link": "https://www.nytimes.com/2025/09/05/business/federal-reserve-interest-rate-jobs-report.html",
    "summary": "A reduction at the Federal Reserve’s next meeting this month looks all but assured after August’s labor market data."
  },
  {
    "title": "U.S. Oil Giant ConocoPhillips Will Lay Off Up to 25% of Its Work Force",
    "link": "https://www.nytimes.com/2025/09/03/business/energy-environment/oil-layoffs-conocophillips.html",
    "summary": "ConocoPhillips of Houston on Wednesday announced plans to reduce its global work force by up to 25 percent."
  },
  {
    "title": "South Koreans Swept Up in Immigration Raid at Hyundai E.V. Plant in Georgia",
    "link": "https://www.nytimes.com/2025/09/05/us/georgia-battery-plant-hyundai-lg-ice-raid.html",
    "summary": "They were among nearly 500 workers apprehended at a construction site for a South Korean battery maker, officials said. The episode prompted diplomatic concern in Seoul."
  },
  {
    "title": "Mounting Deportations Meet Slow Hiring in a ‘Curious Kind of Balance’",
    "link": "https://www.nytimes.com/2025/09/05/business/economy/jobs-immigration-deportations-hiring.html",
    "summary": "An influx of immigrants helped ease worker shortages, and now their expulsion is helping to mask the country’s weakening demand for labor."
  },
  {
    "title": "The Doctors Are Real, but the Sales Pitches Are Frauds",
    "link": "https://www.nytimes.com/2025/09/05/technology/ai-doctor-scams.html",
    "summary": "Scammers are using A.I. tools to make it look as if medical professionals are promoting dubious health care products."
  },
  {
    "title": "AI Influencers Like Lil’ Miquela and Mia Zelu Are Redefining Fame",
    "link": "https://www.nytimes.com/2025/09/03/style/ai-influencers-lil-miquela-mia-zelu.html",
    "summary": "Influencers like Lil’ Miquela and Mia Zelu have millions of followers and generate serious income, despite being created with artificial intelligence."
  },
  {
    "title": "Talks Between Adams and Trump Adviser Center on Saudi Ambassadorship",
    "link": "https://www.nytimes.com/2025/09/05/nyregion/eric-adams-saudi-arabia-ambassador.html",
    "summary": "The discussions are said to be part of an effort to get Mayor Eric Adams to end his mayoral campaign in New York City, clearing a path for Andrew Cuomo."
  },
  {
    "title": "The N.Y. Assembly’s Most Powerful Democrat Has Been Slow to Back Mamdani",
    "link": "https://www.nytimes.com/2025/09/05/nyregion/mamdani-heastie-endorsement-mayor.html",
    "summary": "Carl Heastie, the speaker of the Assembly, has not yet endorsed his fellow lawmaker. He’s not the only prominent Democrat to hold back support."
  },
  {
    "title": "Keanu Reeves and Alex Winter Are Ready for ‘Godot’",
    "link": "https://www.nytimes.com/2025/09/05/theater/keanu-reeves-alex-winter-waiting-for-godot-broadway.html",
    "summary": "After years of training (clowning, Butoh and more), the longtime friends take on Samuel Beckett’s towering drama on Broadway."
  },
  {
    "title": "Elon Musk Could Become First Trillionaire Under New Tesla Pay Package",
    "link": "https://www.nytimes.com/2025/09/05/business/elon-musk-tesla-pay-trillionaire.html",
    "summary": "Tesla’s board unveiled a compensation package for the chief executive that could be worth $900 billion if he meets ambitious targets."
  },
  {
    "title": "Israel Steps Up Attacks on Gaza City Ahead of a Planned Wider Offensive",
    "link": "https://www.nytimes.com/2025/09/05/world/middleeast/gaza-city-takeover.html",
    "summary": "The Israeli military destroyed a landmark building after saying it had taken control of almost half of the city, where hundreds of thousands of civilians are sheltering amid a worsening humanitarian crisis."
  },
  {
    "title": "Why Hamas Refuses to Give Up Fighting",
    "link": "https://www.nytimes.com/2025/09/05/world/middleeast/gaza-hamas-surrender-israel.html",
    "summary": "Analysts say that despite its vast losses in Gaza, Hamas believes it can hold out for a deal that ensures its survival."
  },
  {
    "title": "CBS Abruptly Changes Rules for Editing ‘Face the Nation’ Interviews",
    "link": "https://www.nytimes.com/2025/09/05/business/cbs-face-the-nation-editing-rules.html",
    "summary": "The change came less than a week after an interview aired with Kristi Noem, the homeland security secretary. The administration accused the network of deceptively editing her appearance."
  },
  {
    "title": "‘Something Is Wrong With My Brain’: A Police Officer’s Descent",
    "link": "https://www.nytimes.com/2025/09/05/us/cte-police.html",
    "summary": "Brent Simpson is the first police officer known to have C.T.E. He showed signs of the disease in the last few years of his life."
  },
  {
    "title": "The Trump Administration Wants to Switch Off Climate Satellites",
    "link": "https://www.nytimes.com/2025/09/05/climate/trump-climate-satellites.html",
    "summary": "The Trump administration wants to switch off and possibly destroy the climate-monitoring technology."
  },
  {
    "title": "YouTube’s NFL Broadcast Will Test Platform’s Ability to Handle Live Sports",
    "link": "https://www.nytimes.com/2025/09/05/technology/youtube-nfl-live-sports.html",
    "summary": "YouTube’s live broadcast on Friday night of the Kansas City Chiefs and Los Angeles Chargers game is set to be a major test of the platform’s programming ambitions."
  },
  {
    "title": "Chicago Could Be a Powder Keg",
    "link": "https://www.nytimes.com/2025/09/05/opinion/trump-chicago-national-guard.html",
    "summary": "Many residents are willing to endorse or participate in violent resistance."
  },
  {
    "title": "Why I Am Not a Liberal",
    "link": "https://www.nytimes.com/2025/09/05/opinion/liberal-conservative-left-right-politics.html",
    "summary": "I don’t think the left grasps reality in all its fullness."
  },
  {
    "title": "A Nighttime Raid",
    "link": "https://www.nytimes.com/2025/09/05/briefing/a-nighttime-raid.html",
    "summary": "An investigation details a previously undisclosed U.S. operation to intercept the North Korean leader’s communications."
  },
  {
    "title": "Google Is Fined $3.5 Billion for Breaking Europe’s Antitrust Laws",
    "link": "https://www.nytimes.com/2025/09/05/business/google-eu-antitrust-fine.html",
    "summary": "European Union officials accused the American tech giant of using its size and dominance to undercut rivals in online advertising, a move that could raise the ire of the Trump administration."
  },
  {
    "title": "Duchess of Kent, Royal Who Comforted a Wimbledon Loser, Dies at 92",
    "link": "https://www.nytimes.com/2025/09/05/world/europe/duchess-of-kent-dead.html",
    "summary": "A member of an aristocratic family, she married the Duke of Kent, a cousin of Queen Elizabeth II."
  },
  {
    "title": "Questions Focus on Cable in Lisbon Funicular Crash",
    "link": "https://www.nytimes.com/2025/09/05/world/europe/portugal-lisbon-funicular-crash.html",
    "summary": "Images of recovery efforts in the accident, which killed 16 people on Wednesday, appeared to show damage to a cable connecting the funicular’s two cars."
  },
  {
    "title": "Kim Jong-un Leaves Beijing With Big Diplomatic Wins",
    "link": "https://www.nytimes.com/2025/09/05/world/asia/north-korea-china-nuclear.html",
    "summary": "Mr. Kim’s presence at a Chinese military parade was a sign of his growing geopolitical ​leverage and that North Korea was being accepted as a de facto nuclear power."
  }
]