[
  {
    "title": "Appeals Court Says Lisa Cook Can Remain on Fed Board",
    "link": "https://www.nytimes.com/2025/09/15/us/politics/lisa-cook-fed-appeals-court-decision.html",
    "summary": "The decision came the day before the Federal Reserve begins a two-day meeting at which policymakers are expected to cut interest rates."
  },
  {
    "title": "Senate Confirms Stephen Miran as Fed Governor",
    "link": "https://www.nytimes.com/2025/09/15/business/stephen-miran-confirmed-fed.html",
    "summary": "The Senate voted to install one of President Trump’s top economic advisers at the central bank, opening the door for him to cast a vote at this week’s meeting to set interest rates."
  },
  {
    "title": "How China Is Weathering the Trade War With Trump",
    "link": "https://www.nytimes.com/2025/09/16/business/china-economy-us-tariffs.html",
    "summary": "Tariffs triggered a plunge in China’s exports to the United States, but its global trade surplus is larger because sales to other regions are surging."
  },
  {
    "title": "With a Hashtag, Young Chinese Are Mourning the ‘Beauty of the Boom Years’",
    "link": "https://www.nytimes.com/2025/09/16/business/china-young-people-boom.html",
    "summary": "Nostalgia for the fashion and culture of the years after the millennium, when the future held promise for many, is a commentary on today’s mood."
  },
  {
    "title": "On Charlie Kirk Show, JD Vance Talks of Crackdown on Liberal Groups",
    "link": "https://www.nytimes.com/2025/09/15/us/politics/jd-vance-charlie-kirk-show.html",
    "summary": "Some of the highest-ranking officials in the federal government used Charlie Kirk’s podcast, guest-hosted by Vice President JD Vance, to lay out their plans."
  },
  {
    "title": "Republicans Honor Charlie Kirk at Vigil in the Capitol",
    "link": "https://www.nytimes.com/2025/09/15/us/politics/republicans-charlie-kirk-vigil-capitol.html",
    "summary": "Only a handful of Democrats and none of the party’s top leaders attended the ceremony, an outpouring of praise and mourning for the right-wing activist, who was assassinated last week."
  },
  {
    "title": "What Does ‘Real Unity’ Mean to the White House?",
    "link": "https://www.nytimes.com/2025/09/15/us/politics/jd-vance-charlie-kirk-trump.html",
    "summary": "After Charlie Kirk’s death, the Trump administration has identified a bigger culprit: leftists bent on violence."
  },
  {
    "title": "U.S. Strikes a 2nd Venezuela Boat, Killing 3, Trump Says",
    "link": "https://www.nytimes.com/2025/09/15/us/politics/trump-venezuela-drug-boat-strike.html",
    "summary": "The president said the vessel was heading to the United States, but he did not offer details about its location. Legal specialists condemned the action as illegal."
  },
  {
    "title": "Federal Judge Declines to Intervene for Migrants Deported to Ghana",
    "link": "https://www.nytimes.com/2025/09/16/us/politics/judge-migrants-deported-ghana.html",
    "summary": "Judge Tanya S. Chutkan said her hands were “tied” with regard to the migrants, even though they held protective orders, in another victory for President Trump’s deportation campaign."
  },
  {
    "title": "Trump Signs Off on Sending National Guard to Memphis to Crack Down on Crime",
    "link": "https://www.nytimes.com/2025/09/15/us/politics/trump-memphis-national-guard-crime.html",
    "summary": "The president repeated that Chicago, New Orleans and other Democratic-run cities could be next."
  },
  {
    "title": "President Trump’s State Visit to the UK: What to Know",
    "link": "https://www.nytimes.com/2025/09/16/world/europe/trump-state-visit-uk-king-charles.html",
    "summary": "The president and the first lady will be hosted by King Charles III and Queen Camilla at Windsor Castle. Mr. Trump will also travel to the prime minister’s country residence, Chequers."
  },
  {
    "title": "‘Squid Game’ Star Lee Jung-jae Talks About Korean Fan Culture",
    "link": "https://www.nytimes.com/2025/09/16/world/asia/lee-jae-jung-squid-game.html",
    "summary": "Lee Jung-jae, who has been a star in South Korea for decades, said social media has made audiences more zealous. He thinks he knows how to keep them happy."
  },
  {
    "title": "When a Simple Swim Carries a Risk of Dangerous Illness",
    "link": "https://www.nytimes.com/2025/09/15/health/schistosomiasis-children.html",
    "summary": "The parasitic infection schistosomiasis affects an estimated 200 million people globally, many of them children. But campaigns to identify and treat it face formidable hurdles."
  },
  {
    "title": "Cuomo, Staunch Supporter of Israel, Says ‘Horrific’ Gaza War Must End",
    "link": "https://www.nytimes.com/2025/09/15/nyregion/andrew-cuomo-israel-gaza.html",
    "summary": "The remarks were a departure for former Gov. Andrew M. Cuomo, who trails Assemblyman Zohran Mamdani in the New York City mayor’s race."
  },
  {
    "title": "Florida Says Ban on Openly Carrying Guns Is Invalid After Court Ruling",
    "link": "https://www.nytimes.com/2025/09/15/us/florida-open-carry-guns.html",
    "summary": "The state attorney general told law enforcement officers to stop enforcing the decades-old ban, after a court last week ruled it unconstitutional."
  },
  {
    "title": "Denmark’s Parenting Test Becomes the Latest Flashpoint in Greenland",
    "link": "https://www.nytimes.com/2025/09/15/world/europe/denmark-greenland-baby-parenting-test.html",
    "summary": "The case of a young Greenlandic woman who was ruled incapable of keeping her baby has become the latest flashpoint with Denmark."
  },
  {
    "title": "The N.F.L. Is Coming to Saudi Arabia, Where Soccer Is King",
    "link": "https://www.nytimes.com/2025/09/15/business/nfl-football-saudi-arabia.html",
    "summary": "Saudi Arabia will host a flag football tournament featuring N.F.L. stars in the spring, in a mutually beneficial sports expansion."
  },
  {
    "title": "Sotheby’s Lands a Leonard Lauder Art Collection Worth More Than $400 Million",
    "link": "https://www.nytimes.com/2025/09/15/arts/design/sothebys-leonard-lauder-collection.html",
    "summary": "The collector’s trove of 55 works, including Klimt, Matisse and Munch, will be auctioned in November."
  },
  {
    "title": "Britain Hates Trump. But It Quite Likes Trumpism.",
    "link": "https://www.nytimes.com/2025/09/16/opinion/trump-britain-state-visit.html",
    "summary": "Across the pond, the president’s hard-right nativism is flourishing."
  },
  {
    "title": "Our Booming Stock Market Is in Peril",
    "link": "https://www.nytimes.com/2025/09/15/opinion/stock-market-corporate-governance-ipo.html",
    "summary": "Why companies are increasingly avoiding America’s stock market."
  },
  {
    "title": "Schwarzenegger Urges Voters to Reject California Redistricting Measure",
    "link": "https://www.nytimes.com/2025/09/15/us/schwarzenegger-california-redistricting-newsom.html",
    "summary": "Arnold Schwarzenegger issued his first public rebuke since Gov. Gavin Newsom placed a gerrymander plan on the ballot."
  },
  {
    "title": "Lina Hidalgo Will Not Run for Re-election in Texas",
    "link": "https://www.nytimes.com/2025/09/15/us/politics/lina-hidalgo-texas-houston.html",
    "summary": "Lina Hidalgo, the top elected official in Harris County, which includes Houston, says she will not run for re-election or any other office in 2026."
  },
  {
    "title": "John Penton, ‘Godfather’ of Off-Road Racing, Dies at 100",
    "link": "https://www.nytimes.com/2025/09/15/sports/john-penton-dead.html",
    "summary": "He set a transcontinental motorcycling speed record, and then helped to revolutionize off-road riding with his own brand of nimble bikes."
  },
  {
    "title": "What To Know About the ‘Kissing Bug’ Disease: Symptoms, Risks and More",
    "link": "https://www.nytimes.com/2025/09/15/well/kissing-bug-chagas-disease.html",
    "summary": "Though some researchers believe it should be labeled endemic in the United States, most Americans don’t need to worry about getting sick."
  }
]