[
  {
    "title": "Trump Family’s Business Ties to Saudi Arabia Raise Ethics Worries",
    "link": "https://www.nytimes.com/2025/11/18/world/middleeast/trump-family-business-saudi-arabia.html",
    "summary": "President Trump will host Crown Prince Mohammed bin Salman, Saudi Arabia’s de facto ruler, who oversees a major construction project that is in talks with the Trump family business."
  },
  {
    "title": "Saudi Arabia’s New Power Play Is Exporting A.I. to the World",
    "link": "https://www.nytimes.com/2025/10/27/technology/saudi-arabia-ai-exporter.html",
    "summary": "The kingdom is pouring money into data centers and working with U.S. and Chinese tech giants, landing its A.I. ambitions in the middle of a geopolitical tussle for tech power."
  },
  {
    "title": "Trump Team Calls Maduro a ‘Cartel’ Boss. That Word Doesn’t Mean What You Think.",
    "link": "https://www.nytimes.com/2025/11/18/us/politics/trump-maduro-drug-cartel.html",
    "summary": "Venezuelans coined a figure of speech for the phenomenon of generals corrupted by drug money: “Cartel de los Soles.” Then the United States started talking about it as a literal organization."
  },
  {
    "title": "U.S. Military Threat Puts Spotlight on Venezuela’s Allies",
    "link": "https://www.nytimes.com/2025/11/18/world/americas/us-venezuela-military-maduro-trump.html",
    "summary": "American adversaries are unlikely to help President Nicolás Maduro of Venezuela fend off a concerted attack. But they have made toppling him harder."
  },
  {
    "title": "House Democrats Press for Vote to Bar Military Action in Venezuela",
    "link": "https://www.nytimes.com/2025/11/18/us/politics/house-democrats-press-for-vote-to-bar-military-action-in-venezuela.html",
    "summary": "The effort would invoke the War Powers Act, which expedites action on measures limiting the president’s war-making authority. It faces long odds in the G.O.P.-led House."
  },
  {
    "title": "Ecuador Votes ‘No’ to Hosting U.S. Military Base",
    "link": "https://www.nytimes.com/2025/11/18/world/americas/ecuador-us-military-base-vote-trump.html",
    "summary": "A vote on Sunday rejected the expansion of a foreign military presence. It came as the U.S. military’s campaign in waters near Latin America has been roiling the region."
  },
  {
    "title": "Larry Summers to Step Back From Public Commitments Over Epstein Emails",
    "link": "https://www.nytimes.com/2025/11/17/us/harvard-larry-summers-epstein.html",
    "summary": "New emails showed that Mr. Summers, a former Harvard president, had stayed in touch with Jeffrey Epstein for years after Mr. Epstein faced sex trafficking charges."
  },
  {
    "title": "The Growing Cost of Keeping Close Ties with Jeffrey Epstein",
    "link": "https://www.nytimes.com/2025/11/18/business/dealbook/summers-ties-jeffrey-epstein.html",
    "summary": "Larry Summers, a former Treasury secretary, is stepping back from public commitments. It’s the latest fallout for an associate of Jeffrey Epstein."
  },
  {
    "title": "How We Linked the Auto Industry to Lead Poisoning in Nigeria",
    "link": "https://www.nytimes.com/2025/11/18/world/africa/lead-poisoning-auto-industry-car-batteries.html",
    "summary": "Blood and soil testing confirmed the health consequences. Then we tracked individual shipments to the United States."
  },
  {
    "title": "With Trump in Office, a Transgender Trailblazer and American Diplomat Seeks Refuge Abroad",
    "link": "https://www.nytimes.com/2025/11/18/us/robyn-mccutcheon-diplomat-transgender-refuge-trump.html",
    "summary": "Robyn McCutcheon, the first American diplomat to come out as transgender, helped to shape personnel and foreign policy at the State Department. The country she served doesn’t feel like home anymore."
  },
  {
    "title": "How Much Sex, Drugs and Violence Can Be in a PG-13 Movie?",
    "link": "https://www.nytimes.com/2025/11/18/movies/movie-ratings-sex-violence-drugs.html",
    "summary": "The movie ratings board has pulled back the curtain on how it approaches hot-button topics, including nudity, marijuana and guns."
  },
  {
    "title": "UN Support Propels Trump Gaza Plan, but Road Ahead Is Still Rough",
    "link": "https://www.nytimes.com/2025/11/18/world/middleeast/un-trump-gaza-plan.html",
    "summary": "The Security Council’s backing offered a scaffolding of international legitimacy that will be needed to persuade countries to help see the plans through."
  },
  {
    "title": "Palestinian Voices Absent from U.S.-Run Center Planning Gaza’s Future",
    "link": "https://www.nytimes.com/2025/11/18/world/middleeast/us-israel-gaza-base-palestinians.html",
    "summary": "U.S. and Israeli soldiers, foreign diplomats and aid workers are congregated in a warehouse in Israel to talk about the future of Gaza. One key group is missing: Palestinians."
  },
  {
    "title": "When the G.O.P. Medicaid Cuts Arrive, These Hospitals Will Be Hit Hardest",
    "link": "https://www.nytimes.com/2025/11/18/upshot/urban-hospitals-medicaid-cuts.html",
    "summary": "Republicans created a special $50 billion fund to help rural hospitals stay afloat, but the biggest impacts may be in cities."
  },
  {
    "title": "Self-Driving Taxis Are Catching On. Are You Ready?",
    "link": "https://www.nytimes.com/2025/11/18/technology/personaltech/zoox-driverless-taxis-san-francisco.html",
    "summary": "With the arrival of Amazon’s Zoox robot taxi in San Francisco to compete with Waymo, autonomous services are gaining momentum. But there are pros and cons."
  },
  {
    "title": "Google Unveils Gemini 3, With Improved Coding and Search Abilities",
    "link": "https://www.nytimes.com/2025/11/18/technology/google-gemini-3.html",
    "summary": "The new artificial intelligence model is the second the company has released this year. OpenAI and Anthropic made similar updates a few months ago."
  },
  {
    "title": "Paramount, Comcast and Netflix Prepare Bids for Warner Bros. Discovery",
    "link": "https://www.nytimes.com/2025/11/18/business/media/warner-discovery-paramount-comcast-netflix.html",
    "summary": "Paramount, Comcast and Netflix are preparing bids to buy all or part of Warner Bros. Discovery, a crown jewel of the industry."
  },
  {
    "title": "How Joan Didion Did Thanksgiving",
    "link": "https://www.nytimes.com/2025/11/18/dining/joan-didion-thanksgiving.html",
    "summary": "The author’s newly unveiled papers reveal the meticulous planning and devotion to cooking that went into her big holiday meals."
  },
  {
    "title": "She Has Taken 30 Years to Write a 7-Part Novel About 1 Day. It’s a Sensation.",
    "link": "https://www.nytimes.com/2025/11/18/magazine/solvej-balle-calculation-of-volume.html",
    "summary": "The Danish author Solvej Balle’s experimental opus reframes the tedium of contemporary life as a source of unexpected wonders."
  },
  {
    "title": "New York City’s Scaffolding Gets a Long Overdue Makeover",
    "link": "https://www.nytimes.com/2025/11/18/nyregion/nyc-scaffolding-sidewalk-sheds.html",
    "summary": "Officials have unveiled six new designs, in the biggest reimagining of the city’s ubiquitous sidewalk sheds in decades."
  },
  {
    "title": "The Democrat Who Split MAGA Over the Epstein Files",
    "link": "https://www.nytimes.com/2025/11/18/opinion/ro-khanna-epstein-files-trump.html",
    "summary": "Ro Khanna argues that even though there is a risk in releasing the documents, it still needs to happen."
  },
  {
    "title": "Anorexia Was My Revolt Against Mother Nature",
    "link": "https://www.nytimes.com/2025/11/18/opinion/weight-loss-diet-anorexia-eating-disorder.html",
    "summary": "My sister and I went on a joint diet. She stopped and I didn’t."
  },
  {
    "title": "Why More Pollution Could Be Coming for Wetlands",
    "link": "https://www.nytimes.com/2025/11/18/briefing/why-more-pollution-could-be-coming-for-wetlands.html",
    "summary": "The Trump administration wants to strip federal protections from wetlands and streams. We explain how it could affect Americans."
  },
  {
    "title": "Cloudflare Outage Disrupts X, ChatGPT and Other Parts of the Internet",
    "link": "https://www.nytimes.com/2025/11/18/business/cloudflare-down-challenges-error.html",
    "summary": "Services from Cloudflare, a software company, underpin thousands of websites, including X, Spotify and OpenAI. The company said a crash in a software system was to blame."
  },
  {
    "title": "U.S. Fraud Case Against Indian Tycoon Adani at a Standstill",
    "link": "https://www.nytimes.com/2025/11/18/business/adani-fraud-india.html",
    "summary": "The case against Gautam Adani, the infrastructure titan and a close associate of Prime Minister Narendra Modi, has stalled with no sign of progress."
  },
  {
    "title": "The Internet Loves Peptide Therapy. Is It Really a Miracle Cure?",
    "link": "https://www.nytimes.com/2025/11/18/well/live/peptide-therapy-skin-muscle-longevity.html",
    "summary": "A suite of products promise smoother skin, bigger muscles and longer life. But what are peptides? And do they work?"
  }
]