[
  {
    "title": "Trump’s Attacks on Powell and the Fed Ripple Through Global Economy",
    "link": "https://www.nytimes.com/2025/07/17/business/trump-powell-fed-global-reaction.html",
    "summary": "The independence of central banks, which allows policymakers to operate free from political meddling, is considered sacrosanct by investors and economists."
  },
  {
    "title": "President Trump, Jerome Powell, and Why Their Relationship Matters",
    "link": "https://www.nytimes.com/2025/07/17/podcasts/the-daily/trump-fed-powell-economy.html",
    "summary": "The president has talked about firing Jerome H. Powell, the chair of Federal Reserve. Their tensions could have major implications for the global economy."
  },
  {
    "title": "White House Seeks to Inspect Fed Renovation in Bid to Pressure Powell",
    "link": "https://www.nytimes.com/2025/07/17/us/politics/white-house-seeks-to-inspect-fed-renovation-in-bid-to-pressure-powell.html",
    "summary": "Russell T. Vought, the head of the Office of Management and Budget, said he and other administration officials wanted access to the Fed’s building in Washington."
  },
  {
    "title": "Trump Wants Lower Rates. Firing Powell Could Push Them Higher.",
    "link": "https://www.nytimes.com/2025/07/17/business/trump-powell-federal-reserve-higher-rates.html",
    "summary": "Investors, not the Fed, control the interest rates that matter most to businesses and consumers. They might demand higher returns if the central bank’s independence comes into question."
  },
  {
    "title": "Justice Dept. Asks for 1-Day Sentence for Ex-Officer Convicted in Breonna Taylor Raid",
    "link": "https://www.nytimes.com/2025/07/17/us/politics/justice-department-brett-hankison-sentence-breonna-taylor.html",
    "summary": "The move was a stunning reversal of Biden-era efforts to address racial disparities in local law enforcement."
  },
  {
    "title": "Senate Approves Trump’s Bid to Cancel Foreign Aid and Funds for NPR and PBS Stations",
    "link": "https://www.nytimes.com/2025/07/17/us/politics/senate-vote-trump-bill-pbs-npr-foreign-aid.html",
    "summary": "The bill to claw back $9 billion in congressionally approved spending passed the Senate over the objections of Republicans who said it abdicated the legislative branch’s power of the purse."
  },
  {
    "title": "Even After Bondi Gains Trump’s Backing, Her Survival Remains an Open Question",
    "link": "https://www.nytimes.com/2025/07/17/us/politics/trump-epstein-bondi-bongino.html",
    "summary": "The sustained backlash has exposed the hazards of the attorney general’s focus on courting President Trump, with the assumption that he maintains the total backing of his base."
  },
  {
    "title": "Ron Wyden, a Democrat, Won’t Let Go of the Jeffrey Epstein Case, Either",
    "link": "https://www.nytimes.com/2025/07/17/business/epstein-banks-wyden-trump.html",
    "summary": "Senator Ron Wyden has found that four banks waited until Mr. Epstein’s arrest on federal charges to flag $1.5 billion in suspicious transactions. Mr. Wyden wants the documents made public."
  },
  {
    "title": "How Two Camp Mystic Cabins Turned Into an Epicenter of Grief in the Texas Floods",
    "link": "https://www.nytimes.com/2025/07/17/us/camp-mystic-cabins-bubble-inn-twins.html",
    "summary": "The children who lost their lives at Camp Mystic were not scattered through the camp. Almost every one of them was in either the Bubble Inn or Twins cabins, which housed the youngest campers."
  },
  {
    "title": "Texas Legislature Special Session Will Answer Questions About Redistricting, Floods",
    "link": "https://www.nytimes.com/2025/07/17/us/texas-flood-redistricting.html",
    "summary": "A special session of the Texas Legislature will address the deadly floods in Hill Country, but the fireworks will come from President Trump’s demand for a newly gerrymandered House map."
  },
  {
    "title": "To Live Up to a Legacy, These Texas High Schoolers Had Two Days to Build a Tiny House",
    "link": "https://www.nytimes.com/2025/07/17/realestate/tiny-house-championship-skillsusa-teamworks.html",
    "summary": "A Texas high school has won more championships in mock tiny home construction than any other school in the country. Could a team of rookies defend the title?"
  },
  {
    "title": "Smell of Death Lingers in Syrian City After Spasm of Violence",
    "link": "https://www.nytimes.com/2025/07/17/world/middleeast/syria-sweida-druse-violence.html",
    "summary": "Blood in the streets, smashed windows and the smell of corpses in the air: A resident of the southern city of Sweida describes the aftermath of a wave of sectarian violence."
  },
  {
    "title": "Why Israel Attacked Syria",
    "link": "https://www.nytimes.com/2025/07/17/world/middleeast/israel-syria-druse-diplomacy.html",
    "summary": "For weeks, Israel has engaged in back-channel talks over a diplomatic agreement with the Syrian government. Its strikes on Damascus this week highlight a lack of strategic clarity."
  },
  {
    "title": "Israeli Strike on a Gaza Church Kills Three",
    "link": "https://www.nytimes.com/2025/07/17/world/middleeast/gaza-church-strike-israel.html",
    "summary": "As cease-fire talks stalled, a deadly strike on a Catholic church in Gaza City prompted Pope Leo XIV to call for an immediate end to the fighting."
  },
  {
    "title": "Connie Francis, ‘Pretty Little Baby’ and ‘Who’s Sorry Now’ Singer, Dies at 87",
    "link": "https://www.nytimes.com/2025/07/17/arts/music/connie-francis-dead.html",
    "summary": "Ms. Francis, who had a natural way with a wide variety of material, ruled the charts with songs like “Who’s Sorry Now” and “Where the Boys Are.”"
  },
  {
    "title": "As ‘Pretty Little Baby’ Goes Viral, Connie Francis Is Joining TikTok",
    "link": "https://www.nytimes.com/2025/05/30/style/connie-francis-pretty-little-baby-tiktok.html",
    "summary": "A forgotten song became an unlikely hit, and the 87-year-old singer was happy to be back in the spotlight."
  },
  {
    "title": "They Grew Up on Mexican Coke. Trump’s Cane Sugar Plan Makes Them Uneasy.",
    "link": "https://www.nytimes.com/2025/07/17/us/coca-cola-trump-mexican-coke.html",
    "summary": "After President Trump announced that Coke will be made with cane sugar in the U.S., as it is in Mexico, foodies of Mexican heritage said in interviews that they weren’t excited."
  },
  {
    "title": "PepsiCo Reaches for Protein and Fiber to Boost Sales of Frito-Lay Snacks",
    "link": "https://www.nytimes.com/2025/07/17/business/pepsico-frito-lay-protein-fiber.html",
    "summary": "The food giant said its Frito-Lay snack division planned to make a line of Cheetos and Doritos with no artificial colors or flavors, as demand falters."
  },
  {
    "title": "Elissa Slotkin Wants Democrats to Reclaim Their ‘Alpha Energy’",
    "link": "https://www.nytimes.com/2025/07/17/us/politics/elissa-slotkin-democrats-trump.html",
    "summary": "In a wide-ranging interview, the junior senator from Michigan took stock of her party’s deep-seated woes, warning Democrats not to be “so damn scared.”"
  },
  {
    "title": "Trump’s National Guard Troops Are Questioning Their Mission in L.A.",
    "link": "https://www.nytimes.com/2025/07/16/us/trump-national-guard-california.html",
    "summary": "Thousands of National Guard members have served in the L.A. region since last month. Six soldiers spoke in interviews about low morale over the deployment."
  },
  {
    "title": "‘Morally Offensive and Fiscally Reckless’: 3 Writers on Trump’s Big Gamble",
    "link": "https://www.nytimes.com/2025/07/17/opinion/trump-republicans-democrats-midterms.html",
    "summary": "Will the Republican sprawling policy bill give Democrats new traction in next year’s midterms?"
  },
  {
    "title": "Is ‘Toxic Empathy’ Pulling Christians to the Left?",
    "link": "https://www.nytimes.com/2025/07/17/opinion/interesting-times-allie-beth-stuckey.html",
    "summary": "How Allie Beth Stuckey is holding the line on the right."
  },
  {
    "title": "A Supreme Court Mystery",
    "link": "https://www.nytimes.com/2025/07/17/briefing/a-supreme-court-mystery.html",
    "summary": "We explain a curious type of court case."
  },
  {
    "title": "N.Y.P.D. Officer Accused of Theft to Pay for ‘Booty’ Exercises and BMW",
    "link": "https://www.nytimes.com/2025/07/17/nyregion/nypd-officer-wells-fargo-theft-bmw-glutes.html",
    "summary": "Yeison Rodriguez Acosta used data he had obtained as a Wells Fargo employee to spend customers’ money on luxury car payments and a body-shaping program, among other expenses, prosecutors said."
  },
  {
    "title": "The UK Plans to Lower the Voting Age to 16. Here’s What to Know.",
    "link": "https://www.nytimes.com/2025/07/17/world/europe/uk-voting-age-16.html",
    "summary": "The plan has been described as the largest expansion of voting rights in Britain in decades."
  },
  {
    "title": "F.D.A. Panel to Reassess Hormone Therapy Warnings",
    "link": "https://www.nytimes.com/2025/07/17/health/hormone-therapy-menopause-fda.html",
    "summary": "Dr. Marty Makary, the agency’s commissioner, has said too many women avoid menopause treatments because the risks have been overstated."
  },
  {
    "title": "Billy Jones, Baby’s All Right Owner and NYC Nightlife Impresario, Dies at 45",
    "link": "https://www.nytimes.com/2025/07/15/arts/music/billy-jones-dead.html",
    "summary": "He opened Baby’s All Right and three other nightclubs, a restaurant and a record store in a dozen years, helping the city maintain its cultural verve."
  }
]