[
  {
    "title": "Wrestling Over Charlie Kirk’s Legacy and the Divide in America",
    "link": "https://www.nytimes.com/2025/09/13/us/politics/charlie-kirk-legacy-trump.html",
    "summary": "Historians say the lessons of this particular time will depend on Americans themselves, and what kind of a nation they want it to be."
  },
  {
    "title": "After Charlie Kirk Killing, Suspect Joked That His ‘Doppelganger’ Did It",
    "link": "https://www.nytimes.com/2025/09/13/us/kirk-killing-suspect-online-chat.html",
    "summary": "Before he was arrested on suspicion of carrying out the assassination, 22-year-old Tyler Robinson sent friends messages showing that he was closely following news about the killing."
  },
  {
    "title": "Erika Kirk, Charlie Kirk’s Widow, Grieves Publicly, Melding Personal and Political",
    "link": "https://www.nytimes.com/2025/09/13/style/erika-kirk-charlie-kirk-marriage.html",
    "summary": "Ms. Kirk has played a key role in her husband’s movement. Speaking at Turning Point USA headquarters and on social media, she pledged his work would continue."
  },
  {
    "title": "Trump Escalates Attacks on Political Opponents After Charlie Kirk’s Killing",
    "link": "https://www.nytimes.com/2025/09/13/us/politics/trump-kirk-political-opponents.html",
    "summary": "President Trump has promised to bring the killer to justice while using the moment to blame the left — and only the left — more broadly."
  },
  {
    "title": "In Some Records, Fed Governor Lisa Cook Listed Atlanta Home as Secondary",
    "link": "https://www.nytimes.com/2025/09/13/business/lisa-cook-mortgage-fed-trump.html",
    "summary": "In a court filing, lawyers for Lisa Cook cited a news story about the records and urged a federal court to rule against President Trump’s efforts to block her from an upcoming Fed meeting."
  },
  {
    "title": "NPR and PBS Must Transform After Trump’s Cuts Cripple Broadcasters",
    "link": "https://www.nytimes.com/2025/09/13/us/politics/public-broadcasting-cuts.html",
    "summary": "Radio and television stations, facing enormous budget holes, are pleading with NPR and PBS to lower their fees as they examine whether to drop national programming altogether."
  },
  {
    "title": "Mass Firing of Probationary Federal Employees Was Illegal, Judge Rules",
    "link": "https://www.nytimes.com/2025/09/13/us/politics/probationary-employees-firing-illegal.html",
    "summary": "Months have passed since the lawsuit was filed, and many of the fired employees have moved on, the judge noted."
  },
  {
    "title": "Federal Judge Questions Deportations to Ghana",
    "link": "https://www.nytimes.com/2025/09/13/us/politics/federal-judge-migrants-ghana.html",
    "summary": "A hearing in the case of five migrants deported to Ghana last week showed how earlier Supreme Court rulings have paved the way for President Trump’s mass deportation campaign."
  },
  {
    "title": "Rubio Heads to a Defiant Israel After Qatar Strike",
    "link": "https://www.nytimes.com/2025/09/13/us/politics/rubio-israel-natanyahu.html",
    "summary": "The diplomat will consult with Israeli officials about their coming military offensive in Gaza City, as President Trump’s efforts to end the Gaza war appear stalled."
  },
  {
    "title": "Paramount Criticizes Celebrity-Endorsed Israeli Film Boycott",
    "link": "https://www.nytimes.com/2025/09/13/arts/israel-hollywood-boycott-paramount.html",
    "summary": "The film studio, which some say has turned rightward under its new owner, said it disagreed with thousands of Hollywood professionals pledging to boycott Israeli film institutions."
  },
  {
    "title": "Brazil Defies Trump’s Demands by Convicting Bolsonaro",
    "link": "https://www.nytimes.com/2025/09/13/world/americas/brazil-trump-bolsonaro.html",
    "summary": "Latin America’s largest nation is shaping up as a test case on how to defy President Trump."
  },
  {
    "title": "Funicular Crash Has Jarred Lisbon’s Sense of Itself",
    "link": "https://www.nytimes.com/2025/09/14/world/europe/lisbon-funicular-crash.html",
    "summary": "Lisbon has transformed itself in recent years into a destination for international investors. A funicular crash that killed 16 people has prompted soul-searching about the changes in the city."
  },
  {
    "title": "Van Hollen Criticizes Democratic Leaders for Delay in Endorsing Mamdani",
    "link": "https://www.nytimes.com/2025/09/13/us/politics/van-hollen-zohran-mamdani.html",
    "summary": "At an annual fund-raiser in Iowa, the Maryland Democrat said he supported Zohran Mamdani for mayor of New York City and said people were sick of “spineless politics.”"
  },
  {
    "title": "For the First Time in the Mayor’s Race, Cuomo Campaigns at a Mosque",
    "link": "https://www.nytimes.com/2025/09/12/nyregion/andrew-cuomo-visits-mosque-nyc-mayor.html",
    "summary": "Andrew M. Cuomo, who has faced criticism for bypassing mosques as he seeks to become mayor, spoke of New York as a beacon of opportunity during an appearance in the Bronx."
  },
  {
    "title": "In ‘Hedda,’ Tessa Thompson Puts a Sexy, Messy Spin on the ‘Female Hamlet’",
    "link": "https://www.nytimes.com/2025/09/13/movies/tessa-thompson-hedda.html",
    "summary": "Have you ever seen Ibsen’s “Hedda Gabler” set in the 1950s with a biracial star in a lesbian love triangle? In this new film adaptation, you will."
  },
  {
    "title": "Charlie Kirk’s Killing and Our Poisonous Internet",
    "link": "https://www.nytimes.com/2025/09/14/opinion/charlie-kirk-shooting-internet.html",
    "summary": "We’ve fully stepped into a different historical moment: the age of brain-poisoning meme politics."
  },
  {
    "title": "Oil Destroyed Our Town. Cartels Are Finishing the Job.",
    "link": "https://www.nytimes.com/2025/09/14/opinion/mexico-oil-pollution-fracking.html",
    "summary": "Oil extraction and organized crime plague my community in the forests of eastern Mexico, but we’re fighting back."
  },
  {
    "title": "The German Elections That Are Set to Test the Attraction of the Far Right",
    "link": "https://www.nytimes.com/2025/09/14/world/europe/the-german-state-elections.html",
    "summary": "A municipal vote in the state of North Rhine-Westphalia will be a gauge of the national mood since Chancellor Friedrich Merz took office."
  },
  {
    "title": "Hermeto Pascoal, Prolific Brazilian Composer, Dies at 89",
    "link": "https://www.nytimes.com/2025/09/14/arts/music/hermeto-pascoal-dead.html",
    "summary": "A self-taught multi-instrumentalist, he rose from a childhood of rural privation to become a favorite of jazz musicians and audiences around the world."
  },
  {
    "title": "New York’s Ban on Cellphones in Schools Is Going ‘Better Than Expected’",
    "link": "https://www.nytimes.com/2025/09/10/nyregion/nyc-school-phone-device-ban.html",
    "summary": "In the country’s largest district to ban phones, students, teachers and parents reported some frustrations, but also benefits."
  }
]