[
  {
    "title": "3 Americans Killed in ISIS Attack in Syria, Trump Says, Vowing to Retaliate",
    "link": "https://www.nytimes.com/2025/12/13/world/middleeast/us-forces-attacked-syria.html",
    "summary": "Two soldiers and a civilian interpreter were killed while supporting counterterror operations, the Pentagon said. They are the first U.S. casualties in Syria since the fall of the dictator Bashar al-Assad."
  },
  {
    "title": "Israel Says It Killed Senior Hamas Commander, Despite Cease-Fire",
    "link": "https://www.nytimes.com/2025/12/13/world/middleeast/israel-hamas-commander-gaza-strike.html",
    "summary": "Hamas said the attack on Saturday was a breach of the truce. The militant group did not comment on Israel’s claim to have killed one of its members."
  },
  {
    "title": "Can Trump’s Grand Plans for Gaza Get Off the Drawing Board?",
    "link": "https://www.nytimes.com/2025/12/13/world/middleeast/trump-gaza-plans-postwar.html",
    "summary": "The next steps for the president’s 20-point Gaza peace plan have been mired in uncertainty and a lack of detail, but that may be set to change. Here’s what to know."
  },
  {
    "title": "MAHA Moms Are Angry at the E.P.A. Lee Zeldin Is Trying to Win Them Back.",
    "link": "https://www.nytimes.com/2025/12/13/climate/maha-moms-epa-lee-zeldin.html",
    "summary": "A split is emerging within Trump’s base as health activists accuse Mr. Zeldin of leading the agency to prioritize chemical industry interests over public health."
  },
  {
    "title": "Trump’s ‘Pardon’ of Tina Peters Rejected by Colorado Officials",
    "link": "https://www.nytimes.com/2025/12/13/us/politics/trump-tina-peters.html",
    "summary": "The president’s stated intention to pardon Tina Peters, jailed for tampering with election machines in 2020, has set off a legal fight over the extent of Mr. Trump’s pardon powers."
  },
  {
    "title": "Appeals Court Says Trump Must End Los Angeles Deployment by Monday",
    "link": "https://www.nytimes.com/2025/12/13/us/california-national-guard-trump-los-angeles.html",
    "summary": "While the decision did not remove the National Guard troops from the president’s control, it blocked him from using them in the nation’s second-largest city."
  },
  {
    "title": "The Young Conservatives Fixated on H-1B Visas",
    "link": "https://www.nytimes.com/2025/12/13/style/h1b-visa-young-conservatives-maga.html",
    "summary": "For some Gen Z conservatives, H-1B visas are a hot new topic."
  },
  {
    "title": "Russia Bombs Ukraine Port of Odesa Amid Peace Talks",
    "link": "https://www.nytimes.com/2025/12/13/world/europe/russia-ukraine-odesa-attack.html",
    "summary": "Much of Ukraine’s largest Black Sea port was without power, heat and water on Saturday after strikes from Russia, which has shown little appetite for a deal to end the war."
  },
  {
    "title": "Ivan Urgant Was Russia’s Late-Night King Until Putin’s War in Ukraine",
    "link": "https://www.nytimes.com/2025/12/13/world/europe/russia-ivan-urgant-late-night.html",
    "summary": "Ivan Urgant was an unstoppable Russian megastar. Then he expressed opposition to President Vladimir V. Putin’s invasion of Ukraine."
  },
  {
    "title": "Belarus Frees Prominent Political Prisoners as U.S. Lifts Some Trade Sanctions",
    "link": "https://www.nytimes.com/2025/12/13/world/europe/belarus-frees-prisoners-trade-sanctions.html",
    "summary": "The release of the prisoners, including a Nobel laureate and two opposition leaders, was part of a monthslong rapprochement between Washington and Minsk."
  },
  {
    "title": "Trump’s Nvidia Deal Undermines National Security",
    "link": "https://www.nytimes.com/video/opinion/100000010584310/trumps-nvidia-deal-undermines-national-security.html",
    "summary": "This week, Donald Trump announced that he would allow Nvidia to sell its powerful H200 chips to China. The Times Opinion editor, Kathleen Kingsbury, argues that the move undermines national security."
  },
  {
    "title": "Biden Has Raised Little of What He Needs to Build a Presidential Library",
    "link": "https://www.nytimes.com/2025/12/13/us/politics/biden-presidential-library-delaware.html",
    "summary": "His library foundation has told the I.R.S. that by the end of 2027 it expects to bring in just $11.3 million — not nearly enough for a traditional presidential library."
  },
  {
    "title": "Flight Returns to Dulles After Engine Failure During Takeoff, F.A.A. Says",
    "link": "https://www.nytimes.com/2025/12/13/us/dulles-airport-fire-washington.html",
    "summary": "United Airlines Flight 803, which was headed to Toyko, safely landed at Washington Dulles International Airport on Saturday, officials said."
  },
  {
    "title": "DoorDash Deliverer Faces Tampering Charges Tied to Food Order",
    "link": "https://www.nytimes.com/2025/12/13/us/kentucky-delivery-driver-pepper-spray-food.html",
    "summary": "The authorities said the woman, who was making a delivery for DoorDash, was captured on a doorbell camera spraying an unknown aerosol."
  },
  {
    "title": "Abraham Quintanilla Jr., Music Producer and Father of Selena, Dies at 86",
    "link": "https://www.nytimes.com/2025/12/13/arts/music/abraham-quintanilla-dead.html",
    "summary": "As a teenager, he hoped to make it big in the Tejano music world. He realized that dream through his daughter."
  }
]