[
  {
    "title": "The Looming Taiwan Chip Disaster That Silicon Valley Has Long Ignored",
    "link": "https://www.nytimes.com/2026/02/24/technology/taiwan-china-chips-silicon-valley-tsmc.html",
    "summary": "If China invades Taiwan and cuts off its chip exports to American companies, the tech industry and the U.S. economy would be crippled."
  },
  {
    "title": "China Amps Up Pressure on Japan With Restrictions on Exports",
    "link": "https://www.nytimes.com/2026/02/24/world/asia/china-japan-export-ban.html",
    "summary": "Beijing placed the restrictions on 20 Japanese entities with ties to the defense industry, the latest ratcheting up of its monthslong feud with Tokyo."
  },
  {
    "title": "ICE Whistle-Blower Says Training Is ‘Broken,’ and OpenAI Faces Questions About Mass Shooter",
    "link": "https://www.nytimes.com/2026/02/24/podcasts/the-headlines/ice-whistleblower-openai-mass-shooter.html",
    "summary": "Plus, how Mexico tracked its most-wanted cartel leader."
  },
  {
    "title": "How Russia Put Its Future at Risk by Remaking Its Economy for War",
    "link": "https://www.nytimes.com/2026/02/24/world/europe/russia-ukraine-war-future.html",
    "summary": "About half of the country’s federal budget goes toward the fight in Ukraine, money that does little to support its long-term development."
  },
  {
    "title": "These Ukrainians Don’t Want to Be Traded to Russia for Peace",
    "link": "https://www.nytimes.com/2026/02/24/world/europe/ukraine-war-donetsk.html",
    "summary": "Four years into the war, a major sticking point in talks is control of the eastern Donetsk region. Residents could face an agonizing choice if Ukraine gives up the territory."
  },
  {
    "title": "Mexican Forces Say They Tracked El Mencho to Cabin by Following His Lover",
    "link": "https://www.nytimes.com/2026/02/23/world/americas/el-mencho-mexico-cartel-military-raid.html",
    "summary": "Top security officials revealed details of the operation that led to the death of Mexico’s most wanted drug cartel leader."
  },
  {
    "title": "After Six Decades of the War on Drugs, What Works?",
    "link": "https://www.nytimes.com/2026/02/24/world/americas/mexico-war-on-drugs.html",
    "summary": "The U.S. and its allies have spilled blood and treasure to kill drug lords and defeat cartels, but the drugs keep coming and the new groups are more violent than ever."
  },
  {
    "title": "What Travelers Need to Know as Cartel Violence Rattles Mexico",
    "link": "https://www.nytimes.com/2026/02/23/travel/cartel-violence-mexico-el-mencho-travel-flights.html",
    "summary": "The killing of a drug lord and the unrest that followed have prompted flight cancellations, roadblocks, cruise disruptions and “shelter in place” alerts."
  },
  {
    "title": "New York City’s Homeless Population Faces Another Dangerous Storm",
    "link": "https://www.nytimes.com/2026/02/23/weather/nyc-blizzard-homeless.html",
    "summary": "Mayor Zohran Mamdani said on Monday that his administration had taken lessons from the city’s last storm, when at least 20 people died after exposure to the cold."
  },
  {
    "title": "New York City Restaurants Face the Blizzard",
    "link": "https://www.nytimes.com/2026/02/23/dining/nyc-restaurants-blizzard.html",
    "summary": "Across New York City, restaurateurs and cafe owners weigh logistics and the safety of staff against the demands of customers and a slow winter."
  },
  {
    "title": "What to Know in NYC After Blizzard: School Closures, Transportation and More",
    "link": "https://www.nytimes.com/2026/02/24/nyregion/nyc-snow-blizzard-schools-transit-flights.html",
    "summary": "Public schools and Broadway shows will be open, but transit and flight disruptions could linger."
  },
  {
    "title": "Record Snowfall Slams New England and Leaves New York City Snarled",
    "link": "https://www.nytimes.com/2026/02/24/us/record-snowfall-slams-new-england-and-leaves-new-york-city-snarled.html",
    "summary": "At the storm’s peak, well over half a million homes and businesses in the Northeast were without power."
  },
  {
    "title": "‘A Long Speech’: Trump Prepares for State of the Union",
    "link": "https://www.nytimes.com/2026/02/23/us/politics/speech-trump-state-of-the-union.html",
    "summary": "President Trump does not like to practice reading the speech out loud, but he spent time mimicking the setup of the House chamber, officials familiar with his plans said."
  },
  {
    "title": "Ahead of State of the Union, Cracks Appear in Trump Coalition",
    "link": "https://www.nytimes.com/2026/02/24/us/politics/trump-state-of-the-union-pennsylvania.html",
    "summary": "As the president prepares to speak to the nation, Northeastern Pennsylvania is showing discontent on the edges of the Trump coalition and an energized Democratic opposition."
  },
  {
    "title": "State of the Union May Be a Trial for ‘Barely Invited’ Justices",
    "link": "https://www.nytimes.com/2026/02/24/us/politics/supreme-court-state-of-the-union.html",
    "summary": "If tradition holds, members of the Supreme Court will attend Trump’s annual speech, just days after ruling against the legality of his tariffs."
  },
  {
    "title": "Trump State of the Union Speech 2026: How to Watch, Time and Attendees",
    "link": "https://www.nytimes.com/2026/02/24/us/politics/trump-state-of-union-watch-time-stream.html",
    "summary": "President Trump will speak at 9 p.m. Eastern time to a joint session of Congress. The New York Times will carry the address live."
  },
  {
    "title": "Homeownership Is Out of Reach for Many Americans, Despite a Buyer’s Market",
    "link": "https://www.nytimes.com/2026/02/23/business/home-buying-market-real-estate-economy.html",
    "summary": "A growing split between low-to-middle-income families and wealthy households is changing who has access to homeownership now."
  },
  {
    "title": "Trump Says General Caine Sees Easy Victory if U.S. Attacks Iran",
    "link": "https://www.nytimes.com/2026/02/23/us/politics/general-caine-iran-strikes-trump.html",
    "summary": "The remarks differ from what Gen. Dan Caine, the chairman of the Joint Chiefs of Staff, is said to have told the president in high-level White House meetings."
  },
  {
    "title": "Mandelson’s Arrest Adds to Scandal That Has Rattled Starmer and Labour Party",
    "link": "https://www.nytimes.com/2026/02/24/world/europe/mandelson-arrest-epstein-starmer-uk.html",
    "summary": "The arrest of the British former envoy to Washington, long a key figure in the Labour Party, deepened a scandal that has led to calls for Prime Minister Keir Starmer’s resignation."
  },
  {
    "title": "Peter Attia Leaves CBS News Amid Epstein Files Fallout",
    "link": "https://www.nytimes.com/2026/02/23/well/peter-attia-cbs-epstein.html",
    "summary": "Emails showed that the longevity influencer had provided medical advice to Jeffrey Epstein and had made crude comments about women."
  },
  {
    "title": "Gustavo Dudamel’s Long Goodbye to L.A., and Long Hello to New York",
    "link": "https://www.nytimes.com/2026/02/24/arts/music/gustavo-dudamel-los-angeles-new-york.html",
    "summary": "As the conductor prepares to leave the Los Angeles Philharmonic for the New York Philharmonic, he says, “I am in two waters.”"
  },
  {
    "title": "Mamdani’s Vanquished Foes Are Plotting a Comeback, if Not Revenge",
    "link": "https://www.nytimes.com/2026/02/24/nyregion/mamdani-opponents-nyc.html",
    "summary": "Many of New York City’s wealthy and well-connected power players find themselves in an unfamiliar place: the wilderness."
  },
  {
    "title": "In Blow to Mamdani, Left-Leaning Group Breaks With Mayor Over U.S. House Race",
    "link": "https://www.nytimes.com/2026/02/23/nyregion/antonio-reynoso-wfp-endorsement-congress.html",
    "summary": "Mayor Zohran Mamdani of New York had lobbied for his preferred candidate, Claire Valdez. But the party backed Antonio Reynoso, the Brooklyn borough president."
  },
  {
    "title": "I.R.S. Tactics Against Meta Open a New Front in the Corporate Tax Fight",
    "link": "https://www.nytimes.com/2026/02/24/business/irs-meta-corporate-taxes.html",
    "summary": "The agency is using real-world profit data to challenge how big companies value offshore intellectual property."
  },
  {
    "title": "What Brontë Country Tells Us About Britain Today",
    "link": "https://www.nytimes.com/2026/02/24/world/europe/bronte-country-haworth-bradford-uk-today.html",
    "summary": "West Yorkshire, where the original “Wuthering Heights” was written, offers a window into the forces that are disrupting British politics."
  },
  {
    "title": "Kyiv Is Freezing, but There Is Warmth, Too",
    "link": "https://www.nytimes.com/2026/02/24/opinion/ukraine-war-cold.html",
    "summary": "Delegations from Ukraine, Russia and the United States have been meeting in Abu Dhabi for peace talks. I hear it’s warm there."
  },
  {
    "title": "Trump Is Turning the F.C.C. and F.T.C. Against Free Expression",
    "link": "https://www.nytimes.com/2026/02/24/opinion/fcc-ftc-free-speech-trump.html",
    "summary": "Trump appointees have transformed the F.T.C. and F.C.C. into instruments of ideological enforcement."
  },
  {
    "title": "Your Tariff Questions",
    "link": "https://www.nytimes.com/2026/02/24/briefing/your-tariff-questions.html",
    "summary": "We’re addressing some of your concerns about President Trump’s tariff regime."
  },
  {
    "title": "Late Night Sums Up Trump’s Tariff Tiff with the Supreme Court",
    "link": "https://www.nytimes.com/2026/02/24/arts/television/late-night-trump-tariff.html",
    "summary": "“Wow, a court composed mostly of his own party’s appointees has struck down the constitutionality of Trump’s go-it-alone tariff regime,” Jon Stewart said. “That’s bound to cause him some introspection.”"
  },
  {
    "title": "Billions in Climate Grants, Frozen for a Year, Are Back in Court",
    "link": "https://www.nytimes.com/2026/02/24/climate/billions-in-climate-grants-frozen-for-a-year-are-back-in-court.html",
    "summary": "A year after the Trump administration blocked money that had been awarded by Congress for clean energy projects, the legal fight over the funds rages on."
  },
  {
    "title": "Texas Rep. Tony Gonzales Pressured to Resign Over Sexual Messages to Staff Member",
    "link": "https://www.nytimes.com/2026/02/23/us/tony-gonzales-texas-texts-staff-resign.html",
    "summary": "Democrats and Republicans urged Tony Gonzales to step down after allegations that he had sent inappropriate texts to a staff member and had a sexual relationship with her."
  },
  {
    "title": "After Saks Bankruptcy, Richard Baker Says He Saved Luxury Department Stores",
    "link": "https://www.nytimes.com/2026/02/23/business/richard-baker-saks-neiman-marcus-bankruptcy.html",
    "summary": "Richard Baker wanted to create a retail empire when he combined Saks Fifth Avenue and Neiman Marcus. About a year later, it filed for bankruptcy."
  },
  {
    "title": "Canada to Probe What OpenAI Knew About Tumbler Ridge Shooter",
    "link": "https://www.nytimes.com/2026/02/23/world/canada/canada-shooting-openai.html",
    "summary": "The company suspended the killer’s ChatGPT account over a policy violation in June, eight months before the attacks in Tumbler Ridge, British Columbia."
  }
]