[
  {
    "title": "Trump Fired America’s Economic Data Collector. History Shows the Perils.",
    "link": "https://www.nytimes.com/2025/08/03/business/trump-bls-firing-economic-reports.html",
    "summary": "Economists say unbiased data is essential for policymaking, and for democracy."
  },
  {
    "title": "What’s It Like to Deal With Brutal U.S. Tariffs? Ask Malaysia.",
    "link": "https://www.nytimes.com/2025/08/04/business/malaysia-solar-china.html",
    "summary": "Once a cog in the Malaysian economy, the solar industry profited from Chinese investment. Now it’s becoming a case study of what happens when the United States closes its markets."
  },
  {
    "title": "U.S. and Israeli Officials Float Idea of ‘All or Nothing’ Gaza Deal",
    "link": "https://www.nytimes.com/2025/08/03/world/middleeast/israel-gaza-hamas-ceasefire.html",
    "summary": "The apparent shift in tone comes as cease-fire negotiations have hit a wall and pressure is mounting on Israel over the hunger crisis in Gaza. But Israel and Hamas remain far apart on the terms of any deal."
  },
  {
    "title": "Texas Democrats Leave State to Stop Republicans’ Redistricting Plan",
    "link": "https://www.nytimes.com/2025/08/03/us/texas-democrats-walkout-redistricting-map-gop.html",
    "summary": "The walkout was a sharp escalation in the clash over a redistricting effort. Gov. Greg Abbott threatened to remove the lawmakers who left their posts if they did not return by Monday."
  },
  {
    "title": "Loni Anderson, Star of ‘WKRP in Cincinnati,’ Dies at 79",
    "link": "https://www.nytimes.com/2025/08/03/arts/television/loni-anderson-dead.html",
    "summary": "She won Emmy nominations for her sitcom role as a deceptively smart radio station receptionist. Her divorce from Burt Reynolds landed her in the tabloids."
  },
  {
    "title": "Billionaire Behind Miami Immigration and Deportation Ads Steps Forward",
    "link": "https://www.nytimes.com/2025/08/03/us/immigration-ads-florida-michael-b-fernandez.html",
    "summary": "“Deporting immigrants is cruel,” some of the ads against Cuban Americans in Congress read. Michael B. Fernández wanted to “wake up” Miami’s conscience."
  },
  {
    "title": "A City in Kansas Is Suing Over a Planned ICE Detention Center",
    "link": "https://www.nytimes.com/2025/08/03/us/leavenworth-kansas-prison-immigration-detention-ice-trump.html",
    "summary": "Leavenworth, Kan., was forged by the corrections industry, but residents are divided over plans for a privately operated immigration detention site in town."
  },
  {
    "title": "Victims Named in Montana Bar Shooting as Manhunt Stretches On",
    "link": "https://www.nytimes.com/2025/08/03/us/montana-owl-bar-shooting-victims-manhunt.html",
    "summary": "Those killed on Friday were a bartender and three patrons, ranging in age from 59 to 74, the authorities said. The suspect fled into the nearby foothills."
  },
  {
    "title": "What We Know About the Montana Bar Shooting",
    "link": "https://www.nytimes.com/2025/08/03/us/montana-search-anaconda-bar-shooting.html",
    "summary": "Four people were killed in the attack inside the Owl Bar in Anaconda, Mont. The authorities are still searching for the suspect, an Army veteran who lived nearby."
  },
  {
    "title": "When Bloodshed and Chaos Arrived at 345 Park Avenue",
    "link": "https://www.nytimes.com/2025/08/03/nyregion/park-avenue-shooting-manhattan.html",
    "summary": "On a steamy Monday evening, no one inside the Manhattan office building noticed the dark BMW pull up outside. The driver entered the lobby with a rifle in his hand."
  },
  {
    "title": "Cruz Criticizes Hochul for Wearing Head Scarf at Slain Officer’s Funeral",
    "link": "https://www.nytimes.com/2025/08/03/nyregion/cruz-hochul-head-scarf-officer-funeral.html",
    "summary": "In a social media back-and-forth, Gov. Kathy Hochul of New York replied to Senator Ted Cruz of Texas that “anyone with basic decency” would respect the officer’s Muslim faith."
  },
  {
    "title": "I Was Banished by My Country’s Dictator. What Happened to Me Is a Warning.",
    "link": "https://www.nytimes.com/2025/08/04/opinion/nicaragua-ortega-dictatorship-exile.html",
    "summary": "Thousands of dissidents have fled Daniel Ortega’s Nicaragua — and now, even those of us in exile no longer feel safe."
  },
  {
    "title": "Israel Must Open Its Eyes",
    "link": "https://www.nytimes.com/2025/08/03/opinion/israel-famine-hamas-netanyahu-trump.html",
    "summary": "Defeating Hamas does not require starving a single child."
  },
  {
    "title": "More Than 60 Migrants Dead After Boat Capsizes Off the Coast of Yemen",
    "link": "https://www.nytimes.com/2025/08/03/world/middleeast/yemen-migration-saudi.html",
    "summary": "The trip across the Gulf of Aden is the first leg of one of the world’s riskiest — and busiest — migration and smuggling routes."
  },
  {
    "title": "Boeing Workers Who Make Fighter Jets Are Set to Strike",
    "link": "https://www.nytimes.com/2025/08/03/business/boeing-machinists-st-louis-strike.html",
    "summary": "About 3,200 machinists in St. Louis are poised to walk off the job after failing to reach an agreement on wages and retirement benefits."
  },
  {
    "title": "Rahaman Ali, Boxer Whose Brother Was ‘the Greatest,’ Dies at 82",
    "link": "https://www.nytimes.com/2025/08/03/obituaries/rahaman-ali-dead.html",
    "summary": "Some said he had shown nearly as much promise in the ring as Muhammad Ali. But he gave up his own career to join the champ’s entourage."
  }
]