[
  {
    "title": "‘Enough Is Enough’: Hundreds of Minnesota Businesses Take Stand Against ICE",
    "link": "https://www.nytimes.com/2026/01/23/us/minnesota-businesses-protest-ice.html",
    "summary": "After protesters called for a pause on economic activity and work to strike against the federal immigration crackdown, many business owners won’t open their doors on Friday."
  },
  {
    "title": "Voters Are Split on Deportations but Disapprove of ICE, Poll Finds",
    "link": "https://www.nytimes.com/2026/01/23/us/politics/poll-ice-immigration.html",
    "summary": "While roughly half of voters support President Trump’s handling of the border between the United States and Mexico, a sizable majority says that ICE’s tactics have “gone too far.”"
  },
  {
    "title": "D.H.S. Cited Foreign Students’ Writings and Protests Before Their Arrests",
    "link": "https://www.nytimes.com/2026/01/22/us/politics/trump-rubio-student-speech.html",
    "summary": "Documents unsealed by a federal judge on Thursday include dossiers that investigators prepared on pro-Palestinian student activists before they were targeted for deportation."
  },
  {
    "title": "White House Posts Altered Photo Showing Arrested Minnesota Protester Crying",
    "link": "https://www.nytimes.com/2026/01/22/us/politics/nekima-armstrong-photo-white-house.html",
    "summary": "The New York Times ran the image posted by Kristi Noem, the homeland security secretary, as well as the one posted by the White House through an A.I. detection system. It concluded that the White House’s version showed signs of manipulation."
  },
  {
    "title": "3 Things to Know About the TikTok Deal, and a New Protest Tactic in Minnesota",
    "link": "https://www.nytimes.com/2026/01/23/podcasts/the-headlines/tiktok-deal-new-protest-tactic-in-minnesota.html",
    "summary": "Plus, your Friday news quiz."
  },
  {
    "title": "Trump Rescinds Canada’s Invitation to Join His ‘Board of Peace’",
    "link": "https://www.nytimes.com/2026/01/23/us/politics/trump-carney-canada-board-peace.html",
    "summary": "The president appeared to be lashing out in response to stark, high-profile remarks by Prime Minister Mark Carney of Canada that rejected Mr. Trump’s efforts to dismantle the international order."
  },
  {
    "title": "Europe’s Leaders Scramble to Find a Path Forward With Trump",
    "link": "https://www.nytimes.com/2026/01/22/us/politics/europe-trump-greenland-tariffs-eu-meeting.html",
    "summary": "Leaders from across the European Union held an emergency summit in Brussels to discuss Greenland and, more broadly, their fragile relationship with America."
  },
  {
    "title": "Winter Storm Forecast: 5 Key Things to Know Across the US",
    "link": "https://www.nytimes.com/2026/01/23/weather/winter-storm-ice-snow-forecast.html",
    "summary": "Here are five key things to know about the forecast."
  },
  {
    "title": "Storm Poses Big Threats to Power Grids Across U.S.",
    "link": "https://www.nytimes.com/2026/01/23/business/energy-environment/storm-power-outage.html",
    "summary": "Managers of electric grids say freezing temperatures and ice and snow could lead to power outages in many places, potentially leaving millions in the dark."
  },
  {
    "title": "New York City Could Get a Foot of Snow. Mamdani Knows It’s a Test.",
    "link": "https://www.nytimes.com/2026/01/23/nyregion/mamdani-snow-nyc.html",
    "summary": "Plenty of New York City mayors have faced blowback over their handling of blizzards. In several appearances this week, Mayor Zohran Mamdani has sought to show he is prepared."
  },
  {
    "title": "Driving in Winter? Follow These Expert Tips to Arrive Safely.",
    "link": "https://www.nytimes.com/2026/01/22/us/safe-winter-driving-tips.html",
    "summary": "A storm is expected to bring hazardous driving conditions to much of the United States this weekend. Stay home if you can, but those who must travel should take it slow."
  },
  {
    "title": "TikTok Strikes Deal to Create New U.S. Entity and Loosen App’s Ties to China",
    "link": "https://www.nytimes.com/2026/01/22/technology/tiktok-deal-oracle-bytedance-china-us.html",
    "summary": "The Chinese parent company of the popular video app said a group of non-Chinese investors would create an American TikTok to avoid a federal ban."
  },
  {
    "title": "After TikTok Deal, Chinese Firms Search for a New Global Path",
    "link": "https://www.nytimes.com/2026/01/23/business/tiktok-china-technology.html",
    "summary": "Chinese firms must contend with geopolitical tensions and mistrust to do business in the United States. Some are choosing to avoid the U.S. altogether."
  },
  {
    "title": "Here’s Who Just Bought TikTok",
    "link": "https://www.nytimes.com/2026/01/22/business/media/tiktok-investors-oracle-mgx-silver-lake-bytedance.html",
    "summary": "Several big companies and investment firms are part of the new American TikTok. Many have ties to one another and President Trump."
  },
  {
    "title": "Will I Have to Download a New TikTok App? And Other Big Questions About The Deal.",
    "link": "https://www.nytimes.com/2026/01/22/business/media/tiktok-sold-app-content-algorithm.html",
    "summary": "The popular short form video app has a new corporate structure in the United States, which could result in some changes for the 200 million Americans who use TikTok."
  },
  {
    "title": "As Iran Grieves, Accounts Emerge of Disrespectful Treatment of Protest Victims",
    "link": "https://www.nytimes.com/2026/01/23/world/middleeast/iran-protests-victims-bodies.html",
    "summary": "Witness testimony and videos from Tehran’s largest cemetery show disrespectful treatment of the dead after a brutal government crackdown."
  },
  {
    "title": "Jack Smith Testifies in House Hearing About Trump Investigations",
    "link": "https://www.nytimes.com/2026/01/22/us/politics/jack-smith-trump-testimony-congress.html",
    "summary": "The former special prosecutor argued a case he was never allowed to in court: that President Trump “engaged in criminal activity” that undermined democracy."
  },
  {
    "title": "Takeaways From Jack Smith’s Testimony on Trump Investigations",
    "link": "https://www.nytimes.com/2026/01/22/us/politics/takeaways-jack-smith-congress-testimony.html",
    "summary": "In his remarks, the former special counsel repeatedly denied that he had acted out of partisan animus and bemoaned the Trump administration’s efforts to go after the president’s perceived enemies."
  },
  {
    "title": "Ukrainian, Russian and U.S. Officials to Meet in Abu Dhabi for Peace Talks",
    "link": "https://www.nytimes.com/2026/01/23/world/europe/ukraine-russia-war-us-peace-talks-abu-dhabi.html",
    "summary": "Ukrainian and Russian negotiators have rarely met directly in the past, instead relying on Americans to mediate, and it was unclear how the talks would play out."
  },
  {
    "title": "Increased Scrutiny Leads to an Improved Organ Transplant System",
    "link": "https://www.nytimes.com/2026/01/23/us/organ-donation.html",
    "summary": "A crackdown on problems with fairness and safety is achieving results, including a big drop in the number of sick patients being passed over for transplants."
  },
  {
    "title": "Peru’s President May Be Ousted Over Secret Meetings with Chinese Businessmen",
    "link": "https://www.nytimes.com/2026/01/23/world/americas/peru-president-chinese-businessmen-meetings.html",
    "summary": "Leaked videos have prompted a scandal involving President José Jerí and two Chinese men under investigation."
  },
  {
    "title": "After Pleas From Mamdani and Hochul, Talks Resume in Nurses’ Strike",
    "link": "https://www.nytimes.com/2026/01/23/nyregion/nyc-nurses-strike-mamdani-hochul.html",
    "summary": "Nearly 15,000 health care workers in New York have been off the job since last week in a labor action affecting some of the city’s major hospitals."
  },
  {
    "title": "Days Before His Suicide, Hemingway’s Hopeful Note to Sister Immaculata",
    "link": "https://www.nytimes.com/2026/01/23/arts/hemingway-book-nobel-sister-immaculata.html",
    "summary": "In 1961, the author inscribed a book for the sister, a nurse who cared for him at the Mayo Clinic. Her copy of “The Old Man and the Sea” is being donated to the Nobel Museum."
  },
  {
    "title": "The Trump Crackup",
    "link": "https://www.nytimes.com/2026/01/23/opinion/trump-authoritarian-power.html",
    "summary": "Events are being propelled by one man’s damaged psyche."
  },
  {
    "title": "No One Should Be Afraid to Say That Jasmine Crockett Can’t Win",
    "link": "https://www.nytimes.com/2026/01/23/opinion/jasmine-crockett-texas-win-las-culturistas.html",
    "summary": "Progressives shouldn’t let a retrograde style of internet discourse inhibit them from pointing out the obvious."
  },
  {
    "title": "A Big Storm",
    "link": "https://www.nytimes.com/2026/01/23/briefing/a-big-storm.html",
    "summary": "We explain what you can expect in the winter weather this week."
  },
  {
    "title": "Seth Meyers Says Trump’s Deals Are as Strong as a Pinkie Swear",
    "link": "https://www.nytimes.com/2026/01/23/arts/television/seth-meyers-trump-greenland-deal.html",
    "summary": "“At this point, it’s pretty clear world leaders make deals with Trump the way kids do on the playground,” Meyers said of the president on Wednesday."
  },
  {
    "title": "No Beer for You: How British Pubs Fought a Tax Increase",
    "link": "https://www.nytimes.com/2026/01/23/world/europe/uk-pubs-rates-u-turn.html",
    "summary": "More than 1,400 pubs declared a ban on Labour lawmakers in response to a plan to raise business rates significantly. The move got attention, and results."
  },
  {
    "title": "A Senate Primary in Texas Tests the Future of Democratic Politics",
    "link": "https://www.nytimes.com/2026/01/23/us/politics/texas-democrats.html",
    "summary": "Two of the Democrats’ rising stars, Jasmine Crockett and James Talarico, are seeing if a red state should be won courting disaffected Republicans or focusing on the party’s base."
  },
  {
    "title": "Big Insurers Try to Shift Blame for High Health Costs to Hospitals and Drug Makers",
    "link": "https://www.nytimes.com/2026/01/22/health/health-insurers-obamacare-congress.html",
    "summary": "At two congressional hearings, lawmakers slammed executives of major companies, saying they were failing to rein in the cost of medical care for consumers."
  }
]