[
  {
    "title": "George Santos Is Released From Prison, His Lawyer Says, After Trump Commutes His Sentence",
    "link": "https://www.nytimes.com/2025/10/17/us/politics/trump-george-santos-sentence-commute.html",
    "summary": "George Santos’s lawyer said the disgraced former congressman was freed from a New Jersey prison around 10 p.m. on Friday. He served less than three months on his fraud conviction."
  },
  {
    "title": "A Timeline of George Santos’s Rise and Fall",
    "link": "https://www.nytimes.com/2025/04/25/nyregion/george-santos-timeline.html",
    "summary": "The disgraced former congressman was sentenced to prison, years after his credentials and career began to unravel. Then President Trump commuted his sentence."
  },
  {
    "title": "Prosecutor Who Rejected Trump’s Pressure to Charge James Is Fired",
    "link": "https://www.nytimes.com/2025/10/17/us/politics/trump-prosecutor-fired-letitia-james.html",
    "summary": "The dismissal was the latest fallout from attempts by career Justice Department officials to impede the president’s wide-ranging campaign of retribution. The prosecutor’s deputy was also fired."
  },
  {
    "title": "Higher Obamacare Prices Become Public in a Dozen States",
    "link": "https://www.nytimes.com/2025/10/17/health/aca-health-insurance-costs.html",
    "summary": "Consumers are facing greater costs for their 2026 A.C.A. health coverage as Congress continues to debate whether to extend subsidies that help people afford their premiums."
  },
  {
    "title": "University of Virginia Won’t Join White House’s Compact for Colleges",
    "link": "https://www.nytimes.com/2025/10/17/us/university-of-virginia-white-house-compact.html",
    "summary": "It was the fifth school in a matter of days to refuse an offer of preferential funding treatment from the government, even as the White House has threatened schools that do not sign up."
  },
  {
    "title": "Senators Move to Force Vote to Bar Ground Strikes in Venezuela",
    "link": "https://www.nytimes.com/2025/10/17/us/politics/congress-venezuela-military-strikes.html",
    "summary": "The bid comes after the Senate rejected a similar measure to curb President Trump’s attacks against alleged drug runners in the Caribbean Sea."
  },
  {
    "title": "Maps: Where the U.S. Is Building Up Military Force in the Caribbean",
    "link": "https://www.nytimes.com/2025/10/17/us/politics/trump-caribbean-venezuela-us-military-maps.html",
    "summary": "About 10,000 U.S. troops and dozens of military aircraft and ships are in the region as the Trump administration increases pressure on Venezuela."
  },
  {
    "title": "U.S. Detains 2 Survivors of Latest Military Strike in Caribbean",
    "link": "https://www.nytimes.com/2025/10/17/us/politics/us-military-strike-survivors.html",
    "summary": "The capture of prisoners presents a major new set of legal and policy problems for the Trump administration in its escalating campaign."
  },
  {
    "title": "The Spritzes and Carbonaras That Ate Italy",
    "link": "https://www.nytimes.com/2025/10/18/world/europe/italy-tourism-restaurants.html",
    "summary": "Tourism has turned some Italian streets into monochromatic eating zones. Some officials have banned the opening of new restaurants."
  },
  {
    "title": "Benioff Apologizes for Saying Trump Should Send Troops to San Francisco",
    "link": "https://www.nytimes.com/2025/10/17/us/benioff-apologizes-san-francisco.html",
    "summary": "Marc Benioff, the chief executive of Salesforce, said he no longer believed that National Guard troops were needed in the city."
  },
  {
    "title": "Federal Agents Make Arrests Outside Migrant Shelter in Times Square",
    "link": "https://www.nytimes.com/2025/10/17/nyregion/ice-arrests-midtown-manhattan-shelter.html",
    "summary": "The arrests, on the crowded sidewalks of Midtown Manhattan, rattled migrants residing at a hotel and shook the theater district, which is heavily trafficked by tourists."
  },
  {
    "title": "Tennessee Officials Sue Over National Guard Presence in Memphis",
    "link": "https://www.nytimes.com/2025/10/17/us/politics/memphis-national-guard-lawsuit.html",
    "summary": "Backed by a liberal-leaning legal nonprofit, seven Tennessee officials filed a lawsuit on Friday challenging the deployment of troops in Memphis."
  },
  {
    "title": "Diane Keaton’s Legacy as a House Renovator and Flipper",
    "link": "https://www.nytimes.com/2025/10/17/realestate/diane-keaton-real-estate-flipper.html",
    "summary": "Known for her roles in film, the actress built a second act off-screen, turning the homes she renovated into another stage."
  },
  {
    "title": "The Indonesian Free-Food Program That Has Sickened Thousands",
    "link": "https://www.nytimes.com/2025/10/18/world/asia/indonesia-school-lunch-program-poisoning.html",
    "summary": "Indonesia’s president says the meals are improving nutrition in the country. Critics have called for a halt to the program, saying it threatens public health."
  },
  {
    "title": "Prince Andrew Surrenders Duke of York Title Amid Epstein Fallout",
    "link": "https://www.nytimes.com/2025/10/17/world/europe/prince-andrew-duke-of-york-title.html",
    "summary": "The royal’s fall from grace began nearly six years ago with a calamitous BBC television interview about his ties to the convicted sex offender Jeffrey Epstein."
  },
  {
    "title": "Despite Gaza Cease-Fire, Aid Deliveries Struggle",
    "link": "https://www.nytimes.com/2025/10/17/world/middleeast/gaza-food-delivery.html",
    "summary": "A single photograph of Palestinians besieging an aid convoy after the new cease-fire took hold in Gaza makes clear how much work lies ahead in the enclave."
  },
  {
    "title": "Wikipedia Volunteers Avert Tragedy by Taking Down Gunman at Conference",
    "link": "https://www.nytimes.com/2025/10/17/nyregion/wikipedia-conference-gunman.html",
    "summary": "After the man walked onto the stage at the “Wiki World’s Fair” event and threatened to kill himself, witnesses said, two members of the audience jumped in to stop him."
  },
  {
    "title": "Mamdani ‘Might Be Eaten Alive’: 3 Opinion Writers on Who Won the Mayoral Debate",
    "link": "https://www.nytimes.com/2025/10/17/opinion/nyc-mayor-debate-mamdani-cuomo-sliwa.html",
    "summary": "Who lost the debate may be clearer than who won."
  },
  {
    "title": "How Baby Boomers Blew Up the American Dream",
    "link": "https://www.nytimes.com/2025/10/17/opinion/baby-boomers-us-generations.html",
    "summary": "The postwar generation had a good run. Now we’re all paying for it."
  },
  {
    "title": "Zelensky Pressed Trump for New Weapons",
    "link": "https://www.nytimes.com/2025/10/17/briefing/ukraine-trump-weapons-treasury-argentina.html",
    "summary": "Also, the Treasury secretary is betting big on Argentina. Here’s the latest at the end of Friday."
  },
  {
    "title": "Vermont Legislator Resigns Over Racist Republican Texts",
    "link": "https://www.nytimes.com/2025/10/17/us/politics/samuel-douglass-resigns-vermont-young-republicans.html",
    "summary": "The G.O.P. officials who participated in a group chat have faced calls to step down. State Senator Samuel Douglass was the group’s only elected member."
  },
  {
    "title": "Alaska Governor Says Storm Recovery Could Keep Evacuees Away for 18 Months",
    "link": "https://www.nytimes.com/2025/10/17/us/alaska-storm-typhoon-recovery-evacuations.html",
    "summary": "After the remnants of a typhoon devastated villages in western Alaska, Gov. Mike Dunleavy asked President Trump for federal help in the recovery process."
  },
  {
    "title": "How a Long Island Woman Was Diagnosed With Chikungunya",
    "link": "https://www.nytimes.com/2025/10/17/nyregion/chikungunya-long-island-case.html",
    "summary": "A Long Island woman had no idea what had hit her. Her pursuit of an answer led to a mosquito-borne disease rarely seen in the United States."
  },
  {
    "title": "How a U.K. Spy Case Against China Abruptly Fell Apart",
    "link": "https://www.nytimes.com/2025/10/17/world/europe/uk-china-spy-case.html",
    "summary": "Evidence prepared for a collapsed espionage trial was published by an under-pressure government in Britain, offering a window into Western countries’ struggle to define Beijing as friend or foe."
  }
]