[
  {
    "title": "Trump’s D.C. Crackdown Plan Begins to Take Shape as National Guard Deploys",
    "link": "https://www.nytimes.com/2025/08/12/us/politics/dc-police-national-guard.html",
    "summary": "Troops appeared near the Washington Monument on Tuesday evening. But it remained unclear whether the eventual show of force would match the president’s apocalyptic rhetoric."
  },
  {
    "title": "Trump Deploys National Guard for Local Crime After Calling Jan. 6 Rioters ‘Very Special’",
    "link": "https://www.nytimes.com/2025/08/12/us/politics/trump-jan-6-dc-crime.html",
    "summary": "President Trump said he needed to send in the Guard to secure the nation’s capital. But on Jan. 6, 2021 — the most lawless day in recent Washington history — he had a very different reaction."
  },
  {
    "title": "Fact-Checking Trump’s False and Misleading Claims About Crime in D.C.",
    "link": "https://www.nytimes.com/2025/08/12/us/politics/trump-dc-crime-data-fact-check.html",
    "summary": "The president cited a number of false and misleading claims about homicides and youth crime in the nation’s capital."
  },
  {
    "title": "Rollout of Trump’s D.C. Crackdown Included Fox News Stars and Charts",
    "link": "https://www.nytimes.com/2025/08/12/us/politics/trump-dc-takeover-crime-fox-news.html",
    "summary": "Jeanine Pirro had a starring role in promoting the president’s federal takeover on TV, and Will Cain’s charts made a cameo."
  },
  {
    "title": "Cuomo’s Attack on Mamdani’s Apartment Struck a New York Nerve",
    "link": "https://www.nytimes.com/2025/08/12/nyregion/cuomo-mamdani-rent-stabilized.html",
    "summary": "The attacks in the New York City mayor’s race may have veered into the personal, but they also reflected a larger debate on who should benefit from government regulation of housing costs."
  },
  {
    "title": "What Is Rent Stabilization, and Why Is It an Issue in the NYC Mayor’s Race?",
    "link": "https://www.nytimes.com/2025/08/12/nyregion/mamdani-cuomo-rent-stabilized-apartment.html",
    "summary": "Former Gov. Andrew M. Cuomo’s push to keep “rich” people out of less-expensive apartments is aimed at his political rival in New York, Assemblyman Zohran Mamdani."
  },
  {
    "title": "Trump Will Discuss Ukraine With European Leaders Ahead of Putin Meeting",
    "link": "https://www.nytimes.com/2025/08/13/world/europe/trump-europe-ukraine-talks-putin.html",
    "summary": "Chancellor Friedrich Merz and several allies will host the president for a video call, the latest in a summer-long effort to hold ranks in supporting Ukraine."
  },
  {
    "title": "Trump to Meet Putin at U.S. Military Base in Anchorage",
    "link": "https://www.nytimes.com/2025/08/12/us/politics/trump-putin-summit-alaska.html",
    "summary": "The American and Russian presidents will meet face to face at Joint Base Elmendorf-Richardson in Alaska on Friday, according to a White House official."
  },
  {
    "title": "Russia Is Suspected to Be Behind Breach of Federal Court Filing System",
    "link": "https://www.nytimes.com/2025/08/12/us/politics/russia-hack-federal-court-system.html",
    "summary": "Federal officials are scrambling to assess the damage and address flaws in a sprawling, heavily used computer system long known to have vulnerabilities."
  },
  {
    "title": "White House Announces Comprehensive Review of Smithsonian Exhibitions",
    "link": "https://www.nytimes.com/2025/08/12/arts/design/smithsonian-exhibitions-review-white-house-trump.html",
    "summary": "The Trump administration is giving museums 120 days to replace “divisive or ideologically driven language with unifying, historically accurate and constructive descriptions.”"
  },
  {
    "title": "Human Rights Report Under Trump Blunts Language on Israel and El Salvador",
    "link": "https://www.nytimes.com/2025/08/12/us/politics/trump-human-rights-israel-saudi-arabia-china.html",
    "summary": "A collection of U.S. reports on human rights offenses trimmed or omitted past language on violations in El Salvador, Hungary, Saudi Arabia, the U.A.E. and Israel, all seen as partners by President Trump."
  },
  {
    "title": "Hidden Inside Our Electronics, Tiny Doodles From Another Era",
    "link": "https://www.nytimes.com/2025/08/12/technology/silicon-chips-doodles.html",
    "summary": "Decades ago, designers etched microscopic doodles onto silicon chips to leave their marks. Now, techno-archaeologists search for the tiny fossils."
  },
  {
    "title": "New Video Shows Uvalde School Chief Trying to Negotiate With Gunman",
    "link": "https://www.nytimes.com/2025/08/12/us/uvalde-documents-video-arredondo.html",
    "summary": "The video, part of a trove of materials that authorities had refused to release, shows the minutes in which a commander tried to talk to a gunman barricaded in a room with dozens of children."
  },
  {
    "title": "Cristiano Ronaldo and Georgina Rodríguez Are Engaged. All Eyes Are on the Ring.",
    "link": "https://www.nytimes.com/2025/08/12/style/georgina-rodriguez-cristiano-ronaldo-engagement-ring.html",
    "summary": "After years of speculation, the soccer superstar’s engagement is big news, but it’s the enormous diamond perched on Ms. Rodríguez’s finger that has everyone talking."
  },
  {
    "title": "Trump Is Doubling Down on Sanctions. Putin Is Laughing All the Way to Alaska.",
    "link": "https://www.nytimes.com/2025/08/13/opinion/trump-putin-ukraine-alaska.html",
    "summary": "There is something Putin cares about more than money."
  },
  {
    "title": "Trump Is Squandering the Greatest Gift of the Manhattan Project",
    "link": "https://www.nytimes.com/2025/08/12/opinion/trump-manhattan-project.html",
    "summary": "The U.S. risks not just being left behind, but out of the game entirely."
  },
  {
    "title": "Heavy Rain Causes Flash Flooding in Chattanooga",
    "link": "https://www.nytimes.com/2025/08/12/us/flooding-chattanooga-tennessee.html",
    "summary": "The mayor of Hamilton County, Tenn., declared a state of emergency as rescue crews pulled people out of submerged cars and homes."
  },
  {
    "title": "Six Convicted in 2017 Fire That Killed 41 Girls in Guatemala Group Home",
    "link": "https://www.nytimes.com/2025/08/12/world/americas/guatemala-convictions-deadly-fire.html",
    "summary": "The girls were locked in a classroom in a government-run group home for at-risk youth. The officials were charged with child abuse, dereliction of duty, manslaughter and other counts."
  },
  {
    "title": "Remains of British Researcher Lost in 1959 Are Discovered Off Antarctica",
    "link": "https://www.nytimes.com/2025/08/12/world/british-researcher-frozen-remains-antarctica.html",
    "summary": "Dennis “Tink” Bell was 25 years old when he fell into a crevasse on King George Island. Over the decades, a glacier receded, and a scientific team from Poland found his remains this year."
  },
  {
    "title": "Danielle Spencer, Child Star on ‘What’s Happening!!,’ Is Dead at 60",
    "link": "https://www.nytimes.com/2025/08/12/arts/television/danielle-spencer-dead.html",
    "summary": "She played a witty teenager on one of the first American television shows that centered Black teenagers."
  }
]