[
  {
    "title": "With Comey Indictment, Trump Gets Retribution but Shatters Norms",
    "link": "https://www.nytimes.com/2025/09/25/us/politics/trump-retribution-comey-indictment.html",
    "summary": "A prosecutor’s drive to indict James Comey trampled over the Justice Department’s long tradition of keeping a distance from politics and the White House, and raised the prospect of more arbitrary charges."
  },
  {
    "title": "At U.N., China Casts Itself as Defender of International Order",
    "link": "https://www.nytimes.com/2025/09/26/world/asia/china-un-trump.html",
    "summary": "Li Qiang, China’s second-highest-ranking official, portrayed Beijing as stable leader at a time when President Trump is pulling back from international institutions."
  },
  {
    "title": "Gunman Who Attacked Midtown Office Building Had C.T.E.",
    "link": "https://www.nytimes.com/2025/09/26/us/cte-football-tamura-gunman.html",
    "summary": "Shane Tamura, a former high school football player, shot himself and left behind a note that said his motive was anger at the N.F.L."
  },
  {
    "title": "Trump Will Slap Tariffs on Imported Drugs, Trucks and Household Furnishings",
    "link": "https://www.nytimes.com/2025/09/25/business/economy/trump-tariffs-pharmaceuticals-furniture-trucks.html",
    "summary": "The president said his tariffs would range from 25 to 100 percent and go into effect next week."
  },
  {
    "title": "Wary European Drugmakers Think They Can Avoid Trump’s Latest Tariffs",
    "link": "https://www.nytimes.com/2025/09/26/business/europe-pharma-tariffs-trump.html",
    "summary": "European companies, a major source of U.S. medicines, are hopeful that their investments and trade deals with the U.S. will spare them from President Trump’s latest tariff barrage."
  },
  {
    "title": "Trump’s New Tariffs Shock Countries Reeling From His Chaotic Trade War",
    "link": "https://www.nytimes.com/2025/09/26/business/trump-tariffs-asia.html",
    "summary": "Throughout Asia, the source of about 40 percent of U.S. imports, countries have little to show for weeks of talks trying to finalize deals."
  },
  {
    "title": "Who Pays for U.S. Tariffs, and Where Does the Money Go?",
    "link": "https://www.nytimes.com/2025/07/28/business/economy/trump-tariffs-payment.html",
    "summary": "President Trump is seeking to raise federal revenue by imposing levies on goods from foreign nations. Here’s how the process works."
  },
  {
    "title": "In ‘Punch’ on Broadway, Trying to Summon Empathy for the Unforgivable",
    "link": "https://www.nytimes.com/2025/09/26/theater/punch-broadway-restorative-justice.html",
    "summary": "The Broadway play “Punch” retells the true story of a fatal blow and how restorative justice brought healing to the parents and to the young man who threw the punch."
  },
  {
    "title": "NASA Artemis II Astronauts Aim to Make Space Great for All",
    "link": "https://www.nytimes.com/2025/09/26/science/nasa-astronauts-moon-artemis-ii.html",
    "summary": "In a preview of their flight, the crew of Artemis II, three Americans and a Canadian, struck a tone that veered away from the political currents of the moment."
  },
  {
    "title": "Judge Rejects Lawsuit Claiming Art Had Lost Its ‘Oomph’",
    "link": "https://www.nytimes.com/2025/09/26/arts/design/ronald-perelman-cy-twombly-oomph-lawsuit.html",
    "summary": "The collector’s holding companies had sued his insurers for $400 million to cover paintings that they say had been damaged in a fire. The insurers said they had survived untouched."
  },
  {
    "title": "Filmmaker Joshua Oppenheimer Turns His Camera on History’s Villains",
    "link": "https://www.nytimes.com/2025/09/25/magazine/joshua-oppenheimer-films-director-profile.html",
    "summary": "Joshua Oppenheimer’s films show the political value of empathy in our polarized age."
  },
  {
    "title": "Marketing Movies Is Harder Than Ever. And Here Comes ‘One Battle After Another.’",
    "link": "https://www.nytimes.com/2025/09/26/business/media/marketing-warner-bros-one-battle-after-another.html",
    "summary": "The film is the kind that isn’t supposed to work in theaters anymore. But Warner Bros., the studio behind it, has successfully bucked trends for months now."
  },
  {
    "title": "New York Film Festival Highlights",
    "link": "https://www.nytimes.com/2025/09/26/movies/new-york-film-festival-jim-jarmusch-father-mother-sister-brother.html",
    "summary": "This year’s highlights include Jim Jarmusch’s “Father Mother Sister Brother,” the Italian documentary “Below the Clouds” and the epic “Magellan.”"
  },
  {
    "title": "A Broad Wave of Firings Followed Charlie Kirk’s Assassination",
    "link": "https://www.nytimes.com/2025/09/26/us/kirk-critics-fired-free-speech.html",
    "summary": "More than 145 people in a wide range of occupations have been fired or disciplined after they made statements about the assassination of Charlie Kirk."
  },
  {
    "title": "5 Dairy Myths That Make Experts Sour",
    "link": "https://www.nytimes.com/2025/09/26/well/eat/health-myths-dairy.html",
    "summary": "We surveyed leading nutrition experts to reveal the truth about raw milk, lactose intolerance, low-fat dairy and more."
  },
  {
    "title": "Mamdani Foes, Struggling to Raise Money, Have Started Buying Attack Ads",
    "link": "https://www.nytimes.com/2025/09/26/nyregion/mamdani-opposition-attack-ads.html",
    "summary": "Several super PACs that oppose Zohran Mamdani’s candidacy for mayor of New York City have banded together to coordinate attack ads."
  },
  {
    "title": "Assata Shakur Dies at 78; Convicted Revolutionary Found Refuge in Cuba",
    "link": "https://www.nytimes.com/2025/09/26/obituaries/assata-shakur-dead.html",
    "summary": "A member of a militant Black group, she was found guilty in the 1973 murder of a New Jersey state trooper, escaped from prison and fled to Cuba, where she taught and wrote."
  },
  {
    "title": "Trump Can’t Be the One to Pick Who’s Indicted",
    "link": "https://www.nytimes.com/2025/09/26/opinion/james-comey-indicted-trump.html",
    "summary": "The Justice Department and the attorney general are supposed to keep a distance from the president, not be his personal score settlers."
  },
  {
    "title": "This Town’s Minerals Make A.I. Possible. Then Came Hurricane Helene.",
    "link": "https://www.nytimes.com/2025/09/26/opinion/ai-quartz-mining-hurricane-helene.html",
    "summary": "Spruce Pine, N.C., supplies the world’s highest-purity quartz, a mineral that keeps the A.I. revolution afloat. What are the consequences?"
  },
  {
    "title": "Political Interference at the Justice Department",
    "link": "https://www.nytimes.com/2025/09/26/briefing/political-interference-at-the-justice-department.html",
    "summary": "We examine James Comey’s indictment and an investigation into George Soros’s foundation."
  },
  {
    "title": "ICE Officer ‘Relieved of His Duties’ After Pushing Woman to Floor",
    "link": "https://www.nytimes.com/2025/09/26/nyregion/ice-officer-investigation-woman-shoved.html",
    "summary": "The Department of Homeland Security said it was investigating an officer’s action during an altercation at a New York City immigration courthouse."
  },
  {
    "title": "Boeing Will Regain Ability to Certify Some Planes From F.A.A.",
    "link": "https://www.nytimes.com/2025/09/26/business/boeing-faa-737-max-certification.html",
    "summary": "The Federal Aviation Administration said the aerospace company will be allowed to approve some new 737 Max and 787 Dreamliner jets."
  },
  {
    "title": "Hackers Steal Children’s Data and Photos from U.K. Nursery Chain",
    "link": "https://www.nytimes.com/2025/09/26/world/europe/uk-nursery-school-hack.html",
    "summary": "Kido International, which runs nursery schools, reported the incident to the authorities after hackers posted sensitive data on the dark web and demanded a ransom."
  }
]