[
  {
    "title": "How Netanyahu’s Move Against Iran Gives Him Room to Maneuver on Gaza",
    "link": "https://www.nytimes.com/2025/06/24/world/middleeast/netanyahu-iran-gaza-israel.html",
    "summary": "Benjamin Netanyahu, the Israeli prime minister, has avoided a truce in Gaza. Boosted by his Iran campaign, he can negotiate from strength."
  },
  {
    "title": "Stocks Rise and Oil Falls as Middle East Cease-Fire Begins",
    "link": "https://www.nytimes.com/2025/06/24/business/oil-prices-fall-stocks-rise-iran-israel-ceasefire.html",
    "summary": "A second day of declining oil prices helped lift stocks. Energy costs are a primary expense for companies, making them an important factor in inflation calculations."
  },
  {
    "title": "How B-2 Bombers Can Fly to Iran and Back",
    "link": "https://www.nytimes.com/2025/06/24/us/politics/b2-pilots-iran.html",
    "summary": "The U.S. crews involved in attacking the nuclear site at Fordo probably trained for years. But dropping 30,000-pound bombs was almost certainly a new feeling."
  },
  {
    "title": "Central Park Hits Its Hottest Temperature Since 2012",
    "link": "https://www.nytimes.com/2025/06/24/weather/new-york-city-temperatures-heat-today.html",
    "summary": "New York’s official temperature gauge hit 99 degrees on Tuesday afternoon. It could climb even higher."
  },
  {
    "title": "Extreme Heat Is Exacerbating Air Pollution, a ‘Double Whammy’ for Health",
    "link": "https://www.nytimes.com/2025/06/24/climate/extreme-heat-pollution-health.html",
    "summary": "Extreme heat is making air pollution worse, scientists say. And President Trump’s regulatory rollbacks could drive air pollution even higher."
  },
  {
    "title": "US Heat Wave: Latest Forecast for the East Coast",
    "link": "https://www.nytimes.com/2025/06/22/weather/heat-wave-temperatures.html",
    "summary": "This week is delivering the hottest temperatures of the year so far to much of the eastern United States."
  },
  {
    "title": "At Justice Dept., Bove Suggested Violating Court Orders, Whistle-Blower Says",
    "link": "https://www.nytimes.com/2025/06/24/us/politics/justice-department-emil-bove-trump-deportations-reuveni.html",
    "summary": "Emil Bove III, a Trump judicial nominee, voiced his intent to disobey court orders as others stonewalled and misled judges, according to a complaint."
  },
  {
    "title": "House Democrats Elect Robert Garcia for Top Oversight Post",
    "link": "https://www.nytimes.com/2025/06/24/us/politics/democrats-congress-oversight-post.html",
    "summary": "Robert Garcia, a second-term congressman and former mayor of Long Beach, Calif., prevailed over a more experienced member to take on the high-profile job on one of the House’s most contentious panels."
  },
  {
    "title": "Behind Closed Doors, Harvard Officials Debate a Risky Truce With Trump",
    "link": "https://www.nytimes.com/2025/06/24/us/politics/harvard-debate-settlement-trump.html",
    "summary": "The university is trying to avoid the appearance of appeasement, something other powerful institutions that made deals with President Trump found impossible."
  },
  {
    "title": "Real Doctors of New York Spill Their Guts",
    "link": "https://www.nytimes.com/2025/06/24/well/real-doctors-of-new-york-spill-their-guts.html",
    "summary": "E.R. doctors want you to know that they are people, too. At an event called Airway, one confessed, “I do not like these big, high stakes, bloody, messy, risky procedures.”"
  },
  {
    "title": "NATO Leader’s Aim? Give Trump What He Wants: A Win on Military Spending.",
    "link": "https://www.nytimes.com/2025/06/24/world/europe/trump-ukraine-russia-nato.html",
    "summary": "But at a summit focused on keeping President Trump happy, discussion of Russia is expected to be muted, despite most allies’ belief that its aggression is NATO’s chief challenge."
  },
  {
    "title": "Trump Heads to NATO as Allies Face Pressure Over Defense Spending",
    "link": "https://www.nytimes.com/2025/06/24/us/politics/nato-trump-preview.html",
    "summary": "President Trump is expected to talk about spending commitments from the alliance’s members, while NATO’s secretary general has been eager to avoid diplomatic blowups."
  },
  {
    "title": "Germany to Spend Record Amount on Its Military and Infrastructure",
    "link": "https://www.nytimes.com/2025/06/24/world/europe/germany-budget-military-infrastructure.html",
    "summary": "The increase was announced hours before a NATO meeting during which member countries are expected to agree to raise military spending to 5 percent of their G.D.P."
  },
  {
    "title": "What to Watch for When the N.Y.C. Mayoral Results Come in",
    "link": "https://www.nytimes.com/2025/06/24/nyregion/when-know-nyc-mayor-primary-winner.html",
    "summary": "A winner on Tuesday night is unlikely, but not impossible. Ranked-choice voting will play a big role in the outcome. Here’s what else you should look for as votes are counted."
  },
  {
    "title": "It’s Primary Day, and the Mayor’s Race Has Never Been Closer",
    "link": "https://www.nytimes.com/2025/06/24/nyregion/nyc-primary-day.html",
    "summary": "Voters are heading to the polls amid sweltering heat. Will New Yorkers know the Democratic mayoral nominee this evening? Unlikely."
  },
  {
    "title": "Here Are 5 Key City Council Races to Watch in the N.Y.C. Primary",
    "link": "https://www.nytimes.com/2025/06/24/nyregion/nyc-democratic-primary-city-council.html",
    "summary": "In two bitterly contested races in Brooklyn, Democratic candidates have clashed over Gaza, while in Manhattan Anthony Weiner is trying to return to the Council."
  },
  {
    "title": "America’s Adversaries Are Gaining the Global Megaphone",
    "link": "https://www.nytimes.com/2025/06/24/business/media/us-china-russia-global-communications.html",
    "summary": "The U.S. is dismantling key communications efforts abroad, once a major part of its efforts to build soft power. Its rivals are eager to fill the vacuum."
  },
  {
    "title": "The Challenge of Rebuilding Syria",
    "link": "https://www.nytimes.com/video/world/middleeast/100000010114624/the-challenge-of-rebuilding-syria.html",
    "summary": "After one of the most brutal wars of this century, a new flag flies across Syria: the emblem of the rebels who toppled the dictator Bashar al-Assad. Ben Hubbard, The New York Times’s Istanbul bureau chief, describes what our journalists learned as they drove across Syria, meeting people in towns and cities along the way as they strove to rise from the wreckage and build new lives."
  },
  {
    "title": "The Times’s New Critic Reviews the View, the Revolving Times Square Restaurant",
    "link": "https://www.nytimes.com/2025/06/24/dining/revolving-restaurant-times-square-review.html",
    "summary": "In her first review as our new critic, Ligaya Mishan checks out the View, the revolving Times Square dining room with a nostalgic menu and a stunning panorama of the city."
  },
  {
    "title": "An Interview With Ligaya Mishan and Tejal Rao",
    "link": "https://www.nytimes.com/2025/06/11/dining/ligaya-mishan-tejal-rao-critics-interview.html",
    "summary": "‘Dreamy and daunting,’ is how one of them described the job."
  },
  {
    "title": "Trump’s Iran Diplomacy Failed. I Hope His Airstrike Succeeds.",
    "link": "https://www.nytimes.com/2025/06/24/opinion/trump-iran-jcpoa-biden.html",
    "summary": "Iran can’t be allowed to develop a nuclear weapon, but the president’s approach wasn’t the best way to prevent that."
  },
  {
    "title": "The Story of Antisemitism Needs to Be Rewritten, Starting in New York",
    "link": "https://www.nytimes.com/2025/06/24/opinion/antisemitism-new-york-city-mayor.html",
    "summary": "It may be time to rethink the tragic events in Washington and Boulder."
  },
  {
    "title": "Maryland Closed a Baltimore Addiction Program. For Some Patients, Little Has Changed.",
    "link": "https://www.nytimes.com/2025/06/24/us/baltimore-drug-addiction-pha-healthcare.html",
    "summary": "Patients of PHA Healthcare, a treatment program in Baltimore, were housed in drug-ridden buildings where many overdosed, an investigation reported last year. Some are still there."
  },
  {
    "title": "Freddie O’Connell Confronts the Limits of Political Power in Nashville",
    "link": "https://www.nytimes.com/2025/06/24/us/politics/freddie-oconnell-nashville-democratic-mayor.html",
    "summary": "Freddie O’Connell, a policy and transit wonk, is under Republican scrutiny for his response to immigration enforcement in his left-leaning city."
  },
  {
    "title": "Man on His Honeymoon Is Struck by Lightning and Killed on Florida Beach",
    "link": "https://www.nytimes.com/2025/06/24/us/lightning-kills-man-florida-honeymoon.html",
    "summary": "Just before Jake Rosencranz, 29, of Denver, was struck while standing in ankle-deep water in New Smyrna Beach, two people were struck at a golf course in the area."
  },
  {
    "title": "London Police Appeal for Help in the Theft of a $200,000 Violin",
    "link": "https://www.nytimes.com/2025/06/24/world/europe/london-violin-stolen-police.html",
    "summary": "British police are asking for assistance in identifying the suspect in the theft of a 285-year-old violin, which was snatched while a musician was in a pub."
  }
]