[
  {
    "title": "FEMA Didn’t Answer Thousands of Calls From Flood Survivors, Documents Show",
    "link": "https://www.nytimes.com/2025/07/11/climate/fema-missed-calls-texas-floods.html",
    "summary": "Two days after deadly Texas floods, the agency struggled to answer calls from survivors because of call center contracts that weren’t extended."
  },
  {
    "title": "After Texas Disaster, Trump Shifts His Tone on FEMA",
    "link": "https://www.nytimes.com/2025/07/11/us/politics/trump-fema-texas-flood.html",
    "summary": "Earlier this year, President Trump suggested he wanted to shutter the agency. Now, he says his aides “fixed it up in no time.”"
  },
  {
    "title": "Texas Flood Survivors Recount Night of Terror at Waterfront Campgrounds",
    "link": "https://www.nytimes.com/2025/07/11/us/texas-flood-survivors-waterfront-campgrounds.html",
    "summary": "The half-mile stretch occupied by two campgrounds appears to have been one of the deadliest spots along the Guadalupe River in Central Texas during last week’s flash floods."
  },
  {
    "title": "Trump Visits Texas Flood Sites: ‘Hell of a Situation, Isn’t It?’",
    "link": "https://www.nytimes.com/2025/07/11/us/politics/trump-texas-flood-sites.html",
    "summary": "Mr. Trump and Melania Trump met with victims’ families and viewed some of the aftermath of last weekend’s flooding."
  },
  {
    "title": "Judge Blocks Trump Administration Tactics in L.A. Immigration Raids",
    "link": "https://www.nytimes.com/2025/07/11/us/immigration-raids-judge-injunction.html",
    "summary": "A federal judge temporarily halted the administration from making indiscriminate arrests based on race and denying detainees access to lawyers, in a lawsuit that could have national repercussions."
  },
  {
    "title": "Farmworker Dies After Fleeing a Federal Raid in Southern California",
    "link": "https://www.nytimes.com/2025/07/11/us/immigration-raids-farmworker-death.html",
    "summary": "During a chaotic raid in Ventura County on Thursday, the worker fell from a greenhouse at a cannabis farm, suffered spinal and skull injuries, and died on Friday."
  },
  {
    "title": "Support for Immigration Rebounds as Trump Cracks Down on It, Poll Finds",
    "link": "https://www.nytimes.com/2025/07/11/us/immigration-poll-trump.html",
    "summary": "In a marked reversal from a year ago, more Americans now have positive views about immigration, and a record high believes it is good for the nation."
  },
  {
    "title": "A New York County Will Let Officers Wear Masks When Working With ICE",
    "link": "https://www.nytimes.com/2025/07/11/nyregion/nassau-county-police-officers-ice-masks.html",
    "summary": "Nassau County, which recently barred residents from wearing masks in many circumstances, will allow police officers to wear them during immigration enforcement and other actions."
  },
  {
    "title": "Pam Bondi and FBI’s Dan Bongino Clash Over Handling of Epstein Case",
    "link": "https://www.nytimes.com/2025/07/11/us/politics/jeffrey-epstein-pam-bondi-dan-bongino-clash.html",
    "summary": "An irate attorney general is said to have confronted the deputy director of the F.B.I. at a tense White House meeting earlier in the week."
  },
  {
    "title": "Columbia and Trump Near a Deal, With School Possibly Paying Millions",
    "link": "https://www.nytimes.com/2025/07/11/nyregion/columbia-university-trump-deal-antisemitism.html",
    "summary": "In return, the White House would restore some of the more than $400 million in federal research funding it canceled, according to people familiar with ongoing discussions."
  },
  {
    "title": "Energy Department to Gut Funding for Solar and Wind Projects",
    "link": "https://www.nytimes.com/2025/07/11/business/energy-environment/energy-department-renewable-funding-cuts.html",
    "summary": "Stripping hundreds of millions of dollars from renewable energy and efficiency initiatives is part of a broader move to undo efforts to wean the United States off fossil fuels."
  },
  {
    "title": "Air India Plane Crash Report Says Fuel to Engines Was Cut Off",
    "link": "https://www.nytimes.com/2025/07/11/world/asia/air-india-crash-report.html",
    "summary": "A focus on the fuel switches in a preliminary assessment raised questions about the pilots’ actions, but much is still unknown about Flight 171."
  },
  {
    "title": "David Gergen, Adviser to Presidents and Political Commentator, Dies at 83",
    "link": "https://www.nytimes.com/2025/07/11/us/politics/david-gergen-dead.html",
    "summary": "He served under Nixon, Ford, Reagan and Clinton before becoming a top editor and a familiar TV pundit. “Centrism doesn’t mean splitting the difference,” he said."
  },
  {
    "title": "Meet the French Game Show Contestant Who Won 646 Times in a Row (and 23 Cars)",
    "link": "https://www.nytimes.com/2025/07/11/arts/television/france-game-show.html",
    "summary": "He also won TVs, musical instruments, a parachuting session, makeup, household appliances and much, much more. “It’s a lot,” he acknowledged."
  },
  {
    "title": "Amanda Anisimova Makes Wimbledon Final Years After Taking Extended Break",
    "link": "https://www.nytimes.com/2025/07/11/style/amanda-anisimova-wimbledon.html",
    "summary": "The 23-year-old star could be the first American woman to win the tournament since 2016. A self-imposed sabbatical may have helped her get there."
  },
  {
    "title": "Google Hires Top A.I. Leaders From Windsurf, Which OpenAI Was Courting",
    "link": "https://www.nytimes.com/2025/07/11/technology/google-windsurf-openai.html",
    "summary": "In a $2.4 billion deal, Google recruited the chief executive and a co-founder of Windsurf, which OpenAI had been in talks to buy, as the battle to dominate artificial intelligence escalates."
  },
  {
    "title": "How Netanyahu Prolonged the War in Gaza to Stay in Power",
    "link": "https://www.nytimes.com/2025/07/11/magazine/benjamin-netanyahu-gaza-war.html",
    "summary": "Secret meetings, altered records, ignored intelligence: the inside story of the prime minister’s political calculations since Oct. 7."
  },
  {
    "title": "Takeaways From the Times Investigation Into Benjamin Netanyahu",
    "link": "https://www.nytimes.com/2025/07/11/magazine/benjamin-netanyahu-gaza-investigation-takeaways.html",
    "summary": "Prolonging the Gaza war helped the Israeli prime minister forestall a political reckoning."
  },
  {
    "title": "Have Christians Finally Had It With Trump?",
    "link": "https://www.nytimes.com/2025/07/11/opinion/trump-republicans-christians.html",
    "summary": "The irreconcilable difference between Trumpian politics and Christianity."
  },
  {
    "title": "Novak Djokovic, I Was Wrong About You",
    "link": "https://www.nytimes.com/2025/07/11/opinion/djokovic-wimbledon-tennis.html",
    "summary": "We never really gave him his due. Maybe the problem was us."
  },
  {
    "title": "Trump Says NATO Countries Will Buy Weapons to Give to Ukraine",
    "link": "https://www.nytimes.com/2025/07/11/world/europe/trump-nato-weapons-ukraine.html",
    "summary": "If the plan is finalized, it would allow critical aid to flow to Ukraine as it endures one of Russia’s heaviest assaults of the war."
  },
  {
    "title": "‘They Kept Coming’: Hundreds of Packages Pile Up Outside Woman’s Home",
    "link": "https://www.nytimes.com/2025/07/11/us/amazon-packages-returns-california-woman.html",
    "summary": "A year ago, misdirected Amazon returns began arriving at Karen Holton’s house in California. Eventually, she said, they were stacked so high that she could not easily use her door."
  },
  {
    "title": "Man Had 14 Toucans Stashed in His Volkswagen Dashboard, U.S. Says",
    "link": "https://www.nytimes.com/2025/07/11/us/california-man-charged-toucan-smuggling.html",
    "summary": "Carlos Abundez, 35, is facing federal smuggling charges after U.S. Customs and Border Protection officers made the discovery. The birds, a threatened species, were in stable condition."
  },
  {
    "title": "2 Arkansas Prison Workers Are Fired in Wake of Convicted Murderer’s Escape",
    "link": "https://www.nytimes.com/2025/07/11/us/arkansas-prison-escape-grant-hardin.html",
    "summary": "The employees unwittingly helped Grant Hardin, a former police chief, walk out of a prison in May, dressed in a fake law enforcement uniform, officials said."
  }
]