[
  {
    "title": "Trump’s Big Policy Bill Puts U.S. on Perilous Fiscal Path",
    "link": "https://www.nytimes.com/2025/07/01/us/politics/republican-policy-bill-perilous-fiscal-path.html",
    "summary": "Among the most expensive pieces of legislation in years, the Republican legislation could reshape the country’s finances for a generation."
  },
  {
    "title": "Zohran Mamdani Wins N.Y.C. Mayoral Primary in Decisive 12-Point Victory",
    "link": "https://www.nytimes.com/2025/07/01/nyregion/mamdani-wins-mayor-primary-nyc.html",
    "summary": "Mr. Mamdani defeated Andrew M. Cuomo in the Democratic primary by a significant margin. He was declared the winner on Tuesday after ranked-choice tabulations were run."
  },
  {
    "title": "How Zohran Mamdani Stunned New York and Won the Primary for Mayor",
    "link": "https://www.nytimes.com/2025/07/01/nyregion/how-mamdani-won-campaign-mayor.html",
    "summary": "Mr. Mamdani’s victory upended city politics and reverberated nationally. He relied on a memorable message, charisma and a strong ground game."
  },
  {
    "title": "New Yorkers May Vote on Curbing Council’s Power to Block New Housing",
    "link": "https://www.nytimes.com/2025/07/01/nyregion/nyc-charter-revision-housing.html",
    "summary": "The City Council can block the development of new housing. A panel created by Mayor Eric Adams wants to let voters weigh in on reducing the Council’s power."
  },
  {
    "title": "Under a Drone-Swarmed Sky: Surviving in Eastern Ukraine",
    "link": "https://www.nytimes.com/2025/07/01/world/europe/ukraine-russia-frontline.html",
    "summary": "Towns and troops long accustomed to merciless bombardment are adjusting to an even denser pattern of attacks."
  },
  {
    "title": "Top Russian General Convicted in High-Profile Corruption Case",
    "link": "https://www.nytimes.com/2025/07/01/world/europe/russia-timur-ivanov-verdict.html",
    "summary": "Timur Ivanov, a longtime deputy defense minister, was sentenced to 13 years in a penal colony, according to the Russian state news agency Tass."
  },
  {
    "title": "California Rolls Back Its Landmark Environmental Law",
    "link": "https://www.nytimes.com/2025/06/30/us/california-environment-newsom-ceqa.html",
    "summary": "Gov. Gavin Newsom and state lawmakers scaled back a law that was vilified for its role in California’s housing shortage and homelessness crisis."
  },
  {
    "title": "An Offhand Remark About Gold Bars, Secretly Recorded, Upended His Life",
    "link": "https://www.nytimes.com/2025/07/01/climate/gold-bars-titanic-epa-date.html",
    "summary": "Brent Efron’s “boring” Tinder date wanted to hear all about his work at the Environmental Protection Agency, so Mr. Efron talked. If only he’d seen the hidden camera."
  },
  {
    "title": "Restaurant Review: Acamaya in New Orleans",
    "link": "https://www.nytimes.com/2025/07/01/dining/acamaya-restaurant-review-new-orleans.html",
    "summary": "In her first review as our new critic, Tejal Rao visits Acamaya, where the chef Ana Castro is writing the latest chapter in the city’s rich culinary story."
  },
  {
    "title": "Thought Markets Were Volatile in the First Half? Watch Out.",
    "link": "https://www.nytimes.com/2025/07/01/business/dealbook/2025-markets-outlook.html",
    "summary": "Stocks have rebounded, but the dollar is in a deep slump. Here’s what could go right (and very wrong) for investors."
  },
  {
    "title": "As Debt Piles Up, Countries See Fiscal Relief as Political Leverage",
    "link": "https://www.nytimes.com/2025/07/01/business/debt-eu-africa-china.html",
    "summary": "With developing nations crushed by unaffordable borrowing and Washington on the sidelines, some leaders are brokering debt forgiveness deals."
  },
  {
    "title": "Appeals Court Weighs Trump’s Use of Alien Enemies Act for Deportations",
    "link": "https://www.nytimes.com/2025/06/30/us/politics/appeals-court-trump-alien-enemies-act-deportations.html",
    "summary": "The case is likely to be the first to reach the Supreme Court on the substantive issue of the president’s invocation of a rarely used wartime law."
  },
  {
    "title": "Steve Bannon’s Battle for the Soul of MAGA",
    "link": "https://www.nytimes.com/2025/07/01/podcasts/the-daily/steve-bannon-interview-maga.html",
    "summary": "The former White House chief strategist speaks about the threats he sees to the political movement that formed around Donald J. Trump."
  },
  {
    "title": "Israelis Set a Palestinian Village Ablaze in West Bank Attack",
    "link": "https://www.nytimes.com/2025/07/01/world/middleeast/israel-west-bank-palestinians-attack.html",
    "summary": "The violence last week in Kafr Malik, in the West Bank, comes amid a surge in assaults by Israeli settlers. It also set off a chain of violence in the area."
  },
  {
    "title": "Israel’s Netanyahu Says He Will Meet With Trump Next Week",
    "link": "https://www.nytimes.com/2025/07/01/world/middleeast/netanyahu-israel-trump-meeting.html",
    "summary": "The Israeli prime minister’s expected visit to the United States comes as the cease-fire with Iran may create new momentum for a truce in Gaza."
  },
  {
    "title": "Ford Foundation’s New Leader Says She’ll Work to Protect Democracy",
    "link": "https://www.nytimes.com/2025/07/01/us/ford-foundation-heather-gerken-yale-law-school.html",
    "summary": "Heather K. Gerken, the dean of the law school, will run the powerful philanthropy, known for pushing for social justice."
  },
  {
    "title": "Jimmy Swaggart, Passionate Televangelist Ousted by Scandal, Dies at 90",
    "link": "https://www.nytimes.com/2025/07/01/us/the-rev-jimmy-lee-swaggart-dead.html",
    "summary": "A fire-and-brimstone preacher, he reached millions and made millions in a global enterprise before tumbling from grace over his encounters with a prostitute."
  },
  {
    "title": "How the Hottest Place in India Survives",
    "link": "https://www.nytimes.com/2025/07/01/world/asia/india-heat.html",
    "summary": "It’s 40 degrees Celsius (104 Fahrenheit), and it’s only 10 a.m. Welcome to Sri Ganganagar."
  },
  {
    "title": "What to Know About the Heat Wave in Europe",
    "link": "https://www.nytimes.com/2025/06/30/world/europe/heat-wave-europe-what-to-know.html",
    "summary": "Health warnings were issued to tens of millions of Europeans as temperatures climbed well above 100 degrees Fahrenheit, or more than 40 degrees Celsius."
  },
  {
    "title": "Wimbledon 2025: How the World’s Oldest Tennis Tournament is Coping with the Heat Wave",
    "link": "https://www.nytimes.com/2025/07/01/world/europe/wimbledon-heat-wave.html",
    "summary": "With 6,700 refillable water bottles, “shade mapping” and ice packs, the world’s oldest championship tennis tournament is taking Britain’s heat wave seriously."
  },
  {
    "title": "My First America",
    "link": "https://www.nytimes.com/2025/07/01/opinion/july4-john-jakes-america.html",
    "summary": "When I was a teenager, a mostly forgotten series of novels taught me U.S. history. How would they read to me now?"
  },
  {
    "title": "JD Vance Tells the Truth About the ‘Big, Beautiful Bill’",
    "link": "https://www.nytimes.com/live/2025/06/30/opinion/thepoint/reconciliation-funding-detentions-ice-jd-vance",
    "summary": "Vance’s posts about the reconciliation package reveal the true nature of Trump’s populism."
  },
  {
    "title": "Bryan Kohberger, Suspect in Idaho Student Murders, Accepts Plea Deal",
    "link": "https://www.nytimes.com/2025/06/30/us/idaho-murders-bryan-kohberger-plea.html",
    "summary": "Bryan Kohberger, a former criminology student, is charged in the stabbing deaths of four University of Idaho students. Prosecutors said they had reached a plea agreement that avoids the death penalty."
  },
  {
    "title": "The U.S. Sends Lots of Plastic Trash Overseas. Malaysia Just Said No Thanks.",
    "link": "https://www.nytimes.com/2025/07/01/climate/plastic-recycling-malaysia-import-ban.html",
    "summary": "No country receives more discarded plastic from wealthy countries, but shipments from the United States are no longer welcome."
  },
  {
    "title": "With Tillis Out, North Carolina’s Senate Race Will Draw Parties’ Firepower",
    "link": "https://www.nytimes.com/2025/07/01/us/politics/north-carolina-senate-tillis-cooper.html",
    "summary": "A popular former Democratic governor, Roy Cooper, is expected to announce a bid this summer. The Republicans are banking on an endorsement by President Trump to clear their field."
  }
]