[
  {
    "title": "George Santos Is Released From Prison, His Lawyer Says, After Trump Commutes His Sentence",
    "link": "https://www.nytimes.com/2025/10/17/us/politics/trump-george-santos-sentence-commute.html",
    "summary": "George Santos’s lawyer said the disgraced former congressman was freed from a New Jersey prison around 10 p.m. on Friday. He served less than three months on his fraud conviction."
  },
  {
    "title": "A Timeline of George Santos’s Rise and Fall",
    "link": "https://www.nytimes.com/2025/04/25/nyregion/george-santos-timeline.html",
    "summary": "The disgraced former congressman was sentenced to prison, years after his credentials and career began to unravel. Then President Trump commuted his sentence."
  },
  {
    "title": "The Shutdown is Stretching On. Trump Doesn’t Seem to Mind.",
    "link": "https://www.nytimes.com/2025/10/18/us/politics/trump-democrats-shutdown-deal.html",
    "summary": "As the shutdown nears a fourth week, President Trump has pushed his political opponents to further dig in."
  },
  {
    "title": "Military Plans to Fire Artillery Over California Freeway on Saturday",
    "link": "https://www.nytimes.com/2025/10/18/us/artillery-interstate-5-marines.html",
    "summary": "Rounds were fired on Friday across Interstate 5 as part of a test run for Saturday’s event at Camp Pendleton in Southern California."
  },
  {
    "title": "Prosecutor Who Rejected Trump’s Pressure to Charge James Is Fired",
    "link": "https://www.nytimes.com/2025/10/17/us/politics/trump-prosecutor-fired-letitia-james.html",
    "summary": "The dismissal was the latest fallout from attempts by career Justice Department officials to impede the president’s wide-ranging campaign of retribution. The prosecutor’s deputy was also fired."
  },
  {
    "title": "What We Know About the Latest ‘No Kings’ Protests Amid Government Shutdown",
    "link": "https://www.nytimes.com/2025/10/17/us/no-kings-protest.html",
    "summary": "The nationwide protests are playing out as a federal government shutdown lingers and troops are being deployed in cities."
  },
  {
    "title": "Ukraine Braces for New Talks Without the Leverage of New Missiles",
    "link": "https://www.nytimes.com/2025/10/18/world/europe/ukraine-trump-talks.html",
    "summary": "President Trump backed off selling Tomahawk missiles to Kyiv, opting instead for talks with Russia. Still, Ukraine’s negotiating position has strengthened since the summer."
  },
  {
    "title": "Relief and Grief: What Jewish New Yorkers Feel After the Hostage Release",
    "link": "https://www.nytimes.com/2025/10/18/nyregion/israel-gaza-ceasefire-jewish-new-yorkers.html",
    "summary": "Two years of the war in Gaza have left many Jews in the city changed. Some have become newly politicized."
  },
  {
    "title": "Jeffrey Epstein’s Angry Emails to Billionaire Leon Black",
    "link": "https://www.nytimes.com/2025/10/18/business/jeffrey-epstein-leon-black.html",
    "summary": "New emails show how Mr. Epstein pressured Leon Black, his longtime friend and patron, to fork over millions for financial services."
  },
  {
    "title": "CHICAGO",
    "link": "https://www.nytimes.com/2025/10/18/arts/design/obama-presidential-center-chicago.html",
    "summary": "A look inside Barack Obama’s “living, breathing cultural and gathering space” (with an N.B.A.-size basketball court). Not everyone is cheering."
  },
  {
    "title": "The Spritzes and Carbonaras That Ate Italy",
    "link": "https://www.nytimes.com/2025/10/18/world/europe/italy-tourism-restaurants.html",
    "summary": "Tourism has turned some Italian streets into monochromatic eating zones. Some officials have banned the opening of new restaurants."
  },
  {
    "title": "Fraidy-Cat at the Pentagon",
    "link": "https://www.nytimes.com/2025/10/18/opinion/pentagon-journalists-news-hegseth.html",
    "summary": "Pete Hegseth can’t handle the truth."
  },
  {
    "title": "How Southern Politics Shaped Trumpism",
    "link": "https://www.nytimes.com/2025/10/18/opinion/trump-north-south-politics.html",
    "summary": "Three Southern Opinion columnists on the region and its outsize role in national politics."
  },
  {
    "title": "Down Time",
    "link": "https://www.nytimes.com/2025/10/18/briefing/down-time.html",
    "summary": "A lazy day during which we do absolutely nothing sounds heavenly, but how much unstructured time can we comfortably abide?"
  },
  {
    "title": "Are You a Young Employee Asked to Spend More Time in the Office?",
    "link": "https://www.nytimes.com/2025/10/16/business/rto-young-worker-attitude.html",
    "summary": "Please tell us how stricter return-to-office mandates are affecting your work life and home life."
  },
  {
    "title": "Vermont Legislator Resigns Over Racist Texts in Republican Group Chat",
    "link": "https://www.nytimes.com/2025/10/17/us/politics/samuel-douglass-resigns-vermont-young-republicans.html",
    "summary": "The G.O.P. officials who participated in a group text chat have faced calls to step down. State Senator Samuel Douglass was the group’s only elected member."
  },
  {
    "title": "Camp Mystic Security Guard Saved Dozens Amid Deadly Flooding",
    "link": "https://www.nytimes.com/2025/10/18/us/camp-mystic-flooding-texas-security-guard.html",
    "summary": "In interviews with The New York Times, the guard, Glenn Juenke, offered the most detailed firsthand account yet of what staff members did as floodwaters rose at the Texas camp in July."
  },
  {
    "title": "Police Break Up Lego Theft Ring, Recovering Hundreds of Beheaded Figurines",
    "link": "https://www.nytimes.com/2025/10/18/us/lego-theft-california-arrest.html",
    "summary": "Officials said they had discovered tens of thousands of Lego pieces at a California home and arrested a man who trafficked in the stolen collectibles."
  }
]