[
  {
    "title": "Here’s a Look at Everything (and Everyone) Trump Assailed at Davos",
    "link": "https://www.nytimes.com/2026/01/21/us/politics/trump-davos-speech-takeaways.html",
    "summary": "President Trump’s verbal broadsides drew gasps and nervous laughter at the annual gathering of political and business leaders."
  },
  {
    "title": "What’s a Human Life Worth? The E.P.A. Says Zero Dollars.",
    "link": "https://www.nytimes.com/2026/01/21/climate/epa-human-life-value.html",
    "summary": "The Environmental Protection Agency has stopped estimating the dollar value of lives saved in the cost-benefit analyses for new pollution rules."
  },
  {
    "title": "Investigations and a Billion-Dollar ‘Shakedown’: How Trump Targeted Higher Education",
    "link": "https://www.nytimes.com/2026/01/21/us/politics/trump-higher-education-2025.html",
    "summary": "Donald J. Trump has unleashed the power of the presidency against American colleges, with mixed results."
  },
  {
    "title": "Halligan Leaves as U.S. Attorney After Mounting Pressure From Judges",
    "link": "https://www.nytimes.com/2026/01/20/us/politics/virginia-us-attorney-halligan.html",
    "summary": "For weeks, judges have pressed Ms. Halligan to explain why she continues to identify herself in court filings as the U.S. attorney, despite a ruling in November that she was unlawfully appointed to the job."
  },
  {
    "title": "Court Denies Lawmakers Seeking Independent Monitor of Epstein Files",
    "link": "https://www.nytimes.com/2026/01/21/nyregion/epstein-independent-monitor.html",
    "summary": "A federal judge said he did not have the authority to supervise the Justice Department’s release of the documents."
  },
  {
    "title": "Widespread Winter Storm Is Forecast to Bring Heavy Snow to Central and Eastern US",
    "link": "https://www.nytimes.com/2026/01/21/weather/winter-storm-ice-snow-forecast.html",
    "summary": "People across a large section of the central and eastern United States are facing predictions of heavy snow and ice starting Friday."
  },
  {
    "title": "Trump Administration Starts Immigration Operation in Maine",
    "link": "https://www.nytimes.com/2026/01/21/us/politics/maine-somali-immigration-enforcement.html",
    "summary": "A similar operation that unfolded in Minnesota became a flashpoint between protesters and immigration authorities."
  },
  {
    "title": "Cubans in Florida Are Being Deported in Record Numbers",
    "link": "https://www.nytimes.com/2026/01/19/us/politics/cubans-florida-deportations-trump.html",
    "summary": "Cubans had long benefited from legal privileges unavailable to immigrants from other countries. President Trump has changed that."
  },
  {
    "title": "New York’s Odd Couple: The Mayor and the Police Commissioner",
    "link": "https://www.nytimes.com/2026/01/21/nyregion/zohran-mamdani-jessica-tisch-nypd.html",
    "summary": "Zohran Mamdani and Jessica Tisch have little in common. But both of their political futures hinge on the safety of the city."
  },
  {
    "title": "Majority of Latin Americans Endorsed Trump’s Intervention In Venezuela, Polls Show",
    "link": "https://www.nytimes.com/2026/01/21/world/americas/latin-america-venezuela-us-raid-maduro-polls.html",
    "summary": "Several surveys show that a majority of Latin Americans who were questioned endorsed the intervention, suggesting a shift, at least for now, from ideology to pragmatism."
  },
  {
    "title": "After Maduro’s Last Dance, a New Rhythm Goes Viral in Venezuela",
    "link": "https://www.nytimes.com/2026/01/21/world/americas/maduro-venezuela-dancing-tiktok.html",
    "summary": "For years, Nicolás Maduro and his movement used song and dance to rally support. Now, millions of Venezuelans are dancing to a different political tune."
  },
  {
    "title": "Uber Faces Growing Pressure Over Sexual Assault Record",
    "link": "https://www.nytimes.com/2026/01/21/business/uber-scrutiny-sexual-assault.html",
    "summary": "From the ballot box in California to the halls of Congress and Wall Street, several new initiatives would require more oversight of how the company protects its passengers."
  },
  {
    "title": "How ‘Wine Moms’ Became an Insult for Anti-ICE Protesters",
    "link": "https://www.nytimes.com/2026/01/21/dining/drinks/wine-moms-ice-protests.html",
    "summary": "The insult wielded against protesters taps into a long tradition of casting wine drinkers as out-of-touch elitists."
  },
  {
    "title": "What ‘Marty Supreme’ Says About Being Jewish in America",
    "link": "https://www.nytimes.com/2026/01/21/movies/marty-supreme-jewish-america.html",
    "summary": "The film’s unapologetic depiction of the experience in all of its complications rejects the idea that such characters have to suffer."
  },
  {
    "title": "What to Know About Brooklyn Beckham’s Accusations Against His Parents",
    "link": "https://www.nytimes.com/2026/01/20/style/brooklyn-beckham-parents-wedding.html",
    "summary": "On Monday, the eldest Beckham son posted one-sided explosive accusations against his parents on Instagram. His parents have not responded directly."
  },
  {
    "title": "Europe Has a Bazooka. Time to Use It.",
    "link": "https://www.nytimes.com/2026/01/21/opinion/europe-independence-trump-greenland.html",
    "summary": "For now, Europe’s anti-coercion instrument is less a bazooka than a waterlogged firecracker."
  },
  {
    "title": "Trump’s ‘Dear Jonas’ Letter Is No Prize",
    "link": "https://www.nytimes.com/2026/01/21/opinion/trump-norway-letter.html",
    "summary": "We have three years left with a mad king. It doesn’t feel sustainable."
  },
  {
    "title": "Trump 2.0",
    "link": "https://www.nytimes.com/2026/01/21/briefing/trump-first-year-back.html",
    "summary": "We look at the first year of the president’s second term."
  },
  {
    "title": "Mississippi Temple Says There Is More to Its Story Than Facing Hate",
    "link": "https://www.nytimes.com/2026/01/20/us/mississippi-beth-israel-temple-judaism.html",
    "summary": "An arson attack at a synagogue in Mississippi was a reminder of the threat Jews face, but also of the strength of a small community forged over generations."
  },
  {
    "title": "An Anxious Japan Restarts the World’s Biggest Nuclear Plant",
    "link": "https://www.nytimes.com/2026/01/21/business/japan-nuclear-restart.html",
    "summary": "Japan is reviving nuclear power, balancing the need for more clean energy against the lingering trauma of the 2011 Fukushima Daiichi disaster."
  },
  {
    "title": "Michele Tafoya Announces Senate Run in Minnesota",
    "link": "https://www.nytimes.com/2026/01/21/us/politics/michele-tafoya-senate-minnesota.html",
    "summary": "Ms. Tafoya, once a sideline reporter for N.F.L. games, has more recently turned her focus to Republican politics. She is seeking an open seat now held by a Democrat."
  },
  {
    "title": "Prince Harry Gives Emotional Testimony About Effects of News Coverage",
    "link": "https://www.nytimes.com/2026/01/21/world/europe/prince-harry-emotional-court-daily-mail.html",
    "summary": "Harry said in court that reading articles about him published by Associated Newspapers, which he has accused of acting unlawfully, had been “traumatic.”"
  }
]