[
  {
    "title": "Trump’s New Strategy on Epstein Fallout: Blame the Democrats",
    "link": "https://www.nytimes.com/2025/07/16/us/politics/trump-epstein-attacks-supporters.html",
    "summary": "President Trump said the outrage among his supporters over the Epstein case was just the latest “scam” cooked up by Democrats."
  },
  {
    "title": "Maurene Comey, Prosecutor of Jeffrey Epstein, Is Fired",
    "link": "https://www.nytimes.com/2025/07/16/nyregion/maurene-comey-prosecutor-fired-jeffrey-epstein.html",
    "summary": "Maurene Comey, who is the daughter of the former F.B.I. director James Comey, worked on the criminal cases against Jeffrey Epstein and his associate Ghislaine Maxwell."
  },
  {
    "title": "Rum, Fisheries and a Sculpture Garden: The Quiet Winners in Trump’s Big Bill",
    "link": "https://www.nytimes.com/2025/07/16/us/politics/winners-in-trumps-policy-bill.html",
    "summary": "The president’s marquee policy legislation is best known for slashing taxes and cutting social safety net programs. But the sweeping measure also included many little-noticed goodies and add-ons."
  },
  {
    "title": "Vance Tries to Sell the Benefits of Trump’s Megabill but Ignores the Costs",
    "link": "https://www.nytimes.com/2025/07/16/us/politics/vance-trump-pennsylvania-legislation.html",
    "summary": "In a visit to Pennsylvania, Vice President JD Vance stressed tax cuts and savings accounts for newborns, with no mention of trims to Medicaid and nutritional assistance programs many Trump voters rely on."
  },
  {
    "title": "Trump Has Penned Letter To Fire Fed Chair Jerome Powell",
    "link": "https://www.nytimes.com/2025/07/16/us/politics/trump-powell-firing-letter.html",
    "summary": "The president waved a copy of a draft letter firing Jerome H. Powell at a meeting in the Oval Office with House Republicans. It remains to be seen whether he follows through with his threat."
  },
  {
    "title": "Can Trump Fire Powell? He Likely Lacks Case to Remove Fed Chair, Experts Say.",
    "link": "https://www.nytimes.com/2025/07/16/us/politics/trump-powell-fed-renovations.html",
    "summary": "The Trump administration is toying with removing Jerome H. Powell as chair of the Federal Reserve, accusing him of mismanaging a multibillion-dollar update to its Washington headquarters."
  },
  {
    "title": "Trump’s National Guard Troops Are Questioning Their Mission in L.A.",
    "link": "https://www.nytimes.com/2025/07/16/us/trump-national-guard-california.html",
    "summary": "Thousands of National Guard members have served in the L.A. region since last month. Six soldiers spoke in interviews about low morale over the deployment."
  },
  {
    "title": "Documenting L.A.’s Surge in Immigration Arrests",
    "link": "https://www.nytimes.com/video/us/politics/100000010259953/documenting-las-surge-in-immigration-arrests.html",
    "summary": "Jennifer Medina, a political reporter at The New York Times who is based in Los Angeles, speaks with a witness who recorded an immigration raid near a Home Depot."
  },
  {
    "title": "Eswatini Says It Will Repatriate Migrants Deported by the Trump Administration",
    "link": "https://www.nytimes.com/2025/07/16/world/africa/eswatini-trump-migrants-deportation.html",
    "summary": "The Trump administration sent five deportees to Eswatini, an African kingdom, saying that their own countries would not take them. But Eswatini says it will send them home."
  },
  {
    "title": "Lawyers for Kilmar Abrego Garcia Question Evidence in Criminal Case",
    "link": "https://www.nytimes.com/2025/07/16/us/politics/kilmar-abrego-garcia-trump-deportations.html",
    "summary": "The exchanges unfolded at a hearing in Federal District Court in Nashville intended to determine whether Kilmar Armando Abrego Garcia should be freed from criminal custody as he awaits trial."
  },
  {
    "title": "Immigrants File Class-Action Lawsuit to Stop ICE Courthouse Arrests",
    "link": "https://www.nytimes.com/2025/07/16/nyregion/trump-ice-arrests-lawsuit-immigrants.html",
    "summary": "The detentions have become a relatively easy way for Immigration and Customs Enforcement agents to detain immigrants who are appearing for court dates."
  },
  {
    "title": "‘Who Killed Love?’ A Video Game Plays to Male Resentment in China.",
    "link": "https://www.nytimes.com/2025/07/17/business/china-video-games-women.html",
    "summary": "A popular and contentious game, Revenge on Gold Diggers, sheds light on misogyny, inequality and the feeling among many men that they are economic victims."
  },
  {
    "title": "Adams Eclipses Mamdani in Recent Fund-Raising, as Cuomo Lags Behind",
    "link": "https://www.nytimes.com/2025/07/16/nyregion/mamdani-adams-donors-money.html",
    "summary": "Mayor Eric Adams reported raising $1.5 million over the last month, but his inability to qualify for matching funds may hamper his re-election bid."
  },
  {
    "title": "N.Y.C. Panel Withdraws Proposal to Switch to Open Primaries",
    "link": "https://www.nytimes.com/2025/07/16/nyregion/new-york-open-primary-elections.html",
    "summary": "The panel, created by Mayor Eric Adams, said it would introduce other ballot initiatives, but not a proposal that would allow all voters to participate in primaries regardless of party."
  },
  {
    "title": "Germany’s Merz and UK’s Starmer Meet to Cement Ties as U.S. Steps Back",
    "link": "https://www.nytimes.com/2025/07/17/world/europe/germany-uk-merz-starmer-meeting.html",
    "summary": "Chancellor Friedrich Merz’s trip to London on Thursday is the latest sign of a new world order, in which European nations are uniting amid growing instability."
  },
  {
    "title": "K-Beauty Fans Stock up on Cosmetics After Trump’s Tariff Threat",
    "link": "https://www.nytimes.com/2025/07/17/world/asia/kbeauty-korea-skincare-trump-tariffs.html",
    "summary": "American consumers of Korean cosmetics and skin-care products are bulk buying, as President Trump threatens 25 percent tariffs on imports."
  },
  {
    "title": "Trump Has Promised More Tariffs on Mexico. What Happens Next?",
    "link": "https://www.nytimes.com/2025/07/16/world/americas/trump-tariffs-mexico-cartels.html",
    "summary": "President Trump has threatened to increase Mexico’s tariff rate to 30 percent starting Aug. 1, claiming the country hasn’t sufficiently tackled drug cartels."
  },
  {
    "title": "Carney Moves to Reduce Canada’s Chinese Steel Imports in Response to Trump’s Tariffs",
    "link": "https://www.nytimes.com/2025/07/16/world/canada/carney-trump-us-canada-steel-tariffs.html",
    "summary": "Canada’s steel industry fears that Chinese steel facing steep tariffs in the United States will be sent north and overwhelm the Canadian market."
  },
  {
    "title": "The Grand Canyon Fire Has North Rim Residents Wary of the Future",
    "link": "https://www.nytimes.com/2025/07/16/us/politics/grand-canyon-fire-north-rim-arizona.html",
    "summary": "Fire crews allowed a fire to burn through brush on the Grand Canyon’s North Rim. Then they lost control."
  },
  {
    "title": "Paulette Jiles, 82, Dies; Novelist Evoked the West in ‘News of the World’",
    "link": "https://www.nytimes.com/2025/07/16/books/paulette-jiles-dead.html",
    "summary": "A poet and memoirist as well, she drew a wide readership with her historical fiction, notably with a post-Civil War tale that was adapted for a movie starring Tom Hanks."
  },
  {
    "title": "Trump Is Doing Something No One Wants",
    "link": "https://www.nytimes.com/2025/07/17/opinion/trump-lula-brazil-brics.html",
    "summary": "In his commitment to domination, he is missing an opportunity to shape a new multipolar order that protects America’s interests."
  },
  {
    "title": "The Epstein Story Is Both Conspiracy Theory and Genuine Scandal",
    "link": "https://www.nytimes.com/2025/07/16/opinion/epstein-trump-scandal.html",
    "summary": "More than a client list, MAGA is looking for meaning."
  },
  {
    "title": "Canadian Retailer Couche-Tard Abandons Its $47 Billion Bid to Buy 7-Eleven",
    "link": "https://www.nytimes.com/2025/07/16/business/7-eleven-japan-couche-tard.html",
    "summary": "Alimentation Couche-Tard’s $47 billion bid spurred changes at the chain’s Japanese owner. Now, the question is whether that momentum will carry forward."
  },
  {
    "title": "China’s Aircraft Carriers Push Into Waters Long Dominated by U.S.",
    "link": "https://www.nytimes.com/2025/07/17/world/asia/china-carriers-us-japan.html",
    "summary": "Recent drills near Japan reflect China’s ambitions to extend its navy’s reach and exert greater influence, in the Pacific and beyond."
  },
  {
    "title": "Lightning Kills 1 and Injures 13 on Archery Range in New Jersey",
    "link": "https://www.nytimes.com/2025/07/16/us/lightning-strike-new-jersey.html",
    "summary": "The victims range in age from 7 to 61, according to the authorities."
  },
  {
    "title": "Trump Says Coca-Cola Agreed to Use Cane Sugar in Coke Made in U.S.",
    "link": "https://www.nytimes.com/2025/07/16/us/politics/trump-coca-cola-cane-sugar.html",
    "summary": "The company began using corn syrup in Coke in 1980, blending it with sugar to help defray the cost of rising sugar prices."
  }
]