[
  {
    "title": "Trump Tells Bondi to Seek Release of Epstein Grand Jury Testimony",
    "link": "https://www.nytimes.com/2025/07/17/us/politics/trump-epstein-bondi-grand-jury-testimony.html",
    "summary": "The attorney general plans to ask a court to release the papers. But even if the request succeeds, it would fall far short of critics’ demands to release all investigative materials."
  },
  {
    "title": "House Republicans Dangle Possible Vote on Epstein Files, After Voter Backlash",
    "link": "https://www.nytimes.com/2025/07/17/us/politics/epstein-files-house-republicans-vote.html",
    "summary": "The House Rules Committee laid the groundwork for an eventual vote to call for release of the Epstein files, reflecting Republican uneasiness with the president’s refusal to divulge information from the investigation."
  },
  {
    "title": "A Timeline of What We Know About Trump and Epstein",
    "link": "https://www.nytimes.com/2025/07/17/us/politics/timeline-trump-epstein.html",
    "summary": "Donald Trump was friendly for at least 15 years with Jeffrey Epstein, the multimillionaire financier and convicted sex offender who died in prison in 2019."
  },
  {
    "title": "Trump’s New Order on Epstein Files, and Colbert’s Canceled ‘Late Show’",
    "link": "https://www.nytimes.com/2025/07/18/podcasts/the-headlines/trump-epstein-files-colbert-late-show-cancelled.html",
    "summary": "Plus, your Friday news quiz."
  },
  {
    "title": "NPR and PBS Funding Cuts Were Decades in the Making",
    "link": "https://www.nytimes.com/2025/07/18/business/media/npr-pbs-funding-cuts-republicans.html",
    "summary": "The cuts speak to President Trump’s grip on his party but also to the sweeping changes in media."
  },
  {
    "title": "The Impact of Defunding NPR and PBS",
    "link": "https://www.nytimes.com/video/us/politics/100000010286088/the-impact-of-defunding-npr-and-pbs.html",
    "summary": "Congress just voted to claw back $500 million in funding for public broadcasting. Benjamin Mullin, a media reporter for The New York Times, explains what will happen now to NPR, PBS and the many local stations that rely on the funding."
  },
  {
    "title": "Congress Approves Trump Clawback of Foreign Aid and Funds for NPR and PBS Stations",
    "link": "https://www.nytimes.com/2025/07/17/us/politics/senate-vote-trump-bill-pbs-npr-foreign-aid.html",
    "summary": "President Trump’s request to claw back $9 billion in congressionally approved spending passed despite objections from Republicans who said it abdicated the legislative branch’s power of the purse."
  },
  {
    "title": "As Harvard and Trump Head to Court, the Government Piles on the Pressure",
    "link": "https://www.nytimes.com/2025/07/18/us/harvard-trump-head-to-trial.html",
    "summary": "President Trump suggested a deal was coming, but officials are still demanding more from Harvard, including extensive information about international students, staff payroll and protests."
  },
  {
    "title": "Trump-Driven Chaos Comes to U.S. Attorney’s Offices in Waves",
    "link": "https://www.nytimes.com/2025/07/18/nyregion/new-york-area-us-attorneys-chaos.html",
    "summary": "In Manhattan, Brooklyn, Albany and Newark, confusion has reigned as prosecutors are fired or walk out, and U.S. attorneys serve in limbo while awaiting confirmation."
  },
  {
    "title": "Truemed, a Start-Up Run by an RFK. Jr. Aide, Gives Tax Breaks for Meat and Mattresses",
    "link": "https://www.nytimes.com/2025/07/18/business/truemed-fsa-hsa-calley-means-maha.html",
    "summary": "The start-up, called Truemed, helps people buy meat and mattresses with money that isn’t subject to federal income tax. But does the tax break apply?"
  },
  {
    "title": "UK, France and Germany Plan for a Post-U.S. Future",
    "link": "https://www.nytimes.com/2025/07/18/world/europe/macron-starmer-merz-trump-eu.html",
    "summary": "The leaders of France, Germany and Britain are building parallel diplomatic institutions to defend Europe as President Trump retreats from the continent."
  },
  {
    "title": "‘Late Show With Stephen Colbert’ Is Being Canceled by CBS",
    "link": "https://www.nytimes.com/2025/07/17/business/stephen-colbert-late-show-ending.html",
    "summary": "The show will end in May, the network said, calling it “a purely financial decision.”"
  },
  {
    "title": "Fans React to Colbert ‘Late Show’ Cancellation With Puzzlement and Anger",
    "link": "https://www.nytimes.com/2025/07/17/arts/television/stephen-colbert-late-show-fans.html",
    "summary": "Many questioned the timing of and motivation for the announcement, noting that Mr. Colbert hosted the most-watched show in late night television."
  },
  {
    "title": "Stephen Colbert Laments the End of ‘The Late Show’ on CBS",
    "link": "https://www.nytimes.com/2025/07/18/arts/television/stephen-colbert-late-show-ending.html",
    "summary": "CBS “will be ending ‘The Late Show’ in May,” Colbert told his audience on Thursday. He kept the announcement brief and light."
  },
  {
    "title": "Heath Insurers Are Denying More Drug Claims, Data Shows",
    "link": "https://www.nytimes.com/2025/07/18/health/health-insurance-prescription-claim-denials.html",
    "summary": "Offering a rare glimpse inside the hidden world of rejected insurance claims, new data shows a steady uptick among major private insurers."
  },
  {
    "title": "Debate Ignites at U.S. School Over Netanyahu’s Hall of Fame Status",
    "link": "https://www.nytimes.com/2025/07/18/us/politics/netanyahu-alma-mater-cheltenham.html",
    "summary": "Recent comments by the Israeli prime minister and a Fox News commentator about Cheltenham High School, their alma mater in suburban Philadelphia, have inflamed a debate."
  },
  {
    "title": "Who Are the Druse: The Religious Minority at the Center of Israel and Syria’s Tensions",
    "link": "https://www.nytimes.com/2025/07/18/world/middleeast/who-are-druse-syria-israel-clashes.html",
    "summary": "Spread across Syria, Lebanon and Israel, the secretive religious minority has long balanced integration and independence. Now, members are at the heart of the region’s shifting power struggles."
  },
  {
    "title": "Before Trump, Indonesia Had Another Trade Headache: China",
    "link": "https://www.nytimes.com/2025/07/18/business/indonesia-china-trade.html",
    "summary": "Long before President Trump wielded tariffs as a weapon to punish Indonesia, the country was fighting back a flood of cheap Chinese goods."
  },
  {
    "title": "One of These BRICS Is Not Like the Others",
    "link": "https://www.nytimes.com/2025/07/18/business/trump-brics-india.html",
    "summary": "President Trump’s attacks on the group of emerging economies, which includes Brazil, Russia and China, have put one member — India — in an uncomfortable spot."
  },
  {
    "title": "Tariffs on Russia Could Hurt Wary U.S. Farmers",
    "link": "https://www.nytimes.com/2025/07/18/business/tariffs-on-russia-could-hurt-wary-us-farmers.html",
    "summary": "President Trump’s plan to impose a 100 percent tariff on Russian goods could raise the cost of urea, a key fertilizer in corn and other row crops."
  },
  {
    "title": "Only 5 Fingers Playing Piano, but the Sound of So Many Hands",
    "link": "https://www.nytimes.com/2025/07/18/arts/music/nicholas-mccarthy-piano.html",
    "summary": "Nicholas McCarthy overcame rejection to make a professional career playing the surprisingly vast repertoire for left-hand piano."
  },
  {
    "title": "‘Democrats Don’t Need to Become G.O.P. Lite’",
    "link": "https://www.nytimes.com/2025/07/18/opinion/democrats-politics-trump-abundance.html",
    "summary": "The party is getting pummeled. But it can fight back."
  },
  {
    "title": "Why Trump Can’t Shake Jeffrey Epstein",
    "link": "https://www.nytimes.com/2025/07/17/opinion/ezra-klein-podcast-will-sommer.html",
    "summary": "The journalist Will Sommer examines the perfect storm of the Epstein files, Trump, QAnon and MAGA."
  },
  {
    "title": "Should Teens Vote?",
    "link": "https://www.nytimes.com/2025/07/18/briefing/should-teens-vote.html",
    "summary": "We examine the voting age around the world."
  },
  {
    "title": "Floods and Heavy Rain Kill Dozens in Pakistan",
    "link": "https://www.nytimes.com/2025/07/18/world/asia/pakistan-rains-flood-deaths.html",
    "summary": "Relentless rain began on Wednesday, causing flooding in several cities and across vast rural stretches in the province of Punjab."
  },
  {
    "title": "Chevron Wins Green Light to Buy Into One of World’s Hottest Oil Projects",
    "link": "https://www.nytimes.com/2025/07/18/business/energy-environment/exxon-chevron-hess-guyana.html",
    "summary": "An arbitrator cleared the way for Chevron to buy Hess, allowing the energy giant to acquire a piece of one of the most promising oil projects in the world."
  },
  {
    "title": "Army Special Operations Warns Retired Members of Terror Threat",
    "link": "https://www.nytimes.com/2025/07/17/us/politics/army-special-operations-terror-threat.html",
    "summary": "The alert, issued to retired service members who served in Iraq or Syria and live in Florida, did not specify what kind of threat or which terrorist group was involved."
  },
  {
    "title": "What to Know About the TSA’s Possible End to Its Liquid Size Limits",
    "link": "https://www.nytimes.com/2025/07/17/travel/tsa-liquids-sizes.html",
    "summary": "Kristi Noem, the homeland security secretary, has said that the next major airport security screening announcement could target limits on liquids. How likely is that?"
  }
]