[
  {
    "title": "Senate Passes Bill to Reopen Government Amid Democratic Rift",
    "link": "https://www.nytimes.com/2025/11/10/us/politics/senate-government-shutdown.html",
    "summary": "The vote, on Day 41 of the shutdown, signaled an end in sight to weeks of gridlock. Eight members of the Democratic Caucus supplied the critical backing."
  },
  {
    "title": "For Trump, Nothing Was Off Limits During the Shutdown",
    "link": "https://www.nytimes.com/2025/11/10/us/politics/trump-government-shutdown.html",
    "summary": "President Trump pressured Democrats by taking punishing actions no previous administration ever took during a shutdown."
  },
  {
    "title": "Shutdown Deal Revives Democratic Infighting",
    "link": "https://www.nytimes.com/2025/11/10/us/politics/shutdown-deal-revives-democratic-infighting.html",
    "summary": "The agreement prompted a backlash within the party, not only against the Democratic defectors who supported it, but against Senator Chuck Schumer, the leader who did not."
  },
  {
    "title": "Democrats Denounce Shutdown Vote, and Trump Issues Flurry of Pardons",
    "link": "https://www.nytimes.com/2025/11/11/podcasts/the-headlines/democrats-shutdown-vote-trump-pardons.html",
    "summary": "Plus, a new gambling scandal in pro sports."
  },
  {
    "title": "As Iraqis Vote for a Parliament, U.S. Presses to Rid Country of Iran’s Influence",
    "link": "https://www.nytimes.com/2025/11/11/world/middleeast/iraq-parliamentary-election-vote.html",
    "summary": "After a U.S. occupation, years of sectarian violence and a jihadist insurgency, Iraq has become an improbable haven of calm in the Middle East."
  },
  {
    "title": "Iraqis Are Voting for a New Parliament. Here’s What to Know.",
    "link": "https://www.nytimes.com/2025/11/11/world/middleeast/iraq-election-what-to-know.html",
    "summary": "Iraq is caught in the conflict between Washington and Tehran, with the Trump administration insisting that the next government disarm powerful Iran-backed militias."
  },
  {
    "title": "‘It Feels Like I’m in a Nightmare’: Inside the First Deportation Flight to Iran",
    "link": "https://www.nytimes.com/2025/11/11/world/middleeast/iran-trump-deportation-flight.html",
    "summary": "For decades, Iranians fleeing persecution have found protection in the United States. But this fall, the Trump administration deported a planeload of people to Iran after making a deal with Tehran."
  },
  {
    "title": "Trump Pardons the Husband of a Republican Congressional Ally",
    "link": "https://www.nytimes.com/2025/11/10/us/politics/trump-pardon-republican-harshbarger.html",
    "summary": "Robert Harshbarger Jr. pleaded guilty in 2013 to health care fraud and distributing a misbranded drug. His wife, Diana Harshbarger, is a member of Congress."
  },
  {
    "title": "Trump Asks Supreme Court to Overturn Verdict in E. Jean Carroll Case",
    "link": "https://www.nytimes.com/2025/11/10/us/politics/trump-supreme-court-e-jean-carroll.html",
    "summary": "The president said the assertions behind a judgment that he sexually abused and defamed the writer were “implausible” and “unsubstantiated.”"
  },
  {
    "title": "The NYC Demographic Trends That Shaped Mamdani’s Win",
    "link": "https://www.nytimes.com/2025/11/11/us/mamdani-nyc-voters-election-demographics.html",
    "summary": "Moderate Black voters and young progressives favored Zohran Mamdani for mayor, while Andrew Cuomo won many wealthy New Yorkers and those who voted for Donald Trump."
  },
  {
    "title": "How Did Mamdani Reach Young Male Voters? Podcasts and YouTube Shows.",
    "link": "https://www.nytimes.com/2025/11/10/style/zohran-mamdani-podcasts-manosphere.html",
    "summary": "Zohran Mamdani navigated a media landscape similar to the one that helped Trump win over young men."
  },
  {
    "title": "Chi Ossé Plans to Challenge Jeffries, Despite Mamdani’s Opposition",
    "link": "https://www.nytimes.com/2025/11/10/nyregion/chi-osse-hakeem-jeffries.html",
    "summary": "Chi Ossé, a New York City councilman, has told allies he is preparing to challenge Representative Hakeem Jeffries, the Democratic leader of the House."
  },
  {
    "title": "Sarah Jessica Parker Describes Her Year as a Booker Prize Judge",
    "link": "https://www.nytimes.com/2025/11/11/books/sarah-jessica-parker-booker-prize.html",
    "summary": "The actor had to read so many books (153) she bowed out of most family activities. Still, she said, collaborating to pick a winner was worth the sacrifice."
  },
  {
    "title": "2025 Booker Prize Goes to David Szalay’s ‘Flesh’",
    "link": "https://www.nytimes.com/2025/11/10/books/booker-prize-2025-david-szalay-flesh.html",
    "summary": "The rags-to-riches tale had already made fans of Zadie Smith and Dua Lipa. Roddy Doyle, who chaired the judging panel, called the book “singular” and “extraordinary.”"
  },
  {
    "title": "The Young Women Grappling With an ‘Old Man’s Disease’",
    "link": "https://www.nytimes.com/2025/11/11/health/als-young-women.html",
    "summary": "Diagnosed with A.L.S., they traded stories, drank tequila and made grim jokes at a unique annual gathering on Cape Cod."
  },
  {
    "title": "The Volunteer Buglers Giving 24-Note Salutes",
    "link": "https://www.nytimes.com/2025/11/11/arts/music/taps-veterans-military-buglers.html",
    "summary": "Thousands of musicians — civilians, veterans, teenagers, retirees — are playing taps at military funerals in a rebuke of technology."
  },
  {
    "title": "Book Review: ‘Unfettered,’ by John Fetterman",
    "link": "https://www.nytimes.com/2025/11/11/books/review/unfettered-john-fetterman.html",
    "summary": "The senator from Pennsylvania chronicles his stroke, unlikely election victory and battle with depression. Just don’t expect him to try to win you over."
  },
  {
    "title": "How Do You Judge Whether a Police Officer Is Mentally Fit for the Job?",
    "link": "https://www.nytimes.com/2025/11/11/nyregion/nypd-psych-exams.html",
    "summary": "The New York Police Department has tried to fire 30 officers who failed a psychological exam or a background check. Some say the test is the problem."
  },
  {
    "title": "Hollywood’s Commercial Production Crews Are Losing a Lot of Work",
    "link": "https://www.nytimes.com/2025/11/11/business/media/holes-grow-in-hollywoods-safety-net-when-it-is-needed-most.html",
    "summary": "Commercial production has long been crucial to sustaining entertainment workers in the Los Angeles area. But it continues to plummet."
  },
  {
    "title": "Tatsuya Nakadai, Japanese Star Known for ‘Ran’ and Other Classics, Dies at 92",
    "link": "https://www.nytimes.com/2025/11/11/movies/tatsuya-nakadai-dead.html",
    "summary": "He was a fixture of postwar Japanese cinema and starred in films by Akira Kurosawa and other directors of that era."
  },
  {
    "title": "Use A.I. to Reinvigorate Democracy — Not Replace It",
    "link": "https://www.nytimes.com/2025/11/11/opinion/ai-democracy-government-authoritarianism.html",
    "summary": "Governments shouldn’t hand over decision-making to A.I."
  },
  {
    "title": "On Veterans Day, This Is the Lonely, Terrible Sorrow We Must Never Forget",
    "link": "https://www.nytimes.com/2025/11/11/opinion/veterans-day-world-war-ii.html",
    "summary": "To imagine the cost of an “America First” policy, walk through World War II cemeteries in Europe."
  },
  {
    "title": "Late Night Is Disappointed in Democrats Over Shutdown Deal",
    "link": "https://www.nytimes.com/2025/11/11/arts/television/late-night-democrats-government-shutdown.html",
    "summary": "“Our long national nightmare is different,” Stephen Colbert said after some Democratic senators voted with Republicans to end the government shutdown."
  },
  {
    "title": "Modi Vows Justice as Police Suspect Terrorism in Deadly New Delhi Blast",
    "link": "https://www.nytimes.com/2025/11/11/world/asia/india-delhi-explosion-terror.html",
    "summary": "Those responsible for the explosion “will not be spared,” Prime Minister Narendra Modi of India said. The blast killed at least eight people near a subway station at evening rush hour."
  },
  {
    "title": "Explosion in Pakistan’s Capital Kills at Least 12",
    "link": "https://www.nytimes.com/2025/11/11/world/africa/pakistan-explosion-islamabad.html",
    "summary": "A military official accused the Pakistani Taliban of staging the attack, which took place near a courthouse in Islamabad."
  },
  {
    "title": "Mobile Lounge Crashes at Dulles Airport, Causing Injuries and Damage",
    "link": "https://www.nytimes.com/2025/11/10/us/dulles-airport-crash-mobile-lounge.html",
    "summary": "More than a dozen people were hospitalized after a bus-like vehicle for passengers crashed into a dock at the Washington airport."
  },
  {
    "title": "Families of Children Killed in Texas Floods Sue Camp Mystic, Claiming Gross Negligence",
    "link": "https://www.nytimes.com/2025/11/10/us/camp-mystic-lawsuit.html",
    "summary": "Parents of campers and counselors who died in the July 4 Texas floods said the camp leadership did little before mounting “a hopeless ‘rescue’ effort from its self-created disaster.”"
  }
]