[
  {
    "title": "After ‘Productive’ Call, Trump Plans Another Meeting With Putin",
    "link": "https://www.nytimes.com/2025/10/16/us/politics/trump-putin-cease-fire-ukraine.html",
    "summary": "President Trump has come close to imposing penalties on Russia several times, only to backtrack after talking with President Vladimir Putin and raising hopes for a diplomatic solution to the war."
  },
  {
    "title": "Meet the Designer Who Got Zelensky Into a Suit",
    "link": "https://www.nytimes.com/2025/10/17/world/europe/ukraine-zelensky-suit-fashion-designer.html",
    "summary": "Viktor Anisimov, one of Ukraine’s top fashion designers, first met Volodymyr Zelensky about 20 years ago, when the future president was a comedian. He didn’t want to wear a suit then either."
  },
  {
    "title": "What Are Tomahawk Missiles, and Why Might Trump Give Them to Ukraine?",
    "link": "https://www.nytimes.com/2025/10/15/us/politics/tomahawk-missiles-trump-ukraine.html",
    "summary": "Ukraine could receive a newly developed land-based launcher to strike Moscow and beyond."
  },
  {
    "title": "Trump’s 2-Hour Call with Putin, and Why Iran Is Pushing Gender Transition Surgeries",
    "link": "https://www.nytimes.com/2025/10/17/podcasts/the-headlines/trump-putin-iran-gender-transition-surgeries.html",
    "summary": "Plus, your Friday news quiz."
  },
  {
    "title": "7 Takeaways From the First N.Y.C. Mayoral Debate",
    "link": "https://www.nytimes.com/2025/10/16/nyregion/nyc-mayor-debate-mamdani-cuomo-takeaways.html",
    "summary": "Zohran Mamdani, Andrew Cuomo and Curtis Sliwa sparred over serious topics like the Israel-Hamas war and President Trump, and more curious subjects like parade attendance."
  },
  {
    "title": "The Top Zingers of the Mayoral Debate",
    "link": "https://www.nytimes.com/2025/10/16/nyregion/mamdani-cuomo-sliwa-debate.html",
    "summary": "The two-hour slugfest produced some memorable one-liners, on subjects ranging from the candidates’ parents to imaginary sports championships."
  },
  {
    "title": "Mayoral Candidates Spar Over Trump, Qualifications and the Q Train",
    "link": "https://www.nytimes.com/2025/10/17/nyregion/mayoral-debate-mamdani-cuomo-sliwa.html",
    "summary": "The first New York City mayoral debate among Andrew Cuomo, Zohran Mamdani and Curtis Sliwa covered a minefield of political issues, both global and hyperlocal."
  },
  {
    "title": "Fact-Checking the Debate",
    "link": "https://www.nytimes.com/live/2025/10/16/nyregion/nyc-mayor-debate-fact-check",
    "summary": "Zohran Mamdani, Andrew Cuomo and Curtis Sliwa traded barbs over the police, prostitution and President Trump."
  },
  {
    "title": "John Bolton Indicted Over Handling of Classified Information",
    "link": "https://www.nytimes.com/2025/10/16/us/politics/john-bolton-indictment-trump.html",
    "summary": "Mr. Bolton, a Trump aide turned critic, is part of a string of presidential foes to become prosecutorial targets. But his case gained momentum in the Biden administration."
  },
  {
    "title": "How the Bolton Indictment Compares to Trump’s Classified Documents Case",
    "link": "https://www.nytimes.com/2025/10/16/us/politics/trump-bolton-indictment-documents.html",
    "summary": "Some charges against the onetime national security adviser resemble the dropped case against President Trump, but there are also differences."
  },
  {
    "title": "After ‘Horrors,’ Israeli Hostages Taste Freedom and Savor Family Reunions",
    "link": "https://www.nytimes.com/2025/10/17/world/middleeast/israel-hostages-conditions-recovery.html",
    "summary": "Some former captives have been sent home from the hospital. But a doctor said they all had “endured untold adversity,” as details emerge of their time in Gaza’s tunnels."
  },
  {
    "title": "What’s Next for the Gaza Cease-Fire Plan",
    "link": "https://www.nytimes.com/video/world/middleeast/100000010458240/whats-next-for-the-gaza-cease-fire-plan.html",
    "summary": "Israel and Hamas have reached a cease-fire deal in Gaza, but the hard part starts now. David Sanger of The New York Times describes the major obstacles to further agreement about Gaza’s immediate future."
  },
  {
    "title": "Trump Warns Hamas of Strikes if Violence in Gaza Continues",
    "link": "https://www.nytimes.com/2025/10/16/us/politics/trump-hamas-warnings-gaza-strikes.html",
    "summary": "The president later clarified that the United States would not be involved in such an action."
  },
  {
    "title": "Where Does the Israel-Hamas Cease-Fire Stand?",
    "link": "https://www.nytimes.com/2025/10/16/world/middleeast/israel-hamas-gaza-cease-fire.html",
    "summary": "Unresolved issues — mainly over the exchange of the remains of hostages and prisoners — threaten to destabilize the fragile agreement."
  },
  {
    "title": "U.S. Says Louisiana Man Joined Hamas-Led 2023 Attack on Israel",
    "link": "https://www.nytimes.com/2025/10/17/us/fbi-hamas-attack-louisiana.html",
    "summary": "A man was in custody after federal prosecutors accused him of joining Gazan militants in attacking Israel on Oct. 7, 2023. He was also accused of lying to obtain a U.S. visa."
  },
  {
    "title": "Military Commander Overseeing Escalating Attacks Off Venezuela Coast Is Stepping Down, Officials Say",
    "link": "https://www.nytimes.com/2025/10/16/us/politics/southern-command-head-stepping-down.html",
    "summary": "Adm. Alvin Holsey is leaving less than a year into his tenure, and as the Pentagon escalates attacks against boats in the Caribbean Sea."
  },
  {
    "title": "Psychological Warfare in Venezuela",
    "link": "https://www.nytimes.com/2025/10/17/briefing/psychological-warfare-in-venezuela.html",
    "summary": "We examine the Trump administration’s tactics against Venezuela."
  },
  {
    "title": "Trump Refiles $15 Billion Lawsuit Against The New York Times",
    "link": "https://www.nytimes.com/2025/10/17/business/media/trump-lawsuit-new-york-times.html",
    "summary": "A federal judge had previously dismissed the complaint as unnecessarily lengthy and digressive. The president claims that The Times sought to defame him during the 2024 election."
  },
  {
    "title": "What We Know About the Latest ‘No Kings’ Protests Amid Government Shutdown",
    "link": "https://www.nytimes.com/2025/10/17/us/no-kings-protest.html",
    "summary": "The nationwide protests are playing out as a federal government shutdown lingers and troops are being deployed in cities."
  },
  {
    "title": "An Internet Shutdown Cuts Off Iranians From One Another, and the World",
    "link": "https://www.nytimes.com/2025/10/17/world/middleeast/iran-shutdown-restrictions.html",
    "summary": "Since its brief June war with Israel, Iran has throttled internet traffic and jammed GPS, making day-to-day tasks online almost impossible and prompting Iranians’ fears of greater surveillance."
  },
  {
    "title": "ICE Deported a Teen and Her Mother. Devastation Met Them in Guatemala.",
    "link": "https://www.nytimes.com/2025/10/17/us/ice-immigration-deportations.html",
    "summary": "ICE deported 17-year-old Nory Sontay Ramos and her mother. Devastation met them in Guatemala."
  },
  {
    "title": "Salesforce Offers Its Services to Boost Trump’s Immigration Force",
    "link": "https://www.nytimes.com/2025/10/16/us/salesforce-benioff-ice.html",
    "summary": "The San Francisco-based firm has told ICE that it could use A.I. to help the agency nearly triple its staff. The company’s C.E.O., once a progressive tech titan, has embraced President Trump."
  },
  {
    "title": "The Growing Blowback Against Marc Benioff",
    "link": "https://www.nytimes.com/2025/10/17/business/dealbook/salesforce-benioff-trump-ice.html",
    "summary": "New revelations about efforts by his company, Salesforce, to work with the Trump administration is getting heat from San Francisco officials and now allies."
  },
  {
    "title": "Lady Gaga Was Always Gothic. Now the World Has Caught Up to Her.",
    "link": "https://www.nytimes.com/2025/10/17/magazine/lady-gaga-mayhem-tour-gothic.html",
    "summary": "At a moment when other pop stars are flirting with dark spectacle, Gaga’s “Mayhem” tour shows that she has perfected it."
  },
  {
    "title": "‘You Could Treat a Child for a Few Dollars.’ Now Those Clinics Are Gone.",
    "link": "https://www.nytimes.com/2025/10/17/health/somalia-children-malnutrition-usaid.html",
    "summary": "Hunger and the diseases that stalk small children have surged in Somalia after the U.S. slashed its aid to the country."
  },
  {
    "title": "A Somali Hospital Closed After U.S. Aid Cuts. Fired Employees Reopened It Without Pay.",
    "link": "https://www.nytimes.com/2025/10/17/health/somalia-hospital-reopen-employees.html",
    "summary": "After the Trump administration stopped funding a medical center for women and children, a determined group of health care workers refused to let it shutter."
  },
  {
    "title": "Universities Are Standing Up to Trump",
    "link": "https://www.nytimes.com/2025/10/17/us/universities-are-standing-up-to-trump.html",
    "summary": "A White House proposal for special funding treatment crossed a line for several schools. Some say it feels like a turning point in the federal government’s battle with higher education."
  },
  {
    "title": "Indiana University Fires Adviser to Student Newspaper and Bars Print Publication",
    "link": "https://www.nytimes.com/2025/10/17/business/media/indiana-university-daily-student-newspaper.html",
    "summary": "The administration at Indiana University Bloomington fired the adviser to the paper and barred the publication from putting out a print edition."
  },
  {
    "title": "How Cedric Grolet, an Internet-Famous Pastry Chef, Built a Dessert Empire",
    "link": "https://www.nytimes.com/2025/10/16/dining/cedric-grolet-la-chocolaterie-pastry-chef.html",
    "summary": "Cedric Grolet has built a dessert empire in just a few short years. Crowds are already swarming his new chocolate shop in Paris."
  },
  {
    "title": "‘The Only Candidate With a Coherent Vision’: 3 Opinion Writers on the Mayoral Debate",
    "link": "https://www.nytimes.com/2025/10/17/opinion/nyc-mayor-debate-mamdani-cuomo-sliwa.html",
    "summary": "Who lost the debate may be clearer than who won."
  },
  {
    "title": "How Baby Boomers Blew Up the American Dream",
    "link": "https://www.nytimes.com/2025/10/17/opinion/baby-boomers-us-generations.html",
    "summary": "The postwar generation had a good run. Now we’re all paying for it."
  },
  {
    "title": "Apple, Caught Between U.S. and China, Pledges Investment in Both",
    "link": "https://www.nytimes.com/2025/10/17/business/apple-china-us-tim-cook-investment-tech-war.html",
    "summary": "In Beijing this week, the company’s chief executive, Tim Cook, made promises similar to ones he’d made at the White House. He also got a custom Labubu."
  },
  {
    "title": "Instagram Unveils Teen Safety Features for A.I. Chatbots",
    "link": "https://www.nytimes.com/2025/10/17/technology/instagram-teen-safety-features-ai-chatbots.html",
    "summary": "Instagram is introducing parental controls and limits to conversations on topics like self-harm as concerns grow over how A.I. chatbots affect mental health."
  },
  {
    "title": "Tomiichi Murayama, Japanese Leader Who Gave War Apology, Dies at 101",
    "link": "https://www.nytimes.com/2025/10/17/world/asia/tomiichi-murayama-dead.html",
    "summary": "His televised address as prime minister, delivered 50 years to the day after Japan announced its surrender, set a marker for his country’s “deep remorse” over wartime atrocities."
  },
  {
    "title": "Book Review: ‘Nobody’s Girl,’ by Virginia Roberts Giuffre",
    "link": "https://www.nytimes.com/2025/10/16/books/review/virginia-roberts-giuffre-nobodys-girl-memoir.html",
    "summary": "Virginia Roberts Giuffre’s posthumous “Nobody’s Girl” doesn’t break political news, but might break your heart."
  }
]