[
  {
    "title": "Trump Says U.S. Seized Oil Tanker Off Venezuelan Coast",
    "link": "https://www.nytimes.com/2025/12/10/us/politics/oil-tanker-seized-us-venezuela-trump.html",
    "summary": "The seizure comes as the United States builds up its forces in the Caribbean as part of a campaign against President Nicolás Maduro of Venezuela."
  },
  {
    "title": "María Corina Machado Appears in Norway After Missing Nobel Ceremony",
    "link": "https://www.nytimes.com/2025/12/10/world/americas/maria-corina-machado-venezuela-nobel.html",
    "summary": "María Corina Machado, who spent over a year in hiding in Venezuela, greeted supporters in Oslo, hours after her daughter accepted the Nobel Peace Prize in her name."
  },
  {
    "title": "Oil Tanker U.S. Seized Off Venezuela Has Faked Its Location Before, Data Shows",
    "link": "https://www.nytimes.com/2025/12/10/us/politics/oil-tanker-venezuela-tracking-data.html",
    "summary": "The ship has frequently carried oil from countries under U.S. sanctions, and its tracking data shows multiple recent trips to Iran and Venezuela."
  },
  {
    "title": "House Gives Bipartisan Approval to $900 Billion Defense Bill",
    "link": "https://www.nytimes.com/2025/12/10/us/politics/house-approves-defense-bill.html",
    "summary": "The legislation codifies President Trump’s agenda but includes a few measures challenging his policies and insisting on more consultation with Congress."
  },
  {
    "title": "Defense Bill Will Make D.C. Skies Less Safe, N.T.S.B. Chair Says",
    "link": "https://www.nytimes.com/2025/12/10/us/politics/ntsb-defense-bill-dca-crash.html",
    "summary": "The chair of the National Transportation Safety Board warned that a provision in the new defense bill would worsen the risk of midair collisions near the Washington-area airport where a deadly crash in January killed 67 people."
  },
  {
    "title": "What Is a Trump Gold Card? Applications Open for Million-Dollar Visas.",
    "link": "https://www.nytimes.com/2025/12/10/us/politics/trump-gold-card.html",
    "summary": "President Trump has framed the program as a way for the government to raise billions of dollars and prioritize the admission of successful entrepreneurs and investors."
  },
  {
    "title": "After Shutdown, Democrats Claim Credit for Funding They Opposed",
    "link": "https://www.nytimes.com/2025/12/10/us/politics/shutdown-earmarks-democrats.html",
    "summary": "Several Democrats who fought to steer federal money to their states and districts have boasted about their success even after voting against the bill that provided the funds."
  },
  {
    "title": "As the Price of Beef Soars, Restaurants Are in ‘Code Red’ Mode",
    "link": "https://www.nytimes.com/2025/12/10/business/beef-prices-steakhouses.html",
    "summary": "Midpriced steakhouses and fine-dining establishments are trying to figure out how to cover their rising costs without scaring away customers."
  },
  {
    "title": "Mexico Approves 50% Tariffs on Many Chinese Imports",
    "link": "https://www.nytimes.com/2025/12/11/world/americas/mexico-tariffs-china.html",
    "summary": "The tariffs will apply to goods from China and other nations. Washington has been pressuring Mexico to move away from dealing with China."
  },
  {
    "title": "The Fed Cut Rates Again but Deep Divisions Cloud Path Ahead",
    "link": "https://www.nytimes.com/2025/12/10/business/economy/fed-meeting-interest-rate-decision.html",
    "summary": "The central bank’s decision to lower interest rates for a third straight meeting was highly contentious, reflecting an internal divide that will likely limit how much borrowing costs will fall next year."
  },
  {
    "title": "What Menopause Does to the Body",
    "link": "https://www.nytimes.com/2025/12/10/well/menopause-symptoms.html",
    "summary": "A head-to-toe guide to the many unexpected symptoms of the midlife transition."
  },
  {
    "title": "What Could Thwart the Texas G.O.P. From Picking Up 5 House Seats in Midterm Elections",
    "link": "https://www.nytimes.com/2025/12/10/us/texas-house-redistricting.html",
    "summary": "Republicans redid their voting map so they could flip five seats to help keep control of the U.S. House. But achieving that goal is far from guaranteed."
  },
  {
    "title": "The Conservative Overhaul of the University of Texas Is Underway",
    "link": "https://www.nytimes.com/2025/12/10/us/university-of-texas-republicans-academic-freedom-faculty.html",
    "summary": "The school has been brought to heel by conservative critics of higher education. It is part of a broader transformation at the state’s universities."
  },
  {
    "title": "A Surrogacy Firm Told Parents-to-Be Their Money Was Safe. Suddenly, It Vanished.",
    "link": "https://www.nytimes.com/2025/12/10/health/surro-connections-surrogacy-closure.html",
    "summary": "Surro Connections held itself out as a reliable business. Now, clients have lost as much as tens of thousands of dollars meant to compensate women carrying their pregnancies."
  },
  {
    "title": "Former King Juan Carlos I of Spain, Seeking Relevance, Publishes Book",
    "link": "https://www.nytimes.com/2025/12/11/world/europe/juan-carlos-king-spain-book.html",
    "summary": "King Juan Carlos I of Spain abdicated and left for exile years ago. Now, his attempted comeback is giving his family a royal headache."
  },
  {
    "title": "Louvre Heist Was Caught on Film, Officials Say, Rebutting Earlier Account",
    "link": "https://www.nytimes.com/2025/12/10/world/europe/louvre-heist-camera-delay.html",
    "summary": "Investigators said that a security camera recorded thieves preparing to burgle the Louvre. The museum’s director said previously that the camera was facing the wrong way."
  },
  {
    "title": "Khmer Rouge-Era Land Mines Have a Big Role in Thailand-Cambodia Conflict",
    "link": "https://www.nytimes.com/2025/12/10/world/asia/thailand-cambodia-war-mines.html",
    "summary": "Thailand says ordnance replanted by Cambodia has injured or maimed more than a dozen of its soldiers. Cambodia rejects the accusation."
  },
  {
    "title": "Sophie Kinsella, ‘Confessions of a Shopaholic’ Author, Dies at 55",
    "link": "https://www.nytimes.com/2025/12/10/books/sophie-kinsella-dead-madeleine-wickham.html",
    "summary": "Writing under a pseudonym, Madeleine Wickham cultivated an international following for her series centered on a young woman addicted to shopping."
  },
  {
    "title": "What Trump’s National Security Strategy Gets Right About Europe",
    "link": "https://www.nytimes.com/2025/12/11/opinion/national-security-strategy-us-europe.html",
    "summary": "It’s an actual place, not an arbitrarily bounded zone."
  },
  {
    "title": "The Health Care Debate We Really Need",
    "link": "https://www.nytimes.com/2025/12/10/opinion/health-care-aca-cost-insurance.html",
    "summary": "The high cost of health care in America is suppressing wages, driving job losses and fueling inequality."
  },
  {
    "title": "Washington Faces Heavy Rain and Flooding From Atmospheric River",
    "link": "https://www.nytimes.com/2025/12/10/weather/washington-rivers-flood-evacuations.html",
    "summary": "Tens of thousands of residents in Washington were poised to evacuate, as days of heavy rain sends rivers bursting over their banks."
  },
  {
    "title": "How to Fight Rising Utility Bills? Take Over the Company, Activists Say.",
    "link": "https://www.nytimes.com/2025/12/10/nyregion/central-hudson-utility-takeover.html",
    "summary": "A grass-roots coalition is trying to push New York State to use eminent domain to buy out Central Hudson Gas & Electric and replace it with a public authority."
  },
  {
    "title": "Wenne Alton Davis, Actor in ‘Marvelous Mrs. Maisel,’ Hit by S.U.V. and Killed",
    "link": "https://www.nytimes.com/2025/12/10/us/wenne-alton-davis-dead.html",
    "summary": "The actor, 60, was struck by a vehicle in Midtown Manhattan late on Monday, her agent and the police said."
  },
  {
    "title": "Nursing Home Owners Pocketed Millions as Patients Suffered, Report Says",
    "link": "https://www.nytimes.com/2025/12/10/nyregion/new-jersey-nursing-homes-medicaid.html",
    "summary": "As the owners intentionally understaffed two New Jersey facilities and diverted Medicaid money for their own use, residents in the homes “suffered unnecessarily,” the state comptroller said."
  }
]