[
  {
    "title": "Trump Invokes Kirk’s Killing in Seeking to Silence Opponents on Left",
    "link": "https://www.nytimes.com/2025/09/16/us/politics/trump-kirk-free-speech-hate-speech-left.html",
    "summary": "In the wake of Charlie Kirk’s killing, President Trump and his allies have laid out a broad plan to target liberal groups, monitor speech, revoke visas and designate certain groups as domestic terrorists."
  },
  {
    "title": "Patel Plays the Familiar Role of Pugilist at a Senate Hearing",
    "link": "https://www.nytimes.com/2025/09/16/us/politics/kash-patel-senate-hearing-fbi.html",
    "summary": "The F.B.I. director has come under withering attack in recent days, but with Republicans backing him, the proceedings fell into a familiar partisan groove that appeared to play to his strengths."
  },
  {
    "title": "Democrats Oppose Stopgap Bill, Raising Odds of a Shutdown",
    "link": "https://www.nytimes.com/2025/09/16/us/politics/democrats-funding-bill-shutdown.html",
    "summary": "After allowing a stopgap spending bill to move forward earlier this year, Democrats are under intense pressure not to do so again."
  },
  {
    "title": "G.O.P. Again Cedes Power on Tariffs to Avoid Crossing Trump",
    "link": "https://www.nytimes.com/2025/09/16/us/politics/republicans-house-tariffs-emergency-trump.html",
    "summary": "House Republicans extended a maneuver they engineered earlier in the year that effectively strips Congress of the power to disapprove of President Trump’s tariffs."
  },
  {
    "title": "Fired by Trump, a Former Labor Official Warns Against Politicizing Economic Data",
    "link": "https://www.nytimes.com/2025/09/16/business/mcentarfer-bls-data.html",
    "summary": "Erika McEntarfer, in her first appearance since she was ousted from the Bureau of Labor Statistics, cautioned that “economic data must be free from partisan influence.”"
  },
  {
    "title": "Robert Redford, Screen Idol Turned Director and Activist, Dies at 89",
    "link": "https://www.nytimes.com/2025/09/16/movies/robert-redford-dead.html",
    "summary": "He made serious topics like grief and political corruption resonate with the masses, in no small part because of his own star power."
  },
  {
    "title": "Robert Redford, American Style Icon",
    "link": "https://www.nytimes.com/2025/09/16/style/robert-redford-style-fashion.html",
    "summary": "Reluctant to focus on style or his looks, Mr. Redford nevertheless became the embodiment of an enduring aesthetic."
  },
  {
    "title": "Bob Woodward Remembers Robert Redford",
    "link": "https://www.nytimes.com/2025/09/16/business/media/bob-woodward-robert-redford.html",
    "summary": "Mr. Woodward said Mr. Redford, who portrayed him in the classic 1976 film “All the President’s Men,” was a “genuine, a noble and principled force for good.”"
  },
  {
    "title": "Meryl Streep, Barbra Streisand and Others Mourn Robert Redford",
    "link": "https://www.nytimes.com/2025/09/16/arts/robert-redford-death-celebrity-reactions.html",
    "summary": "Redford “stood for an America we have to keep fighting for,” his frequent collaborator Jane Fonda said after his death was announced on Tuesday."
  },
  {
    "title": "Trump’s Laissez-Faire Stance Gives Netanyahu Free Pass for Gaza Escalation",
    "link": "https://www.nytimes.com/2025/09/16/world/middleeast/trump-netanyahu-gaza-escalation.html",
    "summary": "As Israel mounts a major Gaza offensive, President Trump has neither urged restraint nor endorsed the action, which Israel’s leader has taken as an implicit green light to proceed."
  },
  {
    "title": "Israeli Ground Forces Move Into Gaza City, Sowing Chaos",
    "link": "https://www.nytimes.com/2025/09/16/world/middleeast/gaza-city-israel-invasion.html",
    "summary": "The long-anticipated military assault is aimed, the Israelis said, at routing the militants of Hamas, but it deepened the humanitarian crisis in the Gaza Strip."
  },
  {
    "title": "It Isn’t Just the U.S. The Whole World Has Soured on Climate Politics.",
    "link": "https://www.nytimes.com/2025/09/16/magazine/climate-politics-us-world-paris-agreement.html",
    "summary": "How do we think about the climate future, now that the era marked by the Paris Agreement has so utterly disappeared?"
  },
  {
    "title": "Climate Change’s Toll in Europe This Summer: Thousands of Extra Deaths",
    "link": "https://www.nytimes.com/2025/09/17/climate/europe-heat-deaths-climate-change.html",
    "summary": "Three times as many people in cities and towns died from severe heat as would have done in a world without human-caused warming, scientists said."
  },
  {
    "title": "Has Britain Gone Too Far With Its Digital Controls?",
    "link": "https://www.nytimes.com/2025/09/17/technology/britain-facial-recognition-digital-controls.html",
    "summary": "British authorities have ramped up the use of facial recognition, artificial intelligence and internet regulation to address crime and other issues, stoking concerns of surveillance overreach."
  },
  {
    "title": "State Terrorism Charges Against Luigi Mangione Are Dismissed",
    "link": "https://www.nytimes.com/2025/09/16/nyregion/luigi-mangione-state-terrrorism-charges-dismissed.html",
    "summary": "The judge overseeing the case against Mr. Mangione said the evidence underpinning two of the most serious counts, one of which charged him with first-degree murder, was “legally insufficient.”"
  },
  {
    "title": "Democrat Wins Seat of Slain Minnesota Lawmaker, Leaving State House Evenly Split",
    "link": "https://www.nytimes.com/2025/09/16/us/minnesota-election-slain-lawmaker.html",
    "summary": "Xp Lee, a former City Council member, won a special election to replace his political mentor, former Minnesota House Speaker Melissa Hortman, who was assassinated in June."
  },
  {
    "title": "Joe Manchin Would Like a Word. (OK, Maybe Several Words.)",
    "link": "https://www.nytimes.com/2025/09/16/us/politics/joe-manchin.html",
    "summary": "The voluble former senator, now retired from politics, appears to miss the arena and is mulling a return to it."
  },
  {
    "title": "Tina Brown: When Trump Visits King Charles III",
    "link": "https://www.nytimes.com/2025/09/17/opinion/king-charles-trump-britain-visit.html",
    "summary": "He may be the last man standing who can exude global gravitas in the dumpster fire of our digitally dominated world."
  },
  {
    "title": "Our Allies Are Asking: Why Does Putin Still Own Trump?",
    "link": "https://www.nytimes.com/2025/09/16/opinion/trump-putin-russia-ukraine.html",
    "summary": "Ukrainian and European officials, analysts and entrepreneurs keep asking privately, “What’s up with Trump?”"
  },
  {
    "title": "San Francisco Politician Recalled Over the Great Highway’s Closure",
    "link": "https://www.nytimes.com/2025/09/17/us/joel-engardio-san-francisco.html",
    "summary": "Supervisor Joel Engardio was ousted by voters who were angry that he helped turn a thoroughfare into a park."
  },
  {
    "title": "A Stone-Skimming Contest in Scotland Is Infiltrated by Cheaters",
    "link": "https://www.nytimes.com/2025/09/16/world/europe/stone-skimming-championship-cheating.html",
    "summary": "“I did see some stones that looked a little too perfect,” said the winner of the Stone Skimming World Championships. The offending contestants were disqualified."
  },
  {
    "title": "Pat Crowley, Veteran Actress of Film and TV, Dies at 91",
    "link": "https://www.nytimes.com/2025/09/16/arts/pat-crowley-dead.html",
    "summary": "Named the year’s “new star” at the 1954 Golden Globes, she appeared alongside the biggest names of her time. She later embarked on a long career in television."
  },
  {
    "title": "Remnants of Tropical Storm Mario Could Bring Heavy Rain to Southern California",
    "link": "https://www.nytimes.com/2025/09/16/weather/california-rain-tropical-storm-mario-forecast.html",
    "summary": "The remains of Tropical Storm Mario could bring flooding to the Los Angeles area. Dry storms with lightning could ignite wildfires in Northern California."
  }
]