[
  {
    "title": "Xi Uses Summit, Parade and History to Flaunt China’s Global Pull",
    "link": "https://www.nytimes.com/2025/08/30/world/asia/xi-putin-modi-china-summit.html",
    "summary": "With the leaders of Russia and India visiting, China’s president will show how he can use statecraft, military might and history to push for global influence."
  },
  {
    "title": "China Rekindles Wartime Fury, Stirring Fears of Anti-Japan Hate",
    "link": "https://www.nytimes.com/2025/08/30/world/asia/china-japan-wwii-nationalism.html",
    "summary": "A series of World War II dramas about China’s fight against Japan is drawing audiences to their feet, and, in some cases, to tears. Some say it helps deflect public discontent."
  },
  {
    "title": "The Nobel Prize and a Testy Phone Call: How the Trump-Modi Relationship Unraveled",
    "link": "https://www.nytimes.com/2025/08/30/us/politics/trump-modi-india.html",
    "summary": "President Trump’s repeated claims about having “solved” the India-Pakistan war infuriated Prime Minister Narendra Modi of India. And that was only the beginning."
  },
  {
    "title": "Targeting Iran’s Leaders, Israel Found a Weak Link: Their Bodyguards",
    "link": "https://www.nytimes.com/2025/08/30/us/politics/israel-iran-assassination.html",
    "summary": "Israel was able to track the movements of key Iranian figures and assassinate them during the 12-day war this spring by following the cellphones carried by members of their security forces."
  },
  {
    "title": "Over 15 Killed in Gaza City, One Day After Israel Ends Daily Pauses for Aid",
    "link": "https://www.nytimes.com/2025/08/30/world/middleeast/gaza-israel-deadly-strikes.html",
    "summary": "One attack was an effort to assassinate Abu Obeida, one of Hamas’s best-known spokesmen, Israeli officials said. It was not immediately clear if that succeeded."
  },
  {
    "title": "Houthis Say Prime Minister Was Killed in Israeli Attack",
    "link": "https://www.nytimes.com/2025/08/30/world/middleeast/houthi-prime-minister-killed-israel.html",
    "summary": "Ahmed al-Rahawi had led the Houthi cabinet in Yemen since 2024. His killing is unlikely to halt the Iranian-backed group’s missile attacks on Israel."
  },
  {
    "title": "Mexico’s President Struggles to Escape Trump’s Growing Demands",
    "link": "https://www.nytimes.com/2025/08/30/world/americas/mexico-us-trump-sheinbaum.html",
    "summary": "After months of negotiation and concessions, President Claudia Sheinbaum of Mexico has found herself in a cycle of pressure from the White House."
  },
  {
    "title": "From Cracker Barrel to Sydney Sweeney, Trump Has an Opinion to Share",
    "link": "https://www.nytimes.com/2025/08/30/us/politics/cracker-barrel-sweeney-trump.html",
    "summary": "In his second term, President Trump is using his power to reshape American culture, not just American policy. He has threatened consequences for many who disagree."
  },
  {
    "title": "Benny Johnson Was Fired for Plagiarism. At the White House, He’s Embraced.",
    "link": "https://www.nytimes.com/2025/08/30/business/media/trump-benny-johnson.html",
    "summary": "Benny Johnson, a right-wing podcaster, has enjoyed rare access and promotion from the Trump administration."
  },
  {
    "title": "Russia Distracts Its Citizens From Ukraine War With Nonstop Festivals",
    "link": "https://www.nytimes.com/2025/08/30/world/europe/russia-ukraine-war-summer-in-moscow.html",
    "summary": "A festival known as Summer in Moscow showcases the city’s transformation into an ultramodern metropolis. But the feast can’t last forever."
  },
  {
    "title": "In Secret Diaries, the Church Shooter’s Plans for Mass Murder",
    "link": "https://www.nytimes.com/2025/08/30/us/minneapolis-church-shooter-robin-westman.html",
    "summary": "Robin W. Westman described how she had obtained guns and how she had visited the church on a test run this summer during a Sunday Mass."
  },
  {
    "title": "Marin Lately, a New Satire Publication, Skewers Marin County",
    "link": "https://www.nytimes.com/2025/08/30/us/marin-lately-satire.html",
    "summary": "In February, the publication Marin Lately began satirizing the wealthy, idyllic swath of the Bay Area. The author has been a mystery, until now."
  },
  {
    "title": "What to Know About Zohran Mamdani and Democratic Socialism",
    "link": "https://www.nytimes.com/2025/08/30/nyregion/zohran-mamdani-nyc-mayor-democratic-socialism.html",
    "summary": "Opponents of the Democratic nominee for mayor of New York City have derogatively called him both a socialist and a democratic socialist to make a dent in his lead in the polls."
  },
  {
    "title": "New York’s Very Rich Reel Over the NYC Mayoral Race and Mamdani’s Lead",
    "link": "https://www.nytimes.com/2025/08/30/style/hamptons-nyc-mayor-cuomo-adams-mamdani-fundraising.html",
    "summary": "“The Hamptons is basically in group therapy about the mayoral race.”"
  },
  {
    "title": "The ‘Thursday Murder Club’ Members Get Down to Business",
    "link": "https://www.nytimes.com/2025/08/30/movies/the-thursday-murder-club-members-interview.html",
    "summary": "Helen Mirren, Pierce Brosnan, Ben Kingsley, Celia Imrie and director Chris Columbus on their new adaptation, first-day jitters and their shared love of “Home Alone.”"
  },
  {
    "title": "Vax Quack Lacks Facts",
    "link": "https://www.nytimes.com/2025/08/30/opinion/robert-f-kennedy-jr-maha.html",
    "summary": "This Kennedy is no profile in courage."
  },
  {
    "title": "The Era of the American Lawn Is Over",
    "link": "https://www.nytimes.com/2025/08/30/opinion/lawns-mowing-wildflowers.html",
    "summary": "Yards should be wilder, freer and more alive."
  },
  {
    "title": "Behind Thai Premier’s Dismissal, Unraveling of an Uneasy Alliance",
    "link": "https://www.nytimes.com/2025/08/30/world/asia/thailand-paetongtarn-shinawatra-thaksin.html",
    "summary": "Thaksin Shinawatra had struck a grand bargain with Thailand’s establishment, analysts say, that allowed his daughter to ascend to the prime minister’s job."
  },
  {
    "title": "Pro-Palestinian Protesters at the Venice Film Festival Raise Gaza War",
    "link": "https://www.nytimes.com/2025/08/30/arts/gaza-protest-venice-film-festival.html",
    "summary": "In the days leading up to the festival, hundreds of film professionals signed an open letter demanding that the star-studded event take a stance against the crisis in Gaza."
  },
  {
    "title": "Hiker Is Found Dead in Wyoming After Being Missing for a Month",
    "link": "https://www.nytimes.com/2025/08/30/us/minnesota-hiker-grant-gardner-dead-wyoming.html",
    "summary": "Grant Gardner’s body was found by a climbing team on Wednesday in Bighorn National Forest, a week after the authorities called off a search."
  },
  {
    "title": "Memories Are Still Swirling 20 Years After a Hurricane",
    "link": "https://www.nytimes.com/2025/08/30/insider/katrina-new-orleans.html",
    "summary": "Of all the disorder in New Orleans after Hurricane Katrina, a Times reporter remembers the corpse on Union Street most of all."
  }
]