[
  {
    "title": "Israel and Hamas Say They’ll Work With Trump’s Gaza Plan, but Gaps Remain",
    "link": "https://www.nytimes.com/2025/10/04/world/middleeast/israel-hamas-trump-netanyahu.html",
    "summary": "Israel said it would cooperate with the White House to end the war, but much remains unclear about Hamas’s future and whether it will agree to disarm."
  },
  {
    "title": "For Netanyahu, Trump’s Nod to Peace Puts Him in a Tough Spot",
    "link": "https://www.nytimes.com/2025/10/04/world/middleeast/netanyahu-israel-trump-gaza-plan.html",
    "summary": "The Israeli leader thought he had a plan from the U.S. president that would have represented total victory over Hamas. Suddenly, it looks as though he might not get everything he wants."
  },
  {
    "title": "Cautious Optimism on Gaza Peace Plan, but No Guarantees. Here’s What to Know.",
    "link": "https://www.nytimes.com/2025/10/04/world/middleeast/hamas-trump-gaza-deal.html",
    "summary": "Israel and Hamas said they would work with President Trump’s plan to end the war, but a number of sticking points could derail efforts to make a diplomatic breakthrough."
  },
  {
    "title": "Trump Seizes on Shutdown to Punish Political Foes",
    "link": "https://www.nytimes.com/2025/10/04/us/politics/trump-shutdown-punish-foes.html",
    "summary": "The White House has cut or paused billions in funding to Democratic-run cities and states since the federal government came to a halt."
  },
  {
    "title": "This Program Rescued Army Recruiting",
    "link": "https://www.nytimes.com/2025/10/04/us/politics/army-recruiting-trump.html",
    "summary": "The defense secretary cites a ‘Trump bump.’ But the Army’s recruiting surge wouldn’t have been possible without the program started three years ago at Fort Jackson."
  },
  {
    "title": "Trump Administration Is Said to Plan to Cut Refugee Admissions to a Record Low",
    "link": "https://www.nytimes.com/2025/10/03/us/politics/trump-refugee-admissions-south-africa.html",
    "summary": "Many of the slots would go to white South Africans and others facing “unjust discrimination,” according to people familiar with the matter and documents obtained by The New York Times."
  },
  {
    "title": "Partisan Shutdown Messages Could Hurt Civil Service, Experts Warn",
    "link": "https://www.nytimes.com/2025/10/04/us/politics/partisan-messages-shutdown-trump.html",
    "summary": "Messages on official government channels blaming Democrats for the shutdown are one of the most significant hits yet to the longstanding wall between federal workers and politics, historians said."
  },
  {
    "title": "What Happens When Socialists Are in Charge? Portland Offers a Glimpse.",
    "link": "https://www.nytimes.com/2025/10/04/us/politics/portland-socialists-mamdani.html",
    "summary": "A West Coast version of Zohran Mamdani’s campaign is playing out in Portland. But the socialist city councilors, who say the city has been “run by the rich” for too long, are facing significant opposition."
  },
  {
    "title": "Mamdani Is More Foe Than Friend in the Suburbs, Even Among Democrats",
    "link": "https://www.nytimes.com/2025/10/04/nyregion/mamdani-suburbs-voters-republicans.html",
    "summary": "Just outside New York City, Republicans are using Zohran Mamdani as an attack line for the 2026 midterms, much as they vilified the city in 2022."
  },
  {
    "title": "Sean ‘Diddy’ Combs’s Future: Prison, Fine and a Shunning",
    "link": "https://www.nytimes.com/2025/10/04/arts/music/sean-combs-diddy-sentenced-prison.html",
    "summary": "Many who have tracked the music mogul’s career think his reputation has been irreparably damaged by testimony of abusive behavior as a boss and boyfriend."
  },
  {
    "title": "The Tech Jester Who Pranks San Francisco",
    "link": "https://www.nytimes.com/2025/10/04/us/the-tech-jester-who-pranks-san-francisco.html",
    "summary": "Riley Walz, 23, has gained fame for his online antics. His latest stunt has upset city officials."
  },
  {
    "title": "When A.I. Came for Hollywood",
    "link": "https://www.nytimes.com/2025/10/04/opinion/ai-hollywood-tilly-norwood-actress.html",
    "summary": "The Dream Factory is going full fantasy, human factor be damned."
  },
  {
    "title": "‘If You Don’t Want This Consequence, Don’t Vote for Republicans’",
    "link": "https://www.nytimes.com/2025/10/04/opinion/republicans-government-shutdown.html",
    "summary": "This week, the round table convenes to discuss who wins and who loses when the government shuts down."
  },
  {
    "title": "Best Intentions",
    "link": "https://www.nytimes.com/2025/10/04/briefing/best-intentions.html",
    "summary": "Everyone’s “intentional” these days, but don’t let the word’s wholesale application to every activity of modern life deprive you of its benefits."
  },
  {
    "title": "For the New Archbishop of Canterbury, Nursing Roots Could Bring a Pastoral Sensibility",
    "link": "https://www.nytimes.com/2025/10/04/world/europe/sarah-mullally-archbishop-of-canterbury.html",
    "summary": "As bishop of London, Sarah Mullally placed herself in the middle of the church’s most charged issues. But experts predict that her years treating cancer patients could inform how she approaches her new role."
  },
  {
    "title": "Japan Is Set for Its First Female Prime Minister",
    "link": "https://www.nytimes.com/2025/10/04/world/asia/japan-female-leader.html",
    "summary": "Sanae Takaichi, a hard-line conservative, was elected as leader by Japan’s embattled governing party, paving the way for her to become prime minister of the coalition government."
  },
  {
    "title": "How Private Equity Oversees the Ethics of Drug Research",
    "link": "https://www.nytimes.com/2025/10/04/health/drug-trials-ethics-ozempic.html",
    "summary": "Many drug trials are vetted by companies with ties to the drugmakers, raising concerns about conflicts of interest and patient safety."
  },
  {
    "title": "2 Teen Girls Died In a Hit-And-Run. Another Teen Faces Murder Charges.",
    "link": "https://www.nytimes.com/2025/10/03/nyregion/hit-and-run-deaths-girls-new-jersey.html",
    "summary": "The 17-year-old friends in a small New Jersey town were killed on their way to get ice cream. Prosecutors said the crash was intentional."
  }
]