[
  {
    "title": "Trump Empowers Election Deniers, Still Fixated on 2020 Grievances",
    "link": "https://www.nytimes.com/2025/10/22/us/politics/trump-election-deniers-voting-security.html",
    "summary": "The president has placed proponents of his false claims into government jobs while dismantling systems built to secure voting, raising fears that he aims to seize authority over elections ahead of next year’s midterms."
  },
  {
    "title": "Trump Said to Demand Justice Dept. Pay Him $230 Million for Past Cases",
    "link": "https://www.nytimes.com/2025/10/21/us/politics/trump-justice-department-compensation.html",
    "summary": "Senior department officials who were defense lawyers for the president and those in his orbit are now in jobs that typically must approve any such payout, underscoring potential ethical conflicts."
  },
  {
    "title": "Trump’s $230 Million Demand, and the Chaos Created by U.S.A.I.D. Cuts in Somalia",
    "link": "https://www.nytimes.com/2025/10/22/podcasts/the-headlines/trump-payout-usaid-cuts-somalia.html",
    "summary": "Plus, renegade parachutes at Yosemite."
  },
  {
    "title": "Paul Ingrassia, Trump Nominee for Watchdog Role, Out After Report of Racist Texts",
    "link": "https://www.nytimes.com/2025/10/21/us/politics/paul-ingrassia-trump-senate.html",
    "summary": "At least four Republican senators, including the majority leader, signaled their opposition to Paul Ingrassia, the president’s pick to lead the corruption-fighting Office of Special Counsel."
  },
  {
    "title": "In Trump’s Washington, Hate Is Not a Deal Breaker",
    "link": "https://www.nytimes.com/2025/10/21/us/politics/trump-ingrassia-republicans.html",
    "summary": "Paul Ingrassia’s nomination illustrated how much antisemitic and hateful rhetoric has been explained away or rewarded by Republicans in power."
  },
  {
    "title": "Colleges Face a Reckoning: Is a Degree Really Necessary?",
    "link": "https://www.nytimes.com/2025/10/22/us/value-of-higher-education-attainment-rates-graduation.html",
    "summary": "Wyoming is one of many states that embraced a campaign to encourage more people to enroll in higher education. Some leaders and students wonder if they reached a limit."
  },
  {
    "title": "Civilian Massacres Follow Syrian Leaders’ Promises of Peace",
    "link": "https://www.nytimes.com/2025/10/22/world/middleeast/syria-massacre-druse.html",
    "summary": "Ten months after rebels toppled the long-entrenched Assad regime, little-checked bloodshed has led many Syrians to abandon hope that the years of brutality may be over."
  },
  {
    "title": "New York’s Many Dystopian Fictional Futures",
    "link": "https://www.nytimes.com/2025/10/20/arts/new-york-movies-books-future-dystopia.html",
    "summary": "If you’re a writer or filmmaker hoping to create a hell on earth, might as well start with the most famous city in the world."
  },
  {
    "title": "Silicon Valley Has China Envy, and That Reveals a Lot About America",
    "link": "https://www.nytimes.com/2025/10/22/business/china-tech-silicon-valley.html",
    "summary": "The fascination with China’s ability to build things America struggles with, from bridges to advanced tech, risks a dangerous miscalculation about what drives China."
  },
  {
    "title": "As Trump Moves Forward With White House Ballroom Project, Architects Raise Concerns",
    "link": "https://www.nytimes.com/2025/10/21/arts/design/trump-ballroom-architects-review.html",
    "summary": "Architects were surprised by the scale and speed of the project, but the president is moving forward with his plans for a ballroom at the White House."
  },
  {
    "title": "What to Know About Trump’s Plan for a Triumphal Arch in Washington",
    "link": "https://www.nytimes.com/2025/10/21/us/politics/trump-arch-washington-memorial.html",
    "summary": "President Trump has proposed construction of an arch in the style of the Arc de Triomphe in Washington in the lead-up to the nation’s 250th anniversary."
  },
  {
    "title": "This Might Be Andrew Cuomo’s Last Debate. What Can New Yorkers Expect?",
    "link": "https://www.nytimes.com/2025/10/22/nyregion/cuomo-debate-mayor.html",
    "summary": "Even as Mr. Cuomo has ramped up attacks against the front-runner, Zohran Mamdani, and repeated calls for Curtis Sliwa to drop out, he plans to retain last week’s debate strategy."
  },
  {
    "title": "Management of Guardian Angels Raises Questions About Sliwa’s Leadership",
    "link": "https://www.nytimes.com/2025/10/22/nyregion/mayor-sliwa-guardian-angels.html",
    "summary": "The Republican nominee to lead New York City is projecting a more serious outlook, but his longtime organization shows signs of a flawed stewardship."
  },
  {
    "title": "How to Watch the Final NYC Mayoral Debate",
    "link": "https://www.nytimes.com/2025/10/22/nyregion/how-to-watch-nyc-mayor-debate.html",
    "summary": "Zohran Mamdani, Andrew Cuomo and Curtis Sliwa will meet onstage Wednesday night for the last time before the general election on Nov 4."
  },
  {
    "title": "‘Medicaid Cut Me Off’: A Rural Health Center Faces New Pressures",
    "link": "https://www.nytimes.com/2025/10/22/health/medicaid-health-care-mississippi.html",
    "summary": "As cuts to federal health care take hold, local clinics like Delta Health Center in Mississippi will be stretched more thinly than ever."
  },
  {
    "title": "What Happens if Obamacare Subsidies Expire?",
    "link": "https://www.nytimes.com/video/health/100000010459745/what-happens-if-obamacare-subsidies-expire.html",
    "summary": "Consumers are facing greater costs for their 2026 A.C.A. health coverage as Congress continues to debate whether to extend subsidies that help people afford their premiums. Margot Sanger-Katz, a health care policy reporter for The New York Times, explains why."
  },
  {
    "title": "Obamacare Is Expensive. But So Is All Health Insurance.",
    "link": "https://www.nytimes.com/2025/10/22/upshot/obamacare-health-prices-shutdown.html",
    "summary": "The main difference is that most Americans don’t confront the full cost of their coverage."
  },
  {
    "title": "Workers and Employers Face Higher Health Insurance Costs",
    "link": "https://www.nytimes.com/2025/10/22/health/workers-and-employers-face-higher-health-insurance-costs.html",
    "summary": "A new employer survey shows premiums for a family climbed in 2025 as companies and their workers pay more for coverage."
  },
  {
    "title": "The Louvre’s Attraction Is Its History. That’s Also Its Weakness.",
    "link": "https://www.nytimes.com/2025/10/22/arts/design/louvre-security-history.html",
    "summary": "The brazen robbery on Sunday has put a spotlight on security protocols in the sprawling museum, which have been tested over the years by break-ins and thefts."
  },
  {
    "title": "Louvre Reopens for First Time Since Brazen Jewelry Robbery",
    "link": "https://www.nytimes.com/2025/10/22/world/europe/louvre-museum-robbery-open-paris.html",
    "summary": "French authorities are under growing scrutiny about whether security failings allowed four thieves to steal royal jewelry worth over $100 million."
  },
  {
    "title": "Le Heist",
    "link": "https://www.nytimes.com/2025/10/22/podcasts/the-daily/louvre-heist-jewels-robbery.html",
    "summary": "How thieves were able to pull off an audacious robbery of priceless jewels from the Louvre in broad daylight."
  },
  {
    "title": "Members of Congress Don’t Leave. We Need Term Limits.",
    "link": "https://www.nytimes.com/2025/10/22/opinion/desantis-trone-term-limits.html",
    "summary": "Term limits would help bring our divided nation together."
  },
  {
    "title": "How President Trump Uses A.I.",
    "link": "https://www.nytimes.com/2025/10/22/briefing/how-president-trump-uses-ai.html",
    "summary": "The era of A.I. propaganda is here — and Trump is an enthusiastic participant."
  },
  {
    "title": "Late Night Watches Trump Go ‘Hulk Smash’ on the White House",
    "link": "https://www.nytimes.com/2025/10/22/arts/television/stephen-colbert-trump-white-house-ballroom.html",
    "summary": "“That is it. We are not giving him the security deposit back,” Stephen Colbert said about the president’s building renovation plans."
  },
  {
    "title": "Bird Flu Is Back",
    "link": "https://www.nytimes.com/2025/10/22/health/h5n1-bird-flu.html",
    "summary": "After a quiet summer, the virus is hitting poultry flocks hard in the run-up to the holidays — and in the midst of a federal government shutdown."
  },
  {
    "title": "Deforestation Is Imperiling Coffee Cultivation, Report Finds",
    "link": "https://www.nytimes.com/2025/10/22/world/americas/brazil-coffee-production-rainfall.html",
    "summary": "A new report by an industry watchdog adds to growing scientific consensus that as forests are felled to make way for coffee farms, rainfall decreases and crops are more likely to fail."
  },
  {
    "title": "Vehicle Crashes Into Security Gate Outside the White House",
    "link": "https://www.nytimes.com/2025/10/21/us/white-house-car-crash.html",
    "summary": "The Secret Service said the driver was arrested and there was no longer a threat. President Trump was in the White House at the time, the agency said."
  },
  {
    "title": "As Suspicious Drones Plague Germany, Officials Are Unsure How to Respond",
    "link": "https://www.nytimes.com/2025/10/22/world/europe/germany-drones-defense-russia.html",
    "summary": "Chancellor Friedrich Merz said, “We suspect that Russia is behind most of these drone flights” around vital sites like ports and airports."
  }
]