[
  {
    "title": "Trump’s Affinity for Putin Will Be Tested at High-Risk Summit in Alaska",
    "link": "https://www.nytimes.com/2025/08/13/us/politics/trump-putin-meeting-russia-ukraine.html",
    "summary": "President Trump has largely held back from harsh criticism of Vladimir V. Putin personally, despite recent complaints about Russian intransigence in ending the war in Ukraine."
  },
  {
    "title": "Zelensky and Other European Leaders Work With Trump on Russia-Ukraine Strategy",
    "link": "https://www.nytimes.com/2025/08/13/world/europe/trump-europe-ukraine-talks-putin.html",
    "summary": "Chancellor Friedrich Merz and several allies played host to President Trump for a video call, the latest in a summer-long effort to hold ranks in supporting Ukraine."
  },
  {
    "title": "Trump and Putin Could Decide Others’ Fates, Echoing Yalta Summit",
    "link": "https://www.nytimes.com/2025/08/13/world/europe/yalta-trump-putin-meeting-alaska.html",
    "summary": "In 1945, the map of Europe was redrawn in Yalta without input from the affected countries. Ukraine and Europe fear a repeat in Alaska."
  },
  {
    "title": "Why Surrendering a Key Eastern Region Would Be Hard for Ukraine",
    "link": "https://www.nytimes.com/2025/08/12/world/europe/russia-ukraine-donbas-land-swap.html",
    "summary": "As President Trump talks of land swaps, Ukrainians find it difficult to imagine giving up the Donbas, for military, humanitarian and political reasons."
  },
  {
    "title": "JD Vance Meets Nigel Farage, Another Right Wing Populist, on Trip to UK",
    "link": "https://www.nytimes.com/2025/08/13/world/europe/jd-vance-nigel-farage-reform-uk.html",
    "summary": "JD Vance, the vice president, sat down with Nigel Farage, a longtime supporter of President Trump whose party, Reform U.K., is leading in British polls."
  },
  {
    "title": "Trump Warns of Economic Disaster if Court Strikes Down Tariffs",
    "link": "https://www.nytimes.com/2025/08/13/us/politics/trump-tariffs-case-federal-court.html",
    "summary": "The president has crowed about the billions of dollars collected so far from tariffs. That money could be at risk if the White House loses the legal battle."
  },
  {
    "title": "National Guard Deploys in D.C. as Trump’s Crime Crackdown Starts to Take Shape",
    "link": "https://www.nytimes.com/2025/08/12/us/politics/dc-police-national-guard.html",
    "summary": "Troops appeared near the Washington Monument on Tuesday evening. But it remained unclear whether the eventual show of force would match the president’s apocalyptic rhetoric."
  },
  {
    "title": "The Hardest Part of Setting a Guinness World Record? Getting People to Show Up.",
    "link": "https://www.nytimes.com/2025/08/13/magazine/guinness-world-record.html",
    "summary": "When it comes to mass-participation events, would-be record setters are finding it harder than ever to draw a crowd. But it’s still fun to try."
  },
  {
    "title": "Israel Hasn’t Prosecuted a Single Suspect for the Oct. 7 Attack",
    "link": "https://www.nytimes.com/2025/08/13/world/middleeast/israel-oct-7-palestinians-trial.html",
    "summary": "Israel has extensively documented the 2023 Hamas-led assault and is believed to be holding at least 200 Palestinians suspected of involvement. Not one has been charged or put on trial."
  },
  {
    "title": "What It Takes to Find Food in Gaza",
    "link": "https://www.nytimes.com/video/world/middleeast/100000010322362/what-it-takes-to-find-food-in-gaza.html",
    "summary": "Starvation has spread in Gaza, as the prices of basic goods have skyrocketed and getting aid is difficult and often deadly. Ashley Wu, a graphics reporter for The New York Times, explains the dire choices that many Gazans face, as Israel faces growing condemnation over the crisis."
  },
  {
    "title": "Gaza Plan Stokes Tension Between Israel’s Military Chief and Government",
    "link": "https://www.nytimes.com/2025/08/13/world/middleeast/israel-gaza-plan-military-government-zamir.html",
    "summary": "Lt. Gen. Eyal Zamir has pushed back against a proposal to control Gaza City, according to officials. One hard-right member of the government suggested he could be dismissed."
  },
  {
    "title": "Meat Is Back at Eleven Madison Park, After 4 Vegan Years",
    "link": "https://www.nytimes.com/2025/08/13/dining/eleven-madison-park-meat.html",
    "summary": "The Manhattan restaurant drew global praise and skepticism with its climate-minded, all-plant menu. Now its chef wants to be more welcoming — and popular."
  },
  {
    "title": "How a U.S. Senate Race Is Shaping the Fight Over Redistricting in Texas",
    "link": "https://www.nytimes.com/2025/08/13/us/politics/texas-redistricting-senate.html",
    "summary": "Senator John Cornyn and Attorney General Ken Paxton are vying to be the tougher candidate on Democratic lawmakers who left Texas, as potential Democratic rivals seek their own spotlight."
  },
  {
    "title": "Cuomo’s Attack on Mamdani’s Apartment Struck a New York Nerve",
    "link": "https://www.nytimes.com/2025/08/12/nyregion/cuomo-mamdani-rent-stabilized.html",
    "summary": "The attacks in the New York City mayor’s race may have veered into the personal, but they also reflected a larger debate on who should benefit from government regulation of housing costs."
  },
  {
    "title": "Ex-Governor Switches Back to Eric Adams in NYC Mayor’s Race",
    "link": "https://www.nytimes.com/2025/08/13/nyregion/eric-adams-paterson-endorsement.html",
    "summary": "Former Gov. David Paterson, who had endorsed his successor, Andrew Cuomo, in the Democratic primary, said he believed Mr. Adams “would run the city the best.”"
  },
  {
    "title": "U.K. Secretly Spent $3.2 Million to Stop Journalists From Reporting on Data Breach",
    "link": "https://www.nytimes.com/2025/08/13/world/europe/uk-data-breach-afghan.html",
    "summary": "After British authorities accidentally exposed information about 19,000 Afghans, the government sought a legal order preventing disclosure of the breach."
  },
  {
    "title": "Homeless and Burning in America’s Hottest City",
    "link": "https://www.nytimes.com/2025/08/13/well/homeless-heat-phoenix.html",
    "summary": "As the summer heat becomes increasingly extreme in Phoenix, people who can’t escape the sun are suffering third-degree burns, heatstroke and dehydration."
  },
  {
    "title": "Juneau Floods As Mendenhall Glacier Melts",
    "link": "https://www.nytimes.com/2025/08/13/climate/alaska-juneau-flood-glacier.html",
    "summary": "An overflowing glacial lake caused a surge in the Mendenhall River on Wednesday, prompting flood alerts and evacuations in Juneau."
  },
  {
    "title": "At Least 3 Are Killed in Tennessee Flooding",
    "link": "https://www.nytimes.com/2025/08/12/us/flooding-chattanooga-tennessee.html",
    "summary": "Rescue crews pulled people out of submerged cars and homes overnight as floods swept the southeastern part of the state."
  },
  {
    "title": "Beyoncé Wins First Emmy for N.F.L. Halftime Show",
    "link": "https://www.nytimes.com/2025/08/13/arts/television/beyonce-emmy-win-nfl-halftime-netflix-christmas.html",
    "summary": "The pop superstar received a costume design award for her Netflix football halftime performance tied to her “Cowboy Carter” album."
  },
  {
    "title": "The Strange Beauty of New York’s Bodega Ramps",
    "link": "https://www.nytimes.com/2025/08/13/arts/design/deli-bodega-ramps-accessibility.html",
    "summary": "These humble, concrete blobs, designed to ease entry into delis and other stores, can resemble glaciers, pancakes or clamshells and affirm the civic compact."
  },
  {
    "title": "Trump Wants to Take Over the Fortune 500. What Can Go Wrong?",
    "link": "https://www.nytimes.com/2025/08/13/opinion/trump-ceo-nvidia-intel.html",
    "summary": "Our commander in chief has decided to also command the Fortune 500."
  },
  {
    "title": "In ‘And Just Like That …’ a Craven Era Took Its Revenge on Youth and Hope and Fun",
    "link": "https://www.nytimes.com/2025/08/13/opinion/and-just-like-that-finale.html",
    "summary": "Every generation gets the “Sex and the City” version it deserves."
  },
  {
    "title": "Hard Truths",
    "link": "https://www.nytimes.com/2025/08/13/briefing/trump-administration-data.html",
    "summary": "We look at how the Trump administration deals with unfavorable data."
  },
  {
    "title": "New Video Shows Uvalde School Chief Trying to Negotiate With Gunman",
    "link": "https://www.nytimes.com/2025/08/12/us/uvalde-documents-video-arredondo.html",
    "summary": "The video, part of a trove of materials that authorities had refused to release, shows the minutes in which a commander tried to talk to a gunman barricaded in a room with dozens of children."
  },
  {
    "title": "New York City Companies All but Stopped Hiring in First Half of the Year",
    "link": "https://www.nytimes.com/2025/08/13/nyregion/nyc-jobs.html",
    "summary": "Fewer than 1,000 private-sector jobs were added, the slowest growth in the labor market outside a recession and the pandemic since 2003."
  },
  {
    "title": "Why Cristiano Ronaldo’s Engagement Raised Eyebrows in Saudi Arabia",
    "link": "https://www.nytimes.com/2025/08/13/world/middleeast/ronaldo-engagement-saudi-arabia.html",
    "summary": "The soccer star has been living in the country with Georgina Rodríguez, the mother of his children, testing the boundaries of social change in the conservative Islamic kingdom."
  }
]