[
  {
    "title": "Trump Administration to Require Universities to Submit Data on Applicants’ Race",
    "link": "https://www.nytimes.com/2025/08/07/us/politics/trump-schools-race-data.html",
    "summary": "The administration has become increasingly focused on admissions data in its effort to bring the higher education system in line with President Trump’s political agenda."
  },
  {
    "title": "National Weather Service Is Hiring Hundreds of New Staff",
    "link": "https://www.nytimes.com/2025/08/07/weather/nws-hiring-doge-cuts.html",
    "summary": "The federal forecasting agency plans to restore some of its losses from this year’s Trump administration cuts."
  },
  {
    "title": "Still Fuming Over a Weak Jobs Report, Trump Finds Some Numbers He Likes",
    "link": "https://www.nytimes.com/2025/08/07/us/politics/trump-new-economic-numbers.html",
    "summary": "President Trump promoted his own version of reality in the Oval Office after firing the head of the agency that collects employment statistics last week."
  },
  {
    "title": "Netanyahu Says Israel Wants to Take Military Control of All of Gaza",
    "link": "https://www.nytimes.com/2025/08/07/world/middleeast/israel-gaza-military-offensive.html",
    "summary": "But Israel does not want to “keep” or “govern it,” said Prime Minister Benjamin Netanyahu, ahead of a cabinet meeting to discuss expanding military operations in the territory."
  },
  {
    "title": "Swiss Businesses Fear Trump’s 39% Tariff Will Create ‘Worst-Case Scenario’",
    "link": "https://www.nytimes.com/2025/08/07/business/economy/swizterland-tariffs-trump.html",
    "summary": "Goods shipped from the country face a 39 percent tariff in the U.S., which companies warn will have dire consequences if President Trump cannot be quickly dissuaded."
  },
  {
    "title": "Staggering U.S. Tariffs Begin as Trump Widens Trade War",
    "link": "https://www.nytimes.com/2025/08/07/business/economy/trump-tariffs-trade-war.html",
    "summary": "The duties, which the president announced last week, took effect for about 90 countries just after midnight."
  },
  {
    "title": "India Bought Russian Oil. Now It’s a Trade-War Weapon.",
    "link": "https://www.nytimes.com/2025/08/07/business/oil-india-russia-trump.html",
    "summary": "If Narendra Modi surrendered to President Trump, how tough would it be to wean his country from Russia’s discounted supply?"
  },
  {
    "title": "Trump’s Tariffs Could Raise Prices on Many Consumer Goods",
    "link": "https://www.nytimes.com/2025/08/07/business/economy/trump-tariffs-prices-consumers.html",
    "summary": "The tariffs are driving up prices on everyday goods as businesses warn they can no longer absorb costs, leaving consumers to foot the bill."
  },
  {
    "title": "On Vaccines, RFK Jr. Has Broken Sharply With the Mainstream",
    "link": "https://www.nytimes.com/2025/08/07/health/kennedy-vaccines-mrna-trump.html",
    "summary": "While many officials and scientists embrace other parts of the secretary’s agenda, his stance on vaccines is alienating allies who fear a public health crisis."
  },
  {
    "title": "11 Women, 9 Dogs, Not Much Drama (and No Guys)",
    "link": "https://www.nytimes.com/2025/08/07/well/eleven-women-nine-dogs-not-much-drama-and-no-guys.html",
    "summary": "These retired women in Texas have been through infertility, illness, layoffs, addiction and disappointing marriages. Now they are trying to create a utopia just for themselves."
  },
  {
    "title": "Cuomo and Trump, Two ‘Queens Boys,’ Go Way Back",
    "link": "https://www.nytimes.com/2025/08/07/nyregion/andrew-cuomo-trump.html",
    "summary": "President Trump has urged Andrew Cuomo to stay in the New York City mayor’s race. Here are seven moments when their paths crossed over the years."
  },
  {
    "title": "The Rise of Silicon Valley’s Techno-Religion",
    "link": "https://www.nytimes.com/2025/08/04/technology/rationalists-ai-lighthaven.html",
    "summary": "The Rationalists, a community focused on the risks of artificial intelligence, regularly gather with tech figures and other like-minded people in a complex that covers much of a city block."
  },
  {
    "title": "OpenAI Unveils GPT-5, New AI Model, to ChatGPT Users",
    "link": "https://www.nytimes.com/2025/08/07/technology/openai-chatgpt-gpt-5.html",
    "summary": "The A.I. start-up said its new flagship technology was faster, more accurate and less likely to make stuff up."
  },
  {
    "title": "Right-Wing Influence Shaped the Sydney Sweeney Ad Debate",
    "link": "https://www.nytimes.com/2025/08/07/business/sydney-sweeney-ad-right-wing-media.html",
    "summary": "Right-wing commentators suggested there was widespread criticism of Ms. Sweeney over her new ad campaign. There wasn’t, at least at first."
  },
  {
    "title": "Sallie Bingham, Author at the Center of a Newspaper Drama, Dies at 88",
    "link": "https://www.nytimes.com/2025/08/07/business/media/sallie-bingham-dead.html",
    "summary": "A novelist and memoirist, she famously clashed with her brother, leading to the fall of a Kentucky publishing dynasty that her paternal grandfather established in 1918."
  },
  {
    "title": "Why More People in the World Are Feeling Hopeful (Except Us)",
    "link": "https://www.nytimes.com/2025/08/07/opinion/happiness-community-wealth.html",
    "summary": "I would say the most important social trend over the past decade has been the disconnect between our nation’s economic health and its social health."
  },
  {
    "title": "Springsteen Isn’t Who I Thought He Was",
    "link": "https://www.nytimes.com/2025/08/07/opinion/bruce-springsteen-music-poetry.html",
    "summary": "I stopped listening to Bruce Springsteen’s music. I heard something more."
  },
  {
    "title": "Netanyahu Said Israel Wanted to Take Military Control of Gaza",
    "link": "https://www.nytimes.com/2025/08/07/briefing/israel-gaza-trump-tariff-reaction.html",
    "summary": "Also, Kennedy has broken with the mainstream on vaccines. Here’s the latest at the end of Thursday."
  },
  {
    "title": "Do You Own a Car in New York? Tell Us Your Best, or Worst, Parking Story.",
    "link": "https://www.nytimes.com/2025/08/07/nyregion/nyc-parking-stories.html",
    "summary": "We are interested in your most memorable and weirdest tales about parking, even when it seemed impossible."
  },
  {
    "title": "Prosecutor Takes Over Local Police Force in New Jersey After 2 Killings",
    "link": "https://www.nytimes.com/2025/08/07/nyregion/nj-state-trooper-suspect-shootings.html",
    "summary": "An investigation into the shooting deaths of two people and the apparent suicide of a suspect, a state trooper, “raised serious concerns” from the county prosecutor’s office."
  },
  {
    "title": "Canyon Fire in Ventura County Prompts Evacuation Orders for Thousands",
    "link": "https://www.nytimes.com/2025/08/07/us/canyon-fire-ventura-county.html",
    "summary": "The Canyon Fire was initially reported at about 30 acres but had rapidly grown to 1,050 acres in a few hours on Thursday, officials said."
  },
  {
    "title": "Brandon Blackstock, Kelly Clarkson’s Ex-Husband, Dies at 48",
    "link": "https://www.nytimes.com/2025/08/07/us/brandon-blackstock-dead-cancer-kelly-clarkson.html",
    "summary": "The announcement of Mr. Blackstock’s death came one day after Ms. Clarkson said she would be postponing the remainder of her residency in Las Vegas."
  }
]