[
  {
    "title": "Many Fighting Climate Change Worry They Are Losing the Information War",
    "link": "https://www.nytimes.com/2025/11/30/climate/climate-change-disinformation.html",
    "summary": "Shifting politics, intensive lobbying and surging disinformation online have undermined international efforts to respond to the threat."
  },
  {
    "title": "Trump Pauses All Asylum Applications, and China’s Fast-Food Brands Make a Play for the U.S.",
    "link": "https://www.nytimes.com/2025/12/01/podcasts/the-headlines/asylum-applications-military-war-crimes.html",
    "summary": "Plus, how young is too young for a smartphone?"
  },
  {
    "title": "Despite Supreme Court Wins, Elite D.O.J. Unit Has Seen Mass Turnover",
    "link": "https://www.nytimes.com/2025/12/01/us/trump-solicitor-general-supreme-court.html",
    "summary": "Even with an exodus of lawyers, the Office of the Solicitor General has had remarkable success. But fiery rhetoric and close White House ties have raised concerns."
  },
  {
    "title": "In Georgia, the Fight Over 2020 Election Results Looms Over 2026 Midterms",
    "link": "https://www.nytimes.com/2025/12/01/us/trump-georgia-election-interference-midterms.html",
    "summary": "The Justice Department is trying to access ballots cast in 2020, while several officials who were involved in the fight over the election outcome are seeking higher office."
  },
  {
    "title": "With Judge's Ruling, a New Tool for Charging Crime in D.C.",
    "link": "https://www.nytimes.com/2025/12/01/us/politics/trump-federal-grand-juries-washington.html",
    "summary": "The U.S. attorney’s office says it may use local grand juries for serious federal crime in Washington “when appropriate” after a judge signed off on the unusual procedure."
  },
  {
    "title": "Trump-Endorsed Candidate and Sportscaster Lead Honduran Presidential Race",
    "link": "https://www.nytimes.com/2025/11/30/world/americas/honduras-election.html",
    "summary": "On Sunday night, electoral authorities said a preliminary sample of votes showed the two conservative candidates were virtually tied — and far ahead of the governing left-wing party."
  },
  {
    "title": "Lawmakers Suggest Follow-Up Boat Strike Could Be a War Crime",
    "link": "https://www.nytimes.com/2025/11/30/us/politics/trump-boat-strikes-war-crime.html",
    "summary": "Top Republicans have joined Democrats in demanding answers about the escalating military campaign the Trump administration says is aimed at targeting drug traffickers."
  },
  {
    "title": "People Are Ordering Smaller Pizzas and Fewer Toppings. What Does That Tell Us?",
    "link": "https://www.nytimes.com/2025/12/01/business/consumers-pizza-sales.html",
    "summary": "Sales are softening at big chains and independent shops aren’t selling as many extras. Competition, diet trends and consumer anxiety may all be playing a part."
  },
  {
    "title": "Get Ready, America: Here Come China’s Food and Drink Chains",
    "link": "https://www.nytimes.com/2025/12/01/business/china-restaurants-america.html",
    "summary": "China’s fast-food and beverage brands have an opportunity to expand in the United States and escape cutthroat competition at home."
  },
  {
    "title": "For These Businesses, U.S. Tariffs Are a Price Worth Paying",
    "link": "https://www.nytimes.com/2025/12/01/business/uk-small-business-tariffs-trump.html",
    "summary": "Some British business owners are determined to keep their access to American consumers, but they are facing trade-offs."
  },
  {
    "title": "The Transgender Cancer Patient and What She Heard on Tape",
    "link": "https://www.nytimes.com/2025/12/01/nyregion/transgender-patient-records-during-cancer-surgery.html",
    "summary": "Jennifer Capasso had endured multiple tumors. She wondered what might be said during her next cancer surgery. So, she hit record on her phone."
  },
  {
    "title": "Netanyahu’s Pardon Request Borrows From Trump’s Playbook",
    "link": "https://www.nytimes.com/2025/12/01/world/middleeast/netanyahu-pardon-corruption-israel-trump.html",
    "summary": "In many ways, Prime Minister Benjamin Netanyahu’s request mimics how President Trump has assailed his perceived enemies and attacked legal proceedings against him."
  },
  {
    "title": "The Netanyahu Corruption Trial, Explained",
    "link": "https://www.nytimes.com/2024/12/10/world/middleeast/the-netanyahu-corruption-trial-explained.html",
    "summary": "Prime Minister Benjamin Netanyahu asked Israel’s president to pardon him preemptively, before any verdicts were reached in his corruption cases. Here’s what to know about his trial."
  },
  {
    "title": "Inside the Bird-Flu Vaccine Trial for Monk Seals",
    "link": "https://www.nytimes.com/2025/12/01/science/hawaii-bird-flu-h5n1-monk-seals.html",
    "summary": "After the virus returned to Hawaii this fall, testing the shots in the endangered seal species became urgent."
  },
  {
    "title": "Sri Lanka Declares ‘Largest’ Disaster as Cyclone Death Toll Rises to 355",
    "link": "https://www.nytimes.com/2025/12/01/world/asia/sri-lanka-floods-cyclone.html",
    "summary": "The president called the nationwide flooding the largest and most challenging natural disaster in the island’s history, as emergency rescue efforts continue."
  },
  {
    "title": "Outdoor Concerts? Uncovered Hair? Shimmying in Public? Is This Iran?",
    "link": "https://www.nytimes.com/2025/12/01/world/middleeast/iran-loosening-social-restrictions.html",
    "summary": "Young people across Iran have been leading a dramatic change in social mores in recent months. “We have a fearless young generation that is breaking taboos.”"
  },
  {
    "title": "What Jamaica Wants After Deadly Hurricane? Visit Us, Island Says.",
    "link": "https://www.nytimes.com/2025/12/01/us/hurricane-jamaica-tourism.html",
    "summary": "Tourism accounts for nearly a third of Jamaica’s economy, so officials are rushing to reopen dozens of hotels in time to salvage the vital winter travel season."
  },
  {
    "title": "Having a Cellphone at Younger Than 12 Could Carry Health Risks, Study Says",
    "link": "https://www.nytimes.com/2025/12/01/well/family/early-smartphone-ownership-study.html",
    "summary": "Researchers found higher rates of depression, poor sleep and obesity among tweens who had early access to a cellphone."
  },
  {
    "title": "Our 2025 Cookie Week Recipes Are Here",
    "link": "https://cooking.nytimes.com/article/2025-cookie-week-recipes",
    "summary": "This year’s Cookie Week recipes are inspired by the flavors of treats we love, like mint chocolate chip ice cream, Vietnamese coffee and gingery Dark ’n’ Stormy cocktails."
  },
  {
    "title": "This Is the Story of How the Democrats Blew It on Gaza",
    "link": "https://www.nytimes.com/2025/12/01/opinion/democrats-israel.html",
    "summary": "It may be tempting to memory hole what happened in Gaza. That would only compound the mistake of ignoring, or rationalizing, an intolerable reality."
  },
  {
    "title": "Why Hepatitis B Vaccine Changes Would be Devastating",
    "link": "https://www.nytimes.com/2025/12/01/opinion/hepatitis-b-vaccine.html",
    "summary": "Changes to the vaccine recommendation could be disastrous."
  },
  {
    "title": "Millions Under Winter Storm Watch as Potential Nor’easter Approaches",
    "link": "https://www.nytimes.com/2025/12/01/us/snowstorm-noreaster-northeast-new-england.html",
    "summary": "Forecasters expected the storm to track up the Eastern Seaboard Monday night into Tuesday, leaving as much as a foot of snow in parts of the Northeast."
  },
  {
    "title": "Supreme Court to Hear Copyright Battle Over Online Music Piracy",
    "link": "https://www.nytimes.com/2025/12/01/us/politics/supreme-court-copyright-music-piracy.html",
    "summary": "At issue is whether internet providers can be held liable for repeated copyright infringements of users, with potentially billions of dollars on the line."
  },
  {
    "title": "What to Know About Luigi Mangione’s Court Hearing This Week",
    "link": "https://www.nytimes.com/2025/12/01/nyregion/mangione-hearing-what-to-know.html",
    "summary": "Lawyers for Mr. Mangione, accused of killing a health insurance executive in Manhattan, will ask a judge to throw out evidence gathered when he was arrested in Pennsylvania."
  },
  {
    "title": "Battle for New York City Casino Licenses Reaches Final Phase",
    "link": "https://www.nytimes.com/2025/12/01/nyregion/nyc-casino-license.html",
    "summary": "A state board is scheduled to recommend licenses for as many as three full-fledged casinos to the state’s gaming commission, which is expected to follow the recommendations."
  }
]