[
  {
    "title": "Newly Unbound, Trump Weighs More Nuclear Arms and Underground Tests",
    "link": "https://www.nytimes.com/2026/02/09/us/politics/trump-nuclear-arms-underground-tests.html",
    "summary": "It remains to be seen whether the three big nuclear powers are headed into a new arms race, or whether President Trump is trying to spur negotiations on a new accord now that a last Cold War treaty has expired."
  },
  {
    "title": "Trump Administration to Cut $600 Million in Health Funding From Four States",
    "link": "https://www.nytimes.com/2026/02/09/health/trump-public-health-cuts-california.html",
    "summary": "The states, all led by Democrats, used the grants to support a wide variety of functions, including H.I.V. prevention and surveillance."
  },
  {
    "title": "Gateway Funding Doesn’t Have to Be Immediately Restored, Judge Says",
    "link": "https://www.nytimes.com/2026/02/09/nyregion/gateway-rail-tunnel-funding-new-york.html",
    "summary": "A federal judge had ordered the funding for a $16 billion tunnel project restored last week, but on Monday granted a temporary stay after the federal government appealed her decision."
  },
  {
    "title": "Trump Is a Global ‘Wrecking Ball,’ European Security Experts Say",
    "link": "https://www.nytimes.com/2026/02/09/world/europe/trump-munich-conference-security-report.html",
    "summary": "The organizers of the Munich Security Conference, Europe’s main defense-related forum, said in a report that President Trump is helping destroy the postwar international order."
  },
  {
    "title": "Judge Strikes Down California’s Ban on Masks for Federal Agents",
    "link": "https://www.nytimes.com/2026/02/09/us/judge-rejects-california-mask-ban-ice.html",
    "summary": "The state can require federal agents to display identification, the judge said. The Trump administration had asked the court to block both laws, which were designed to help identify federal agents."
  },
  {
    "title": "A Raid in a Small Town Brings Trump’s Deportations to Deep-Red Idaho",
    "link": "https://www.nytimes.com/2026/02/09/us/politics/trump-deportation-idaho.html",
    "summary": "Wilder, Idaho, prided itself on comity. Then federal agents stormed a racetrack outside of town in October, and the reverberations are still shaking the community."
  },
  {
    "title": "Hungry Families, ICE and Secret Grocery Networks in Minneapolis",
    "link": "https://www.nytimes.com/2026/02/09/dining/minneapolis-ice-grocery-stores-hunger.html",
    "summary": "As immigrants become increasingly afraid to leave their homes for fear of being detained, access to food, including free school lunches, is being cut off."
  },
  {
    "title": "Bomb Threats Referring to Haitian Immigrants Disrupt Springfield, Ohio",
    "link": "https://www.nytimes.com/2026/02/09/us/bomb-threats-springfield-ohio-haitians.html",
    "summary": "Schools, city offices and businesses were locked down in Springfield, Ohio, where more than 10,000 Haitians have settled in recent years."
  },
  {
    "title": "New Email Shows Bard President Leon Botstein Thanked Epstein for Caribbean Trip",
    "link": "https://www.nytimes.com/2026/02/09/us/bard-leon-botstein-jeffrey-epstein-relationship.html",
    "summary": "Leon Botstein, Bard’s president, also invited Jeffrey Epstein to visit a high school linked to Bard College and sent him well wishes after stories were published about his sexual abuse of minors."
  },
  {
    "title": "Allies Back Keir Starmer Amid Pressure to Resign Over Epstein Turmoil",
    "link": "https://www.nytimes.com/2026/02/09/world/europe/keir-starmer-uk-communications-resigns.html",
    "summary": "Senior U.K. ministers closed ranks after a senior Labour politician urged the prime minister to step down over a scandal involving an ambassador with close ties to Jeffrey Epstein."
  },
  {
    "title": "Oz Offers Forceful Call for Measles Vaccination",
    "link": "https://www.nytimes.com/2026/02/09/well/dr-mehmet-oz-measles-vaccine.html",
    "summary": "The comments by the Centers for Medicare and Medicaid Services director come as South Carolina grapples with a large measles outbreak."
  },
  {
    "title": "Bad Bunny Super Bowl Halftime Review: A History Lesson Full of Puerto Rican Pride",
    "link": "https://www.nytimes.com/2026/02/09/arts/music/bad-bunny-super-bowl-halftime-show-review.html",
    "summary": "The superstar showcased Puerto Rican pride during a 13-minute set that turned a global opportunity into an intimate, personal performance."
  },
  {
    "title": "Israel Gives Itself More Control Over Occupied West Bank",
    "link": "https://www.nytimes.com/2026/02/09/world/middleeast/israel-settlements-west-bank.html",
    "summary": "The security cabinet took actions that make it easier for Jews to buy land in the territory. Critics say the changes violate the Oslo Accords and international law and accelerate attempts to annex the land."
  },
  {
    "title": "Australia Visit by President Herzog of Israel Prompts Protest",
    "link": "https://www.nytimes.com/2026/02/09/world/australia/israel-herzog-visit-protests.html",
    "summary": "Amid activists’ objections, Prime Minister Anthony Albanese had invited President Isaac Herzog to visit to honor the victims of the Bondi Beach shooting."
  },
  {
    "title": "Savannah Guthrie Says She Believes Her Mom, Nancy, ‘Is Still Out There’ in New Video",
    "link": "https://www.nytimes.com/2026/02/09/us/savannah-guthrie-kidnapping-video.html",
    "summary": "The television host pleaded for the public’s help in finding her mother, Nancy, who disappeared from her Arizona home last week. “We are at an hour of desperation,” she said."
  },
  {
    "title": "Air Canada Cancels Flights to Cuba as Cuba Runs Out of Jet Fuel",
    "link": "https://www.nytimes.com/2026/02/09/world/americas/air-canada-flight-cancellations-cuba-jet-fuel.html",
    "summary": "The Trump administration’s crackdown on oil shipments to Cuba is beginning to wreak havoc on the Caribbean island’s travel industry."
  },
  {
    "title": "Ilia Malinin, Who Led the U.S. to Gold, Is Bringing Ice Skating Back Into the Limelight",
    "link": "https://www.nytimes.com/2026/02/09/world/olympics/ilia-malinin-ice-skating-winter-olympics.html",
    "summary": "Ilia Malinin, who led the United States to a team gold medal at the Winter Olympics and will now vie for his own, is testing the physical limits of what is possible on the ice."
  },
  {
    "title": "Catherine O’Hara Died From Pulmonary Embolism, Death Certificate Says",
    "link": "https://www.nytimes.com/2026/02/09/movies/catherine-ohara-cause-of-death.html",
    "summary": "A death certificate released on Monday also said rectal cancer was an underlying cause for the comedic actress’s death on Jan. 30 at 71."
  },
  {
    "title": "Will This High School Coach Get to 973 Wins Before He Gets Fired?",
    "link": "https://www.nytimes.com/2026/02/09/nyregion/ron-naclerio-basketball-cardozo-nyc.html",
    "summary": "After 45 years coaching basketball in Queens, Ron Naclerio was a shoo-in for the Hall of Fame. Then his victory lap got complicated."
  },
  {
    "title": "2 to 3 Cups of Coffee a Day May Reduce Dementia Risk. But Not if It’s Decaf.",
    "link": "https://www.nytimes.com/2026/02/09/health/coffee-tea-dementia-risk.html",
    "summary": "One to two cups of caffeinated tea per day helps too, researchers found after following nearly 132,000 people for 40 years."
  },
  {
    "title": "The Latest Victim of a Snowless West: Dog Sledding",
    "link": "https://www.nytimes.com/2026/02/09/travel/sled-dog-races-canceled-western-united-states.html",
    "summary": "Organizers of the Idaho Sled Dog Challenge said they would no longer hold a major competition after snow conditions forced its cancellation for a third straight year."
  },
  {
    "title": "In the New Jersey Primary, ‘Abolish ICE’ Looks Like a Winning Message",
    "link": "https://www.nytimes.com/2026/02/09/opinion/new-jersey-democratic-anger.html",
    "summary": "Trump has thrust us into a new political world, and Democratic voters want leaders who can adapt."
  },
  {
    "title": "Bad Bunny’s Halftime Show",
    "link": "https://www.nytimes.com/2026/02/09/opinion/bad-bunny-super-bowl-americans.html",
    "summary": "We weren’t prepared for the emotional roller coaster Bad Bunny Benito Antonio Martínez Ocasio, took us on."
  },
  {
    "title": "Britain’s Leader Faces Pressure Over Epstein Turmoil",
    "link": "https://www.nytimes.com/2026/02/09/briefing/britain-keir-starmer-mountain-lions-california.html",
    "summary": "Also, California tries to help its mountain lions. Here’s the latest at the end of Monday."
  },
  {
    "title": "Meta and YouTube Created ‘Digital Casinos,’ Lawyers Argue in Landmark Trial",
    "link": "https://www.nytimes.com/2026/02/09/technology/social-media-addiction-trial.html",
    "summary": "Opening statements began in a trial claiming social media companies design addictive products that cause personal injury."
  },
  {
    "title": "Iran Detains Opposition Leaders Following Talks with Trump Administration",
    "link": "https://www.nytimes.com/2026/02/09/world/europe/iran-detains-prominent-opposition-figures-expanding-crackdown-on-dissent.html",
    "summary": "The detentions of politicians from Iran’s reformist opposition follow mass arrests and a string of repression tactics aimed at preventing further anti-government unrest."
  },
  {
    "title": "From Fishing Nets to Furniture: Turning Ocean Plastic Into Usable Products",
    "link": "https://www.nytimes.com/2026/02/09/business/gravity-wave-conservation.html",
    "summary": "A brother-and-sister team in Spain started a sustainable business model recycling old and damaged nets into stadium seating and decorations."
  },
  {
    "title": "A Gray Wolf’s Visit to Los Angeles County Is a First in Nearly a Century",
    "link": "https://www.nytimes.com/2026/02/09/us/gray-wolf-los-angeles-california.html",
    "summary": "The wolf, known as BEY03F, roamed more than 500 miles from Northern California, signaling that the species continues to rebound after being wiped out in the 1920s."
  }
]