[
  {
    "title": "Swiss Bar Fire Likely Caused By Sparklers, Authorities Say",
    "link": "https://www.nytimes.com/2026/01/02/world/europe/switzerland-ski-resort-bar-fire-crans-montana.html",
    "summary": "Fireworks attached to bottles of Champagne sent up showers of sparks that appear to have ignited insulation in a bar. The blaze killed 40 people."
  },
  {
    "title": "There Was Probably a Flashover in the Swiss Bar Fire. Here’s What That Means.",
    "link": "https://www.nytimes.com/2026/01/02/world/europe/switzerland-resort-bar-fire-flashover.html",
    "summary": "A flashover is an event where an entire room is rapidly engulfed in flames."
  },
  {
    "title": "In Trump’s Second Year, Congress Weighs How to Reassert Its Power",
    "link": "https://www.nytimes.com/2026/01/02/us/politics/trump-congress-power-republicans-democrats.html",
    "summary": "Lawmakers head into President Trump’s second year facing questions about whether they can reclaim congressional clout in the face of his power grab."
  },
  {
    "title": "After Watergate, the Presidency Was Tamed. Trump Is Unleashing It.",
    "link": "https://www.nytimes.com/2026/01/02/us/politics/president-trump-powers-watergate.html",
    "summary": "In the 1970s, Congress passed a raft of laws to hold the White House accountable. President Trump has decided they don’t apply to him."
  },
  {
    "title": "Stephen Schwartz Criticizes Kennedy Center, Saying He Won’t Host Gala",
    "link": "https://www.nytimes.com/2026/01/02/arts/stephen-schwartz-kennedy-center-opera-gala.html",
    "summary": "The Washington National Opera said the “Wicked” composer was scheduled to host its annual event at the center this spring."
  },
  {
    "title": "Trump Super PAC Raised More Than $100 Million in Recent Months",
    "link": "https://www.nytimes.com/2026/01/02/us/politics/trump-super-pac-maga-inc-fundraising.html",
    "summary": "The haul highlights how the president’s team has continued aggressive fund-raising from donors with interests before the administration."
  },
  {
    "title": "Israeli Government Accuses Mamdani of Antisemitism Over Canceled Orders",
    "link": "https://www.nytimes.com/2026/01/02/nyregion/mamdani-israel-executive-orders.html",
    "summary": "Mayor Zohran Mamdani of New York canceled executive orders issued by his predecessor that had barred city agencies from boycotting Israel and defined some criticism of Israel as antisemitic."
  },
  {
    "title": "Democratic Socialists Celebrate Mayor Mamdani With a Rave in Brooklyn",
    "link": "https://www.nytimes.com/2026/01/02/style/mamdani-paragon-brooklyn-democratic-socialist.html",
    "summary": "Democratic Socialists gathered at a Bushwick dance club to celebrate as one of their members began to govern New York City."
  },
  {
    "title": "Mamdani Creates Office to Encourage Public Participation in Government",
    "link": "https://www.nytimes.com/2026/01/02/nyregion/mamdani-appointments.html",
    "summary": "Mayor Zohran Mamdani of New York said he hoped to reach communities that had been left out of the process."
  },
  {
    "title": "‘Chinese Peptides’ Are the Latest Biohacking Trend in the Tech World",
    "link": "https://www.nytimes.com/2026/01/03/business/chinese-peptides-silicon-valley.html",
    "summary": "The gray-market drugs flooding Silicon Valley reveal a community that believes it can move faster than the F.D.A."
  },
  {
    "title": "Boredom Is the Latest Online Trend Trying to Sharpen Young People’s Short Attention Spans",
    "link": "https://www.nytimes.com/2026/01/01/style/boredom-online-trend-influencers-tiktok.html",
    "summary": "Boredom, or an approximation of it, is an online trend for young people trying to sharpen their attention spans."
  },
  {
    "title": "A Study Is Retracted, Renewing Concerns About the Weedkiller Roundup",
    "link": "https://www.nytimes.com/2026/01/02/climate/glyphosate-roundup-retracted-study.html",
    "summary": "Problems with a 25-year-old landmark paper on the safety of Roundup’s active ingredient, glyphosate, have led to calls for the E.P.A. to reassess the widely used chemical."
  },
  {
    "title": "Trump Says He Takes a High Daily Dose of Aspirin. How Safe Is That?",
    "link": "https://www.nytimes.com/2026/01/02/well/trump-health-asprin-dosage-blood.html",
    "summary": "Despite his doctors’ recommendations, President Trump takes a high dose."
  },
  {
    "title": "California’s Latest Storm Brings Flooding to San Francisco Bay Area",
    "link": "https://www.nytimes.com/2026/01/02/weather/california-rain-forecast.html",
    "summary": "The state has seen a nonstop run of storms in recent weeks. This one is expected to bring heavy rain through the weekend."
  },
  {
    "title": "Diane Crump, First Woman to Ride in Kentucky Derby, Dies at 77",
    "link": "https://www.nytimes.com/2026/01/02/obituaries/diane-crump-dead.html",
    "summary": "She was the first professional female jockey to compete at a track in the United States where betting was legal, and notched up 228 career victories."
  },
  {
    "title": "Saks C.E.O. Steps Down as Company Struggles to Pay Down Debt",
    "link": "https://www.nytimes.com/2026/01/02/business/saks-ceo-marc-metrick-steps-down.html",
    "summary": "Saks Global’s executive chairman, Richard Baker, is taking over the luxury retailer he created with the 2024 acquisition of Neiman Marcus and Bergdorf Goodman."
  },
  {
    "title": "Coast Guard Suspends Search for Survivors of Latest Boat Strikes",
    "link": "https://www.nytimes.com/2026/01/02/us/politics/coast-guard-survivors-boat-strikes.html",
    "summary": "The service said that conditions in the area where the search was taking place included nine-foot seas and winds approaching 50 miles per hour."
  },
  {
    "title": "Oil Tanker Fleeing U.S. Coast Guard Broadcasts Location in North Atlantic",
    "link": "https://www.nytimes.com/2026/01/02/us/politics/oil-tanker-russia-north-atlantic.html",
    "summary": "Russia requested this week that the United States end its pursuit of the vessel, which was intercepted in the Caribbean on its way to pick up oil in Venezuela."
  },
  {
    "title": "Carrying for a Cause: Meet the Man Lugging Shelter Dogs Around New York",
    "link": "https://www.nytimes.com/2026/01/02/nyregion/dog-backpack-adopt.html",
    "summary": "Bryan Reisberg built a social media following in the millions by carrying his corgi, Maxine, in a backpack. Now, he carries shelter dogs."
  },
  {
    "title": "Trump Is the Jan. 6 President",
    "link": "https://www.nytimes.com/2025/12/31/opinion/jan-6-anniversary-trump-politics.html",
    "summary": "Tragically, America is still living in a political era that began on Jan. 6, 2021."
  },
  {
    "title": "Self-Driving Cars Can’t See Without Their Eyes",
    "link": "https://www.nytimes.com/2026/01/02/opinion/ai-self-driving-cars-workers.html",
    "summary": "The unseen workers who help train A.I."
  },
  {
    "title": "Federal Appeals Court Says California Open-Carry Ban Is Unconstitutional",
    "link": "https://www.nytimes.com/2026/01/02/us/ninth-circuit-california-gun-law.html",
    "summary": "A Ninth Circuit panel said the ban ran afoul of a 2022 Supreme Court ruling that required courts to evaluate gun laws based on the country’s “historical tradition of firearm regulation.”"
  },
  {
    "title": "Lenny Dykstra Faces Charges After Police Find Drugs During Traffic Stop",
    "link": "https://www.nytimes.com/2026/01/03/us/lenny-dykstra-drugs-charges.html",
    "summary": "The Pennsylvania police did not say what charges would be filed against the former baseball star. His lawyer said the drugs were not Mr. Dykstra’s."
  },
  {
    "title": "Software Error Will Force 325,000 Californians to Replace Real IDs",
    "link": "https://www.nytimes.com/2026/01/02/us/california-real-id-dmv-error.html",
    "summary": "Some state-issued identification cards issued to legal immigrants could be valid longer than the people holding them are allowed to remain in the United States, state officials said."
  },
  {
    "title": "2 Navy Service Members Accused of Entering Sham Marriages With Chinese Nationals",
    "link": "https://www.nytimes.com/2026/01/02/us/politics/navy-sham-marriage-chinese-nationals.html",
    "summary": "Federal prosecutors say two female service members are facing fraud charges after having accepted thousands of dollars for the marriages."
  }
]