[
  {
    "title": "Trump’s Laissez-Faire Stance Gives Netanyahu Free Pass for Gaza Escalation",
    "link": "https://www.nytimes.com/2025/09/16/world/middleeast/trump-netanyahu-gaza-escalation.html",
    "summary": "As Israel mounts a major Gaza offensive, President Trump has neither urged restraint nor endorsed the action, which Israel’s leader has taken as an implicit green light to proceed."
  },
  {
    "title": "Israeli Ground Forces Move Into Gaza City, Sowing Chaos",
    "link": "https://www.nytimes.com/2025/09/16/world/middleeast/gaza-city-israel-invasion.html",
    "summary": "The long-anticipated military assault is aimed, the Israelis said, at routing the militants of Hamas, but it deepened the humanitarian crisis in the Gaza Strip."
  },
  {
    "title": "Satellite Images Show Israeli Military Buildup Around Gaza City",
    "link": "https://www.nytimes.com/2025/09/16/world/middleeast/gaza-satellite-images-israel-war.html",
    "summary": "The images show Israeli armored vehicles in multiple places along the outskirts of the city on Tuesday morning, after Israel said it had begun its armed offensive into the city."
  },
  {
    "title": "Robert Redford, Screen Idol Turned Director and Activist, Dies at 89",
    "link": "https://www.nytimes.com/2025/09/16/movies/robert-redford-dead.html",
    "summary": "He made serious topics like grief and political corruption resonate with the masses, in no small part because of his own star power."
  },
  {
    "title": "Robert Redford, American Style Icon",
    "link": "https://www.nytimes.com/2025/09/16/style/robert-redford-style-fashion.html",
    "summary": "Reluctant to focus on style or his looks, Mr. Redford nevertheless became the embodiment of an enduring aesthetic."
  },
  {
    "title": "Bob Woodward Remembers Robert Redford",
    "link": "https://www.nytimes.com/2025/09/16/business/media/bob-woodward-robert-redford.html",
    "summary": "Mr. Woodward said Mr. Redford, who portrayed him in the classic 1976 film “All the President’s Men,” was a “genuine, a noble and principled force for good.”"
  },
  {
    "title": "Meryl Streep, Barbra Streisand and Others Mourn Robert Redford",
    "link": "https://www.nytimes.com/2025/09/16/arts/robert-redford-death-celebrity-reactions.html",
    "summary": "Redford “stood for an America we have to keep fighting for,” his frequent collaborator Jane Fonda said after his death was announced on Tuesday."
  },
  {
    "title": "State Terrorism Charges Against Luigi Mangione Are Dismissed",
    "link": "https://www.nytimes.com/2025/09/16/nyregion/luigi-mangione-state-terrrorism-charges-dismissed.html",
    "summary": "The judge overseeing the case against Mr. Mangione said the evidence underpinning two of the most serious counts, one of which charged him with first-degree murder, was “legally insufficient.”"
  },
  {
    "title": "Howard Lutnick, the Pierre Hotel and Claims of a Secret Plan",
    "link": "https://www.nytimes.com/2025/09/16/business/lutnick-pierre-hotel.html",
    "summary": "Some residents of the Pierre claim that Howard Lutnick, who owns the penthouse, was part of a plot to sell off this symbol of Manhattan glamour and wealth."
  },
  {
    "title": "G.O.P. Again Cedes Power on Tariffs to Avoid Crossing Trump",
    "link": "https://www.nytimes.com/2025/09/16/us/politics/republicans-house-tariffs-emergency-trump.html",
    "summary": "House Republicans extended a maneuver they engineered earlier in the year that effectively strips Congress of the power to disapprove of President Trump’s tariffs."
  },
  {
    "title": "House Passes D.C. Crime Bills as Trump Crackdown Continues",
    "link": "https://www.nytimes.com/2025/09/16/us/politics/house-dc-crime-bills.html",
    "summary": "The legislation is part of a package that House Republicans are pushing to impose more federal control over the District in line with President Trump’s demands."
  },
  {
    "title": "Trump Sues The New York Times For Articles Questioning His Success",
    "link": "https://www.nytimes.com/2025/09/16/business/media/trump-lawsuit-new-york-times.html",
    "summary": "The lawsuit, filed by the president in federal court in Florida, claims The Times defamed him and sought to undermine his campaign in the 2024 election."
  },
  {
    "title": "Former C.D.C. Director to Tell Lawmakers She Was ‘Fired for Holding the Line’",
    "link": "https://www.nytimes.com/2025/09/16/us/politics/cdc-monarez-testimony-rfk.html",
    "summary": "Susan Monarez is set to provide her first detailed account of her ouster in testimony before the Senate Health Committee on Wednesday."
  },
  {
    "title": "Cassidy, His Job in Peril, Scrutinizes Kennedy on Vaccines",
    "link": "https://www.nytimes.com/2025/09/16/us/politics/bill-cassidy-vaccines-rfk-kennedy.html",
    "summary": "Senator Bill Cassidy, a Republican physician and vaccine proponent who is facing a primary challenge from the right, has a fraught relationship with the health secretary."
  },
  {
    "title": "Surgeon General Nominee Pledges to Divest From Wellness Interests",
    "link": "https://www.nytimes.com/2025/09/16/health/casey-means-financial-invesments-surgeon-general.html",
    "summary": "In financial filings, Casey Means stated that she would liquidate holdings in companies that sell personal devices, supplements, tobacco and tech."
  },
  {
    "title": "California’s Environmental Past Confronts Economic Worries of the Present",
    "link": "https://www.nytimes.com/2025/09/16/us/california-environment-democrats-newsom.html",
    "summary": "Gov. Gavin Newsom and Democratic state lawmakers have focused on pocketbook concerns this year, seeing their party’s national losses as a reckoning."
  },
  {
    "title": "California’s High Gas Prices Could Climb Further as Refineries Close",
    "link": "https://www.nytimes.com/2025/09/16/business/energy-environment/california-gas-prices-oil-refineries.html",
    "summary": "The state has led the country in adopting electric cars and reducing gas use, but it now faces much higher gas prices as oil companies plan to shut down refineries."
  },
  {
    "title": "‘People Are Losing Hope’: Suicide Risk Is Rife in ICE Detention Centers",
    "link": "https://www.nytimes.com/2025/09/16/health/ice-homeland-security-immigration-detention.html",
    "summary": "Immigrant detainees are not receiving proper mental health care, lawyers and advocacy groups say, and reports of suicide attempts are persistent."
  },
  {
    "title": "Whistle-Blower Account Contradicts Government’s Claims on Guatemalan Children",
    "link": "https://www.nytimes.com/2025/09/16/us/politics/whistleblower-congress-guatemalan-children.html",
    "summary": "A report filed to Congress on Tuesday alleges the Trump administration concealed data showing that dozens of children it sought to deport faced serious harm back in Guatemala."
  },
  {
    "title": "Joe Manchin Would Like a Word. (OK, Maybe Several Words.)",
    "link": "https://www.nytimes.com/2025/09/16/us/politics/joe-manchin.html",
    "summary": "The voluble former senator, now retired from politics, appears to miss the arena and is mulling a return to it."
  },
  {
    "title": "Our Allies Are Asking: ‘Why Does Putin Still Own Trump?’",
    "link": "https://www.nytimes.com/2025/09/16/opinion/trump-putin-russia-ukraine.html",
    "summary": "Ukrainian and European officials, analysts and entrepreneurs keep asking privately, “What’s up with Trump?”"
  },
  {
    "title": "Why the Kirk Assassination Is a Warning to the Left",
    "link": "https://www.nytimes.com/2025/09/16/opinion/charlie-kirk-assassination-left-violence.html",
    "summary": "Progressives need a cure for political desperation and despair."
  },
  {
    "title": "Prosecutors Seek Death Penalty in Killing of Charlie Kirk",
    "link": "https://www.nytimes.com/2025/09/16/briefing/charges-charlie-kirk-killing-israel-gaza-city.html",
    "summary": "Also, Israeli troops pushed into Gaza City. Here’s the latest at the end of Tuesday."
  },
  {
    "title": "Asylum Seeker Wins Bid to Delay Deportation Under U.K.-France Treaty",
    "link": "https://www.nytimes.com/2025/09/16/world/europe/small-boat-migrant-uk-france-treaty.html",
    "summary": "The case was the first challenge relating to the treaty, which aims to reduce small-boat crossings of the English Channel by migrants, to reach London’s High Court."
  },
  {
    "title": "Ex-Midshipman Is Charged in Threat That Led to 2 Injuries at U.S. Naval Academy",
    "link": "https://www.nytimes.com/2025/09/16/us/naval-academy-threat-arrest.html",
    "summary": "The threat, which was made on social media, caused fears of an active shooter on the campus last week, leading to one person being shot and another injured."
  },
  {
    "title": "Pat Crowley, Veteran Actress of Film and TV, Dies at 91",
    "link": "https://www.nytimes.com/2025/09/16/arts/pat-crowley-dead.html",
    "summary": "Named the year’s “new star” at the 1954 Golden Globes, she appeared alongside the biggest names of her time. She later embarked on a long career in television."
  },
  {
    "title": "Tropical System Could Bring Heavy Rain to Southern California This Week",
    "link": "https://www.nytimes.com/2025/09/16/weather/california-rain-tropical-storm-mario-forecast.html",
    "summary": "The remains of Tropical Storm Mario could bring flooding to the Los Angeles area. Dry storms with lightning could ignite wildfires in Northern California."
  }
]