[
  {
    "title": "Biden Says He Made the Clemency Decisions Recorded With Autopen",
    "link": "https://www.nytimes.com/2025/07/13/us/politics/biden-pardon-autopen-trump.html",
    "summary": "Donald J. Trump and his allies have begun investigations to support their claims that Joseph R. Biden Jr. was incapacitated and his staff conspired to take presidential actions in his name."
  },
  {
    "title": "Excerpts From The Times’s Interview With Biden on Clemency Decisions",
    "link": "https://www.nytimes.com/2025/07/13/us/politics/biden-clemency-interview.html",
    "summary": "The former president said he “made every single one of those” decisions and that Republicans were questioning them because “they’ve done so badly” and wanted to shift the focus."
  },
  {
    "title": "Heavy Rain Pounds Central Texas, Forcing a Halt to Search Efforts",
    "link": "https://www.nytimes.com/2025/07/13/weather/texas-rain-flooding.html",
    "summary": "Flood warnings were in effect in several areas, including ones that were devastated by the July 4 floods. By the afternoon, the rain had eased up in some parts, and some rescuers resumed their work."
  },
  {
    "title": "Texas Floods Bring Grief and Prayer to Local Churches",
    "link": "https://www.nytimes.com/2025/07/13/us/texas-floods-churches-grief.html",
    "summary": "At services in the stricken Hill Country and elsewhere, ministers spoke Sunday morning about sorrow and solace, community and hope, as more rain beat down."
  },
  {
    "title": "Noem Defends FEMA Response to Texas Flooding and Says Trump Wants Agency ‘Remade,’ Not Cut",
    "link": "https://www.nytimes.com/2025/07/13/us/politics/kristi-noem-trump-texas-floods-fema.html",
    "summary": "The homeland security secretary said a report that thousands of calls to a disaster hotline went unanswered because of staffing cuts was “false.”"
  },
  {
    "title": "Trump Is Gutting Weather Science and Reducing Disaster Response",
    "link": "https://www.nytimes.com/2025/07/13/climate/floods-trump-cuts-disaster-preparedness-fema.html",
    "summary": "As a warming planet delivers more extreme weather, experts warn that the Trump administration is dismantling the government’s disaster capabilities."
  },
  {
    "title": "The NATO leader will meet with Trump and other top officials in Washington this week.",
    "link": "https://www.nytimes.com/live/2025/07/13/us/trump-news/the-nato-leader-will-meet-with-trump-and-other-top-officials-in-washington-this-week",
    "summary": ""
  },
  {
    "title": "Ex-Secret Service Director Denies She Failed to Send Agents to Protect Trump",
    "link": "https://www.nytimes.com/2025/07/13/us/politics/ex-secret-service-director-senate-report.html",
    "summary": "Kimberly A. Cheatle, who resigned after Donald J. Trump was grazed by a bullet as a candidate a year ago, pushed back against findings in a Senate report released on Sunday."
  },
  {
    "title": "To Sidestep Trump Tariffs, Asian Nations Seek New Trade Partners",
    "link": "https://www.nytimes.com/2025/07/13/business/economy/trump-tariffs-trade-deals.html",
    "summary": "Most nations are still negotiating in hopes of avoiding punitive import taxes. At the same time, they’re looking for trading partners as a way around the United States."
  },
  {
    "title": "How Trump’s Latest Tariff Threat Risks Deeper Damage to Europe’s Economy",
    "link": "https://www.nytimes.com/2025/07/13/business/trump-tariffs-europe-economy.html",
    "summary": "Economists had already downgraded growth for the European Union, and the new duties would hit industries there especially hard. Companies are looking for ways to blunt the impact."
  },
  {
    "title": "So Your Doctor Is a DO. Does That Matter?",
    "link": "https://www.nytimes.com/2025/07/13/well/osteopath-doctor-health.html",
    "summary": "The number of osteopathic doctors has increased dramatically. People still don’t know what they are."
  },
  {
    "title": "State Trooper Is Among Multiple Victims in Kentucky Shooting, Officials Say",
    "link": "https://www.nytimes.com/2025/07/13/us/kentucky-shooting-church-state-trooper.html",
    "summary": "The episodes, which left the shooter dead, started with a traffic stop near an airport and ended at a church in Lexington, Ky., where four people were shot, the authorities said."
  },
  {
    "title": "Factories Were Pushed Out of Cities. Their Return Could Revive Downtowns.",
    "link": "https://www.nytimes.com/2025/07/13/business/factories-manufacturing-cities-zoning.html",
    "summary": "Changes in zoning rules have allowed small manufacturers to return to the districts and neighborhoods they began leaving a century ago."
  },
  {
    "title": "With $217 Million in Ticket Sales, ‘Superman’ Helps Save Warner Bros., Too",
    "link": "https://www.nytimes.com/2025/07/13/business/media/superman-warner-bros-box-office.html",
    "summary": "The film is the latest part of a startling turnaround for the studio, which has now released five consecutive hits."
  },
  {
    "title": "MAGA Is Tearing Itself Apart Over Jeffrey Epstein",
    "link": "https://www.nytimes.com/2025/07/13/opinion/epstein-files-trump-maga.html",
    "summary": "What happens when Trump becomes the “deep state”?"
  },
  {
    "title": "A Grand Canyon Access Point Is Closed as 19,000 Acres Burn Nearby",
    "link": "https://www.nytimes.com/2025/07/12/us/wildfires-grand-canyon-north-rim-closed.html",
    "summary": "Two wildfires have consumed more than 45,000 acres and destroyed as many as 80 structures in the Grand Canyon."
  },
  {
    "title": "Macron Increases Military Spending, Saying Freedom Is Threatened",
    "link": "https://www.nytimes.com/2025/07/13/world/europe/macron-france-military-spending.html",
    "summary": "“You have to be feared in this world,” President Emmanuel Macron said, preparing France for an era in which it may no longer be able to count on the U.S."
  }
]