[
  {
    "title": "James Comey, Former FBI Director, Indicted After Pressure From Trump",
    "link": "https://www.nytimes.com/2025/09/25/us/politics/james-comey-indicted.html",
    "summary": "The move came after the president intensified his pressure campaign on the Justice Department in recent days, publicly demanding that top officials prosecute Mr. Comey."
  },
  {
    "title": "With Comey Indictment, Trump Gets Retribution but Shatters Norms",
    "link": "https://www.nytimes.com/2025/09/25/us/politics/trump-retribution-comey-indictment.html",
    "summary": "A prosecutor’s drive to indict James Comey trampled over the Justice Department’s long tradition of keeping a distance from politics and the White House, and raised the prospect of more arbitrary charges."
  },
  {
    "title": "Who Might the Trump Administration Go After Next?",
    "link": "https://www.nytimes.com/2025/09/26/business/dealbook/trump-soros-hoffman.html",
    "summary": "The president suggested more foes, including the billionaire Democratic donors George Soros and Reid Hoffman, could face legal scrutiny. Could others follow?"
  },
  {
    "title": "A Norm-Shattering Indictment, and Amazon’s $2.5 Billion Settlement",
    "link": "https://www.nytimes.com/2025/09/26/podcasts/the-headlines/comey-indictment-amazon-settlement.html",
    "summary": "Plus, your Friday news quiz."
  },
  {
    "title": "Trump Will Slap Tariffs on Imported Drugs, Trucks and Household Furnishings",
    "link": "https://www.nytimes.com/2025/09/25/business/economy/trump-tariffs-pharmaceuticals-furniture-trucks.html",
    "summary": "The president said his tariffs would range from 25 to 100 percent and go into effect next week."
  },
  {
    "title": "Trump’s New Tariffs Shock Countries Reeling From His Chaotic Trade War",
    "link": "https://www.nytimes.com/2025/09/26/business/trump-tariffs-asia.html",
    "summary": "Throughout Asia, the source of about 40 percent of U.S. imports, countries have little to show for weeks of talks trying to finalize deals."
  },
  {
    "title": "Who Pays for U.S. Tariffs, and Where Does the Money Go?",
    "link": "https://www.nytimes.com/2025/07/28/business/economy/trump-tariffs-payment.html",
    "summary": "President Trump is seeking to raise federal revenue by imposing levies on goods from foreign nations. Here’s how the process works."
  },
  {
    "title": "Microsoft Disables Some Services to Israel’s Defense Ministry",
    "link": "https://www.nytimes.com/2025/09/25/technology/microsoft-israel-defense-ministry.html",
    "summary": "Microsoft said it found that Israel was violating some terms of service for its products and that it does “not provide technology to facilitate mass surveillance of civilians.”"
  },
  {
    "title": "Kennedy Says U.S. Rejects Global Health Goals",
    "link": "https://www.nytimes.com/2025/09/25/health/rfk-jr-un-chronic-disease.html",
    "summary": "The nation’s top federal health official said the United States could not support W.H.O. policies that he claimed promoted abortion and “radical gender ideology.”"
  },
  {
    "title": "Countries Consider A.I.’s Dangers and Benefits at U.N.",
    "link": "https://www.nytimes.com/2025/09/25/business/un-artificial-intelligence.html",
    "summary": "The United Nations announced a new “global dialogue on artificial intelligence governance,” and a new global A.I. panel on the technology’s risks and rewards."
  },
  {
    "title": "NASA Artemis II Astronauts Aim to Make Space Great for All",
    "link": "https://www.nytimes.com/2025/09/26/science/nasa-astronauts-moon-artemis-ii.html",
    "summary": "In a preview of their flight, the crew of Artemis II, three Americans and a Canadian, struck a tone that veered away from the political currents of the moment."
  },
  {
    "title": "Filmmaker Joshua Oppenheimer Turns His Camera on History’s Villains",
    "link": "https://www.nytimes.com/2025/09/25/magazine/joshua-oppenheimer-films-director-profile.html",
    "summary": "Joshua Oppenheimer’s films show the political value of empathy in our polarized age."
  },
  {
    "title": "Marketing Movies Is Harder Than Ever. And Here Comes ‘One Battle After Another.’",
    "link": "https://www.nytimes.com/2025/09/26/business/media/marketing-warner-bros-one-battle-after-another.html",
    "summary": "The film is the kind that isn’t supposed to work in theaters anymore. But Warner Bros., the studio behind it, has successfully bucked trends for months now."
  },
  {
    "title": "A Broad Wave of Firings Followed Charlie Kirk’s Assassination",
    "link": "https://www.nytimes.com/2025/09/26/us/kirk-critics-fired-free-speech.html",
    "summary": "More than 145 people in a wide range of occupations have been fired or disciplined after they made statements about the assassination of Charlie Kirk."
  },
  {
    "title": "Hudson Yards Developer May Get Another $2 Billion Boost From New York",
    "link": "https://www.nytimes.com/2025/09/26/nyregion/hudson-yards-related-companies.html",
    "summary": "The tentative deal comes on top of nearly $6 billion in government aid that already benefited the firm, Related Companies, when the first phase was built."
  },
  {
    "title": "As Trump’s H-1B Visa Fee Targets Foreign Workers, China Woos Them",
    "link": "https://www.nytimes.com/2025/09/26/world/asia/china-tech-workers-visas-us-h1b.html",
    "summary": "A new visa for science and engineering graduates is part of China’s effort to establish itself as the world leader in science and technology."
  },
  {
    "title": "Europe Eyes New Use of Frozen Russian Funds to Help Ukraine",
    "link": "https://www.nytimes.com/2025/09/26/world/europe/europe-frozen-russian-funds-ukraine.html",
    "summary": "Germany’s chancellor is the latest to back a loan plan that is meant to send a message to Moscow that Ukraine will not collapse. But the idea carries risks."
  },
  {
    "title": "‘Face/Off,’ the Bonkers Blockbuster With Staying Power",
    "link": "https://www.nytimes.com/2025/09/26/movies/face-off-nicolas-cage-travolta.html",
    "summary": "In 1997, Nicolas Cage and John Travolta swapped identities and faces in John Woo’s extravagant action thriller. The results were fabulously ludicrous."
  },
  {
    "title": "Trump Is Lying About Left-Wing Terrorism",
    "link": "https://www.nytimes.com/2025/09/26/opinion/dallas-ice-shooter-kirk-luigi.html",
    "summary": "The alienated loners behind left-coded violence."
  },
  {
    "title": "This Town’s Minerals Make A.I. Possible. Then Came Hurricane Helene.",
    "link": "https://www.nytimes.com/2025/09/26/opinion/ai-quartz-mining-hurricane-helene.html",
    "summary": "Spruce Pine, N.C., supplies the world’s highest-purity quartz, a mineral that keeps the A.I. revolution afloat. What are the consequences?"
  },
  {
    "title": "Political Interference at the Justice Department",
    "link": "https://www.nytimes.com/2025/09/26/briefing/political-interference-at-the-justice-department.html",
    "summary": "We examine James Comey’s indictment and an investigation into George Soros’s foundation."
  },
  {
    "title": "Colbert Investigates Trump’s Claim of Escalator ‘Sabotage’",
    "link": "https://www.nytimes.com/2025/09/26/arts/television/colbert-trump-escalator-sabotage.html",
    "summary": "“Now he’s focused all of his rage on the one foe who refused to take him up, and that is the U.N.’s escalator,” Colbert said of Trump’s recent post on Truth Social."
  },
  {
    "title": "As Right-Wing Populism Rises, Progressives Share Tactics in London",
    "link": "https://www.nytimes.com/2025/09/26/world/europe/progressives-ippr-summit-london-starmer.html",
    "summary": "Center-left figures including Mark Carney, Keir Starmer, Pete Buttigieg and Jacinda Ardern joined a summit on Friday as their brand of politics appears under threat."
  },
  {
    "title": "Vaccine Skepticism Takes Center Stage in a Close Race for Governor",
    "link": "https://www.nytimes.com/2025/09/26/nyregion/jack-ciattarelli-new-jersey-vaccines.html",
    "summary": "Jack Ciattarelli, the Republican nominee for governor of New Jersey, was a featured speaker at an event sponsored by a leading opponent of vaccine mandates."
  },
  {
    "title": "U.S. Agent Pushes Woman to Floor in Immigration Courthouse Confrontation",
    "link": "https://www.nytimes.com/2025/09/25/nyregion/ice-push-woman-nyc.html",
    "summary": "In a scene caught on video, the woman and a young girl were clinging to a man who was being detained. Agents pulled their hair, then one shoved the woman after she touched his chest."
  }
]