[
  {
    "title": "Trump and Zelensky Meet to Iron Out Peace Plan, but Deal Remains Elusive",
    "link": "https://www.nytimes.com/2025/12/28/us/politics/trump-zelensky-peace-ukraine-putin.html",
    "summary": "The U.S. president said after a meeting at Mar-a-Lago that a deal was “maybe very close.” But a joint U.S.-Ukraine proposal appeared unfinished, as Russia rejected several ideas."
  },
  {
    "title": "The Status of the 20-Point Peace Plan for Ukraine",
    "link": "https://www.nytimes.com/2025/12/24/world/europe/what-is-in-the-20-point-ukraine-peace-plan.html",
    "summary": "The blueprint covers a broad range of issues, including territory, security guarantees and postwar reconstruction. But Russia has indicated little willingness to end the war."
  },
  {
    "title": "Trump Says the U.S. Struck a ‘Big Facility’ in Campaign Against Venezuela",
    "link": "https://www.nytimes.com/2025/12/28/us/politics/trump-drug-facility-venezuela.html",
    "summary": "The administration provided no details of what the president said was an attack last week linked to U.S. efforts to disrupt drug trafficking from Latin America."
  },
  {
    "title": "Suspect Confessed to Planting Pipe Bombs Near the Capitol Before Jan. 6",
    "link": "https://www.nytimes.com/2025/12/28/us/politics/jan-6-pipe-bomb.html",
    "summary": "A Virginia man was charged with planting the bombs outside Democratic and Republican headquarters. Court documents show he believed that the 2020 election had been “tampered with.”"
  },
  {
    "title": "What America Might Look Like With Zero Immigration",
    "link": "https://www.nytimes.com/2025/12/28/business/us-immigration-trump-1920s.html",
    "summary": "The Trump administration’s efforts to reduce the foreign-born population are being felt in hospitals and soccer leagues and on Main Streets across the country, with hints of what’s to come."
  },
  {
    "title": "With Critical Decisions Ahead, Netanyahu Faces Mounting Pressure",
    "link": "https://www.nytimes.com/2025/12/29/world/middleeast/israel-benjamin-netanyahu-decisions.html",
    "summary": "Prime Minister Benjamin Netanyahu of Israel has a series of vexing choices to make in the year ahead on issues including Gaza, conscription and a judicial overhaul, with elections looming."
  },
  {
    "title": "The World Wants More Ube. Philippine Farmers Are Struggling to Keep Up.",
    "link": "https://www.nytimes.com/2025/12/29/world/asia/philippines-ube-purple-yam.html",
    "summary": "Soaring demand and extreme weather worsened by climate change have wiped out harvests of the popular purple yam."
  },
  {
    "title": "Brigitte Bardot, French Movie Icon Who Renounced Stardom, Dies at 91",
    "link": "https://www.nytimes.com/2025/12/28/movies/brigitte-bardot-dead.html",
    "summary": "“And God Created Woman” made her a world-famous sex symbol in the 1950s. She later gave up acting to devote her life to animal welfare."
  },
  {
    "title": "Brigitte Bardot: A Life in Pictures",
    "link": "https://www.nytimes.com/2025/12/28/movies/brigitte-bardot-photos.html",
    "summary": "The movies made the French actress a star, but photography sealed her stardom."
  },
  {
    "title": "From Sex Appeal to the Far Right, Brigitte Bardot Symbolized a Changing France",
    "link": "https://www.nytimes.com/2025/12/28/arts/brigitte-bardot-movies-songs-animal-rights.html",
    "summary": "In the decades after becoming a megastar, the French actress became as known for her politics as she once had been for her acting career."
  },
  {
    "title": "How Cameroon Fought to Save Its Malaria Program After the U.S. Cut Critical Funding",
    "link": "https://www.nytimes.com/2025/12/28/health/malaria-cameroon-usaid-pmi.html",
    "summary": "When the Trump administration slashed foreign aid, it gutted a program that had reduced malaria deaths world wide. In northern Cameroon, health workers tried to protect children in one last rainy season."
  },
  {
    "title": "China Will Hold Live-Fire Military Exercises Around Taiwan",
    "link": "https://www.nytimes.com/2025/12/29/world/asia/china-taiwan-military-exercises.html",
    "summary": "The exercises end months of relative calm across the Taiwan Strait and come after the Trump administration announced arms sales to the island."
  },
  {
    "title": "Can You Reboot a Lamp Like a Superhero Franchise?",
    "link": "https://www.nytimes.com/2025/12/28/business/midcentury-design-furniture-lamps.html",
    "summary": "Riding an endless wave of nostalgia, one company is exhuming the intellectual property of midcentury designers to create new audiences for forgotten work."
  },
  {
    "title": "Twins’ Peaks: The Gilbertson Brothers Want to Rewrite Your Country’s Map",
    "link": "https://www.nytimes.com/2025/12/28/science/eric-matthew-gilbertson-mountains.html",
    "summary": "Two brothers, both mechanical engineers, are climbing many of the world’s tall peaks to prove they have been measured incorrectly."
  },
  {
    "title": "The Lure of a Rising Asian Metropolis? No Traffic.",
    "link": "https://www.nytimes.com/2025/12/28/world/asia/indonesia-nusantara-future-capital.html",
    "summary": "Indonesia is building a new, green city in the jungle. Its future is far from certain, but new residents like living there."
  },
  {
    "title": "Why We Keep Falling for Narcissistic Leaders",
    "link": "https://www.nytimes.com/2025/12/29/opinion/why-we-fall-for-narcissistic-leaders-starting-in-grade-school.html",
    "summary": "We should know better."
  },
  {
    "title": "Opinionated Lists for an Overwhelming Year",
    "link": "https://www.nytimes.com/2025/12/27/opinion/the-year-in-lists.html",
    "summary": "As the year drew to a close, we reached out to Opinion columnists and contributors for personal lists."
  },
  {
    "title": "Don Bryant, 83, Dies; Co-Wrote ‘I Can’t Stand the Rain’ for His Wife",
    "link": "https://www.nytimes.com/2025/12/28/obituaries/don-bryant-dead.html",
    "summary": "He and Ann Peebles made up one of Southern soul’s most accomplished partnerships. He finally broke through as a solo act at 75."
  },
  {
    "title": "Pilot Is Dead After Helicopters Crash in New Jersey",
    "link": "https://www.nytimes.com/2025/12/28/nyregion/helicopters-crash-new-jersey.html",
    "summary": "Another pilot was in critical condition, according to the fire chief in Hammonton, N.J., where the crash took place."
  },
  {
    "title": "Winter Storm Batters Minnesota, Bringing ‘Potentially Life-Threatening Travel Conditions’",
    "link": "https://www.nytimes.com/2025/12/28/us/minnesota-winter-storm.html",
    "summary": "Forecasters warned that whiteouts had reduced visibility in Minnesota. More heavy snow was expected in the region through Monday."
  },
  {
    "title": "Mexico Train Derailment Kills 13 People",
    "link": "https://www.nytimes.com/2025/12/28/world/americas/mexico-train-crash.html",
    "summary": "The train was carrying around 250 passengers and crew members on a cross-country route linking the Pacific and the Gulf of Mexico. Nearly 100 people were injured."
  }
]