[
  {
    "title": "Judge Dismisses Georgia Election Interference Case Against Trump",
    "link": "https://www.nytimes.com/2025/11/26/us/trump-georgia-election-racketeering.html",
    "summary": "The president has now seen three criminal cases against him dissolve since he was re-elected last year."
  },
  {
    "title": "Signs of Fatigue: Trump Faces Realities of Aging in Office",
    "link": "https://www.nytimes.com/2025/11/25/us/politics/trump-age-health.html",
    "summary": "President Trump has always used his stamina and energy as a political strength. But that image is getting harder for him to sustain."
  },
  {
    "title": "Fact Check: Is Trump Right About Affordability?",
    "link": "https://www.nytimes.com/video/us/politics/100000010540099/fact-check-is-trump-right-about-affordability.html",
    "summary": "President Trump has made misleading statements about the cost of a Thanksgiving meal, turkey and gasoline."
  },
  {
    "title": "As Prices Pinch, Bessent Looks for Ways to Mollify Wary Consumers",
    "link": "https://www.nytimes.com/2025/11/26/business/scott-bessent-inflation.html",
    "summary": "Treasury Secretary Scott Bessent has offered a variety of creative justifications for President Trump’s import duties."
  },
  {
    "title": "Trump Vowed Fewer Regulations and Lots More Oil. He’s Delivered on One.",
    "link": "https://www.nytimes.com/2025/11/26/climate/trump-energy-drilling-inflation.html",
    "summary": "The president’s energy strategy is projected to generate more pollution, but so far production has not risen significantly and price drops have been modest, analysts say."
  },
  {
    "title": "U.S. Nuclear Arms Chief Warns Against Leaks of Secret Information",
    "link": "https://www.nytimes.com/2025/11/26/science/brandon-williams-nuclear-weapons-nnsa.html",
    "summary": "The email sent to atom bomb officials by Brandon Williams highlights the managerial challenge faced by the former one-term congressman."
  },
  {
    "title": "The Question Hanging Over Peace Talks: What Will Putin Accept?",
    "link": "https://www.nytimes.com/2025/11/26/world/europe/russia-putin-ukraine-peace-talks.html",
    "summary": "A U.S. proposal may cross a number of red lines for the Russian leader, who sees little to lose and much potentially to gain from continuing to fight."
  },
  {
    "title": "The 2026 Putin Calendar Is Here: ‘ A Man for Every Season’",
    "link": "https://www.nytimes.com/2025/11/25/world/europe/putin-calendar-russia.html",
    "summary": "January shows the Russian leader astride a snowmobile. For February, he flips a judo partner. In August, he offers advice: “My recipe for energy: Sleep little, work a lot and don’t whine.”"
  },
  {
    "title": "What to Know About the Fire at a Hong Kong Apartment Complex",
    "link": "https://www.nytimes.com/2025/11/26/world/asia/hong-kong-fire-what-to-know.html",
    "summary": "Firefighters struggled to contain the blaze in the high-rise buildings. At least 36 people were killed, and many more were feared trapped inside the towers."
  },
  {
    "title": "Marriages, Kids, Careers: For 44 Years, They’ve Been Talking It Out",
    "link": "https://www.nytimes.com/2025/11/26/nyregion/group-women-friendships-marriage-family.html",
    "summary": "Six women in their 70s, all married and all mothers and grandmothers, gather twice a month without fail. They credit their close-knit families to their longstanding friendships."
  },
  {
    "title": "‘Imperial Israel’ in the New Middle East",
    "link": "https://www.nytimes.com/2025/11/26/world/middleeast/imperial-israel-in-the-new-middle-east.html",
    "summary": "Despite a cease-fire with Hezbollah, almost daily strikes demonstrate an emboldened Israel’s strategy to eliminate its enemies any time, anywhere."
  },
  {
    "title": "Pope Leo to Visit Turkey and Lebanon",
    "link": "https://www.nytimes.com/2025/11/26/world/middleeast/pope-leo-trip-turkey-lebanon.html",
    "summary": "Leo XIV will meet political and religious leaders in Turkey and Lebanon, providing an early test of his geopolitical mettle. Here’s what to know."
  },
  {
    "title": "What the Pentagon’s Attack Videos Reveal About the Boat Strikes at Sea",
    "link": "https://www.nytimes.com/2025/11/26/us/trump-boat-strike-videos.html",
    "summary": "The military has released 21 video clips of U.S. attacks on vessels it says are trafficking drugs. But they tell only part of the story."
  },
  {
    "title": "Venezuela’s Nobel Peace Prize Winner Pushes False Claims About Maduro",
    "link": "https://www.nytimes.com/2025/11/26/world/americas/maria-machado-maduro-venezuela.html",
    "summary": "Opposition leader Maria Corina Machado faces criticism that she is exaggerating threats posed by Venezuela’s leader to justify U.S. force to overthrow him."
  },
  {
    "title": "The Tourism Slump Squeezes Navajo Nation Parks Like Monument Valley",
    "link": "https://www.nytimes.com/2025/11/26/travel/navajo-tourism-monument-valley.html",
    "summary": "Things were looking up last year at pandemic-battered Navajo Nation parks. Then their lifeblood, foreign visitors, slowed to a trickle."
  },
  {
    "title": "Trump Administration Will Raise Prices for Foreign Visitors at National Parks",
    "link": "https://www.nytimes.com/2025/11/25/us/politics/national-parks-prices-tourists-trump.html",
    "summary": "The increases come as more and more international travelers are choosing to stay away from the United States and amid turmoil at the National Park Service."
  },
  {
    "title": "Missing High School Coach Travis Turner Facing Charges, Officials Say",
    "link": "https://www.nytimes.com/2025/11/25/us/coach-missing-charges-undefeated-football-team.html",
    "summary": "An Appalachian community in Virginia was electrified by its high school team’s winning streak. Until the team’s coach disappeared — and allegations against him surfaced."
  },
  {
    "title": "Detroit Has Its Own Thanksgiving Parade. The City Gets Bigheaded About It.",
    "link": "https://www.nytimes.com/2025/11/26/us/detroit-michigan-thanksgiving-parade.html",
    "summary": "The march down Woodward Avenue, which endured through the city’s hardest years, features papier-mâché caricatures that are uniquely Detroit."
  },
  {
    "title": "Broadway Performers Rehearse for the Macy’s Thanksgiving Day Parade",
    "link": "https://www.nytimes.com/2025/11/26/theater/macys-thanksgiving-day-parade-broadway.html",
    "summary": "We tagged along to a late-night rehearsal for performers from “Just in Time,” “Buena Vista Social Club” and “Ragtime.”"
  },
  {
    "title": "How to Watch the 2025 Macy’s Thanksgiving Day Parade",
    "link": "https://www.nytimes.com/2025/11/26/nyregion/macys-thanksgiving-day-parade-how-to-watch.html",
    "summary": "The 99th edition of the New York parade will feature performances from Cynthia Erivo and Busta Rhymes, as well as dozens of floats and balloons."
  },
  {
    "title": "Here’s Where Weather May Slow Your Thanksgiving Travel",
    "link": "https://www.nytimes.com/2025/11/24/weather/thanksgiving-forecast-snow-cold-rain.html",
    "summary": "A winter storm could make for tricky conditions."
  },
  {
    "title": "The Race for Mikie Sherrill’s House Seat Is On, and It’s Crowded",
    "link": "https://www.nytimes.com/2025/11/26/nyregion/mikie-sherrill-congressional-seat-new-jersey-primary.html",
    "summary": "The dozen candidates include an activist endorsed by Bernie Sanders, New Jersey’s lieutenant governor and an ousted congressman running in a new district."
  },
  {
    "title": "A Moderate From Manhattan Claims Enough Support to Lead City Council",
    "link": "https://www.nytimes.com/2025/11/26/nyregion/julie-menin-nyc-city-council.html",
    "summary": "Julie Menin, a councilwoman from the Upper East Side, was seen by some supporters as a necessary check on Mayor-elect Zohran Mamdani, a democratic socialist with an ambitious policy agenda."
  },
  {
    "title": "In City Hall Housecleaning, Mamdani Asks 179 Adams Staff Members to Quit",
    "link": "https://www.nytimes.com/2025/11/25/nyregion/mamdani-adams-staff-resignations.html",
    "summary": "Zohran Mamdani will be sworn in as mayor on Jan. 1. His request for resignations targeted political appointees."
  },
  {
    "title": "Disney’s ‘Zootopia 2’ Will Be a Test for Jared Bush",
    "link": "https://www.nytimes.com/2025/11/26/business/disney-zootopia-2-jared-bush.html",
    "summary": "Jared Bush is trying to make the heart of the media empire beat more consistently. “Zootopia 2” will be a test."
  },
  {
    "title": "‘Zootopia 2’ Review: Natural Habitats, Expanded",
    "link": "https://www.nytimes.com/2025/11/26/movies/zootopia-2-review.html",
    "summary": "A sequel to the 2016 hit, this movie about an animal metropolis takes on an even messier social allegory than the first one, while building out a wider (if bloated) universe."
  },
  {
    "title": "Has Marjorie Taylor Greene Really Seen the Light?",
    "link": "https://www.nytimes.com/2025/11/26/opinion/marjorie-taylor-greene-resignation-republican.html",
    "summary": "This is a classic breakup drama."
  },
  {
    "title": "What You’re Thankful For",
    "link": "https://www.nytimes.com/2025/11/26/briefing/what-youre-thankful-for.html",
    "summary": "Six-word stories of gratitude."
  },
  {
    "title": "Army Takes Control in Guinea-Bissau Amid Apparent Coup",
    "link": "https://www.nytimes.com/2025/11/26/world/africa/guinea-bissau-coup.html",
    "summary": "The West African nation had recently held a presidential election in which the main opposition party was barred from the ballot."
  },
  {
    "title": "New York Influencer Dined and Dashed at Fine Restaurants, Owners and Police Say",
    "link": "https://www.nytimes.com/2025/11/25/nyregion/nyc-dine-dash-food-influencer-pei-chung.html",
    "summary": "Restaurant owners in Brooklyn have warned one another about a woman who frequents their establishments, photographs her food and then doesn’t pay for it."
  },
  {
    "title": "Retail Earnings Show Shoppers’ Resilience, but Some Stores Struggle",
    "link": "https://www.nytimes.com/2025/11/26/business/retailers-earnings-tariffs-spending.html",
    "summary": "Companies said they managed tariff pressures in the latest quarter as consumers focused on discounts and high quality."
  },
  {
    "title": "New Studies of Dog DNA Shed Light on Pets and People",
    "link": "https://www.nytimes.com/2025/11/24/science/genetics-dogs-pets.html",
    "summary": "New studies of canine genetics shed light on the diversity of dogs and our longstanding, still-evolving relationship to them."
  }
]