[
  {
    "title": "Can Iran, Israel and the U.S. Now All Claim to Have Won?",
    "link": "https://www.nytimes.com/2025/06/23/world/middleeast/iran-response-ceasefire-chance.html",
    "summary": "Iran’s response to the attacks on its nuclear facilities killed no Americans and each nation has a victory narrative. But an hours-old cease-fire appeared fragile and President Trump lashed out at Israel and Iran over the state of the truce."
  },
  {
    "title": "Uncertain Peace",
    "link": "https://www.nytimes.com/2025/06/24/briefing/uncertain-peace.html",
    "summary": "We explain the state of the cease-fire."
  },
  {
    "title": "A Fragile Cease-Fire Between Iran and Israel, and Toxic Homes in L.A.",
    "link": "https://www.nytimes.com/2025/06/24/podcasts/the-headlines/ceasefire-iran-israel-toxic-homes-los-angeles.html",
    "summary": "Plus, Florida’s new “Alligator Alcatraz” for migrants."
  },
  {
    "title": "Behind Closed Doors, Harvard Officials Debate a Risky Truce With Trump",
    "link": "https://www.nytimes.com/2025/06/24/us/politics/harvard-debate-settlement-trump.html",
    "summary": "The university is trying to avoid the appearance of appeasement, something other powerful institutions that made deals with President Trump found impossible."
  },
  {
    "title": "Judge Blocks Trump Proclamation Barring Harvard’s International Students",
    "link": "https://www.nytimes.com/2025/06/23/us/harvard-trump-international-students.html",
    "summary": "The same judge issued an order last week blocking a separate government effort to keep the school from enrolling students from abroad."
  },
  {
    "title": "Judge’s Ruling Casts Doubt on Trump Administration’s Claims Against Migrant",
    "link": "https://www.nytimes.com/2025/06/24/us/politics/bondi-trump-abrego-garcia.html",
    "summary": "Attorney General Pam Bondi has disregarded departmental norms to level lurid public accusations at Mr. Abrego Garcia without first detailing evidence."
  },
  {
    "title": "Trump Administration to End Protections for 58 Million Acres of National Forests",
    "link": "https://www.nytimes.com/2025/06/23/climate/trump-end-protections-for-58-million-acres-of-national-forests.html",
    "summary": "Agriculture Secretary Brooke Rollins said the Clinton-era rule barring road construction and logging was outdated and “absurd.”"
  },
  {
    "title": "Here’s How the N.Y.C. Mayoral Results May Emerge",
    "link": "https://www.nytimes.com/2025/06/24/nyregion/when-know-nyc-mayor-primary-winner.html",
    "summary": "A winner on Tuesday night is unlikely, but not impossible. Ranked-choice voting will play a big role in the outcome. Here’s what else you should look for as votes are counted."
  },
  {
    "title": "Cuomo and Mamdani Push to Raise Turnout in ‘Jump Ball’ Mayor’s Race",
    "link": "https://www.nytimes.com/2025/06/23/nyregion/mayor-primary-mamdani-cuomo.html",
    "summary": "A new poll shows the New York City mayor’s race tightening in its final days. Former Gov. Andrew M. Cuomo and Assemblyman Zohran Mamdani are scrambling for every last vote."
  },
  {
    "title": "Trump Asks NATO to Spend More but Is Quiet About Why",
    "link": "https://www.nytimes.com/2025/06/24/world/europe/trump-ukraine-russia-nato.html",
    "summary": "The “why” is Russia. But at a summit focused on keeping President Trump happy, discussion of that is expected to be muted."
  },
  {
    "title": "What to Watch for at the NATO Summit",
    "link": "https://www.nytimes.com/2025/06/24/world/europe/nato-what-to-watch.html",
    "summary": "An internal rift over defense spending and President Trump’s disregard for Ukraine have lowered expectations for the gathering."
  },
  {
    "title": "Scenes From the Hottest Blocks in New York City",
    "link": "https://www.nytimes.com/2025/06/23/nyregion/heat-weather-nyc-queens.html",
    "summary": "Whatever the temperature is in Central Park, it’s hotter alongside Newtown Creek, the toxic and industrial waterway separating Brooklyn from Queens."
  },
  {
    "title": "7 Tips for Managing Extreme Heat",
    "link": "https://www.nytimes.com/2025/06/24/well/extreme-heat-tips.html",
    "summary": "Essential advice to get you through a heat wave."
  },
  {
    "title": "A Trove Of Princess Diana’s Personal Belongings Is Going Up For Auction",
    "link": "https://www.nytimes.com/2025/06/24/style/princess-diana-auction-clothing.html",
    "summary": "A large trove of the princess’ belongings including her Lady Dior handbag, will be auctioned this week. For some buyers, more intimate items are the main draw."
  },
  {
    "title": "Trump’s Iran Diplomacy Failed. I Hope His Airstrike Succeeds.",
    "link": "https://www.nytimes.com/2025/06/24/opinion/trump-iran-jcpoa-biden.html",
    "summary": "Iran can’t be allowed to develop a nuclear weapon, but the president’s approach wasn’t the best way to prevent that."
  },
  {
    "title": "The Story of Antisemitism Needs to Be Rewritten, Starting in New York",
    "link": "https://www.nytimes.com/2025/06/24/opinion/antisemitism-new-york-city-mayor.html",
    "summary": "It may be time to rethink the tragic events in Washington and Boulder."
  },
  {
    "title": "Jimmy Fallon Wonders What Trump Will Launch Next",
    "link": "https://www.nytimes.com/2025/06/24/arts/television/fallon-trump-launches-iran.html",
    "summary": "The “Tonight Show” host said it was crazy that the president had “launched an attack on Iran, his own parade and a cellphone in the same week.”"
  },
  {
    "title": "Freddie O’Connell Confronts the Limits of Political Power in Nashville",
    "link": "https://www.nytimes.com/2025/06/24/us/politics/freddie-oconnell-nashville-democratic-mayor.html",
    "summary": "Freddie O’Connell, a policy and transit wonk, is under Republican scrutiny for his response to immigration enforcement in his left-leaning city."
  },
  {
    "title": "In a Big Place With Few People, a Minister Needs a Pilot’s License",
    "link": "https://www.nytimes.com/2025/06/24/world/australia/australia-flying-padres-chaplains.html",
    "summary": "The Salvation Army’s “Flying Padres” cross the Australian outback by air, dropping in on ranches and small communities — sometimes, just to lend an ear."
  },
  {
    "title": "Wisconsin Couple Charged in Scheme to Poison Women He Dated",
    "link": "https://www.nytimes.com/2025/06/23/us/wisconsin-couple-charged-poison-plot.html",
    "summary": "Paul VanDuyne Jr. and Andrea Whitaker placed cyanide, homemade poisons and other substances in water bottles and cars belonging to two women he had briefly dated, the authorities said."
  },
  {
    "title": "Bodies of 3 Hikers Who Jumped in Water Near Lake Tahoe Are Recovered",
    "link": "https://www.nytimes.com/2025/06/23/us/missing-hikers-dead-rattlesnake-falls-california.html",
    "summary": "The three men had been hiking in Soda Springs, Calif., when they jumped into the water near Rattlesnake Falls, a remote and isolated area that made rescue difficult."
  }
]