[
  {
    "title": "Justice Dept. Seeks Information on Fani Willis, Georgia D.A. Who Prosecuted Trump",
    "link": "https://www.nytimes.com/2025/09/26/us/justice-department-fani-willis-trump.html",
    "summary": "Federal investigators have subpoenaed records related to travel they believe Fani Willis took around the time of last year’s election, but it was not immediately clear why."
  },
  {
    "title": "Trump Predicts More Indictments After Comey and Claims It’s Not Revenge",
    "link": "https://www.nytimes.com/2025/09/26/us/politics/trump-comey-revenge.html",
    "summary": "President Trump has made clear that he expects the Justice Department to mete out punishment to his perceived enemies."
  },
  {
    "title": "Examining James Comey’s 2020 Testimony at the Heart of His Indictment",
    "link": "https://www.nytimes.com/2025/09/26/us/politics/james-comey-testimony-trump.html",
    "summary": "The charges against the former F.B.I. director center on an appearance he made before a Senate committee in September 2020. Here’s a closer look."
  },
  {
    "title": "Trump Fired a U.S. Attorney Who Insisted on Following a Court Order",
    "link": "https://www.nytimes.com/2025/09/26/us/trump-fires-us-attorney-california-immigration.html",
    "summary": "The top federal prosecutor in Sacramento was fired hours after she reminded a Border Patrol chief to abide by court-ordered restrictions on immigration raids."
  },
  {
    "title": "Supreme Court Allows Trump to Withhold $4 Billion in Foreign Aid Funding",
    "link": "https://www.nytimes.com/2025/09/26/us/politics/supreme-court-trump-foreign-aid.html",
    "summary": "The court’s conservative majority allowed the president to cut the funding in part because it said his flexibility to engage in foreign affairs outweighed “the potential harm” faced by aid recipients."
  },
  {
    "title": "Texas Tech Moves to Limit Academic Discussion to 2 Genders",
    "link": "https://www.nytimes.com/2025/09/26/us/politics/texas-tech-gender.html",
    "summary": "The university system said faculty must comply with President Trump’s order recognizing only two genders, possibly a first for a major public institution of higher education."
  },
  {
    "title": "Trump Administration Asks Supreme Court to Allow End of Birthright Citizenship",
    "link": "https://www.nytimes.com/2025/09/26/us/politics/supreme-court-birthright-citizenship.html",
    "summary": "Government lawyers asked the justices to clear the way for the president’s executive order ending birthright citizenship."
  },
  {
    "title": "Summoned U.S. Military Officers Are Expected to Hear a ‘Rally the Troops’ Message",
    "link": "https://www.nytimes.com/2025/09/26/us/politics/hegseth-military-summit.html",
    "summary": "Several generals and admirals said the unusual meeting in the Washington area called by Defense Secretary Pete Hegseth would be both disruptive and expensive."
  },
  {
    "title": "Des Moines Schools Superintendent Ian Roberts Detained by ICE, Officials Say",
    "link": "https://www.nytimes.com/2025/09/26/us/des-moines-schools-ice-immigration.html",
    "summary": "Federal immigration officials said the superintendent had received a deportation order in May 2024 and fled from agents when they approached him on Friday."
  },
  {
    "title": "Justice Dept. Agents to Protect ICE Facilities, Bondi Says",
    "link": "https://www.nytimes.com/2025/09/26/us/doj-agents-ice-facilities.html",
    "summary": "Pam Bondi, the attorney general, announced the deployment two days after a gunman opened fire at an ICE facility in Dallas, killing one detainee and injuring two others."
  },
  {
    "title": "Dallas ICE Shooting Victim, a Detainee, Is Now Fighting for His Life",
    "link": "https://www.nytimes.com/2025/09/26/us/politics/victims-dallas-ice.html",
    "summary": "Miguel Ángel García was critically injured in a shooting at a Dallas ICE facility, where Norlan Guzman-Fuentes was also killed. Early portraits of the victims are emerging."
  },
  {
    "title": "ICE Officer ‘Relieved of His Duties’ After Pushing Woman to Floor",
    "link": "https://www.nytimes.com/2025/09/26/nyregion/ice-officer-investigation-woman-shoved.html",
    "summary": "The Department of Homeland Security said it was investigating an officer’s action during an altercation at a New York City immigration courthouse."
  },
  {
    "title": "Trump Believes ‘We Have a Deal’ on Gaza. But a Host of Obstacles Remain.",
    "link": "https://www.nytimes.com/2025/09/26/us/politics/trump-gaza-deal.html",
    "summary": "Whether President Trump can help bring the war to an end will probably depend on how much he is willing to push Benjamin Netanyahu."
  },
  {
    "title": "Defiant Netanyahu Denounces Palestine Recognition, to a Mostly Empty U.N. Hall",
    "link": "https://www.nytimes.com/2025/09/26/world/middleeast/netanyahu-speech-united-nations.html",
    "summary": "A Palestinian state would be “national suicide” for Israel, Prime Minister Benjamin Netanyahu said, but many of the diplomats and leaders at the assembly boycotted his remarks."
  },
  {
    "title": "As Witkoff Pitched Mideast Peace, His Son Pitched Mideast Investors",
    "link": "https://www.nytimes.com/2025/09/26/business/witkoff-son-qatar-gaza.html",
    "summary": "Steve Witkoff’s son recently sought money from Gulf states including Qatar, which has previously invested in Witkoff family projects to win favor with President Trump."
  },
  {
    "title": "Russia Steps Up Provocations in Europe, Alarming Leaders There",
    "link": "https://www.nytimes.com/2025/09/27/world/europe/russia-europe-poland-drones-moldova-election.html",
    "summary": "European officials fear that Moscow is escalating its antagonism of Europe as U.S. support recedes. A focus of worry now: election interference in Moldova."
  },
  {
    "title": "5 Dairy Myths Experts Want to Correct",
    "link": "https://www.nytimes.com/2025/09/26/well/eat/health-myths-dairy.html",
    "summary": "We surveyed leading nutrition experts to reveal the truth about raw milk, lactose intolerance, low-fat dairy and more."
  },
  {
    "title": "China’s Small Steps Look Bigger Next to Trump’s Retreat",
    "link": "https://www.nytimes.com/2025/09/27/world/asia/china-un-trump-leader.html",
    "summary": "Beijing’s climate and trade pledges at the U.N. highlighted how modest moves can stand out when the United States is pulling back from global leadership."
  },
  {
    "title": "Gunman in NYC Shooting at NFL Headquarters Had CTE",
    "link": "https://www.nytimes.com/2025/09/26/us/cte-football-tamura-gunman.html",
    "summary": "Shane Tamura, a former high school football player, shot himself and left a note that said his motive was anger at the N.F.L."
  },
  {
    "title": "Trump Expands Tariffs Beyond Supreme Court’s Reach",
    "link": "https://www.nytimes.com/2025/09/26/us/politics/trump-tariffs-supreme-court.html",
    "summary": "The president’s tariffs on foreign drugs and furniture rely on national security laws outside the scope of current lawsuits."
  },
  {
    "title": "How Trump’s Latest Tariffs May Affect Your Medicines",
    "link": "https://www.nytimes.com/2025/09/26/health/trump-drug-tariffs-prescription-costs.html",
    "summary": "The president said he would impose a tariff of 100 percent on certain brand-name drugs. Here’s what we know so far."
  },
  {
    "title": "Sinclair and Nexstar End Jimmy Kimmel Boycott on Local ABC Stations",
    "link": "https://www.nytimes.com/2025/09/26/business/media/sinclair-jimmy-kimmel-boycott.html",
    "summary": "Sinclair and Nexstar have been pre-empting Mr. Kimmel’s show since he returned this week."
  },
  {
    "title": "Judge Rejects Lawsuit Claiming Art Had Lost Its ‘Oomph’",
    "link": "https://www.nytimes.com/2025/09/26/arts/design/ronald-perelman-cy-twombly-oomph-lawsuit.html",
    "summary": "The collector’s holding companies had sued his insurers for $400 million to cover paintings that they say had been damaged in a fire. The insurers said they had survived untouched."
  },
  {
    "title": "Robert B. Barnett, Washington Master of the Book World Megadeal, Dies at 79",
    "link": "https://www.nytimes.com/2025/09/26/books/robert-barnett-dead.html",
    "summary": "An influential lawyer, he negotiated blockbuster contracts for A-list clients, including the Clintons, the Obamas and the Bushes, while often acting as a political adviser."
  },
  {
    "title": "Polish Skier Climbs Everest and Skis Down Without Extra Oxygen",
    "link": "https://www.nytimes.com/2025/09/26/sports/andrzej-bargiel-mount-everest-oxygen-skiing.html",
    "summary": "Andrzej Bargiel, 37, became the first person to complete the feat."
  },
  {
    "title": "The Comey Indictment Plunges the Country Into a Grave New Period",
    "link": "https://www.nytimes.com/2025/09/26/opinion/comey-indictment-justice-department.html",
    "summary": "As despots have done for centuries, Trump is persecuting people he considers his enemies, with little justification other than raw political power."
  },
  {
    "title": "Trump Can’t Be the One to Pick Who’s Indicted",
    "link": "https://www.nytimes.com/2025/09/26/opinion/james-comey-indicted-trump.html",
    "summary": "The Justice Department and the attorney general are supposed to keep a distance from the president, not be his personal score settlers."
  },
  {
    "title": "Trump Orders Unsealing of All Files on Amelia Earhart and Her Disappearance",
    "link": "https://www.nytimes.com/2025/09/26/us/politics/trump-amelia-earhart-files.html",
    "summary": "The president has called for the unsealing of documents related to the deaths of prominent historical figures like John F. Kennedy and Dr. Martin Luther King Jr."
  },
  {
    "title": "Jared Kushner’s Firm Is Said to Be Part of $50 Billion Buyout of Electronic Arts",
    "link": "https://www.nytimes.com/2025/09/26/business/electronic-arts-buyout-jared-kushner.html",
    "summary": "Mr. Kushner’s private equity firm, Affinity Partners, is said to be in talks with the Saudi sovereign wealth fund and Silver Lake to buy out the video game giant."
  },
  {
    "title": "Brutal Murder of 3 Women, Broadcast On Instagram, Shocks Argentina",
    "link": "https://www.nytimes.com/2025/09/26/world/americas/argentina-women-murder-instagram.html",
    "summary": "The live streamed torture and killing of three young women in Buenos Aires has stunned the country, setting off worries about the increasing presence of drug cartels."
  },
  {
    "title": "Police Kill Man Who Shot at Cars Outside Georgia Elementary School",
    "link": "https://www.nytimes.com/2025/09/26/us/valdosta-georgia-school-shooting.html",
    "summary": "The gunman, a 25-year-old who lived near the campus, was shot dead as he approached the front of the school, officials said."
  }
]