[
  {
    "title": "Trump’s Sanctions on Russian Oil Sector Ratchet Up Economic War",
    "link": "https://www.nytimes.com/2025/10/23/us/politics/trump-sanctions-russian-oil.html",
    "summary": "After months of restraint, President Trump’s move to blacklist Lukoil and Rosneft will hit Russia where it hurts."
  },
  {
    "title": "The U.S. and Europe Are Trying New Ways to Pressure Russia",
    "link": "https://www.nytimes.com/2025/10/23/world/europe/russia-oil-sanctions-prices.html",
    "summary": "For the first time in his second term, President Trump is imposing new sanctions, but they may not shift the course of Russia’s war in Ukraine."
  },
  {
    "title": "U.S. Charges N.B.A. Figures in Gambling Schemes That Tainted Games",
    "link": "https://www.nytimes.com/live/2025/10/23/nyregion/nba-illegal-gambling-arrests/nba-gambling-charges",
    "summary": "Terry Rozier, a Miami Heat guard, and Chauncey Billups, coach of the Portland Trail Blazers, were among those arrested. Two indictments spanned the worlds of professional sports, Mafia families and online betting."
  },
  {
    "title": "Gambinos and Other NYC Mob Families Are Still in Business",
    "link": "https://www.nytimes.com/2025/10/23/nyregion/nba-gambling-mafia-gambino-genovese-bonanno-luchese.html",
    "summary": "Four of the city’s five Mafia families were part of a high-tech scheme that netted $7 million, prosecutors said, by fleecing high rollers at illegal poker games."
  },
  {
    "title": "Here Are the Defendants Named in the N.B.A. Gambling Indictments",
    "link": "https://www.nytimes.com/2025/10/23/nyregion/nba-betting-indictment-defendants.html",
    "summary": "More than 30 people were charged in what prosecutors said was a gambling scheme involving N.B.A. players and coaches."
  },
  {
    "title": "NBA Gambling Scandal: What We Know",
    "link": "https://www.nytimes.com/2025/10/23/nyregion/nba-gambling-scandal-explained.html",
    "summary": "Two indictments detailed schemes involving sports betting and rigged poker games, prosecutors said. The link was current and former N.B.A. players and coaches."
  },
  {
    "title": "Trump Calls Off Federal Operation in San Francisco",
    "link": "https://www.nytimes.com/2025/10/23/us/san-francisco-trump-federal-deployment.html",
    "summary": "President Trump said he had halted a planned federal deployment of immigration agents to the city. It was not clear what that meant for the rest of the Bay Area."
  },
  {
    "title": "Tensions Mount as Agents, Including Gregory Bovino, Clash With Chicagoans",
    "link": "https://www.nytimes.com/2025/10/23/us/politics/gregory-bovino-chicago-immigration.html",
    "summary": "Mr. Bovino, a Border Patrol leader, appeared to use tear gas during a confrontation with residents on Thursday. Plaintiffs in a suit over federal tactics say that violated a court order."
  },
  {
    "title": "Trump Official Says U.S. Can House Migrants at All of Its Overseas Bases",
    "link": "https://www.nytimes.com/2025/10/23/us/politics/dhs-ice-guantanamo.html",
    "summary": "A Justice Department lawyer made the claim in response to a challenge to the administration’s use of the base at Guantánamo Bay, Cuba, to hold detainees designated for deportation."
  },
  {
    "title": "Trump’s Ballroom Project Claims 123-Year-Old East Wing",
    "link": "https://www.nytimes.com/2025/10/23/us/politics/east-wing-obituary.html",
    "summary": "Mourners are outraged over President Trump’s demolition of the East Wing to make way for his $300 million ballroom. Others say it was time for change."
  },
  {
    "title": "Oz Pearlman Is the Manosphere’s Favorite Magician",
    "link": "https://www.nytimes.com/2025/10/23/style/oz-pearlman-mentalist-magician.html",
    "summary": "Oz Pearlman has revealed Joe Rogan’s A.T.M. code on air and entertained N.F.L. stars. Now he wants more."
  },
  {
    "title": "After Remark About Mamdani and Sept. 11, Cuomo Faces Democratic Rebukes",
    "link": "https://www.nytimes.com/2025/10/23/nyregion/cuomo-mamdani-sept-11.html",
    "summary": "When a radio host suggested that Zohran Mamdani would celebrate another Sept. 11-style attack, Andrew Cuomo chuckled. Democrats denounced the exchange as Islamophobic."
  },
  {
    "title": "How Mamdani Has Evolved in the Mayoral Race",
    "link": "https://www.nytimes.com/video/nyregion/100000010472876/how-mamdani-has-evolved-in-the-mayoral-race.html",
    "summary": "Zohran Mamdani entered the final debate in the New York City mayoral race ahead in the polls. Nicholas Fandos, who covers New York politics and government for The New York Times, describes Mr. Mamdani’s strategy to appeal to the wider electorate before early voting begins."
  },
  {
    "title": "Eric Adams Will Endorse Andrew Cuomo for NYC Mayor",
    "link": "https://www.nytimes.com/2025/10/23/nyregion/adams-endorse-cuomo-nyc-mayor.html",
    "summary": "Mayor Eric Adams backed former Gov. Andrew M. Cuomo in the New York City mayor’s race and plans to campaign with him, in hopes of slowing the momentum of Zohran Mamdani, the Democratic nominee."
  },
  {
    "title": "Democrats Block Federal Worker Pay Bill as Shutdown Drags On",
    "link": "https://www.nytimes.com/2025/10/23/us/politics/democrats-shutdown-federal-employee-pay.html",
    "summary": "A Republican measure that would pay essential government employees faltered in the Senate, and the G.O.P. blocked a pair of Democratic bills to pay a broader swath of workers."
  },
  {
    "title": "Trump Pardons Changpeng Zhao, Founder of the Crypto Exchange Binance",
    "link": "https://www.nytimes.com/2025/10/23/technology/trump-pardons-cz-binance.html",
    "summary": "Changpeng Zhao, the richest man in crypto, had admitted to money-laundering violations that allowed terrorists and other criminals to move money on Binance."
  },
  {
    "title": "Musk Attacks NASA Leader Over Threat to Reconsider Lunar Contract",
    "link": "https://www.nytimes.com/2025/10/23/us/politics/elon-musk-duffy-nasa.html",
    "summary": "The billionaire’s swipes at Sean Duffy are the latest example of his tangling with members of the Trump administration."
  },
  {
    "title": "Stavros Halkias Wants a Career. Will His Fans Let Him Have One?",
    "link": "https://www.nytimes.com/2025/10/23/magazine/stavros-halkias.html",
    "summary": "The comedian is pivoting from online notoriety to mainstream roles. It’s harder than it looks."
  },
  {
    "title": "U.S. May Seek United Nations Mandate for Gaza Security Force, Rubio Says",
    "link": "https://www.nytimes.com/2025/10/23/world/middleeast/rubio-israel-gaza.html",
    "summary": "Vice President JD Vance spoke from Israel, as he wrapped up a visit aimed at shoring up a fragile cease-fire between Israel and Hamas."
  },
  {
    "title": "Trump Says Israeli Annexation of West Bank Land ‘Won’t Happen’",
    "link": "https://www.nytimes.com/2025/10/23/world/middleeast/trump-israel-west-bank-annexation.html",
    "summary": "Vice President JD Vance also called symbolic votes in Israel’s Parliament to take territory a “very stupid political stunt.”"
  },
  {
    "title": "The Rot Creeping Into Our Minds",
    "link": "https://www.nytimes.com/2025/10/23/opinion/shutdown-democracy-democrats.html",
    "summary": "Yes, Trump is assaulting democracy, but what worries me more is what has happened to the rest of us — the loss of the convictions and norms that undergird democracy."
  },
  {
    "title": "The Next Economic Bubble Is Here",
    "link": "https://www.nytimes.com/2025/10/23/opinion/ai-bubble-economy-bust.html",
    "summary": "OpenAI is worth more than Goldman Sachs. Here’s what that means for the economy."
  },
  {
    "title": "N.B.A. Figures Charged in Gambling Schemes",
    "link": "https://www.nytimes.com/2025/10/23/briefing/nba-figures-charged-in-gambling-schemes.html",
    "summary": "Also, Trump halted his plan to send federal agents to San Francisco. Here’s the latest at the end of Thursday."
  },
  {
    "title": "Meta Layoffs Included Employees Who Monitored Risks to User Privacy",
    "link": "https://www.nytimes.com/2025/10/23/technology/meta-layoffs-user-privacy.html",
    "summary": "While the company announced job cuts in artificial intelligence, it also expanded plans to replace privacy and risk auditors with more automated systems."
  },
  {
    "title": "U.S. to Investigate China’s Compliance With 2020 Trade Deal",
    "link": "https://www.nytimes.com/2025/10/23/business/economy/us-china-trade-investigation.html",
    "summary": "The trade case is coming at a pivotal moment, before a meeting next week between President Trump and China’s leader."
  },
  {
    "title": "Ruth A. Lawrence, Doctor Who Championed Breastfeeding, Is Dead at 101",
    "link": "https://www.nytimes.com/2025/10/23/health/ruth-a-lawrence-dead.html",
    "summary": "As a pediatrician, she helped elevate breastfeeding from a medical afterthought to a specialty of its own. As a mother of nine, she practiced what she preached."
  },
  {
    "title": "Kim Kardashian Announces Brain Aneurysm Diagnosis. Here’s What to Know.",
    "link": "https://www.nytimes.com/2025/10/23/well/kim-kardashian-brain-aneurysm.html",
    "summary": "About one in every 50 people has an unruptured brain aneurysm. It was not clear whether Ms. Kardashian had experienced symptoms."
  }
]