[
  {
    "title": "Conservative Project at Supreme Court Meets Trump’s Push to Oust Officials",
    "link": "https://www.nytimes.com/2025/12/07/us/politics/supreme-court-trump-independent-agencies.html",
    "summary": "President Trump has repeatedly ousted leaders of independent agencies despite federal laws meant to shield those regulators from politics."
  },
  {
    "title": "For Landmark Test of Executive Power, Echoes of a 1930s Supreme Court Battle",
    "link": "https://www.nytimes.com/2025/12/07/us/politics/supreme-court-humphrey-roosevelt.html",
    "summary": "Franklin D. Roosevelt’s efforts to oust a Federal Trade Commission leader offer parallels to the current fight over President Trump’s actions."
  },
  {
    "title": "Superpower Competition: The Missing Chapter in Trump’s Security Strategy",
    "link": "https://www.nytimes.com/2025/12/07/us/politics/trump-security-strategy-superpowers.html",
    "summary": "President Trump is shifting from discussion of the long-lasting competition among the world’s biggest economies and nuclear powers."
  },
  {
    "title": "Judge Halts Justice Dept. Effort to Seek New Comey Indictment",
    "link": "https://www.nytimes.com/2025/12/06/us/politics/judge-comey-indictment-richman.html",
    "summary": "The judge’s decision prevented the government until at least next Friday from having access to much of the evidence it used to secure its original indictment against Mr. Comey."
  },
  {
    "title": "This Nebraska Prison Rehabilitated Inmates. Until ICE Paid to Fill It With Immigrants.",
    "link": "https://www.nytimes.com/2025/12/07/world/nebraska-prison-mccook-ice-immigrants-detention-trump.html",
    "summary": "Over two decades, a minimum-security prison aimed at helping inmates prepare to leave prison was a point of civic pride. Now, state officials have converted it to ICE detention."
  },
  {
    "title": "Hegseth Skirts Questions About Releasing Video of Sept. 2 Boat Attack",
    "link": "https://www.nytimes.com/2025/12/06/us/politics/pete-hegseth-boat-attack-video.html",
    "summary": "At an appearance in California, Defense Secretary Pete Hegseth was noncommittal about releasing the full video of a U.S. military attack on a boat in the Caribbean."
  },
  {
    "title": "How Stablecoins Can Help Criminals Launder Money and Evade Sanctions",
    "link": "https://www.nytimes.com/2025/12/07/technology/how-a-cryptocurrency-helps-criminals-launder-money-and-evade-sanctions.html",
    "summary": "Through layers of intermediaries, stablecoins can be moved, swapped and mixed into pools of other funds in ways that are difficult to trace, experts say."
  },
  {
    "title": "How Biden Ignored Warnings and Lost Americans’ Faith in Immigration",
    "link": "https://www.nytimes.com/2025/12/07/us/politics/biden-immigration-trump.html",
    "summary": "The Democratic president and his top advisers rejected recommendations that could have eased the border crisis that helped return Donald Trump to the White House."
  },
  {
    "title": "4 Takeaways From The Times’s Reporting on Biden’s Immigration Record",
    "link": "https://www.nytimes.com/2025/12/07/us/politics/biden-immigration-policy-takeaways.html",
    "summary": "A New York Times review of President Joseph R. Biden Jr.’s actions on immigration showed that they created an opening for a more aggressive Trump administration agenda."
  },
  {
    "title": "Netflix Deal for Warner Bros. Adds New Twist to Rivalry With HBO",
    "link": "https://www.nytimes.com/2025/12/07/business/media/netflix-hbo-warner-bros.html",
    "summary": "Netflix’s blockbuster deal to buy Warner Bros., including HBO, is the latest twist in a rivalry that has reshaped the entertainment industry."
  },
  {
    "title": "What to Know About Netflix’s $83 Billion Deal for Warner Bros. Discovery",
    "link": "https://www.nytimes.com/2025/12/06/business/netflix-warner-bros-what-to-know.html",
    "summary": "The cash-and-stock deal would give the world’s largest paid streaming service expansive power over theater owners and entertainment-industry unions."
  },
  {
    "title": "Hong Kong Holds Vote as Officials Move Against ‘Anti-China’ Elements",
    "link": "https://www.nytimes.com/2025/12/07/world/asia/hong-kong-fire-election-campaign.html",
    "summary": "The government is pushing hard to raise turnout in an election overshadowed by a deadly fire and public anger over safety lapses and official accountability."
  },
  {
    "title": "Hong Kong Man Arrested After Posting Online About Deadly Fire",
    "link": "https://www.nytimes.com/2025/12/07/world/asia/hong-kong-fire-arrest-after-online-speech.html",
    "summary": "The arrest was part of a crackdown on speech that the authorities say is inciting hatred of the government. Critics say officials are silencing calls for accountability."
  },
  {
    "title": "China’s National Security Office in Hong Kong Summons Foreign Journalists",
    "link": "https://www.nytimes.com/2025/12/06/world/asia/hong-kong-fire-media-national-security.html",
    "summary": "The authorities accused “some foreign media” of smearing the government’s response to a fire at a high-rise complex, saying: “Do not say you have not been warned.”"
  },
  {
    "title": "The Married Scientists Torn Apart by a Covid Bioweapon Theory",
    "link": "https://www.nytimes.com/2025/12/07/us/china-virologist-li-meng-yan-coronavirus.html",
    "summary": "In 2020, a Chinese virologist fled to the United States, aided by allies of President Trump who sought to promote her unproven theories about the origins of Covid-19. Her husband still can’t find her."
  },
  {
    "title": "Hollywood Doesn’t Want Netflix to Buy Warner Bros.",
    "link": "https://www.nytimes.com/2025/12/07/opinion/netflix-warner-bros-hollywood.html",
    "summary": "The Warner Bros. deal has the town on edge."
  },
  {
    "title": "This Is the Story of How the Democrats Blew It on Gaza",
    "link": "https://www.nytimes.com/2025/12/01/opinion/democrats-israel.html",
    "summary": "It may be tempting to memory hole what happened in Gaza. That would only compound the mistake of ignoring, or rationalizing, an intolerable reality."
  },
  {
    "title": "How Has Congestion Pricing Changed Your Year?",
    "link": "https://www.nytimes.com/2025/12/05/nyregion/nyc-congestion-pricing-anniversary.html",
    "summary": "The tolling program, decades in the making, has shown signs of being effective after a rocky rollout."
  },
  {
    "title": "In Honduras, Some Voters Were Swayed by Trump, Others Angered",
    "link": "https://www.nytimes.com/2025/12/06/world/americas/honduras-voters-trump-election.html",
    "summary": "President Trump backed Nasry Asfura days before the Nov. 30 election and denounced his opponents. In a close race, that has potentially tipped the scales."
  },
  {
    "title": "In Brazil’s Answer to Hollywood, Dreams and Drought Share the Stage",
    "link": "https://www.nytimes.com/2025/12/07/world/americas/brazil-cabaceiras-film-tv-hollywood.html",
    "summary": "A dusty town in the parched northeast has become the nation’s show business destination. But climate change and technology are posing new challenges there."
  },
  {
    "title": "Francis Ford Coppola’s F.P. Journe Sells for $11 Million at Auction",
    "link": "https://www.nytimes.com/2025/12/06/style/francis-ford-coppola-watch-auction-fp-journe.html",
    "summary": "Frenzied bidding pushed the polarizing F.P. Journe timepiece into near-record territory despite one dealer calling the design “goofy.”"
  }
]