[
  {
    "title": "U.S. Deports Planeload of Iranians After Deal With Tehran, Officials Say",
    "link": "https://www.nytimes.com/2025/09/30/world/middleeast/us-iran-deportation-flight.html",
    "summary": "The deportation flight to Iran is the most stark push yet by the Trump administration to deport migrants even to places with harsh human rights conditions."
  },
  {
    "title": "Government Shutdown Appears Imminent After Trump Meets With Democrats",
    "link": "https://www.nytimes.com/2025/09/29/us/politics/government-shutdown-trump-vance-congress.html",
    "summary": "President Trump met with Republican and Democratic leaders at the White House, but they emerged without a deal, as Democrats seek more health care funding."
  },
  {
    "title": "Explaining the G.O.P.’s Misleading Talking Point on the Looming Shutdown",
    "link": "https://www.nytimes.com/2025/09/29/us/politics/republicans-shutdown-fact-check-health-immigration.html",
    "summary": "Republicans have been falsely asserting that Democrats are shutting down the government to fund free health care for unauthorized immigrants."
  },
  {
    "title": "Trump and Netanyahu Tell Hamas to Accept Gaza Cease-Fire Plan, Or Else",
    "link": "https://www.nytimes.com/2025/09/29/us/politics/trump-netanyahu-hamas-ultimatum.html",
    "summary": "President Trump said Israel would have a green light to “finish the job” if Hamas refused to agree to the cease-fire deal."
  },
  {
    "title": "Read Each Point of Trump’s Plan for an Israel-Gaza Cease-Fire",
    "link": "https://www.nytimes.com/2025/09/29/world/middleeast/gaza-israel-cease-fire-plan-text.html",
    "summary": "“If both sides agree to this proposal, the war will immediately end,” the White House proposal says."
  },
  {
    "title": "U.S. Sues Pro-Palestinian Demonstrators Who Protested Outside Synagogue",
    "link": "https://www.nytimes.com/2025/09/29/nyregion/face-act-palestinian-suit-new-jersey.html",
    "summary": "The Justice Department sued participants in a confrontation at a New Jersey synagogue that devolved into violence. An official said there might be more such cases to come."
  },
  {
    "title": "Michigan Church Attacker Is Said to Have Held a Grudge Against Mormons",
    "link": "https://www.nytimes.com/2025/09/29/us/michigan-church-attack.html",
    "summary": "Several friends and acquaintances of the man accused of attacking a Church of Jesus Christ of Latter-day Saints meetinghouse said he had long railed against the faith."
  },
  {
    "title": "A 102-Year-Old Yoga Teacher’s Simple Approach to Aging Well",
    "link": "https://www.nytimes.com/2025/09/29/well/move/102-year-old-yogi-charlotte-chopin.html",
    "summary": "For decades, Charlotte Chopin has been bending and stretching in Léré, a village in France. Here’s how she keeps moving."
  },
  {
    "title": "Trump and Comey: An Escalating Conflict With No Off-Ramp",
    "link": "https://www.nytimes.com/2025/09/29/us/politics/trump-comey-escalating-conflict.html",
    "summary": "The yearslong face-off between Donald Trump and James Comey amounts to a case study of how the president grew evermore emboldened to carry out his revenge agenda."
  },
  {
    "title": "YouTube Settles Trump Lawsuit Over Account Suspension for $24.5 Million",
    "link": "https://www.nytimes.com/2025/09/29/technology/youtube-trump-lawsuit-settlement.html",
    "summary": "Mr. Trump had sued Alphabet, the parent of YouTube and Google, and other social media companies after the platforms suspended his accounts following the Jan. 6, 2021, riot at the Capitol."
  },
  {
    "title": "Health Department Moves to Block Harvard From Future Research Grants",
    "link": "https://www.nytimes.com/2025/09/29/us/politics/trump-administration-harvard-research-grants.html",
    "summary": "The White House and Harvard University have struggled to negotiate an end to their monthslong dispute over the administration’s campaign to expunge “woke” ideology from campuses."
  },
  {
    "title": "N.Y.C. Mayoral Candidates Move to Capitalize on Adams’s Departure",
    "link": "https://www.nytimes.com/2025/09/29/nyregion/mamdani-cuomo-sliwa-nyc-mayor.html",
    "summary": "Zohran Mamdani and Curtis Sliwa hit the campaign trail on Monday after Eric Adams left the race, while Andrew Cuomo called donors."
  },
  {
    "title": "What Eric Adams Has Said as an Outspoken Mayor of New York City",
    "link": "https://www.nytimes.com/2025/09/29/nyregion/eric-adams-nyc-mayor.html",
    "summary": "At an afternoon news conference or a late-night talk show, it has been almost impossible to predict what New York City’s mayor might say next."
  },
  {
    "title": "Trump Officials Flesh Out Tariffs on Kitchen Cabinets, Furniture and Timber",
    "link": "https://www.nytimes.com/2025/09/29/business/economy/tariffs-cabinets-furniture-lumber-trump.html",
    "summary": "The White House set a relatively low tariff on imports of timber and lumber, and a significantly higher tariff on furniture and kitchen cabinets."
  },
  {
    "title": "Hegseth and Trump to Meet With Military Brass: What We Know",
    "link": "https://www.nytimes.com/2025/09/29/us/politics/hegseth-trump-military-officers.html",
    "summary": "Tuesday’s meeting at a Marine Corps base appears to be without precedent, and a lack of explanation for it has led to speculation and fear."
  },
  {
    "title": "Lally Weymouth, Globe-Trotting Reporter and Scion of Graham Family, Dies at 82",
    "link": "https://www.nytimes.com/2025/09/29/us/politics/lally-weymouth-dead.html",
    "summary": "The daughter of Washington Post publisher Katharine Graham, she secured hard-to-land interviews with foreign leaders but found few opportunities for a leadership role."
  },
  {
    "title": "Charlie Javice Sentenced to 85 Months in Prison for Fraud",
    "link": "https://www.nytimes.com/2025/09/29/business/charlie-javice-sentence.html",
    "summary": "A federal jury in March had found Ms. Javice guilty for faking customer lists during JPMorgan Chase’s $175 million acquisition of her start-up."
  },
  {
    "title": "What It Takes to Get Lunch Delivered to the 70th Floor",
    "link": "https://www.nytimes.com/2025/09/29/world/asia/china-delivery-shenzhen.html",
    "summary": "An informal network of last-mile runners close the gap between harried delivery drivers and hungry office workers in a Shenzhen skyscraper."
  },
  {
    "title": "Death of Trey Reed, a Black Man, in Mississippi Strikes Nerves in the U.S.",
    "link": "https://www.nytimes.com/2025/09/29/us/politics/trey-reed-hanging-mississippi.html",
    "summary": "The authorities say Trey Reed took his own life on his college campus, but in a nation ready to jump to judgment and in a state with its history of racial violence, that conclusion has not ended the story."
  },
  {
    "title": "College Students Are Seeking Out Phone-Free Social Connection",
    "link": "https://www.nytimes.com/2025/09/29/well/mind/phone-screen-social-media-college-club-reconnect.html",
    "summary": "A campus movement aims to find out."
  },
  {
    "title": "Can the Trump Peace Plan Overcome Unprecedented Cruelty?",
    "link": "https://www.nytimes.com/2025/09/29/opinion/trump-israel-gaza-palestinian-peace-plan.html",
    "summary": "Donald Trump’s peace plan will be like solving a diplomatic Rubik’s cube every day — while all the enemies of the deal try to scramble it."
  },
  {
    "title": "Democrats Are in Crisis. Eat-the-Rich Populism Is the Only Answer.",
    "link": "https://www.nytimes.com/2025/09/29/opinion/democrats-dan-osborne.html",
    "summary": "A blistering assault on economic elites, a moderate stance on cultural issues and a rejection of politics as usual. That’s how to remake the Democratic Party."
  },
  {
    "title": "Peace Broker, Arms Supplier: China’s Dual Roles in a Deadly Conflict",
    "link": "https://www.nytimes.com/2025/09/29/world/asia/thailand-cambodia-china-weapons.html",
    "summary": "China urged Cambodia and Thailand to end their border war in July. But weeks earlier, it had sent rockets and artillery shells to Cambodia, Thai intelligence documents show."
  },
  {
    "title": "Mika Immonen, Champion Pool Player Known as the Iceman, Dies at 52",
    "link": "https://www.nytimes.com/2025/09/29/sports/mika-immonen-dead.html",
    "summary": "He won the world nine-ball title in 2001 and the 10-ball title in 2009, as well as back-to-back U.S. Opens, earning his nickname for his steely demeanor."
  },
  {
    "title": "‘Kpop Demon Hunters’ Noodle Cup Trend May Increase Burn Risks for Kids",
    "link": "https://www.nytimes.com/2025/09/29/us/kpop-demon-hunters-noodles-tiktok.html",
    "summary": "TikTok users have rushed to get their hands on the instant noodles that appear in the film. One prominent Boston hospital has sounded the alarm."
  }
]