[
  {
    "title": "At U.N. Climate Summit, U.S. Stands Alone",
    "link": "https://www.nytimes.com/2025/09/24/climate/united-nations-climate-summit-emissions-targets.html",
    "summary": "On Wednesday in New York, countries lined up to say they would accelerate their efforts to cut greenhouse-gas emissions. In staying away, the U.S. was all but alone."
  },
  {
    "title": "At the UN, Trump Strikes Radically Different Tones in Public and Private",
    "link": "https://www.nytimes.com/2025/09/24/us/politics/trump-united-nations-tones.html",
    "summary": "At the United Nations, world leaders got to see both sides of President Trump: bellicose in public and far more conciliatory in private."
  },
  {
    "title": "JD Vance Spars With Jon Favreau Over Dallas Shooting Information",
    "link": "https://www.nytimes.com/2025/09/24/style/jd-vance-jon-favreau-dallas-shooting.html",
    "summary": "In the aftermath of a violent episode, political figures quickly engaged with one another on social media."
  },
  {
    "title": "Dallas Shooting Suspect Had Extensive Online Footprint but Little on Politics",
    "link": "https://www.nytimes.com/2025/09/24/us/dallas-ice-shooting-suspect.html",
    "summary": "On social media accounts, the suspect, Joshua Jahn, talked about video games, cars, “South Park” and marijuana — but not so much about politics."
  },
  {
    "title": "Dallas Shooting Comes Amid Growing Tensions Over Immigrant Detentions",
    "link": "https://www.nytimes.com/2025/09/24/us/politics/ice-shooting-dallas-tensions.html",
    "summary": "The Trump administration has blamed the “demonization” of immigration enforcement officers for recent episodes."
  },
  {
    "title": "U.S. Attorney Races to Present Case Against James Comey",
    "link": "https://www.nytimes.com/2025/09/24/us/politics/james-comey-indictment.html",
    "summary": "It remains to be seen whether a career prosecutor would be willing to present a case to a grand jury or whether jurors would bring an indictment."
  },
  {
    "title": "Inquiry Into Ex-C.I.A. Chief Stalls After Purge by Gabbard",
    "link": "https://www.nytimes.com/2025/09/24/us/politics/john-brennan-tulsi-gabbard-cia-trump.html",
    "summary": "The lack of an indictment so far against Mr. Brennan, in the Eastern District of Pennsylvania, is the most recent setback for such prosecutions."
  },
  {
    "title": "Jimmy Kimmel’s Return Draws 6.2 Million Viewers, Ratings Show",
    "link": "https://www.nytimes.com/2025/09/24/business/media/jimmy-kimmel-ratings.html",
    "summary": "The first episode of “Jimmy Kimmel Live!” since it was suspended last week by Disney attracted nearly four times its average viewership."
  },
  {
    "title": "The Billionaire, the Psychedelics and the Best-Selling Memoir",
    "link": "https://www.nytimes.com/2025/09/24/nyregion/amy-griffin-memoir-psychedelic-drugs.html",
    "summary": "Amy Griffin wrote a book based on recovered memories of childhood sexual abuse. Oprah Winfrey and a slew of celebrities promoted it. Then questions arose."
  },
  {
    "title": "Trump’s ‘Surreal’ Tylenol Guidance Worries Pregnant Women",
    "link": "https://www.nytimes.com/2025/09/24/us/politics/pregnant-women-tylenol-trump.html",
    "summary": "The administration’s guidance to avoid Tylenol and “tough it out” prompted anxiety, especially for expectant women who face painful health conditions."
  },
  {
    "title": "Trump’s Pregnancy Advice Strikes a Familiar Refrain for Mothers",
    "link": "https://www.nytimes.com/2025/09/24/well/family/trump-tylenol-pregnancy-advice.html",
    "summary": "Mr. Trump, who implored pregnant women not to take Tylenol, is only the latest in a long line of people offering unsolicited advice to expectant mothers."
  },
  {
    "title": "At a Times Event, Opposing Views on Climate Change Collide",
    "link": "https://www.nytimes.com/2025/09/24/climate/climate-forward-gavin-newsom-chris-wright.html",
    "summary": "In a day of live journalism, California’s governor assailed President Trump, and the U.S. energy secretary called for countries to quit the Paris Agreement on global warming."
  },
  {
    "title": "How Did Maria Branyas Morera, Who Was the World’s Oldest Person, Live So Long?",
    "link": "https://www.nytimes.com/2025/09/24/health/maria-branyas-longevity-genes-microbiome.html",
    "summary": "Spanish researchers say Maria Branyas Morera, who lived to 117, won a genetic lottery. But experts caution that healthy genes and microbiomes don’t explain longevity on their own."
  },
  {
    "title": "With Sobs and Doubts, Greenlandic Women Receive Apology for Forced Contraception",
    "link": "https://www.nytimes.com/2025/09/24/world/europe/denmark-greenland-apology-birth-control.html",
    "summary": "Some Greenlanders asked why an apology had not come decades earlier, and chalked up the timing to tensions over President Trump’s aim of annexing the island."
  },
  {
    "title": "Mel Taub, Creator of a Pun-Loving Puzzle, Is Dead at 97",
    "link": "https://www.nytimes.com/2025/09/24/crosswords/mel-taub-dead.html",
    "summary": "He was the main whiz behind a crossword  variation for The Times, whose readers delighted in his anagrams and sometimes groan-inducing wordplay. (Try one yourself.)"
  },
  {
    "title": "President Trump, Your Aid Cuts Are Costing Lives and Money",
    "link": "https://www.nytimes.com/2025/09/24/opinion/trump-aid-cuts.html",
    "summary": "The dismantling of U.S.A.I.D. is leading to the squandering of taxpayer dollars, as well as of large numbers of lives."
  },
  {
    "title": "Trump Is Building the Blue Scare",
    "link": "https://www.nytimes.com/2025/09/24/opinion/ezra-klein-podcast-corey-robin.html",
    "summary": "The political theorist Corey Robin walks through the history of the Red Scare and the “fractured mirror” it is to Trump’s attack on the “radical left.”"
  },
  {
    "title": "A Shooter Opened Fire on a Dallas ICE Facility",
    "link": "https://www.nytimes.com/2025/09/24/briefing/ice-shooting-vaccine-questions-answered.html",
    "summary": "Also, we answer your vaccine questions. Here’s the latest at the end of Wednesday."
  },
  {
    "title": "Kamala Harris Reinforces Support for Zohran Mamdani in Phone Call",
    "link": "https://www.nytimes.com/2025/09/24/nyregion/kamala-harris-mamdani-phone-call.html",
    "summary": "The conversation came two days after Ms. Harris, the former vice president, gave a muted endorsement to Mr. Mamdani’s bid for mayor of New York City."
  },
  {
    "title": "NJ PBS May Shut Down Next Year Amid Funding Cuts",
    "link": "https://www.nytimes.com/2025/09/24/nyregion/nj-pbs-trump-funding-cuts.html",
    "summary": "The announcement of the possible closure comes as federal funding cuts have hurt public broadcasting stations across the United States."
  },
  {
    "title": "Woman, 50, Killed by Midtown Manhattan Driver in Hit-and-Run Crash",
    "link": "https://www.nytimes.com/2025/09/24/nyregion/midtown-hit-run-woman-killed.html",
    "summary": "A driver hit the woman and her husband, tourists from Germany, near Bryant Park on Wednesday afternoon. Her husband, 55, was injured, the police said."
  },
  {
    "title": "Want to Bring a Dog to This Italian City? That Will Be $1.75.",
    "link": "https://www.nytimes.com/2025/09/24/world/europe/bolzano-italy-dog-tax.html",
    "summary": "Bolzano, in northern Italy, is considering taxing tourists’ dogs, and charging resident dog owners an annual fee as well."
  }
]