[
  {
    "title": "CDC Vaccine Panel Postpones One Vote and Reverses Another Amid Confusion",
    "link": "https://www.nytimes.com/2025/09/19/health/cdc-vaccines-mmrv-hepatitis-b.html",
    "summary": "Committee members delayed indefinitely a vote on a hepatitis B vaccine for newborns because they did not feel ready to make a decision."
  },
  {
    "title": "The S.E.C. Drops Efforts to Recoup Funds From Trump Clemency Recipients",
    "link": "https://www.nytimes.com/2025/09/19/us/politics/sec-trump-clemency.html",
    "summary": "Devon Archer, Trevor Milton and Carlos Watson were convicted in fraud schemes totaling hundreds of millions of dollars. Now, they will not be required by the government to pay back victims."
  },
  {
    "title": "Draft Bill Would Authorize Trump to Kill People He Deems Narco-Terrorists",
    "link": "https://www.nytimes.com/2025/09/19/us/politics/trump-drug-cartels-war-authorization.html",
    "summary": "Potential legislation circulating in the executive branch and Congress would grant President Trump sweeping military powers."
  },
  {
    "title": "How Outrage at Kimmel Grew to a Shout From a Whisper",
    "link": "https://www.nytimes.com/2025/09/19/technology/kimmel-carr-outrage-online.html",
    "summary": "Right-wing users on social media on Tuesday were frustrated but not yet apoplectic about Jimmy Kimmel’s monologue. Things changed."
  },
  {
    "title": "In Pressuring ABC Over Kimmel, Trump May Have Crossed a Constitutional Line",
    "link": "https://www.nytimes.com/2025/09/19/us/politics/supreme-court-jimmy-kimmel-free-speech.html",
    "summary": "The Supreme Court has distinguished bully-pulpit persuasion, which is permissible under the First Amendment, from coercion and threats, which are not."
  },
  {
    "title": "Judge Dismisses Trump’s $15 Billion Lawsuit Against The New York Times",
    "link": "https://www.nytimes.com/2025/09/19/business/media/trump-new-york-times-lawsuit.html",
    "summary": "The judge said that the complaint failed to contain a “short and plain statement of the claim.” Mr. Trump has 28 days to refile."
  },
  {
    "title": "Battered but Undefeated, Hamas Remains a Fighting Force in Gaza",
    "link": "https://www.nytimes.com/2025/09/19/world/middleeast/hamas-remaining-in-gaza.html",
    "summary": "Some Israeli officials believe the military assault on Gaza City will deliver a decisive blow to the group, which continues to stage ambushes and guerrilla attacks."
  },
  {
    "title": "What Charlie Kirk Could Mean for the Future of Marriage and Family",
    "link": "https://www.nytimes.com/2025/09/19/us/politics/charlie-kirk-erika-family-marriage-children.html",
    "summary": "Erika Kirk said her husband aspired to “revive the American family.” Conservative activists wonder if Charlie Kirk’s legacy will lend new urgency to White House policy discussions."
  },
  {
    "title": "Charlie Kirk’s Base Was Young People. Now His Tent Might Be Expanding.",
    "link": "https://www.nytimes.com/2025/09/19/us/charlie-kirk-turning-point-usa.html",
    "summary": "Since his death, the parents and grandparents of his original followers are discovering his work. They like what they see."
  },
  {
    "title": "The Plot to Free the Nuns",
    "link": "https://www.nytimes.com/2025/09/19/world/europe/nuns-austria-sisters.html",
    "summary": "The last of their order, they are now known for a dispute with the church they gave their lives to over where to live in retirement. And they wanted to stay home."
  },
  {
    "title": "A Missing Woman, an N.B.A. Hopeful and an Arrest That Shocked a Team",
    "link": "https://www.nytimes.com/2025/09/19/us/comanche-murder-trial-stockton-kings-nba.html",
    "summary": "In 2023, Chance Comanche was playing some of the best basketball of his life. His teammates thought he was on his way to the N.B.A. Instead, he was accused of murder."
  },
  {
    "title": "Russian Fighter Jets Enter Airspace of Estonia, a NATO Member",
    "link": "https://www.nytimes.com/2025/09/19/world/europe/russian-fighter-jets-estonia-nato.html",
    "summary": "Estonia’s foreign minister described the flights, which lasted for an unusually long 12 minutes, as an “unprecedentedly brazen” intrusion."
  },
  {
    "title": "Europe Announces New Sanctions to Ramp Up Pressure on Russia",
    "link": "https://www.nytimes.com/2025/09/19/world/europe/eu-sanctions-russia-ukraine.html",
    "summary": "The latest set of European Union restrictions are aimed at chipping away at Russia’s energy profits and ability to do business globally."
  },
  {
    "title": "Political Violence Isn’t New. But Something About This Moment Is.",
    "link": "https://www.nytimes.com/2025/09/19/magazine/tyler-robinson-political-violence.html",
    "summary": "Charlie Kirk’s assassination fits into American history. How does it fit into our politics?"
  },
  {
    "title": "Trump and China, in Vague Statements, Suggest TikTok Deal Could Move Ahead",
    "link": "https://www.nytimes.com/2025/09/19/business/trump-tiktok-deal-china.html",
    "summary": "The president wrote on Truth Social, “appreciate the TikTok approval,” after a call with China’s top leader, Xi Jinping. But he also suggested the deal and other issues were still in progress."
  },
  {
    "title": "How China Could Use a TikTok Deal to Ease U.S. Pressure",
    "link": "https://www.nytimes.com/2025/09/19/world/asia/tiktok-xi-trump-china.html",
    "summary": "The Chinese leader’s willingness to discuss a TikTok deal suggests that the fate of the app matters less than issues like tariffs, technology and Taiwan."
  },
  {
    "title": "As Farm Aid Reaches 40 Years, It Deals With Familiar Farming Crises",
    "link": "https://www.nytimes.com/2025/09/19/business/farm-aid-40-concert-farmers-crisis-hotline.html",
    "summary": "Saturday’s star-studded concert will air on TV for the first time in years as the hotline for farmers gets more calls about a mix of complicated problems."
  },
  {
    "title": "Trump Officials Question Harvard’s Stability, Saying Federal Inquiries Raise Financial Risk",
    "link": "https://www.nytimes.com/2025/09/19/us/politics/trump-harvard-financial-risk.html",
    "summary": "The administration’s latest attack on the nation’s oldest university comes as negotiations stall for a settlement to restore billions in frozen federal research funds."
  },
  {
    "title": "Texas A&M President to Step Down After Controversy Over ‘Gender Ideology’",
    "link": "https://www.nytimes.com/2025/09/18/us/texas-am-president-gender-ideology-controversy.html",
    "summary": "The university had been roiled after a student filmed herself arguing with the instructor of a children’s literature course that recognized more than two genders."
  },
  {
    "title": "Autocrats Move Quickly to Fill Void as Trump Retreats From U.N.",
    "link": "https://www.nytimes.com/2025/09/19/world/asia/trump-un-china-authoritarian.html",
    "summary": "As President Trump pulls back U.S. funding of the United Nations, countries like China, Russia and Qatar are seeking to influence the body’s work on human rights and labor."
  },
  {
    "title": "How China Stands to Gain as the U.S. Steps Away From the U.N.",
    "link": "https://www.nytimes.com/2025/09/19/world/asia/china-united-nations-trump.html",
    "summary": "U.S. funding cuts are straining the United Nations and giving Beijing an opening to strengthen its influence, at a fraction of the cost Washington once paid."
  },
  {
    "title": "Elon Musk Has Focused on xAI Since Leaving Washington",
    "link": "https://www.nytimes.com/2025/09/18/technology/elon-musk-artificial-intelligence-xai.html",
    "summary": "Mr. Musk spent the summer at his artificial intelligence start-up xAI, trying to match the runaway success of OpenAI. The result was chaos."
  },
  {
    "title": "Agnes Gund, Who Oversaw a Major Expansion of MoMA, Dies at 87",
    "link": "https://www.nytimes.com/2025/09/19/arts/agnes-gund-dead.html",
    "summary": "A champion of contemporary art, she was the museum’s president for 11 years. She also founded the Art for Justice Fund, donating $100 million."
  },
  {
    "title": "She’s Starting a Blood Bank for Zoos",
    "link": "https://www.nytimes.com/2025/09/19/science/zoo-veterinarian-blood.html",
    "summary": "Captive animals sometimes need a transfusion, but the typical approach to blood banking isn’t practical for zoos and aquariums. One veterinarian is testing a solution."
  },
  {
    "title": "We Can No Longer Tell Ourselves This Isn’t Really Happening",
    "link": "https://www.nytimes.com/2025/09/19/opinion/jimmy-kimmel-trump-media-government.html",
    "summary": "Laughter is now a government-regulated product."
  },
  {
    "title": "Spencer Cox Wants to Pull Our Politics Back From the Brink",
    "link": "https://www.nytimes.com/2025/09/19/opinion/ezra-klein-podcast-spencer-cox.html",
    "summary": "The Utah governor is trying to model a different kind of leadership in a very dangerous political moment."
  },
  {
    "title": "Soros Gives $10 Million to Newsom Redistricting Fight",
    "link": "https://www.nytimes.com/2025/09/19/us/politics/gavin-newsom-redistricting-california-fundraising.html",
    "summary": "The sum makes the Soros family the single largest funder so far in favor of the California effort to counter President Trump."
  },
  {
    "title": "32 Years After a Brutal Murder, a Man Is on Trial. Again.",
    "link": "https://www.nytimes.com/2025/09/19/nyregion/tonanwanda-murder-retrial.html",
    "summary": "A judge vacated the convictions of two men accused of killing Deborah Meindl in her Tonawanda, N.Y., home. The district attorney is trying to convict them once more."
  },
  {
    "title": "The Race Is on to Make Rare Earth Magnets Outside China",
    "link": "https://www.nytimes.com/2025/09/19/business/china-rare-earths-magnets.html",
    "summary": "After Beijing exerted its power over the valuable magnets as leverage, other countries started to add production, but only incrementally. And China is far ahead."
  },
  {
    "title": "Brett James, Grammy-Winning Songwriter, Dies in Plane Crash in North Carolina",
    "link": "https://www.nytimes.com/2025/09/19/us/plane-crash-north-carolina-brett-james.html",
    "summary": "He had written hits for Carrie Underwood, Kenny Chesney and other country stars. Two other people on the plane were also killed when it crashed into a field in Franklin, N.C., officials said."
  }
]