[
  {
    "title": "CDC Director Susan Monarez Is Fired, White House Says",
    "link": "https://www.nytimes.com/2025/08/27/health/cdc-monarez-kennedy-vaccines.html",
    "summary": "Susan Monarez was said to have refused to adopt Health Secretary Robert F. Kennedy Jr.’s stance on vaccination policy. A lawyer for Dr. Monarez said the firing was “legally deficient.”"
  },
  {
    "title": "Steven Cook, a Former Chemical Industry Lawyer, Now at E.P.A., Wants to Change PFAS Rules",
    "link": "https://www.nytimes.com/2025/08/28/climate/steven-cook-epa-pfas-forever-chemicals.html",
    "summary": "A Trump appointee has proposed rewriting a measure that requires companies to clean up “forever chemicals,” documents show. The new version would shift costs from polluters."
  },
  {
    "title": "John Bolton Inquiry Eyes Emails Obtained by Foreign Government",
    "link": "https://www.nytimes.com/2025/08/27/us/politics/bolton-trump-emails-fbi-investigation.html",
    "summary": "It is not clear what country intercepted Mr. Bolton’s private emails, but the investigation into President Trump’s former national security adviser picked up momentum under the Biden administration."
  },
  {
    "title": "C.D.C. Loses Top Officials, and Why Israeli Reservists Aren’t Showing Up for Duty",
    "link": "https://www.nytimes.com/2025/08/28/podcasts/the-headlines/cdc-five-top-officials-israeli-soldiers.html",
    "summary": "Plus, robots for rent."
  },
  {
    "title": "Minneapolis Shooting Suspect Knew Her Target, but Motive Is a Mystery",
    "link": "https://www.nytimes.com/2025/08/27/us/minneapolis-school-shooting-suspect-gunman.html",
    "summary": "The shooter who attacked a Catholic school on Wednesday posted social media videos and writings that betrayed a litany of grievances and obsessions."
  },
  {
    "title": "Survivors of Minneapolis Catholic School Shooting Face Long Road Ahead",
    "link": "https://www.nytimes.com/2025/08/28/us/minneapolis-school-shooting-victims-survivors-injuries.html",
    "summary": "Children who survive school shootings deal with a host of complex feelings, ranging from anxiety and grief to guilt and shame."
  },
  {
    "title": "What We Know About the Minneapolis Catholic School Shooting",
    "link": "https://www.nytimes.com/2025/08/27/us/minneapolis-school-shooting-minnesota.html",
    "summary": "Investigators were still searching for a motive in the shooting, which left two children dead at Annunciation Catholic Church in Minneapolis."
  },
  {
    "title": "Trump’s Push to Fire Lisa Cook Puts Fed Independence on Trial",
    "link": "https://www.nytimes.com/2025/08/27/us/politics/supreme-court-fed-trump.html",
    "summary": "The Supreme Court has said the Federal Reserve Board’s independence warrants protection. President Trump’s effort to fire a member will test that commitment."
  },
  {
    "title": "How Trump Could Gain Control of the Fed",
    "link": "https://www.nytimes.com/video/business/economy/100000010362356/how-trump-could-gain-control-of-the-fed.html",
    "summary": "President Trump’s attempt to fire Lisa Cook has laid bare the erosion of the Federal Reserve’s independence, which could lead to economic consequences for Americans, The New York Times’s chief economics correspondent explains."
  },
  {
    "title": "Trump’s Fed Feud Spotlights Mortgage Data Privacy: Is Your Information Public?",
    "link": "https://www.nytimes.com/2025/08/28/business/mortgage-data-privacy-lisa-cook-trump.html",
    "summary": "After President Trump accused a Federal Reserve governor of mortgage fraud, everyday citizens are waking up to just how much information is out there."
  },
  {
    "title": "Russian Missile and Drone Attack Kills at Least 15 in Kyiv",
    "link": "https://www.nytimes.com/2025/08/28/world/europe/ukraine-russia-strikes.html",
    "summary": "The strikes on Ukraine’s capital, nearly two weeks after the U.S.-Russia summit in Alaska, injured at least 45 people, officials said."
  },
  {
    "title": "Russian Drones Are Flying Over U.S. Weapons Routes in Germany, Officials Say",
    "link": "https://www.nytimes.com/2025/08/28/us/politics/russian-drones-weapons-routes.html",
    "summary": "U.S. and European military officials are increasingly concerned about the flights, even as Russian acts of sabotage have declined."
  },
  {
    "title": "Austria’s Hills Are Still Alive, 60 Years Later",
    "link": "https://www.nytimes.com/2025/08/28/world/europe/austria-sound-of-music.html",
    "summary": "In Salzburg, an anniversary of “The Sound of Music” looks grand through a child’s eyes, even if the locals are gazing elsewhere."
  },
  {
    "title": "Nvidia Earnings Show Sales Jump Amid Strong Demand for A.I. Chips",
    "link": "https://www.nytimes.com/2025/08/27/technology/nvidia-earnings-ai-chips.html",
    "summary": "The chipmaker, now the most valuable public company in the world, said strong demand for its chips should continue this quarter."
  },
  {
    "title": "U.S. Government Cracks Down on Organ Transplant System",
    "link": "https://www.nytimes.com/2025/08/28/us/federal-crackdown-organ-donations.html",
    "summary": "Organ donation groups accused of safety lapses are facing multiple investigations, and new policies are underway to protect patients."
  },
  {
    "title": "A Push for More Organ Transplants Is Putting Donors at Risk",
    "link": "https://www.nytimes.com/2025/07/20/us/organ-transplants-donors-alive.html",
    "summary": "People across the United States have endured rushed or premature attempts to remove their organs. Some were gasping, crying or showing other signs of life."
  },
  {
    "title": "Israel’s Exhausted Soldiers Complicate Plans for Gaza Assault",
    "link": "https://www.nytimes.com/2025/08/28/world/middleeast/israels-exhausted-reservists-gaza.html",
    "summary": "Worn down by hundreds of days of military service, fewer Israeli reservists are turning up for duty. Others are refusing to fight in a war they no longer believe in."
  },
  {
    "title": "Nothing Could Topple the ‘Queen of Heels.’ Then Trump Came Along.",
    "link": "https://www.nytimes.com/2025/08/28/us/politics/tariffs-luxury-shoes-brazil-trump.html",
    "summary": "The president’s steep tariffs and erratic moves have turned manufacturing abroad into a minefield, even for entrepreneurs who set up in countries viewed as safe alternatives to China."
  },
  {
    "title": "A Casualty of Trump’s Tariffs: India’s Nascent Solar Industry",
    "link": "https://www.nytimes.com/2025/08/27/climate/india-solar-panels-tariff-exports.html",
    "summary": "The full weight of a 50 percent tariff on Indian goods took effect this week, undercutting one of the country’s most promising markets for solar exports."
  },
  {
    "title": "At the U.S. Open, Players’ Dogs Have the Run of the Place",
    "link": "https://www.nytimes.com/2025/08/28/style/us-open-dogs.html",
    "summary": "At the U.S. Open, players’ dogs are a key part of the entourage, and they have the run of the place."
  },
  {
    "title": "America Was Making Progress on Opioid Addiction. That’s Now at Risk",
    "link": "https://www.nytimes.com/2025/08/28/opinion/opioids-progress-trump-policy-law.html",
    "summary": "Trump’s budget law effectively undoes much of the good that the Affordable Care Act did in reducing opioid deaths."
  },
  {
    "title": "Disney World Is the Happiest Place on Earth, if You Can Afford It",
    "link": "https://www.nytimes.com/2025/08/28/opinion/disney-world-economy-middle-class-rich.html",
    "summary": "The theme-park operator, like so many other companies, is abandoning America’s middle class."
  },
  {
    "title": "A Shooting in Minnesota",
    "link": "https://www.nytimes.com/2025/08/28/briefing/shooting-minneapolis.html",
    "summary": "We have the latest on the attack on Annunciation Catholic Church."
  },
  {
    "title": "Medicare Will Require Prior Approval for Certain Procedures",
    "link": "https://www.nytimes.com/2025/08/28/health/medicare-prior-approval-health-care.html",
    "summary": "A pilot program in six states will use a tactic employed by private insurers that has been heavily criticized for delaying and denying medical care."
  },
  {
    "title": "Jimmy Lai’s Freedom May Now Hinge on Beijing and Trump",
    "link": "https://www.nytimes.com/2025/08/27/world/asia/hong-kong-jimmy-lai-trump.html",
    "summary": "As the outspoken Hong Kong publisher awaits a verdict, his trial has become a test of China’s resolve to crush dissent, and of whether President Trump can free him."
  },
  {
    "title": "Inside the Crisis Gripping New Jersey’s Federal Courts",
    "link": "https://www.nytimes.com/2025/08/28/nyregion/new-jersey-federal-court-slowdown.html",
    "summary": "Trials and hearings have been delayed since a judge ruled that Alina Habba was serving unlawfully as U.S. attorney. The uncertainty may last for months."
  },
  {
    "title": "Relics From an Ancient Egyptian ‘Party Town’ Are Pulled Out of the Sea",
    "link": "https://www.nytimes.com/2025/08/28/world/middleeast/egypt-alexandria-sunken-city.html",
    "summary": "Remnants of a 2,000-year-old sunken city, Canopus, were lifted from waters off Alexandria, Egypt, revealing the city might have been larger than thought."
  }
]