[
  {
    "title": "Supreme Court Ruling on SNAP Benefits Leaves Families in Limbo",
    "link": "https://www.nytimes.com/2025/11/08/us/politics/families-food-stamps-supreme-court-order.html",
    "summary": "In many states, it remained unclear how the Supreme Court’s Friday night order might immediately affect low-income residents."
  },
  {
    "title": "A Timeline of the Legal Saga Surrounding SNAP Payments",
    "link": "https://www.nytimes.com/2025/11/08/us/politics/snap-payments-timeline.html",
    "summary": "Weeks of uncertainty during the longest government shutdown in American history have left some states struggling to issue payments to food stamp recipients."
  },
  {
    "title": "How Families Are Coping with SNAP Cuts During the Shutdown",
    "link": "https://www.nytimes.com/2025/11/07/us/politics/snap-benefits-cuts-shutdown.html",
    "summary": "For the 42 million people who rely on the country’s largest anti-hunger program, it has been a chaotic, nerve-racking week. Here are some of their stories."
  },
  {
    "title": "Worries Increase on Second Day of Flight Cancellations",
    "link": "https://www.nytimes.com/2025/11/08/us/worries-mount-as-air-traffic-delays-stretch-to-second-day.html",
    "summary": "Disruptions to air travel on Saturday were modest, but officials and passengers were bracing for worse as the government shutdown continued."
  },
  {
    "title": "Gavin Newsom, Eyeing 2028, Tries to Mess With Texas",
    "link": "https://www.nytimes.com/2025/11/08/us/politics/newsom-2028-texas-rally-abbott-trump.html",
    "summary": "Celebrating his recent redistricting victory, the California governor swooped into a state led by a Republican rival and sent the latest signal about his presidential ambitions."
  },
  {
    "title": "Live From New York: Zohran Mamdani’s Got Jokes",
    "link": "https://www.nytimes.com/2025/11/08/nyregion/mamdani-humor-funny.html",
    "summary": "New York City’s next mayor showed during the campaign that he has a sharp sense of humor. Keeping things light at City Hall could be trickier."
  },
  {
    "title": "Black South Carolina Residents Say Re-Routed Penn Center Parade Feels Like Erasure",
    "link": "https://www.nytimes.com/2025/11/08/us/penn-center-parade-south-carolina-gullah-geechee.html",
    "summary": "The annual Penn Center Heritage Day Parade in South Carolina draws hundreds to celebrate the Gullah Geechee people. But a new route has Black residents feeling as if their legacy is vanishing."
  },
  {
    "title": "Spain’s True-Crime Capital Is Fed Up",
    "link": "https://www.nytimes.com/2025/11/09/world/europe/spain-tor-sansa-true-crime-carles-porta.html",
    "summary": "A decades-old killing in a tiny village in a northern mountain town has turned the village into a destination for true-crime enthusiasts, creating a headache for remaining residents."
  },
  {
    "title": "I Photographed an Appalachian Family for 15 Years",
    "link": "https://www.nytimes.com/2025/11/06/opinion/appalachia-family-photographs-poverty.html",
    "summary": "A photographer spends 15 years documenting an Appalachian family and the constant pressure of poverty in their lives."
  },
  {
    "title": "We Can’t Pretend to Know the Future of the Democratic Party",
    "link": "https://www.nytimes.com/2025/11/08/opinion/democrats-elections-new-york-new-jersey-virginia.html",
    "summary": "There is no one-size-fits-all template for winning elections."
  },
  {
    "title": "Merck PCSK9 Pill Results Point to Extremely Low Cholesterol Future",
    "link": "https://www.nytimes.com/2025/11/08/health/merck-cholesterol-pill-pcsk9.html",
    "summary": "The drug targets the PCSK9 protein, and could give millions of people a more affordable option to reduce their heart disease risk."
  },
  {
    "title": "Heavy Rain Expected in California After Spell of Unusually Warm Weather",
    "link": "https://www.nytimes.com/2025/11/08/weather/california-weather-heat-rain.html",
    "summary": "Areas across the state could record anywhere from one to five or more inches of rain. The Sierra will get some snow."
  },
  {
    "title": "John Cleary, Wounded in Kent State Shooting, Dies at 74",
    "link": "https://www.nytimes.com/2025/11/07/us/john-cleary-dead.html",
    "summary": "He was shot in 1970 by the National Guard during a student protest over the Vietnam War that left four dead in Ohio. A photo of him lying on the ground and bleeding made the cover of Life magazine."
  },
  {
    "title": "After More Than 30 Years, a Man Is Charged in Seattle Girl’s Killing",
    "link": "https://www.nytimes.com/2025/11/08/us/seattle-police-arrest-tanya-frazier-murder.html",
    "summary": "Tanya Marie Frazier, 14, never returned from summer school in 1994, and was found dead in a wooded area five days later. The police say a new DNA analysis links a felon to her death."
  }
]