[
  {
    "title": "The A.I. Boom Has Found Another Gear. Why Can’t People Shake Their Worries?",
    "link": "https://www.nytimes.com/2025/11/20/technology/ai-stock-boom-nvidia.html",
    "summary": "It is a time of superlatives in the tech industry, with historic profits, stock prices and deal prices. It’s enough to make some people very nervous."
  },
  {
    "title": "Anxiety Over A.I. Spending Returns to Global Markets",
    "link": "https://www.nytimes.com/2025/11/20/business/stocks-ai-global.html",
    "summary": "A sharp reversal in Asian and European stocks, after a rally fueled by Nvidia’s strong earnings, underscores how fears of an A.I. bubble are driving broad market swings."
  },
  {
    "title": "Mamdani at the White House, and the Coast Guard’s New Policy on Swastikas and Nooses",
    "link": "https://www.nytimes.com/2025/11/21/podcasts/the-headlines/mamdani-white-house-coast-guard.html",
    "summary": "Plus, your Friday news quiz."
  },
  {
    "title": "Congressional Republicans Begin to Look Beyond Trump",
    "link": "https://www.nytimes.com/2025/11/20/us/politics/congressional-republicans-trump-midterms.html",
    "summary": "Election defeats earlier this month and the approach of 2026 have G.O.P. lawmakers cautiously asserting themselves."
  },
  {
    "title": "Trump and Mamdani Are Meeting for the First Time. Will They Play Nice?",
    "link": "https://www.nytimes.com/2025/11/20/nyregion/mamdani-trump-meeting.html",
    "summary": "Zohran Mamdani, the mayor-elect of New York City, will go to the White House on Friday. The stakes are high for the city."
  },
  {
    "title": "Zelensky Says Ukraine Ready to ‘Honestly’ Engage With U.S. Peace Plan",
    "link": "https://www.nytimes.com/2025/11/20/world/europe/ukraine-russia-trump-peace-talks.html",
    "summary": "The proposal, which the White House confirmed on Thursday without providing details, echoes many long-held Russian demands."
  },
  {
    "title": "Trump’s All-but-Forgotten Border Wall Reaches an Angry Laredo, Texas",
    "link": "https://www.nytimes.com/2025/11/21/us/politics/trump-border-wall-texas.html",
    "summary": "Once the symbol of the president’s immigration policies, the wall has been eclipsed by his deportation efforts, but with $46.5 billion from Congress, construction is ramping up on the Rio Grande."
  },
  {
    "title": "After Syria’s 14-Year Civil War, a Search for Victims Leads to Mass Graves",
    "link": "https://www.nytimes.com/2025/11/21/world/middleeast/syria-mass-graves-civil-war.html",
    "summary": "More than 100,000 people disappeared during the 13-year civil war. To bring closure to some of their families, the new government faces the challenging task of exhuming remains from scores of burial sites."
  },
  {
    "title": "Republicans’ Redistricting Push Is at Risk of Backfiring",
    "link": "https://www.nytimes.com/2025/11/21/upshot/republicans-redistricting-gerrymanders-update.html",
    "summary": "A series of setbacks for the G.O.P. leaves an unlikely opening for Democrats to narrowly win this year’s redistricting wars."
  },
  {
    "title": "Japan’s Leader Gets Off to Rocky Start With China",
    "link": "https://www.nytimes.com/2025/11/21/world/asia/japan-china-taiwan-dispute.html",
    "summary": "Facing reprisals from Beijing for a remark over Taiwan, Prime Minister Sanae Takaichi must walk a fine line to prevent escalating the dispute without looking weak at home."
  },
  {
    "title": "Adrien Nunez, the Brooklyn Basketball Star Who Became a Country Music Heartthrob",
    "link": "https://www.nytimes.com/2025/11/21/nyregion/adrien-nunez-low-road-songs-basketball.html",
    "summary": "As a boy in Brooklyn, Adrien Nunez dreamed of playing in the N.B.A. He got close, but it turns out he had a gift for singing at the top of his lungs in his car."
  },
  {
    "title": "Researcher’s Smuggling Arrest Casts Light on Dispute Over Chinese Students",
    "link": "https://www.nytimes.com/2025/11/21/world/asia/chinese-students-us.html",
    "summary": "As some lawmakers press U.S. universities to curtail ties with China, a postdoctoral student’s prosecution raises questions about how big the danger actually is."
  },
  {
    "title": "Fine Chocolate in Brazil, Home of the Cacao Bean",
    "link": "https://www.nytimes.com/2025/11/21/climate/cop30-belem-chocolate.html",
    "summary": "A new generation of craft chocolatiers in Brazil is making bars with “identity.” They’re helping to sustain the forest, too."
  },
  {
    "title": "Trump Promised Lower Prices. His Policies Are Raising Them.",
    "link": "https://www.nytimes.com/2025/11/21/opinion/trump-prices-affordability-promises-inflation.html",
    "summary": "From the day he took the oath of office, the president has pursued policies that are making life in America less affordable."
  },
  {
    "title": "What Trump’s Immigration Policies Are Doing to People Here Legally",
    "link": "https://www.nytimes.com/2025/11/21/opinion/ice-immigration-green-card-detention.html",
    "summary": "Something new is happening in the breadth and ferocity of efforts to change the makeup of this country."
  },
  {
    "title": "Is President Trump’s Power Over the Republican Party Waning?",
    "link": "https://www.nytimes.com/2025/11/21/briefing/is-president-trumps-power-over-the-republican-party-waning.html",
    "summary": "Some members of the party are defying him."
  },
  {
    "title": "‘I’ll Go When You Go,’ Jimmy Kimmel Tells Trump",
    "link": "https://www.nytimes.com/2025/11/21/arts/television/jimmy-kimmel-trump-abc.html",
    "summary": "“Let’s ride off into the sunset together like Butch Cassidy and the Suntan Kid,” Kimmel said after the president demanded (again) that ABC take him off the air."
  },
  {
    "title": "Representative Eric Swalwell Will Run for California Governor",
    "link": "https://www.nytimes.com/2025/11/21/us/eric-swalwell-california-governor.html",
    "summary": "Representative Eric Swalwell, a Democrat, is likely to emphasize his history of fighting President Trump, an approach that many Democratic voters say they want their elected officials to take."
  },
  {
    "title": "U.S. Manufacturers to Benefit as GE Appliances Shifts Production",
    "link": "https://www.nytimes.com/2025/11/20/business/ge-appliances-us-production.html",
    "summary": "The company, now owned by a Chinese conglomerate, is investing $150 million in 19 American suppliers across 10 states."
  },
  {
    "title": "Mexico Wins Miss Universe Pageant Marred by Scandal",
    "link": "https://www.nytimes.com/2025/11/21/world/asia/miss-universe-mexico.html",
    "summary": "Fátima Bosch was crowned in Thailand on Friday. The competition got off to a rocky start this month when she briefly walked out after being scolded by an organizer."
  },
  {
    "title": "Frida Kahlo Portrait Sells for $55 Million, Setting Her Auction Record",
    "link": "https://www.nytimes.com/2025/11/20/arts/design/kahlo-portrait-auction-art-sothebys.html",
    "summary": "The surrealistic self-portrait was made in 1940, a turbulent year in the Mexican artist’s life as her health and marriage deteriorated."
  }
]