[
  {
    "title": "Small Island Nations Lack Funds to Fight Climate Disasters",
    "link": "https://www.nytimes.com/2025/10/28/climate/hurricane-jamaica-caribbean.html",
    "summary": "As Hurricane Melissa threatens island nations across the Caribbean, many are already burdened by debt from a string of climate-fueled crises."
  },
  {
    "title": "Trump Says He Is Prepared to Send ‘More Than the National Guard’ Into U.S. Cities",
    "link": "https://www.nytimes.com/2025/10/28/us/politics/trump-japan-national-guard-us-cities.html",
    "summary": "In a speech to American troops assembled in Japan on Tuesday, President Trump said he would escalate his orders to active duty branches of the military if he decides it is appropriate."
  },
  {
    "title": "Judge Questions Gregory Bovino Over Immigration Crackdown Tactics",
    "link": "https://www.nytimes.com/2025/10/28/us/chicago-bovino-tear-gas.html",
    "summary": "Gregory Bovino, a border patrol official who has become a public face of President Trump’s crackdown, appeared in a Chicago courtroom."
  },
  {
    "title": "Netanyahu Orders Strikes on Gaza, as Israel Says Hamas Violated Cease-Fire",
    "link": "https://www.nytimes.com/2025/10/28/world/middleeast/israel-gaza-netanyahu-strikes.html",
    "summary": "The office of the Israeli Prime Minister said on Tuesday evening that he had ordered “forceful strikes” after Hamas fired on Israeli troops and failed to return hostages’ bodies."
  },
  {
    "title": "More Food Reaches Gaza, but It’s Still Not Enough",
    "link": "https://www.nytimes.com/2025/10/28/nyregion/gaza-aid-trucks.html",
    "summary": "Aid to the devastated territory has increased since the cease-fire took effect and prices have fallen. But many trucks going into Gaza are bringing food and commercial goods to sell that most people cannot afford."
  },
  {
    "title": "Israel Conducts First Airstrike in West Bank in Months and Kills 3",
    "link": "https://www.nytimes.com/2025/10/28/world/middleeast/jenin-west-bank-airstrike-israel.html",
    "summary": "A militant group allied with Hamas confirmed the deaths, which were part of an increase in fighting in the Palestinian territory during a surge of settler violence."
  },
  {
    "title": "Trump Bonds With Japan’s Leader Over Baseball and U.S. Beef",
    "link": "https://www.nytimes.com/2025/10/28/us/politics/trump-takaichi-japan-meeting.html",
    "summary": "The president and Sanae Takaichi, the Japanese prime minister, traded compliments in Tokyo, but signaled no major breakthrough in resolving ongoing trade issues."
  },
  {
    "title": "As Trump Tariffs Canada, Carney Turns to Asia for Trade",
    "link": "https://www.nytimes.com/2025/10/28/world/canada/carney-asia-trade-trump.html",
    "summary": "Mark Carney is pitching Canada as a predictable and responsible alternative to the United States."
  },
  {
    "title": "Japanese Executives Called On by Trump Pledge U.S. Investment",
    "link": "https://www.nytimes.com/2025/10/28/business/trump-japan-toyota.html",
    "summary": "Toyota said it would sell some of its U.S.-made cars in Japan, one of a number of announcements by companies responding to U.S. pressure over trade imbalances."
  },
  {
    "title": "48 Hours Without A.I.",
    "link": "https://www.nytimes.com/2025/10/28/style/48-hours-without-ai.html",
    "summary": "It’s everywhere, as the author learned the hard way while making as little contact as possible with machine learning and generative artificial intelligence."
  },
  {
    "title": "OpenAI Restructures as For-Profit Company",
    "link": "https://www.nytimes.com/2025/10/28/technology/openai-restructure-for-profit-company.html",
    "summary": "The artificial intelligence company said that the nonprofit that controlled the organization would receive a $130 billion stake in the new company."
  },
  {
    "title": "Can a Start-Up Make Computer Chips Cheaper Than the Industry’s Giants?",
    "link": "https://www.nytimes.com/2025/10/28/business/can-a-start-up-make-computer-chips-cheaper-than-the-industrys-giants.html",
    "summary": "Substrate, a San Francisco company, is trying to take on powerhouses like the Dutch company ASML."
  },
  {
    "title": "‘The Beginning of a Movement’: Snapshots From a Mamdani Rally",
    "link": "https://www.nytimes.com/2025/10/28/nyregion/photos-mamdani-aoc-bernie-rally.html",
    "summary": "Zohran Mamdani’s rally on Sunday nearly filled Forest Hills Stadium in Queens, which holds 13,000 attendees. Here’s why some of them went, in their own words."
  },
  {
    "title": "A Twist in the Candy Cane Park Murder Investigation in Oregon",
    "link": "https://www.nytimes.com/2025/10/28/us/trump-cuts-candy-cane-park-killing-oregon.html",
    "summary": "An unlikely twist in the investigation of a killing in 1983 that still haunts a small town in Oregon."
  },
  {
    "title": "Memo From Bill Gates Warns Against Climate Alarmism",
    "link": "https://www.nytimes.com/2025/10/28/climate/bill-gates-climate-change-humanity.html",
    "summary": "In a memo, the Microsoft co-founder warned against climate alarmism and appears to have shifted some of his views about climate change."
  },
  {
    "title": "MacKenzie Scott Backs Disaster Recovery in Marginalized Communities",
    "link": "https://www.nytimes.com/2025/10/28/climate/mackenzie-scott-disaster-gift.html",
    "summary": "The billionaire’s $60 million donation to the Center for Disaster Philanthropy counters cuts to federal emergency assistance and diversity programs."
  },
  {
    "title": "In a Looming Nuclear Arms Race, Aging Los Alamos Faces a Major Test",
    "link": "https://www.nytimes.com/2025/10/28/us/los-alamos-nuclear-program.html",
    "summary": "The lab where Oppenheimer developed the atomic bomb is the linchpin in the United States’ effort to modernize its nuclear weapons. Yet the site has contended with contamination incidents, work disruptions and old infrastructure."
  },
  {
    "title": "Texas Sues Tylenol Makers, Claiming They Hid Autism Risks",
    "link": "https://www.nytimes.com/2025/10/28/health/tylenol-autism-texas-lawsuit.html",
    "summary": "The lawsuit follows claims by President Trump that linked acetaminophen taken by pregnant women to autism, a connection that is unproven."
  },
  {
    "title": "Gavin Newsom Tells Donors He Has Enough Cash for California Redistricting Fight",
    "link": "https://www.nytimes.com/2025/10/28/us/newsom-redistricting-donors-proposition-50.html",
    "summary": "In an unusual show of confidence, Gov. Gavin Newsom said he raised enough cash more than a week before the California redistricting election."
  },
  {
    "title": "California Democrats Jockey for House Seats Ahead of Redistricting Vote",
    "link": "https://www.nytimes.com/2025/10/28/us/politics/california-prop-50-house-congress.html",
    "summary": "Candidates are already starting campaigns and declaring their intentions for hypothetical seats that voters must first approve in the Nov. 4 election."
  },
  {
    "title": "Jewish Heirs Sue the Met, Saying a van Gogh It Sold Was Nazi Loot",
    "link": "https://www.nytimes.com/2025/10/28/arts/design/jewish-heirs-sue-met-van-gogh-nazi-loot.html",
    "summary": "The museum says it had no idea at the time, but the heirs say the Met curator who bought and sold the work, a former U.S. Army specialist on looting, should have known better."
  },
  {
    "title": "A Broadway Tradition Is Fluttering Into History",
    "link": "https://www.nytimes.com/2025/10/28/theater/broadway-cast-change-slips-playbill.html",
    "summary": "Broadway plans to replace the cast-change slips that are stuffed into Playbills with QR codes. Some understudies and theater buffs will mourn their loss."
  },
  {
    "title": "There's a Reason Trump Reminds His Targets of a Mafia Don",
    "link": "https://www.nytimes.com/2025/10/28/opinion/trump-comey-christie-mafia.html",
    "summary": "Why do people keep comparing the President to a Mafia don?"
  },
  {
    "title": "I Worked at OpenAI. It’s Not Doing Enough to Protect People.",
    "link": "https://www.nytimes.com/2025/10/28/opinion/openai-chatgpt-safety.html",
    "summary": "A.I. companies need to do more to show the proof behind their claims."
  },
  {
    "title": "Anti-Vax for Dogs?",
    "link": "https://www.nytimes.com/2025/10/28/briefing/anti-vax-for-dogs.html",
    "summary": "We explain how pet owners are expressing vaccine hesitancy."
  },
  {
    "title": "UPS Has Already Cut 48,000 Workers This Year",
    "link": "https://www.nytimes.com/2025/10/28/business/ups-layoffs-48000-workers-this-year.html",
    "summary": "About 70 percent of the layoffs affected drivers and warehouse workers, the delivery company said."
  },
  {
    "title": "A 17th-Century Crypt Shines a Light on Milan’s Most Impoverished",
    "link": "https://www.nytimes.com/2025/10/28/science/archaeology-milan-crypt.html",
    "summary": "In Milan, bones that piled under a hospital over a half-century shed light on the health and habits of some of the Renaissance era’s most impoverished people."
  },
  {
    "title": "Sudan’s Military Withdraws From El Fasher in Darfur, Handing City to R.S.F.",
    "link": "https://www.nytimes.com/2025/10/28/world/africa/sudan-el-fasher-burhan-rsf.html",
    "summary": "The Sudanese military withdrew from a key city in Darfur, where fleeing civilians were reported to be coming under attack from R.S.F. paramilitary forces."
  },
  {
    "title": "Prunella Scales, Sybil on ‘Fawlty Towers,’ Dies at 93",
    "link": "https://www.nytimes.com/2025/10/28/arts/television/prunella-scales-dead.html",
    "summary": "Best known “for playing unfortunate wives,” she had a decades-long career in the theater and on television."
  }
]