[
  {
    "title": "Mercedes and Porsche Squeezed by U.S. Tariffs and Slowdown in China",
    "link": "https://www.nytimes.com/2025/07/30/business/mercedes-porsche-tariffs.html",
    "summary": "Germany’s leading luxury automakers are sharply scaling back expectations for the rest of the year."
  },
  {
    "title": "Trump Administration Told Taiwan’s President to Avoid U.S. Stopover",
    "link": "https://www.nytimes.com/2025/07/30/world/asia/trump-taiwan-china.html",
    "summary": "The Taiwanese leader canceled U.S. transit visits after being urged to change his plans, two officials said. Washington has been in talks with Beijing over trade and a possible summit."
  },
  {
    "title": "U.S. Economy Slowed in First Half of 2025 as Tariffs Scrambled Data",
    "link": "https://www.nytimes.com/2025/07/30/business/us-economy-grew-in-second-quarter-as-tariffs-scrambled-data.html",
    "summary": "Gross domestic product rebounded in the spring after contracting at the start of the year, but consumer spending remained weak."
  },
  {
    "title": "Trump’s Tax Bill Expands Farm Subsidies. Not All Farmers Will Benefit.",
    "link": "https://www.nytimes.com/2025/07/30/us/trump-tax-policy-bill-farmers.html",
    "summary": "A $60 billion boost to farm subsidies will be a lifeline to some. But the way the funding will be distributed could worsen disparities between farms in an industry already struggling with consolidation."
  },
  {
    "title": "Texas Republicans Unveil Gerrymandered House Map, Trying to Please Trump",
    "link": "https://www.nytimes.com/2025/07/30/us/politics/texas-republican-redistricting.html",
    "summary": "The proposed map would give Republicans a chance to gain five U.S. House seats, including in Houston, Dallas and along the U.S.-Mexican border."
  },
  {
    "title": "An Evening at the Office, and Four Lives Ended by Gunfire",
    "link": "https://www.nytimes.com/2025/07/30/nyregion/park-avenue-shooting-victims.html",
    "summary": "A police officer. A security guard. An executive. An associate. They were remembered for their “light,” for their passion and commitment."
  },
  {
    "title": "Mamdani Returns From Uganda and Visits Slain Officer’s Family",
    "link": "https://www.nytimes.com/2025/07/30/nyregion/mamdani-uganda-return-officer.html",
    "summary": "Zohran Mamdani, the Democratic candidate for mayor of New York City, visited the home of a police officer who was killed in a mass shooting in Midtown Manhattan on Monday."
  },
  {
    "title": "NYC Gunman Brings Issue of C.T.E. to NFL’s Door",
    "link": "https://www.nytimes.com/2025/07/29/us/nyc-shooting-gunman-nfl-cte.html",
    "summary": "Shane Tamura never played in the league, but the police believe he was seeking vengeance over the handling of head injuries in football."
  },
  {
    "title": "Jason Momoa Prefers to Be Called a ‘Sensitive Alpha Male’",
    "link": "https://www.nytimes.com/2025/07/30/arts/television/jason-momoa-chief-of-war.html",
    "summary": "For “Chief of War,” the actor went from playing fictional superheroes to a real one in this epic passion project set in Hawaii."
  },
  {
    "title": "Pilots for Army Black Hawk Discussed Changing Course Before Crash",
    "link": "https://www.nytimes.com/2025/07/30/us/politics/black-hawk-reagan-crash-transcripts.html",
    "summary": "The maneuver might have taken the helicopter out of the direct path of a passenger jet as it was trying to land at Reagan Airport on Jan. 29."
  },
  {
    "title": "The Biggest Unanswered Questions About the Reagan Airport Crash",
    "link": "https://www.nytimes.com/2025/07/30/us/politics/reagan-airport-crash-questions.html",
    "summary": "Six months after a midair collision killed 67 people outside Washington, transportation safety officials will hear testimony from the key players whose pilots were involved in the accident."
  },
  {
    "title": "Confirmation Slowdown Forces a Senate Showdown",
    "link": "https://www.nytimes.com/2025/07/30/us/senate-confirmation-slowdown.html",
    "summary": "Under pressure to show they are resisting President Trump, Democrats have insisted on recorded votes on every nominee, creating a bottleneck ahead of the August recess."
  },
  {
    "title": "House Democrats Sue ICE for Barring Them From Detention Facilities",
    "link": "https://www.nytimes.com/2025/07/30/us/politics/house-democrats-ice-lawsuit.html",
    "summary": "The 12 Democrats accused the Trump administration of violating the law when it turned them away from immigrant detention sites and imposed a new policy limiting congressional access."
  },
  {
    "title": "Top F.D.A. Official Resigns Under Pressure",
    "link": "https://www.nytimes.com/2025/07/29/health/vinay-prasad-fda-resigns-loomer.html",
    "summary": "After turning down several new drugs and restricting use of another, Dr. Vinay Prasad drew the ire of the right-wing influencer Laura Loomer and others."
  },
  {
    "title": "Canada’s Measles Cases Surpass U.S., Alberta Officials Push for State of Emergency",
    "link": "https://www.nytimes.com/2025/07/30/world/canada/canada-alberta-measles-outbreak.html",
    "summary": "Some doctors in Alberta have criticized officials for not declaring a health emergency in the western province where measles infections are surging."
  },
  {
    "title": "Trump’s Mideast Envoy Heads to Israel Amid Global Fury Over Gaza Hunger",
    "link": "https://www.nytimes.com/2025/07/30/world/middleeast/trump-envoy-israel-gaza.html",
    "summary": "It will be the first known visit in months for Steve Witkoff, President Trump’s lead on the cease-fire and hostage talks. Since his last trip, conditions in the enclave have worsened."
  },
  {
    "title": "A Seaside Refuge in Gaza, Torn Apart by an Israeli Strike",
    "link": "https://www.nytimes.com/2025/07/30/world/middleeast/gaza-cafe-strike.html",
    "summary": "The Israeli military said it killed at least three Hamas operatives at Al-Baqa Cafe. It also killed a journalist, an artist and two best friends reconciling after a fight."
  },
  {
    "title": "Brennan and Clapper: The Trump Administration Is Rewriting History of Russia and 2016",
    "link": "https://www.nytimes.com/2025/07/30/opinion/trump-obama-treason-russia-miller.html",
    "summary": "We want to set the record straight and also sound a warning."
  },
  {
    "title": "They Saw Their Neighbors Taken Away by ICE. Then They Made a Plan.",
    "link": "https://www.nytimes.com/2025/07/30/opinion/ice-immigration-protest-resistance.html",
    "summary": "The movement against ICE in Los Angeles — one that is starting to take root across the country — demonstrates a shift from symbolic protest to direct action."
  },
  {
    "title": "Football’s Brain Injuries",
    "link": "https://www.nytimes.com/2025/07/30/briefing/footballs-brain-injuries.html",
    "summary": "We explain what we know about the disease after the shooting in Manhattan."
  },
  {
    "title": "Colbert Mocks Presidential Memo About Religious Conversions at Work",
    "link": "https://www.nytimes.com/2025/07/30/arts/television/colbert-trump-memo-religion-workplace.html",
    "summary": "Despite the Trump administration’s support for proselytizing at the office, Stephen Colbert doesn’t think it’s a good idea."
  },
  {
    "title": "Powerful Earthquake Rattles Russia’s Far East But Causes Little Damage",
    "link": "https://www.nytimes.com/2025/07/30/world/europe/russia-earthquake-kamchatka.html",
    "summary": "A 8.8-magnitude earthquake shook the remote, sparsely populated Kamchatka region and set off tsunami waves. No serious injuries were reported, officials said."
  },
  {
    "title": "Ozzy Osbourne’s Coffin Is Taken Through His Hometown’s Streets Before Funeral",
    "link": "https://www.nytimes.com/2025/07/30/arts/music/ozzy-osbourne-funeral-procession-birmingham.html",
    "summary": "A cortege took the singer’s coffin through the streets of his hometown, Birmingham, England, on Wednesday."
  },
  {
    "title": "Laura Dahlmeier, Gold Medal-Winning German Biathlete, Dies in Rockfall",
    "link": "https://www.nytimes.com/2025/07/30/world/asia/laura-dahlmeier-olympian-died-accident-pakistan.html",
    "summary": "Ms. Dahlmeier, 31, an experienced mountaineer, was climbing in Pakistan when she was hit by falling rocks, officials said."
  },
  {
    "title": "Company That Owns Apartments.com Sues Zillow Over Rental Listing Photos",
    "link": "https://www.nytimes.com/2025/07/30/realestate/costar-zillow-listings-photographs-lawsuit.html",
    "summary": "The chief executive of CoStar Group, which owns Apartments.com, said Zillow has ‘stolen’ thousands of images to bolster its business."
  }
]