[
  {
    "title": "Israel Pressures Hamas to Return Bodies, but Gaza’s Destruction Poses Challenge",
    "link": "https://www.nytimes.com/2025/10/14/world/middleeast/israeli-hostages-bodies-hamas.html",
    "summary": "The Israeli government is considering limits on aid to Gaza to penalize Hamas for not turning over more bodies of former hostages. But devastation in the enclave complicates the retrieval of all remains."
  },
  {
    "title": "‘A Big Day’: How the U.S. and the Arab World Teamed Up to Seal the Gaza Deal",
    "link": "https://www.nytimes.com/2025/10/14/world/middleeast/us-arab-gaza-deal.html",
    "summary": "The cease-fire talks in Egypt showed that with pressure on Hamas and Israel, seemingly huge impediments could be overcome or set aside."
  },
  {
    "title": "How Trump’s Gaza Peace Plan Presents Hurdles for Israel and Hamas",
    "link": "https://www.nytimes.com/2025/10/14/world/middleeast/gaza-talks-phase-two.html",
    "summary": "Hamas released hostages and agreed to abide by a cease-fire, but persuading it to lay down its arms is another matter."
  },
  {
    "title": "Trump’s Trade War With China Catches the World in Its Crossfire",
    "link": "https://www.nytimes.com/2025/10/14/business/economy/us-china-trade-tariffs-global-economy.html",
    "summary": "Tariffs and other restrictions between the United States and China are reverberating in unpredictable ways."
  },
  {
    "title": "Global Economic Growth Remains Sluggish as Trump’s Tariff Threats Loom",
    "link": "https://www.nytimes.com/2025/10/14/business/imf-report-economy-trade-inflation.html",
    "summary": "The International Monetary Fund said the impact of trade tensions had been limited so far, but it expects growth to slow."
  },
  {
    "title": "China Wants Foreign Scientists. The Public Says No, Thanks.",
    "link": "https://www.nytimes.com/2025/10/14/world/asia/china-stem-visa-racist-backlash.html",
    "summary": "Since Beijing announced a new visa to attract young science and technology graduates, a backlash has erupted online, forcing the government to respond."
  },
  {
    "title": "Inside the Improbable, Audacious and (So Far) Unstoppable Rise of Zohran Mamdani",
    "link": "https://www.nytimes.com/2025/10/14/magazine/zohran-mamdani-mayor-new-york.html",
    "summary": "The story of the man most likely to be the next mayor of New York City — and the promise and peril his ascent poses for the Democratic Party."
  },
  {
    "title": "Five Takeaways From the Magazine’s Profile of Zohran Mamdani",
    "link": "https://www.nytimes.com/2025/10/14/magazine/zohran-mamdani-mayor-race-takeaways.html",
    "summary": "How the Democratic nominee for mayor who has stunned the New York establishment is working to shore up support and sustain his momentum."
  },
  {
    "title": "Will the Supreme Court Use a Louisiana Case to Gut the Voting Rights Act?",
    "link": "https://www.nytimes.com/2025/10/14/us/politics/supreme-court-voting-rights-act.html",
    "summary": "The justices have shown a willingness to chip away at the landmark civil rights legislation. A Louisiana case could unravel much of its remaining power."
  },
  {
    "title": "Gov. Janet Mills of Maine to Run for Senate, Aiming at Senator Susan Collins",
    "link": "https://www.nytimes.com/2025/10/14/us/politics/janet-mills-senate-race-maine-susan-collins.html",
    "summary": "A two-term Democratic governor, Ms. Mills called herself “battle tested” in an interview. But she faces a Democratic primary before she can challenge the Republican incumbent."
  },
  {
    "title": "A Furious Debate Over Autism’s Causes Leaves Parents Grasping for Answers",
    "link": "https://www.nytimes.com/2025/10/14/health/autism-parents-genetics-vaccines-tylenol.html",
    "summary": "The Trump administration’s embrace of unproven or debunked theories about vaccines and Tylenol has left doctors fielding questions from worried parents."
  },
  {
    "title": "Ukraine’s Formula for Peace: Fewer Talks, More Weapons",
    "link": "https://www.nytimes.com/2025/10/14/world/europe/zelensky-trump-tomahawk-missiles.html",
    "summary": "As Russia rebuffs President Trump’s diplomatic push, President Volodymyr Zelensky of Ukraine plans to head again to the White House, this time seeking missiles."
  },
  {
    "title": "Russia Accuses Antiwar Exiles of Terrorism",
    "link": "https://www.nytimes.com/2025/10/14/world/europe/russia-antiwar-ukraine-terrorism.html",
    "summary": "An intelligence agency’s sweeping investigation shows that Moscow is closely following the anti-Kremlin activities of Russians abroad."
  },
  {
    "title": "Inside the New Bible-Infused Texas English Curriculum",
    "link": "https://www.nytimes.com/2025/10/14/us/bible-public-school-curriculum-texas.html",
    "summary": "This school year, many Texas districts are teaching from an elementary curriculum that features extensive content about the Christian faith, according to a New York Times analysis."
  },
  {
    "title": "D’Angelo, Acclaimed and Reclusive R&B Innovator, Dies at 51",
    "link": "https://www.nytimes.com/2025/10/14/arts/music/dangelo-dead.html",
    "summary": "After hitting No. 1 with “Voodoo,” his genre-melding 2000 album that he promoted with a risqué music video, he vanished for more than a decade."
  },
  {
    "title": "In a New Memoir, Kevin Federline Sounds an Alarm on Britney Spears",
    "link": "https://www.nytimes.com/2025/10/14/arts/music/britney-spears-kevin-federline-book.html",
    "summary": "Her ex-husband says in his book that since the pop star’s conservatorship ended, “It’s become impossible to pretend everything’s OK.”"
  },
  {
    "title": "The Matcha Market Cracks Under Pressure",
    "link": "https://www.nytimes.com/2025/10/14/dining/matcha.html",
    "summary": "Once consumed mainly in small, formal tea ceremonies, matcha is now mixed into fruity lattes and preyed on by counterfeiters. Can it survive its own popularity?"
  },
  {
    "title": "Pete Buttigieg on Rebuilding America After Trump",
    "link": "https://www.nytimes.com/2025/10/14/opinion/next-american-story-pete-buttigieg.html",
    "summary": "The former transportation secretary argues Americans need a new sense of belonging."
  },
  {
    "title": "She Struggled With Addiction, Then Tried a Weight Loss Drug",
    "link": "https://www.nytimes.com/2025/10/14/opinion/ozempic-addiction.html",
    "summary": "Is a powerful addiction treatment already invented?"
  },
  {
    "title": "Meet Zohran Mamdani, the Favorite to Lead New York City",
    "link": "https://www.nytimes.com/2025/10/14/us/meet-zohran-mamdani-the-favorite-to-lead-new-york-city.html",
    "summary": "Our reporters explore his skyrocket, his life and his appeal."
  },
  {
    "title": "French Premier Offers to Delay Pension Overhaul, in a Bid to Calm Turmoil",
    "link": "https://www.nytimes.com/2025/10/14/world/europe/france-political-crisis-pension.html",
    "summary": "Sébastien Lecornu said the government was ready for “a new debate” on the issue, a major concession as he faces no-confidence votes that threaten to topple his government again this week."
  },
  {
    "title": "Newsom Vetoes California’s Ban on ‘Forever Chemicals’ in Cookware",
    "link": "https://www.nytimes.com/2025/10/14/climate/pfas-forever-chemicals-california-cookware-ban.html",
    "summary": "Mr. Newsom said he was concerned that the measure restricting PFAS chemicals would make pots and pans more expensive for Californians."
  },
  {
    "title": "Supreme Court Denies Alex Jones’s Appeal of Payment to Sandy Hook Families",
    "link": "https://www.nytimes.com/2025/10/14/us/politics/supreme-court-alex-jones-defamation.html",
    "summary": "Mr. Jones was ordered to pay $1.4 billion in damages to families who lost children in the 2012 shooting in Newtown, Conn."
  },
  {
    "title": "Suspect Pleads Guilty in Firebombing of Pennsylvania Governor’s Residence",
    "link": "https://www.nytimes.com/2025/10/14/us/arson-harrisburg-cody-balmer-josh-shapiro.html",
    "summary": "Under a plea agreement, Cody Balmer will be imprisoned for 25 to 50 years for attempted murder and other charges in the attack on Gov. Josh Shapiro’s official residence in Harrisburg in April."
  }
]