[
  {
    "title": "For Trump, E.U. Trade Deal was Badly Needed",
    "link": "https://www.nytimes.com/2025/07/27/us/politics/trump-europe-trade-deal.html",
    "summary": "After a lot of big talk on trade, the Trump administration needed a big win. It appears to have just gotten one."
  },
  {
    "title": "A Timeline of Trump’s Tariff Fight With Canada, Mexico, China and the E.U.",
    "link": "https://www.nytimes.com/2025/03/13/business/economy/trump-tariff-timeline.html",
    "summary": "The president’s penchant for imposing and then suspending tariffs has shaken markets and confounded trading partners."
  },
  {
    "title": "No Meals, Fainting Nurses, Dwindling Baby Formula: Starvation Haunts Gaza Hospitals",
    "link": "https://www.nytimes.com/2025/07/27/world/middleeast/gaza-hunger-doctors-nurses.html",
    "summary": "After Israeli restrictions on aid, hunger has risen across Gaza. Doctors and nurses, struggling to find food themselves, lack the resources to stem the surge."
  },
  {
    "title": "Israel Says It Has Paused Some Military Activity in Gaza as Anger Grows Over Hunger",
    "link": "https://www.nytimes.com/2025/07/27/world/middleeast/israel-gaza-aid-hunger.html",
    "summary": "Operations in parts of the enclave were put on hold to allow more aid. It was unclear if the move would relieve the hunger crisis, amid rising deaths from starvation."
  },
  {
    "title": "News Organizations Urge Israel to Let Reporters and Aid Into Gaza",
    "link": "https://www.nytimes.com/2025/07/27/world/middleeast/gaza-starvation-reporters-israel.html",
    "summary": "Saying that journalists in the territory, like many Gazans, are facing starvation, the groups urged Israel to allow more food in."
  },
  {
    "title": "What Will It Cost to Renovate Trump’s ‘Free’ Air Force One? Don’t Ask.",
    "link": "https://www.nytimes.com/2025/07/27/us/politics/air-force-one-trump-cost.html",
    "summary": "To hide the cost of renovating the plane Qatar donated to President Trump, the Air Force appears to have tucked it inside an over-budget, behind-schedule nuclear modernization program."
  },
  {
    "title": "Massie Criticizes Johnson on Recess as He Tries to Force Epstein Files Vote",
    "link": "https://www.nytimes.com/2025/07/27/us/politics/massie-johnson-house-epstein-files.html",
    "summary": "“I don’t know why it should be politically painful to be transparent,” Representative Thomas Massie, a Kentucky Republican, said on Sunday, referring to comments by Speaker Mike Johnson."
  },
  {
    "title": "Alpha School, AI-Driven Education Founded in Austin, Is Coming to More Cities",
    "link": "https://www.nytimes.com/2025/07/27/us/politics/ai-alpha-school-austin-texas.html",
    "summary": "At Austin’s Alpha School, students spend just two hours a day on academics, led by artificial intelligence tools. New Alpha schools are set to open in about a dozen cities this fall."
  },
  {
    "title": "Inside a Gathering of America’s Growing Home-School Movement",
    "link": "https://www.nytimes.com/2025/07/27/style/home-schooling-movement.html",
    "summary": "The pandemic supercharged interest. Now, a cultural and political emphasis on women staying at home is continuing to fuel growth."
  },
  {
    "title": "Tom Lehrer, Musical Satirist With a Dark Streak, Dies at 97",
    "link": "https://www.nytimes.com/2025/07/27/arts/music/tom-lehrer-dead.html",
    "summary": "A mathematician by training, he acquired a devoted following with songs that set sardonic lyrics to music that was often maddeningly cheerful."
  },
  {
    "title": "Suspect in Traverse City Walmart Stabbing Attack Faces Terrorism Charge",
    "link": "https://www.nytimes.com/2025/07/27/us/walmart-stabbing-traverse-city-charges.html",
    "summary": "The authorities on Sunday said that a motive for the attack, which left 11 people injured, remained unknown. Citizens, including one who was armed, helped to apprehend the suspect, officials said."
  },
  {
    "title": "With Bombs Whizzing in Air, Thousands Flee Thailand-Cambodia Border",
    "link": "https://www.nytimes.com/2025/07/27/world/asia/thailand-cambodia-border-conflict-evacuees.html",
    "summary": "The conflict is one of the deadliest clashes ever between the two countries. Thirty-four people have died, and over 165,000 have been displaced."
  },
  {
    "title": "At Trump’s Urging, Thailand and Cambodia to Meet for Cease-Fire Talks",
    "link": "https://www.nytimes.com/2025/07/26/world/asia/thailand-cambodia-conflict.html",
    "summary": "After calls by President Trump, the leaders of Cambodia and Thailand are set to meet in Malaysia on Monday to discuss a halt to the fighting."
  },
  {
    "title": "5 Money Mistakes That Can Put Retirement Farther Off",
    "link": "https://www.nytimes.com/2025/07/27/business/retirement-saving-mistakes-401k.html",
    "summary": "Even people with employee-sponsored retirement plans still find it difficult to save for the future when faced with present-day desires."
  },
  {
    "title": "England’s Lionesses Take ‘Football Home’ With Gripping Euro Win",
    "link": "https://www.nytimes.com/2025/07/27/world/europe/england-women-soccer-championship.html",
    "summary": "By edging out Spain in a penalty shootout in the European championship final, England’s women’s team cemented its position as the standard-bearer for English soccer."
  },
  {
    "title": "The Raw Power of Repentance",
    "link": "https://www.nytimes.com/2025/07/27/opinion/the-bear-carmy-jeremy-allen-white.html",
    "summary": "“The Bear” asks the question, how do we live together when someone always seems to be going too far?"
  },
  {
    "title": "The World Is Letting Gaza Starve",
    "link": "https://www.nytimes.com/2025/07/24/opinion/gaza-hunger-children-rescue.html",
    "summary": "Today, many children in Gaza are so hungry they may never recover, and our supplies are critically low."
  },
  {
    "title": "Passengers Evacuate Smoky American Airlines Plane at Denver Airport",
    "link": "https://www.nytimes.com/2025/07/27/us/american-airlines-denver-flight.html",
    "summary": "A small fire in the brake system just ahead of the jet’s takeoff prompted the evacuation of 173 passengers and six crew members, the authorities said."
  },
  {
    "title": "Joan Anderson, Unsung Heroine of Hula Hoop History, Dies at 101",
    "link": "https://www.nytimes.com/2025/07/27/business/joan-anderson-dead.html",
    "summary": "Because of a deal made on a handshake in a parking lot, she was long left out of a famous toy’s story. When she was 94, a documentary changed that."
  }
]