[
  {
    "title": "Market Volatility Underscores Epic Buildup of Global Risk",
    "link": "https://www.nytimes.com/2025/11/25/business/economy/stocks-bitcoin-markets-risk.html",
    "summary": "Some experts see a dangerous combination of factors reminiscent of practices that led to previous financial crises."
  },
  {
    "title": "The Fed and Big Tech Re-Raise Investors’ Spirits",
    "link": "https://www.nytimes.com/2025/11/25/business/dealbook/fed-big-tech-market-rally.html",
    "summary": "Markets appear to be hoping again that the central bank will cut rates next month, and that the artificial intelligence boom has room to run."
  },
  {
    "title": "Russia Strikes Ukraine and Signals Resistance to Amended Peace Plan",
    "link": "https://www.nytimes.com/2025/11/25/world/europe/ukraine-russia-strike-peace-plan.html",
    "summary": "The attack killed at least seven people in Kyiv, the authorities said, as Moscow suggested it would resist changes negotiated by Ukraine."
  },
  {
    "title": "How Rubio Tried to Bring a Pro-Russia Peace Plan to Middle Ground",
    "link": "https://www.nytimes.com/2025/11/24/us/politics/trump-russia-ukraine-peace-plan-middle-ground.html",
    "summary": "While President Trump attacked the Ukrainians, Secretary of State Marco Rubio flew to Geneva to seize control of negotiations that were going off the rails."
  },
  {
    "title": "As Trump Pushes to End Ukraine War, Europe Toils to Have a Say",
    "link": "https://www.nytimes.com/2025/11/25/world/europe/trump-ukraine-war-peace-plan-merz-macron-starmer.html",
    "summary": "Initially cut out of development of the 28-point peace plan, European leaders are now trying to recast its pro-Russia slant. So far, it seems to be working."
  },
  {
    "title": "U.S. Army Secretary Meets With Russian Envoys on Ukraine Peace Plan",
    "link": "https://www.nytimes.com/2025/11/25/us/daniel-driscoll-uae-russia-ukraine.html",
    "summary": "The secretary, Daniel Driscoll, held talks in Geneva over the weekend with a Ukrainian delegation. “We remain optimistic,” his spokesman said."
  },
  {
    "title": "Trump Administration Is Taking Billions in Stakes in Firms Like Intel",
    "link": "https://www.nytimes.com/2025/11/25/us/politics/trump-intel-steel-minerals-china.html",
    "summary": "The Trump administration is trading billions of dollars of taxpayer money for ownership stakes in companies. The unusual practice shows no sign of slowing."
  },
  {
    "title": "How Much Will Thanksgiving Dinner Cost? It Depends on Whom You Ask.",
    "link": "https://www.nytimes.com/2025/11/25/business/thanksgiving-dinner-cost-turkey-meal-expensive.html",
    "summary": "As Americans become increasingly concerned about affordability, there’s scrutiny on the annual meal."
  },
  {
    "title": "Anxiety. It’s What’s for Thanksgiving Dinner.",
    "link": "https://www.nytimes.com/2025/11/25/dining/anxiety-thanksgiving-dinner.html",
    "summary": "In a year of high prices, economic uncertainty and other jitters, America is united in uncertainty — and poultry."
  },
  {
    "title": "100 Notable Books of 2025",
    "link": "https://www.nytimes.com/2025/11/24/books/notable-books.html",
    "summary": "Here is the standout fiction and nonfiction of the year, selected by the staff of The New York Times Book Review."
  },
  {
    "title": "An Eritrean Woman Seeking Asylum in Canada Was Almost Deported From the U.S.",
    "link": "https://www.nytimes.com/2025/11/25/world/canada/usa-ice-eritrea-deportation-asylum.html",
    "summary": "After more than 20 years in the U.S., an Eritrean mother and nurse tried to self-deport to Canada. She found herself in a Texas detention center instead."
  },
  {
    "title": "Mamdani Response to Protest Inflames Tensions With Jewish Leaders",
    "link": "https://www.nytimes.com/2025/11/24/nyregion/mamdani-synagogue-protest.html",
    "summary": "The mayor-elect chastised a synagogue that hosted an event promoting migration to Israel and settlements in occupied territories. His stance further tested his strained relationship with pro-Israel Jews."
  },
  {
    "title": "Challengers Take on N.Y. House Democrats, Targeting Their Ties to Israel",
    "link": "https://www.nytimes.com/2025/11/25/nyregion/israel-congress-mamdani-challengers.html",
    "summary": "Several Democratic incumbents are facing primary battles after Zohran Mamdani’s win suggested that being pro-Israel was no longer a universal selling point."
  },
  {
    "title": "Vahid Abedini, University of Oklahoma Professor, Released After ICE Detainment",
    "link": "https://www.nytimes.com/2025/11/25/us/vahid-abedini-oklahoma-professor-ice.html",
    "summary": "Vahid Abedini, who colleagues said was in the United States on an H-1B visa, was arrested on his way to a conference in Washington. It was unclear why."
  },
  {
    "title": "Drug Arrests and Gun Seizures Fell as Homeland Security Pursued Immigration",
    "link": "https://www.nytimes.com/2025/11/25/us/politics/drug-arrests-gun-seizures-homeland-security-immigration.html",
    "summary": "Internal documents reveal the impact on crime fighting as the Trump administration diverts special agents to its mass deportation agenda."
  },
  {
    "title": "Deported and Desperate to Be Reunited With Their Children",
    "link": "https://www.nytimes.com/2025/11/25/nyregion/venezuela-children-deported-parents.html",
    "summary": "Across the United States, children have been left in the care of relatives and neighbors after deportations. In Venezuela, parents are clamoring for the return of their sons and daughters."
  },
  {
    "title": "U.S. Plans Compounds to House Palestinians in Israeli-Held Half of Gaza",
    "link": "https://www.nytimes.com/2025/11/25/world/middleeast/us-compounds-palestinians-israel-gaza-strip.html",
    "summary": "The project could offer relief for tens of thousands of Palestinians who have endured two years of war, but has raised questions about whether it could entrench the partition of Gaza into Israeli- and Hamas-controlled zones."
  },
  {
    "title": "Binance Is Sued by Oct. 7 Victims’ Families, Accused of Aiding Terrorism",
    "link": "https://www.nytimes.com/2025/11/25/business/binance-hamas-terrorism.html",
    "summary": "A lawsuit claims the cryptocurrency exchange turned a blind eye as $1 billion used to finance the Oct. 7 attacks in Israel and other acts moved through its network."
  },
  {
    "title": "Boeing Tackles Quality With a ‘War on Defects’",
    "link": "https://www.nytimes.com/2025/11/25/business/boeing-737-max-factory.html",
    "summary": "Two years after a panel flew off a 737 Max, Boeing is doing more inspections, completing work in its intended order and making other changes. Can the company keep it up?"
  },
  {
    "title": "How New York Can Protect Its Street Vendors",
    "link": "https://www.nytimes.com/2025/11/25/dining/street-vendors-new-york-food.html",
    "summary": "The city’s history can be understood through the people who sell food on sidewalks. Here’s how New York could set them up for success."
  },
  {
    "title": "I’m a Professor. A.I. Has Changed My Classroom, but Not for the Worse.",
    "link": "https://www.nytimes.com/2025/11/25/magazine/ai-higher-education-students-teachers.html",
    "summary": "My students’ easy access to chatbots forced me to make humanities instruction even more human."
  },
  {
    "title": "Prosecutor Used Flawed A.I. to Keep a Man in Jail, His Lawyers Say",
    "link": "https://www.nytimes.com/2025/11/25/us/prosecutor-artificial-intelligence-errors-lawyers-california.html",
    "summary": "The case is among the first in which a prosecutor is accused of filing court papers marred by A.I.-generated mistakes."
  },
  {
    "title": "Mapping the Brain’s Sense of What Goes On Inside the Body",
    "link": "https://www.nytimes.com/2025/11/25/science/brain-neuroscience-interoception.html",
    "summary": "Scientists are learning how the brain knows what’s happening throughout the body, and how that process might go awry in some psychiatric disorders."
  },
  {
    "title": "Trump Falls Short of His Populist Rhetoric",
    "link": "https://www.nytimes.com/2025/11/25/opinion/trump-antitrust-corporations-consumers.html",
    "summary": "The Trump administration is using its antitrust powers mostly to protect Mr. Trump."
  },
  {
    "title": "I Went to an Anti-Vaccine Conference. Medicine Is in Trouble.",
    "link": "https://www.nytimes.com/2025/11/25/opinion/children-health-defense-kennedy.html",
    "summary": "A journey to the fringe of MAHA."
  },
  {
    "title": "Are Schools a Problem?",
    "link": "https://www.nytimes.com/2025/11/25/briefing/are-schools-a-problem.html",
    "summary": "We look into the mental health crisis affecting American youth."
  },
  {
    "title": "Share Your Most Memorable SantaCon Story",
    "link": "https://www.nytimes.com/2025/11/20/special-series/share-your-santacon-story.html",
    "summary": "We’re gathering readers’ stories about one of New York’s most polarizing holiday traditions. Share your best, worst and wildest SantaCon memories here."
  },
  {
    "title": "Strike and Trump Tariffs Drive ‘Once-in-a-Lifetime’ Boost for Canadian Wine",
    "link": "https://www.nytimes.com/2025/11/25/world/canada/canada-wines-vineyards-us-tariffs.html",
    "summary": "The trade war with the United States, bans on U.S. wine and liquor imports and a recent distributor strike in British Columbia have Canadians giving their homegrown wines another look."
  },
  {
    "title": "Is it Cold, Flu or Covid? What to Know About Symptoms and Testing.",
    "link": "https://www.nytimes.com/2025/11/25/well/cold-flu-covid-symptoms.html",
    "summary": "With similar symptoms, it can be difficult to tell which illness is which. Here’s what to know."
  },
  {
    "title": "Four More Arrested in Connection With Louvre Heist",
    "link": "https://www.nytimes.com/2025/11/25/world/europe/four-new-arrests-louvre-heist.html",
    "summary": "A Paris prosecutor said two men and two women were arrested as part of an investigation into the robbery at the museum."
  },
  {
    "title": "Budget Will Be a Big Test for the UK’s Most Unpopular Chancellor in Decades",
    "link": "https://www.nytimes.com/2025/11/25/business/rachel-reeves-uk-budget.html",
    "summary": "Rachel Reeves, who has had a bruising tenure as the country’s top economic official, is set to announce tax and spending measures that risk stoking more discontent."
  }
]