[
  {
    "title": "U.S. Government to Take Cut of Nvidia and AMD A.I. Chip Sales to China",
    "link": "https://www.nytimes.com/2025/08/10/technology/us-government-nvidia-amd-chips-china.html",
    "summary": "In a highly unusual arrangement with President Trump, the companies are expected to kick 15 percent of what they make in China to the U.S. government."
  },
  {
    "title": "Trump’s Cartel Order Revives ‘Bitter’ Memories in Latin America",
    "link": "https://www.nytimes.com/2025/08/10/us/trumps-cartel-order-revives-bitter-memories-in-latin-america.html",
    "summary": "The decision triggers fears that the U.S. might return to a pattern of military interference in the region that dates to the Monroe Doctrine."
  },
  {
    "title": "Trump Administration to Put F.B.I. Agents on Night Patrol in Washington",
    "link": "https://www.nytimes.com/2025/08/10/us/politics/trump-fbi-patrol-washington.html",
    "summary": "The move is part of President Trump’s pledge to crack down on street crime in the nation’s capital."
  },
  {
    "title": "Trump and Putin May Get a Cold Reception From Some Alaskans",
    "link": "https://www.nytimes.com/2025/08/10/us/politics/trump-putin-alaska-reaction.html",
    "summary": "Warm relations between Alaskans and Russians began to shift with the rise of Vladimir Putin and the invasion of Ukraine. In Alaska, feelings on the two leaders’ meeting seemed mixed."
  },
  {
    "title": "Israeli Strike Kills 4 Al Jazeera Journalists, Network Says",
    "link": "https://www.nytimes.com/2025/08/10/world/middleeast/israel-gaza-journalists-killed.html",
    "summary": "Anas al-Sharif, a well-known correspondent for the network, was among those killed. Israel said it had conducted a strike targeting Mr. al-Sharif, claiming he worked for Hamas."
  },
  {
    "title": "Netanyahu Doubles Down on Gaza Offensive After Global Backlash",
    "link": "https://www.nytimes.com/2025/08/10/world/middleeast/smotrich-israel-gaza-takeover-netanyahu.html",
    "summary": "This is not the first time the Israeli prime minister has called for one final military drive to dismantle Hamas and end the war."
  },
  {
    "title": "Trump Attacked California’s Redistricting System. Republicans Want to Save It.",
    "link": "https://www.nytimes.com/2025/08/10/us/california-redistricting-independent-commission.html",
    "summary": "The independent body that redraws the state’s political maps isn’t perfect, many Republicans say. But they prefer that to the gerrymander that Gov. Gavin Newsom seeks to offset one proposed in Texas."
  },
  {
    "title": "‘Fighting Fire With Fire,’ Democrats on Defense as Texas Redistricting Looms",
    "link": "https://www.nytimes.com/2025/08/10/us/politics/fighting-fire-with-fire-democrats-on-defense-as-texas-redistricting-looms.html",
    "summary": "A Republican proposal to add five Republican congressional seats in Texas imperils Democrats’ midterm prospects."
  },
  {
    "title": "Trump Raids Help Stir a Political Reversal for Karen Bass",
    "link": "https://www.nytimes.com/2025/08/10/us/politics/mayor-bass-los-angeles-raids.html",
    "summary": "The mayor of Los Angeles has emerged as a leading voice of the city’s resistance to the Trump administration after facing criticism for her handling of the wildfires."
  },
  {
    "title": "Senator Gallego Brings a Message of Hope for Democrats to Iowa",
    "link": "https://www.nytimes.com/2025/08/10/us/politics/senator-gallego-democrats-iowa.html",
    "summary": "Senator Ruben Gallego of Arizona won his seat last year by outperforming national Democrats among Hispanic voters and men. He wants the party to listen to his message as it regroups."
  },
  {
    "title": "Alyson Stoner, a Former Disney Star, Writes a Tell-All. Sort Of.",
    "link": "https://www.nytimes.com/2025/08/10/style/alyson-stoner-memoir-disney-nickelodeon.html",
    "summary": "Alyson Stoner has much to say about their years acting for Disney and Nickelodeon. They’re careful how they say it."
  },
  {
    "title": "What Happened When Mark Zuckerberg Moved In Next Door",
    "link": "https://www.nytimes.com/2025/08/10/us/mark-zuckerberg-palo-alto.html",
    "summary": "The billionaire has bought at least 11 properties in Palo Alto, Calif., creating a compound for his family, a private school for his children — and headaches for his neighbors."
  },
  {
    "title": "Zuckerberg’s Compound Had Something That Violated City Code: A Private School",
    "link": "https://www.nytimes.com/2025/08/10/us/zuckerberg-compound-palo-alto-school.html",
    "summary": "The school, called BBS, enrolled 14 children in kindergarten through fourth grade and employed three full-time teachers and other staff members."
  },
  {
    "title": "Computer Science Grads Struggle to Find Jobs in the A.I. Age",
    "link": "https://www.nytimes.com/2025/08/10/technology/coding-ai-jobs-students.html",
    "summary": "As companies like Amazon and Microsoft lay off workers and embrace A.I. coding tools, computer science graduates say they’re struggling to land tech jobs."
  },
  {
    "title": "Bears Are Terrorizing Romania. It’s Humans’ Fault.",
    "link": "https://www.nytimes.com/2025/08/08/realestate/bears-romania.html",
    "summary": "Romania’s growing bear population has turned conservation into confrontation for people living in the shadows of the Carpathian Mountains."
  },
  {
    "title": "If You Fly Economy, You’re Paying for Someone Else to Fly Private",
    "link": "https://www.nytimes.com/video/opinion/100000010331153/private-planes-faa.html",
    "summary": "The Times editorial board argues that Congress must change the Federal Aviation Administration’s funding structure."
  },
  {
    "title": "‘Acute, Sustained, Profound and Abiding Rage’: Canada Finds Its Voice",
    "link": "https://www.nytimes.com/2025/08/10/opinion/canada-america-allies.html",
    "summary": "America’s withdrawal from the global order is forcing former allies to rethink their identities."
  },
  {
    "title": "Heavy Rains in Wisconsin Lead to Flooding and Early Closure of State Fair",
    "link": "https://www.nytimes.com/2025/08/10/us/wisconsin-flood-storms-rain.html",
    "summary": "Record-setting rainfall caused intense flooding in and around the Milwaukee area starting on Saturday night."
  },
  {
    "title": "Western Turkey Is Hit by Earthquake but Avoids Major Damage",
    "link": "https://www.nytimes.com/2025/08/10/world/europe/earthquake-western-turkey-sindirgi.html",
    "summary": "Rescue efforts were continuing after the 6.1-magnitude temblor struck in a region that is crisscrossed by fault lines."
  },
  {
    "title": "What We Know About the C.D.C. Shooting in Atlanta",
    "link": "https://www.nytimes.com/2025/08/10/us/cdc-shooting-atlanta.html",
    "summary": "A gunman who believed the Covid-19 vaccine had made him ill fired at the agency’s Atlanta offices, killing a police officer and rattling the public health community."
  },
  {
    "title": "Terry Reid, Rock Singer Known as ‘Superlungs,’ Dies at 75",
    "link": "https://www.nytimes.com/2025/08/10/arts/music/terry-reid-dead.html",
    "summary": "He missed his chance to be Led Zeppelin’s lead vocalist, but his solo work — and his otherworldly voice — drew raves from Aretha Franklin and others."
  }
]