[
  {
    "title": "As Texas Flood Raged, Camp Mystic Was Left to Fend for Itself",
    "link": "https://www.nytimes.com/2025/07/10/us/texas-flood-local-response.html",
    "summary": "Flash floods surged through in the middle of the night, but many local officials appeared unaware of the unfolding catastrophe, initially leaving people near the river on their own."
  },
  {
    "title": "Chance of Finding More Survivors of Texas Flooding Dims as Search Continues",
    "link": "https://www.nytimes.com/2025/07/10/us/texas-flooding-search-survivors-victims.html",
    "summary": "At least 120 people have died and some 173 people remain unaccounted for statewide, nearly a week after flash floods ravaged the Texas Hill Country."
  },
  {
    "title": "New Details on Camp Mystic, and Trump’s Retribution Campaign",
    "link": "https://www.nytimes.com/2025/07/10/podcasts/the-headlines/camp-mystic-trump-retribution.html",
    "summary": "Plus, where curry meets quesadillas."
  },
  {
    "title": "China Surveys Seabeds Where Naval Rivals May One Day Clash",
    "link": "https://www.nytimes.com/2025/07/10/world/asia/china-ships-taiwan-guam.html",
    "summary": "Chinese research ships are studying the seas for science and resources, but the data they gather could also be useful in a conflict with Taiwan or the United States."
  },
  {
    "title": "How El Salvador Is Reaping Rewards From Trump’s Deportation Agenda",
    "link": "https://www.nytimes.com/2025/07/10/world/americas/trump-migrants-el-salvador-bukele.html",
    "summary": "In exchange for jailing more than 200 deportees, El Salvador’s president, Nayib Bukele, has become a favorite of the Trump administration."
  },
  {
    "title": "FEMA Is Holding Up $2.4 Billion in Grants to Fight Terrorism, States Say",
    "link": "https://www.nytimes.com/2025/07/10/nyregion/fema-funds-trump-noem.html",
    "summary": "FEMA officials are two months behind in posting grant application guidelines, which are expected to reflect President Trump’s demand for cooperation on his priorities."
  },
  {
    "title": "UK and France Agree to First Ever Nuclear Weapons Pact to Fend Off Threat to Europe",
    "link": "https://www.nytimes.com/2025/07/10/world/europe/starmer-macron-nuclear-agreement.html",
    "summary": "The two leaders are set to confirm details of a strengthened defense relationship at a summit Thursday. An agreement on tackling unauthorized migration may also be announced."
  },
  {
    "title": "Rubio Visits Asia as Trump Raises Trade-War Tensions",
    "link": "https://www.nytimes.com/2025/07/09/world/asia/rubio-asia-diplomacy-tariffs.html",
    "summary": "Secretary of State Marco Rubio talks about countering China as it expands its global influence. But President Trump’s tariff threats have created friction with U.S. partners."
  },
  {
    "title": "Trump Pledges 50% Tariffs Against Brazil, Citing ‘Witch Hunt’ Against Bolsonaro",
    "link": "https://www.nytimes.com/2025/07/09/world/americas/brazil-trump-bolsonaro-lula-coup-tariff.html",
    "summary": "Tensions between the United States and Brazil have suddenly burst open. Brazil’s president promised to reciprocate against President Trump’s tariffs."
  },
  {
    "title": "Trump Threatens New Tariffs on Countries and Copper",
    "link": "https://www.nytimes.com/article/trump-tariffs-canada-mexico-china.html",
    "summary": "Since re-entering office, President Trump has announced a barrage of tariffs to try to rewire the global economy."
  },
  {
    "title": "Trump Seems to Be Warming to What Europe Wants for Ukraine: New Russia Sanctions",
    "link": "https://www.nytimes.com/2025/07/10/world/europe/trump-ukraine-russia-europe.html",
    "summary": "Flattery and pressure — coupled with President Trump’s growing dissatisfaction with President Vladimir V. Putin — have helped build momentum for new economic punishments."
  },
  {
    "title": "Vladimir Putin Messed Up",
    "link": "https://www.nytimes.com/2025/07/10/briefing/vladimir-putin-messed-up.html",
    "summary": "We explain President Trump and Putin’s changing relationship."
  },
  {
    "title": "Russia Bombards Ukraine as U.S. Frustration Mounts",
    "link": "https://www.nytimes.com/2025/07/10/world/europe/ukraine-russia-lavrov-rubio.html",
    "summary": "Kyiv was the main target of an hourslong assault that killed at least two people, officials said. The barrage came hours before the top American and Russian diplomats sat down for a meting."
  },
  {
    "title": "These Younger Democrats Are Sick of Their Party’s Status Quo",
    "link": "https://www.nytimes.com/2025/07/10/us/politics/majority-democrats.html",
    "summary": "Majority Democrats, a new group of elected officials from all levels of government, has outsized ambitions to challenge political orthodoxies and remake the party."
  },
  {
    "title": "New Democratic Group Says Answer to the Party’s Woes Lies With the States",
    "link": "https://www.nytimes.com/2025/07/10/us/politics/democrats-states-forum.html",
    "summary": "The founders of the initiative, the States Forum, say they hope to extend successful Democratic policies across states and even to the national level."
  },
  {
    "title": "Signs of Violence in Mississippi County Sheriff’s Office Dated Back Years",
    "link": "https://www.nytimes.com/2025/07/10/us/rankin-county-mississippi-sheriff-office-violence.html",
    "summary": "The F.B.I. and a Mississippi sheriff investigated complaints about brutal assaults, but the deputies accused remained on the force and never faced charges."
  },
  {
    "title": "A British Surgeon Shares What She Saw in Gaza’s Hospitals",
    "link": "https://www.nytimes.com/2025/07/09/world/middleeast/gaza-hospitals-uk-surgeon-israel-attacks.html",
    "summary": "Dr. Victoria Rose spent 21 days in the territory, treating people who were shot trying to get food and children with life-changing injuries from Israeli bombs."
  },
  {
    "title": "Trump’s D.E.I. Cuts Are Hurting Rural, White Americans, Too",
    "link": "https://www.nytimes.com/2025/07/10/us/trump-science-nih-grants-dei-cuts.html",
    "summary": "The N.I.H. has terminated hundreds of diversity grants awarded to young scientists, many of whom come from the very places that supported Trump."
  },
  {
    "title": "Espaillat Endorses Mamdani for Mayor, After Backing Cuomo and Adams",
    "link": "https://www.nytimes.com/2025/07/10/nyregion/espaillat-endorse-mamdani.html",
    "summary": "Representative Adriano Espaillat, the most powerful Latino leader in New York City, will back Zohran Mamdani, the Democratic candidate for mayor."
  },
  {
    "title": "Zohran Mamdani Expands Campaign Team, Hiring Veteran Democrat",
    "link": "https://www.nytimes.com/2025/07/09/nyregion/mamdani-communications-jeffrey-lerner.html",
    "summary": "Mr. Mamdani, a state assemblyman and the Democratic nominee for mayor of New York City, is taking on a small handful of more experienced campaign hands."
  },
  {
    "title": "A.I.-Generated Images of Child Sexual Abuse Are Flooding the Internet",
    "link": "https://www.nytimes.com/2025/07/10/technology/ai-csam-child-sexual-abuse.html",
    "summary": "Organizations that track the material are reporting a surge in A.I. images and videos, which are threatening to overwhelm law enforcement."
  },
  {
    "title": "European Union Unveils Rules for Powerful A.I. Systems",
    "link": "https://www.nytimes.com/2025/07/10/business/ai-rules-europe.html",
    "summary": "Makers of the most advanced artificial intelligence systems will face new obligations for transparency, copyright protection and public safety. The rules are voluntary to start."
  },
  {
    "title": "My Problem With Superman",
    "link": "https://www.nytimes.com/2025/07/10/opinion/superman-movie-immigrant-junot-diaz.html",
    "summary": "Other people might note his alien-ness and quickly forget it, but I couldn’t unsee it. And because I couldn’t unsee his, I couldn’t unsee mine."
  },
  {
    "title": "Trolling Democracy",
    "link": "https://www.nytimes.com/2025/07/10/opinion/trolling-democracy.html",
    "summary": "The rise of a toxic online politics."
  },
  {
    "title": "Late Night Is All Over Grok’s Antisemitic Posts",
    "link": "https://www.nytimes.com/2025/07/10/arts/television/late-night-grok-antisemitic-posts.html",
    "summary": "“Do you know how racist and antisemitic you have to be for Elon Musk to step in?” Anthony Anderson, sitting in for Jimmy Kimmel, asked rhetorically."
  },
  {
    "title": "27 Workers Make Improbable Escape from Collapsed L.A. Tunnel",
    "link": "https://www.nytimes.com/2025/07/10/us/tunnel-collapse-los-angeles-trapped.html",
    "summary": "They climbed over a mound of loose soil and emerged at the tunnel’s only entrance five miles away, officials said."
  },
  {
    "title": "As N.Y.C. Replaces MetroCards With OMNY, Transit Riders Have Complaints",
    "link": "https://www.nytimes.com/2025/07/10/nyregion/metrocard-omny-nyc-rider-issues.html",
    "summary": "A survey of transit riders found that a majority have had issues with New York’s new tap-and-go system, months before its predecessor is expected to be retired."
  },
  {
    "title": "Maya Ruler’s Tomb Is Unearthed in Belize, With Clues to His Ancient World",
    "link": "https://www.nytimes.com/2025/07/10/world/americas/maya-tomb-caracol-belize.html",
    "summary": "A rare mosaic death mask made of jadeite and vessels in the shapes of an owl, a monkey and coati-mundi were found with the ruler."
  }
]