[
  {
    "title": "Defying Congress, Trump Moves to Cut $4.9 Billion in Foreign Aid",
    "link": "https://www.nytimes.com/2025/08/29/us/politics/trump-foreign-aid.html",
    "summary": "The White House notified Congress that it plans to use a legally untested maneuver to circumvent lawmakers and claw back more money for foreign aid programs."
  },
  {
    "title": "In Budget Logs It Tried to Hide, White House Wrests More Control Over Spending",
    "link": "https://www.nytimes.com/2025/08/29/upshot/trump-congress-federal-budget.html",
    "summary": "Deep within obscure footnotes, the Trump administration is claiming more of Congress’s constitutional power of the purse by threatening to block funding."
  },
  {
    "title": "Trump Cancels Kamala Harris’s Secret Service Protection",
    "link": "https://www.nytimes.com/2025/08/29/us/politics/kamala-harris-secret-service.html",
    "summary": "The Secret Service usually protects a former vice president for six months after they leave office, but President Joseph R. Biden Jr. had extended Ms. Harris’s protection beyond that."
  },
  {
    "title": "Grand Juries in D.C. Reject Prosecutors’ Efforts to Level Harsh Charges Against Residents",
    "link": "https://www.nytimes.com/2025/08/29/us/politics/dc-grand-juries-indictments.html",
    "summary": "The extraordinary pushback in at least three separate cases comes as President Trump has flooded the streets with National Guard troops and federal agents."
  },
  {
    "title": "Weapons to Start Flowing Into Ukraine Under European Deal With Trump",
    "link": "https://www.nytimes.com/2025/08/29/world/europe/ukraine-weapons-europe-purchases.html",
    "summary": "A package of U.S. cruise missiles is among the first shipments of purchases by NATO allies to be sent to the embattled country."
  },
  {
    "title": "Ukraine’s Donetsk Faces Water Crisis Under Russian Occupation",
    "link": "https://www.nytimes.com/2025/08/29/world/europe/donetsk-water-shortage-crisis.html",
    "summary": "The Russian authorities have seized on the crisis in Donetsk to argue that taking over the rest of the region from Ukraine would allow Moscow to restore the water supply."
  },
  {
    "title": "How the Future of the Fed Came to Rest on Lisa Cook",
    "link": "https://www.nytimes.com/2025/08/29/us/politics/trump-fed-independence-lisa-cook.html",
    "summary": "President Trump’s effort to oust the Federal Reserve governor has kicked off a landmark legal battle, one that will have far-reaching consequences for the institution’s independence."
  },
  {
    "title": "PCE Inflation Stayed Stable in July, Keeping Fed on Track to Lower Interest Rates",
    "link": "https://www.nytimes.com/2025/08/29/business/pce-inflation-fed.html",
    "summary": "The latest economic data keeps the central bank on track to lower interest rates at its next meeting in September."
  },
  {
    "title": "After Minneapolis Church Shooting, Families Seek Healing and Comfort",
    "link": "https://www.nytimes.com/2025/08/28/us/annunciation-catholic-church-minneapolis-shooting.html",
    "summary": "Families and neighbors sought comfort on Thursday. “Give your kids an extra hug and kiss today,” the father of a victim said."
  },
  {
    "title": "What We Know About the Minneapolis Catholic School Shooting",
    "link": "https://www.nytimes.com/2025/08/27/us/minneapolis-school-shooting-minnesota.html",
    "summary": "The attack on a back-to-school Mass at Annunciation Catholic Church killed two children and injured 18 others. Investigators said the shooter’s writings and videos reflected violent obsessions."
  },
  {
    "title": "The Overlooked Element to the ‘KPop Demon Hunters’ Phenomenon",
    "link": "https://www.nytimes.com/2025/08/28/movies/kpop-demon-hunters-fandom.html",
    "summary": "Beyond its catchy songs and memorable characters, the Netflix movie does an admirable job of capturing what it’s like to be an adoring fan."
  },
  {
    "title": "‘The Queen of Versailles’ Puts Her Life in the Hands of a ‘Wicked’ Diva",
    "link": "https://www.nytimes.com/2025/08/29/theater/queen-of-versailles-chenoweth-broadway.html",
    "summary": "A 2012 documentary asked if Jacqueline Siegel was a benefactor or victim of American greed. A new musical starring Kristin Chenoweth raises doubts."
  },
  {
    "title": "International Student Enrollments Stay Steady at Columbia and Princeton",
    "link": "https://www.nytimes.com/2025/08/29/us/international-students-race-affirmative-action-princeton-columbia.html",
    "summary": "But Black student enrollment is lower at the two universities after years of turmoil in elite higher education."
  },
  {
    "title": "20 Years After Katrina, New Orleans Is ‘at a Tipping Point’",
    "link": "https://www.nytimes.com/2025/08/29/us/katrina-anniversary-new-orleans.html",
    "summary": "The city has taken pride in its ability to endure. But many residents, fed up with dysfunction and soaring costs, want it to strive for more."
  },
  {
    "title": "3 Ways Hurricane Forecasts Have Changed Since Katrina",
    "link": "https://www.nytimes.com/2025/08/28/weather/hurricane-katrina-forecasting.html",
    "summary": "Modern technology has given meteorologists more detail than they’ve ever had on how storms behave. Here’s what they’re doing with it."
  },
  {
    "title": "Israel Resumes Daytime Operations in Gaza City, Signaling Buildup to Assault",
    "link": "https://www.nytimes.com/2025/08/29/world/middleeast/israel-gaza-city-combat-zone.html",
    "summary": "The Israeli military ended a policy of pausing operations during the day that was intended to allow more aid in, calling Gaza City a “dangerous combat zone.”"
  },
  {
    "title": "Israel Military Says It Recovered Body of Ilan Weiss, Oct. 7 Victim, From Gaza",
    "link": "https://www.nytimes.com/2025/08/29/world/middleeast/israel-hostages-remains-recovered.html",
    "summary": "Ilan Weiss, who was killed in the Hamas-led attack, and the remains of another person, who was not identified, were found as the government looks set to expand a military offensive."
  },
  {
    "title": "Britain Bars Israeli Government From a Leading Arms Trade Fair",
    "link": "https://www.nytimes.com/2025/08/29/world/europe/uk-israel-military-trade-fair.html",
    "summary": "The British government said it was acting in response to Israel’s escalating military operation in Gaza. Israel condemned the decision."
  },
  {
    "title": "Iowa’s Joni Ernst Will Not Seek Re-election, Putting a Competitive Senate Seat in Play",
    "link": "https://www.nytimes.com/2025/08/29/us/politics/joni-ernst-senate-iowa-re-election.html",
    "summary": "Democrats still face an uphill fight to win in Iowa and retake the majority in the closely divided Senate."
  },
  {
    "title": "Gov. Greg Abbott Signs Gerrymandered Texas Map",
    "link": "https://www.nytimes.com/2025/08/29/us/politics/abbott-texas-legislature-redistricting-map.html",
    "summary": "After a bruising political fight, Gov. Greg Abbott signed into law a new congressional map. But the Republican-led Legislature, newly emboldened, has not stopped there."
  },
  {
    "title": "TSA PreCheck: Does It Really Save Time at the Airport?",
    "link": "https://www.nytimes.com/2025/08/29/upshot/tsa-precheck-how-long.html",
    "summary": "At the New York-area airports, for example, a lot depends on the terminal."
  },
  {
    "title": "John Malone Helped Create the Modern Media Industry. He’s Not Sure We’re Better Off.",
    "link": "https://www.nytimes.com/2025/08/29/business/john-malone-memoir-media-internet.html",
    "summary": "John Malone helped create the modern media industry over the last half century. In a new memoir, “Born to Be Wired,” he looks back on what he has wrought."
  },
  {
    "title": "Why the Texas Democrats’ Walkout Worked",
    "link": "https://www.nytimes.com/2025/08/29/opinion/gerrymandering-texas-newsom-trump.html",
    "summary": "Losing loudly has been a crucial feature of successful political movements."
  },
  {
    "title": "Los Angeles Wildfires Left the City With a Toxic Mess",
    "link": "https://www.nytimes.com/2025/08/29/opinion/los-angeles-wildfires-toxic-public-health.html",
    "summary": "Urban wildfires are becoming public health emergencies."
  },
  {
    "title": "Living With Katrina",
    "link": "https://www.nytimes.com/2025/08/29/briefing/hurricane-katrina-20-years.html",
    "summary": "The storm made landfall 20 years ago today. What’s happened since then?"
  },
  {
    "title": "CVS and Walgreens Clamp Down on Covid Vaccines in Many States",
    "link": "https://www.nytimes.com/2025/08/28/well/cvs-pharmacy-covid-vaccine-16-states.html",
    "summary": "Because a C.D.C. panel has not yet recommended the shots, the country’s largest pharmacy chains are requiring prescriptions or holding back altogether under some state laws."
  },
  {
    "title": "Looted by Nazis, a 17th-Century Painting Resurfaces. But Not for Long.",
    "link": "https://www.nytimes.com/2025/08/28/arts/argentina-giuseppe-ghislandi-painting-found.html",
    "summary": "The artwork had been missing for 80 years before Dutch journalists spotted it in a real estate listing in Argentina."
  },
  {
    "title": "Alabama Man Once Barred From Office Is Elected Mayor",
    "link": "https://www.nytimes.com/2025/08/29/us/politics/newbern-alabama-mayor-patrick-braxton.html",
    "summary": "Patrick Braxton won the first mayoral election in a half century in the small town of Newbern, five years after its leaders put up roadblocks to his assuming office."
  }
]