[
  {
    "title": "Witnesses describe harrowing scenes at the hospital and school.",
    "link": "https://www.nytimes.com/live/2025/08/27/us/minneapolis-church-shooting/witnesses-describe-harrowing-scenes-at-the-hospital-and-school",
    "summary": ""
  },
  {
    "title": "Trump, With Tariffs and Threats, Tries to Strong-Arm Nations to Retreat on Climate Goals",
    "link": "https://www.nytimes.com/2025/08/27/climate/trump-international-pressure-climate-oil.html",
    "summary": "The president has made no secret of his distaste for wind and solar in America. Now he’s taking his fossil fuel agenda overseas."
  },
  {
    "title": "Trump Raises Tariffs on India to 50% Over Russian Oil",
    "link": "https://www.nytimes.com/2025/08/27/business/india-tariffs-trump-russia-oil.html",
    "summary": "As punishment for buying Russian oil, President Trump is doubling the tax on goods imported from India, jeopardizing a relationship decades in the making."
  },
  {
    "title": "India Reels at Trump’s Highest Tariffs Yet",
    "link": "https://www.nytimes.com/2025/08/27/business/india-trump-tariffs.html",
    "summary": "Businesses and policymakers are casting around for help from unlikely places, as the country’s exports to the United States are crushed by 50 percent tariffs."
  },
  {
    "title": "The A.I. Spending Frenzy Is Propping Up the Real Economy, Too",
    "link": "https://www.nytimes.com/2025/08/27/business/economy/ai-investment-economic-growth.html",
    "summary": "The trillions of dollars that tech companies are pouring into new data centers are starting to show up in economic growth. For now, at least."
  },
  {
    "title": "Prosecutors Fail to Secure Indictment Against Man Who Threw Sandwich at Federal Agent",
    "link": "https://www.nytimes.com/2025/08/27/us/politics/trump-sandwich-assault-indictment-justice-department.html",
    "summary": "It was a sharp rebuke to the prosecutors who were assigned to bring charges against those arrested after President Trump’s deployment of National Guard troops and federal agents to Washington."
  },
  {
    "title": "Longest-Running Rafiki Says Goodbye to ‘The Lion King’",
    "link": "https://www.nytimes.com/2025/08/27/theater/tshidi-manye-lion-king-rafiki.html",
    "summary": "After more than 9,000 performances as the shaman in the Broadway show, Tshidi Manye prepares to hang up her baboon costume."
  },
  {
    "title": "FDA Approves Updated Covid Vaccines With New Restrictions",
    "link": "https://www.nytimes.com/2025/08/27/health/fda-covid-vaccines-rfk-jr.html",
    "summary": "The agency’s fall recommendations underscore the goals of Health Secretary Robert F. Kennedy Jr. to limit access to the vaccines, which he has long opposed."
  },
  {
    "title": "Riley Gaines Finished 5th. Now She Believes Victory Is in Her Grasp.",
    "link": "https://www.nytimes.com/2025/08/27/us/riley-gaines-trans-athletes.html",
    "summary": "The former college swimmer has used her race against Lia Thomas, a trans athlete, to propel her career as an influential, and unsparing, activist."
  },
  {
    "title": "Federal Money Is a ‘Lifeline’ for This Republican School District",
    "link": "https://www.nytimes.com/2025/08/27/us/federal-funding-education-department-republican-school-district.html",
    "summary": "President Trump wants to cut federal spending for education. The money often goes toward disadvantaged students in Republican states."
  },
  {
    "title": "As PBS Stations Confront Cuts, American History Takes a Hit",
    "link": "https://www.nytimes.com/2025/08/27/arts/television/american-experience.html",
    "summary": "The documentary series “American Experience” begins an abbreviated schedule this week. A victim of the federal funding take-back, it has suspended production and laid off its staff."
  },
  {
    "title": "Partial Heart Transplants Show Promise",
    "link": "https://www.nytimes.com/2025/08/27/well/partial-heart-transplants.html",
    "summary": "Owen Monroe was born with a deadly heart defect. Thanks to a cutting-edge surgery, now he’s starting preschool."
  },
  {
    "title": "Denmark Summons U.S. Envoy Over Greenland Espionage Allegations",
    "link": "https://www.nytimes.com/2025/08/27/world/europe/trump-denmark-greenland-us-embassy.html",
    "summary": "It’s the latest twist in the Greenland drama. President Trump wants the island, but Denmark refuses to hand it over."
  },
  {
    "title": "With Fuzzy Racket Bag, Venus Williams Highlights ERL and Other American Labels",
    "link": "https://www.nytimes.com/2025/08/27/style/venus-williams-fuzzy-bag-erl.html",
    "summary": "In her return at the U.S. Open, Ms. Williams decided to highlight labels based in the United States. Her shearling racket bag was hard to miss."
  },
  {
    "title": "The Ralph Lauren Look of Taylor Swift and Travis Kelce’s Engagement Photos",
    "link": "https://www.nytimes.com/2025/08/27/style/taylor-swift-engagement-dress.html",
    "summary": "It’s picture-perfect, of course."
  },
  {
    "title": "Taylor Swift’s Engagement Ring Marks a Return to Vintage Elegance",
    "link": "https://www.nytimes.com/2025/08/26/style/taylor-swift-engagement-ring.html",
    "summary": "The pop star’s antique-inspired sparkler channels the “heirloom look,” reflecting a return to antique stones."
  },
  {
    "title": "The Rise of the Democratic National Security Mom",
    "link": "https://www.nytimes.com/2025/08/27/opinion/spanberger-sherrill-women-governor-virginia-new-jersey.html",
    "summary": "The Democratic Party is counting on a new type of leader to counteract Trump."
  },
  {
    "title": "All the Things Trump Thinks He Owns",
    "link": "https://www.nytimes.com/2025/08/27/opinion/trump-white-house-smithsonian-lisa-cook.html",
    "summary": "The White House is not the president’s property. Neither is the Smithsonian. Nor Washington itself."
  },
  {
    "title": "The New State Interventions",
    "link": "https://www.nytimes.com/2025/08/27/briefing/intel-tariffs-the-fed-state-intervention.html",
    "summary": "Protectionism, industrial policy and government ownership — all once conservative boogeymen — have become official doctrine."
  },
  {
    "title": "After Blocking U.N. Nuclear Watchdog, Iran Allows Inspectors to Return",
    "link": "https://www.nytimes.com/2025/08/27/world/europe/iran-un-nuclear-watchdog-inspectors.html",
    "summary": "Iran halted cooperation with the agency last month, as experts warned that Tehran may revive efforts to build a nuclear bomb."
  },
  {
    "title": "Sean Duffy Says Penn Station Renovation Will Begin in 2027",
    "link": "https://www.nytimes.com/2025/08/27/nyregion/penn-station-renovation-2027.html",
    "summary": "Amtrak intends to team up with a private developer to rebuild the dingy Manhattan train station on an accelerated schedule, transportation officials said."
  },
  {
    "title": "Google Pixel 10 Pro Review: This A.I. Phone Can Save Time if You Surrender Your Data",
    "link": "https://www.nytimes.com/2025/08/27/technology/personaltech/google-pixel-10-pro-review-ai-phone.html",
    "summary": "The new artificially intelligent Pixel can help people streamline certain tasks. But that efficiency may not be worth the data you give up, our reviewer writes."
  },
  {
    "title": "Uncovering the Genes That Let Our Ancestors Walk Upright",
    "link": "https://www.nytimes.com/2025/08/27/science/human-evolution-ilium-bipedal.html",
    "summary": "A new study reveals some of the crucial molecular steps on the path to bipedalism."
  }
]