[
  {
    "title": "How Trump-Putin Summit Signals Return to Imperial Thinking",
    "link": "https://www.nytimes.com/2025/08/15/world/asia/trump-putin-summit-imperial.html",
    "summary": "The two leaders are bringing some old-world approaches to bear on a 21st-century conflict."
  },
  {
    "title": "Why Russia Sold Alaska to the U.S.",
    "link": "https://www.nytimes.com/2025/08/15/world/europe/russia-alaska-purchase-ukraine.html",
    "summary": "The Trump-Putin summit will take place in a former Russian colony that the United States bought for $7.2 million in 1867. Here’s how the deal came together and why its legacy matters."
  },
  {
    "title": "Trump Depicted Youth Crime in D.C. as Rampant. Here’s What the Data Shows.",
    "link": "https://www.nytimes.com/2025/08/15/us/trump-juvenile-crime-dc-data.html",
    "summary": "Concerns came to a head during the pandemic, when carjackings surged and many of those arrested were children. Carjackings and other crimes have declined considerably."
  },
  {
    "title": "Congressional Democrats Move to End Trump’s Control of D.C. Police",
    "link": "https://www.nytimes.com/2025/08/15/us/politics/congress-democrats-legislation-trump-dc-police.html",
    "summary": "The legislation has little chance of success, given that Republicans control Congress."
  },
  {
    "title": "Elon Musk’s SpaceX Most Likely Doesn’t Pay Taxes",
    "link": "https://www.nytimes.com/2025/08/15/technology/spacex-musk-government-contracts-taxes.html",
    "summary": "Elon Musk’s rocket company relies on federal contracts, but years of losses have most likely let it avoid paying federal income taxes, according to internal company documents."
  },
  {
    "title": "The Woman to See About Your Face",
    "link": "https://www.nytimes.com/2025/08/15/style/beauty-broker-melinda-farina-plastic-surgery.html",
    "summary": "Melinda Farina, known as the Beauty Broker, sends Hollywood actresses and everyday women to doctors around the globe. In her world, the knives are always out."
  },
  {
    "title": "How Train Riders With Disabilities Are Faring on Amtrak",
    "link": "https://www.nytimes.com/2025/08/14/travel/amtrak-riders-passengers-disabilities.html",
    "summary": "Passengers are facing blocked wheelchair space, getting stuck in doors and suffering other indignities 35 years after the Americans With Disabilities Act became law."
  },
  {
    "title": "How Accessible Is Traveling by Amtrak?",
    "link": "https://www.nytimes.com/video/travel/100000010331128/how-accessible-is-traveling-by-amtrak.html",
    "summary": "Many people with disabilities depend on Amtrak to travel across the country, but the journey can still present obstacles. Gabe Castro-Root outlines some of the challenges disabled passengers encounter while traveling."
  },
  {
    "title": "Governor Hochul Pardons Laotian Immigrant to Stop His Deportation",
    "link": "https://www.nytimes.com/2025/08/15/nyregion/hochul-pardon-laos-immigrant-deportation.html",
    "summary": "The man had been convicted of manslaughter as a teenager after he admitted to fatally shooting a man during a pool hall confrontation in Brooklyn, arguing it was self-defense."
  },
  {
    "title": "St. Patrick’s Cathedral to Unveil Mural Celebrating City’s Immigrants",
    "link": "https://www.nytimes.com/2025/08/14/arts/design/st-patricks-cathedral-mural-immigration-dolan.html",
    "summary": "Cardinal Timothy M. Dolan’s art commission hits a hot button. “I thought they might say, ‘We don’t want to wade in these waters’ — and the opposite happened,” the painter said."
  },
  {
    "title": "No Running Water and No Electricity, but for Some Venetians, This Island Is Paradise",
    "link": "https://www.nytimes.com/2025/08/15/world/europe/venice-residents-poveglia-island-lease.html",
    "summary": "A citizens’ group is now in charge of the island of Poveglia, where they will create a park for anyone who wants to leave Venice’s maddening crowds of tourists behind."
  },
  {
    "title": "Why Does the Stock Market Keep Rising?",
    "link": "https://www.nytimes.com/2025/08/15/business/tariffs-stock-market-records.html",
    "summary": "Strong corporate earnings, mostly stable tariff rates and the expectation of interest rate cuts have eased worries of a market reckoning."
  },
  {
    "title": "Why Hands-Off Investing Pays Off",
    "link": "https://www.nytimes.com/2025/08/15/business/investing-fund-returns-interfere.html",
    "summary": "Put money into low-cost stock and bond funds, but don’t forget the rest of the recipe: Leave your investments alone."
  },
  {
    "title": "Fed Chair Faces Scrutiny — and Bats — at Major Policy Speech in Mountain Forum",
    "link": "https://www.nytimes.com/2025/08/15/business/federal-reserve-jerome-powell-jackson-hole-bats.html",
    "summary": "A colony of bats recently took up residence at the storied Jackson Lake Lodge, where central bankers and economic policymakers will convene next week for an exclusive gathering."
  },
  {
    "title": "Air Canada’s Flight Attendants Reject Call for Arbitration",
    "link": "https://www.nytimes.com/2025/08/15/world/canada/air-canada-flight-attendant-strike.html",
    "summary": "Their union says one of its core demands, to receive pay for groundwork, is unlikely to be introduced in arbitration. The airline began canceling flights ahead of the potential strike."
  },
  {
    "title": "As Air Canada Strike Looms, Here’s What Travelers Need to Know",
    "link": "https://www.nytimes.com/2025/08/15/travel/air-canada-strike-flight-cancellations.html",
    "summary": "A strike by the carrier’s flight attendants could disrupt 130,000 travelers a day, including international fliers. Here’s what to know if your flight is affected."
  },
  {
    "title": "With a Shovel and a Dream, a Woman Finds a 2.3 Carat Diamond in Arkansas",
    "link": "https://www.nytimes.com/2025/08/15/us/arkansas-state-park-diamond-found-engagment-ring.html",
    "summary": "After three weeks, with bug bites and tattered hiking boots, Micherre Fox found the stone at Crater of Diamonds State Park."
  },
  {
    "title": "The Stock Market Is Getting Scary. What You Should Do.",
    "link": "https://www.nytimes.com/2025/08/15/opinion/stock-market-advice-investing.html",
    "summary": "There are troubling signs that our stock market may be overheated."
  },
  {
    "title": "Boy Crisis of 2025, Meet the ‘Boy Problem’ of the 1900s",
    "link": "https://www.nytimes.com/2025/08/15/opinion/men-boys-crisis-progressive-era.html",
    "summary": "It takes a village to raise a child. But some of the villagers must be men."
  },
  {
    "title": "What to Know Ahead of the Trump-Putin Summit",
    "link": "https://www.nytimes.com/2025/08/15/briefing/trump-putin-alaska-ukraine.html",
    "summary": "We have a primer on today’s Trump-Putin summit in Alaska."
  },
  {
    "title": "A $45 Treatment Can Save a Starving Child. US Aid Cuts Have Frozen the Supply",
    "link": "https://www.nytimes.com/2025/08/15/health/hunger-malnutrition-usaid-cuts.html",
    "summary": "The dismantling of U.S.A.I.D. has disrupted the global supply chain that provides a therapeutic food, leaving thousands of malnourished children at risk of dying."
  },
  {
    "title": "As Trump Tightens Hold on Kennedy Center, Top Theater Producer Resigns",
    "link": "https://www.nytimes.com/2025/08/15/theater/jeffrey-finn-kennedy-center-theater.html",
    "summary": "Jeffrey Finn, a Broadway producer who has overseen theater programming at the Washington venue since 2016, will leave next month."
  },
  {
    "title": "Study Finds Planet Around Trappist-1 Star Shows No Signs of Life",
    "link": "https://www.nytimes.com/2025/08/14/science/trappist-1d-webb-life-planet.html",
    "summary": "Astronomers had hoped to observe an atmosphere on one of the seven planets known to orbit Trappist-1, a red dwarf star. A new study found nothing to write home about."
  }
]