[
  {
    "title": "Here Are Airports That Could Be Affected by the Air Traffic Slowdown",
    "link": "https://www.nytimes.com/2025/11/06/us/politics/airports-list-flight-cuts-government-shutdown.html",
    "summary": "The cuts to flights are expected to begin Friday and deepen over the weekend to reach a 10 percent reduction in air traffic."
  },
  {
    "title": "Trump Announces Deal to Drop Obesity Drug Prices to as Little as $150 a Month",
    "link": "https://www.nytimes.com/2025/11/06/health/obesity-drug-prices-trump.html",
    "summary": "President Trump announced a deal with Eli Lilly and Novo Nordisk to lower prices on hugely popular weight-loss drugs for Medicare, Medicaid and American patients who pay with their own money."
  },
  {
    "title": "Nancy Pelosi Announces Retirement From Congress in 2027",
    "link": "https://www.nytimes.com/2025/11/06/us/politics/nancy-pelosi-house-retire.html",
    "summary": "Representative Nancy Pelosi, the only female House speaker, said she will not run for re-election. She wielded immense power and became a Democratic icon, while she was demonized by conservatives."
  },
  {
    "title": "As Mamdani Surges Ahead, Schumer Risks Finding Himself Left Behind",
    "link": "https://www.nytimes.com/2025/11/06/nyregion/schumer-mamdani-democrats-new-york.html",
    "summary": "The rise of New York City’s mayor-elect comes at a complicated moment in the career of Senator Chuck Schumer, who is in danger of looking out of touch with the prevailing energy back home."
  },
  {
    "title": "Two Signs That Democrats Flipped Trump Supporters on Tuesday",
    "link": "https://www.nytimes.com/2025/11/06/upshot/election-turnout-trump-hispanics.html",
    "summary": "It wasn’t just about superior turnout. Party switchers played a significant role in Virginia and New Jersey."
  },
  {
    "title": "Nick Fuentes’s Rise Puts MAGA Movement in a ‘Time of Choosing’",
    "link": "https://www.nytimes.com/2025/11/06/us/politics/nick-fuentes-trump.html",
    "summary": "After Mr. Fuentes’s interview with Tucker Carlson, Republicans are considering just how far his views are from the nationalism embraced by President Trump’s followers."
  },
  {
    "title": "Trump vs. Mamdani: President Sees a Capable Foil in New York’s Next Mayor",
    "link": "https://www.nytimes.com/2025/11/05/us/politics/trump-mamdani-showdown.html",
    "summary": "President Trump has berated Zohran Mamdani, the mayor-elect of New York City, in public. But privately, Mr. Trump describes him as slick and a good talker."
  },
  {
    "title": "Are A.I. Therapy Chatbots Safe to Use?",
    "link": "https://www.nytimes.com/2025/11/06/technology/ai-therapy-chatbots-ash.html",
    "summary": "Psychologists and technologists see them as the future of therapy. The Food and Drug Administration is exploring whether to regulate them as medical devices."
  },
  {
    "title": "How A.I. and Social Media Contribute to ‘Brain Rot’",
    "link": "https://www.nytimes.com/2025/11/06/technology/personaltech/ai-social-media-brain-rot.html",
    "summary": "A.I. search tools, chatbots and social media are associated with lower cognitive performance, studies say. What to do?"
  },
  {
    "title": "The Florentine Diamond Resurfaces After 100 Years in Hiding",
    "link": "https://www.nytimes.com/2025/11/06/arts/design/florentine-diamond-resurfaces-hapsburg.html",
    "summary": "A legendary jewel of the Hapsburg dynasty — not seen since 1919 and thought lost, stolen or recut — has actually been safe in a Canadian bank for decades."
  },
  {
    "title": "The ‘Worst Test in Medicine’ is Driving America’s High C-Section Rate",
    "link": "https://www.nytimes.com/2025/11/06/health/electronic-fetal-monitoring-c-sections.html",
    "summary": "Round-the-clock fetal monitoring leads to unnecessary C-sections. But it’s used in nearly every birth because of business and legal concerns, The Times found."
  },
  {
    "title": "A Grave Condition Caused by C-Sections Is on the Rise",
    "link": "https://www.nytimes.com/2025/11/06/health/placenta-accreta-c-sections.html",
    "summary": "Placenta accreta is a life-threatening condition in which the placenta attaches to scar tissue left by a C-section. It used to be extremely rare."
  },
  {
    "title": "Judy Garland’s ‘Lucky Jacket’ Returns to Carnegie Hall",
    "link": "https://www.nytimes.com/2025/11/06/style/judy-garland-lucky-jacket-carnegie-hall.html",
    "summary": "She wore it at Carnegie Hall on “the greatest evening in show-business history.” Now the jacket that got away is coming home."
  },
  {
    "title": "Russia Close to Its Biggest Capture of a Ukrainian City Since 2023",
    "link": "https://www.nytimes.com/2025/11/06/world/europe/ukraine-war-pokrovsk-frontline.html",
    "summary": "The Kremlin is focusing its fire on Pokrovsk, a gateway to the Donetsk region, which Russia’s president, Vladimir V. Putin, has long coveted."
  },
  {
    "title": "How China’s Rare Earth Chokehold Could Strangle Europe’s Military Buildup",
    "link": "https://www.nytimes.com/2025/11/06/business/rare-earth-china-europe.html",
    "summary": "Drones, missiles and other crucial components of Europe’s rush to rearm itself rely on an increasingly unsteady supply of minerals from China."
  },
  {
    "title": "Scores of Palestinian Militants Still in Israeli-Controlled Parts of Gaza, Officials Say",
    "link": "https://www.nytimes.com/2025/11/06/world/middleeast/hamas-militants-trapped-gaza-israel.html",
    "summary": "At least some of the fighters are believed to be in the enclave’s vast tunnel network, marooned behind the “yellow line” that Israeli forces withdrew to as part of the cease-fire."
  },
  {
    "title": "AR-15 Ammunition at a Crime Scene? Good Odds This Army Plant Made It.",
    "link": "https://www.nytimes.com/2025/11/06/us/military-ammunition-crime-lake-city.html",
    "summary": "Popular AR-15 ammunition made at an Army-owned facility was far more likely than any other to turn up in a government database tracking evidence from gun crimes, new data shows."
  },
  {
    "title": "Canada Is About to Lose Its Status as Having Eliminated Measles",
    "link": "https://www.nytimes.com/2025/11/06/world/canada/canada-measles-elimination-measles.html",
    "summary": "One province with an outsize number of cases has seen a collision of politics and public health policy."
  },
  {
    "title": "The U.S. Is Skipping This Year’s Climate Summit. For Many, That’s OK.",
    "link": "https://www.nytimes.com/2025/11/06/climate/belem-brazi-cop30-trump.html",
    "summary": "World leaders, gathering in Brazil, will try to agree on new, more ambitious plans to cut greenhouse gases."
  },
  {
    "title": "COP30 U.N. Climate Talks Are Starting in Brazil. Here’s What to Know.",
    "link": "https://www.nytimes.com/2025/11/06/climate/what-is-cop30-belem.html",
    "summary": "Diplomats and leaders from around the world are gathering on the edge of the Amazon rainforest for annual talks on how to limit global warming."
  },
  {
    "title": "How ‘The Office’ Memes Became the Language of the Internet",
    "link": "https://www.nytimes.com/2025/11/06/arts/television/the-office-memes-internet.html",
    "summary": "Oh my God, OK, it’s happening! From social-media posters to the F.C.C. chair, we are all living in Michael Scott’s world."
  },
  {
    "title": "Did Liberal Feminism Ruin the Workplace?",
    "link": "https://www.nytimes.com/2025/11/06/opinion/women-workplace-feminism-conservative.html",
    "summary": "And if so, can conservative feminism fix it?"
  },
  {
    "title": "Seeing Those Who Are Forgotten: An Act of Witness in Appalachia",
    "link": "https://www.nytimes.com/2025/11/06/opinion/appalachia-family-photographs-poverty.html",
    "summary": "A photographer spends 15 years documenting an Appalachian family and the constant pressure of poverty in their lives."
  },
  {
    "title": "A Fight Over Maps",
    "link": "https://www.nytimes.com/2025/11/06/briefing/a-fight-over-maps.html",
    "summary": "We explain a California vote to flip as many as five House seats for Democrats next year."
  },
  {
    "title": "Late Night Celebrates a Consequential Election Day",
    "link": "https://www.nytimes.com/2025/11/06/arts/television/late-night-election-day-democrats.html",
    "summary": "“We needed a big night,” Jimmy Kimmel said. “Democrats have had fewer wins this year than the Jets.”"
  },
  {
    "title": "Mexico’s President Presses Charges Against Man Who Groped Her on the Street",
    "link": "https://www.nytimes.com/2025/11/05/world/americas/sheinbaum-man-video-charges.html",
    "summary": "A video of a man touching Mexico’s first female president, Claudia Sheinbaum, shocked many Mexicans but did not surprise them. “It’s so common,” one woman said."
  },
  {
    "title": "On Prince Andrews Road, a Frustrating Effort to Get a New Address",
    "link": "https://www.nytimes.com/2025/11/06/world/europe/prince-andrew-road-name-uk.html",
    "summary": "Villagers in Hellesdon, England, are pushing to change the name, but local bureaucracy makes it difficult."
  },
  {
    "title": "Early Blast of Winter Weather Heads East This Weekend",
    "link": "https://www.nytimes.com/2025/11/05/weather/cold-snow-northeast-forecast.html",
    "summary": "From Saturday through the start of next week, a cold snap is expected to spread from the Midwest to the East Coast."
  },
  {
    "title": "Miss Universe Organizer Apologizes After Tirade at Miss Mexico",
    "link": "https://www.nytimes.com/2025/11/06/world/asia/miss-universe-walkout-mexico-thailand.html",
    "summary": "Several contestants walked out of a Miss Universe event this week when the pageant director berated Miss Mexico for not taking part in promotional activities."
  }
]