[
  {
    "title": "Latest Trump-Zelensky Meeting Yields No Progress Toward a Cease-fire in Ukraine",
    "link": "https://www.nytimes.com/2025/10/21/world/europe/ukraine-russia-trump-zelensky-meeting.html",
    "summary": "A contentious meeting between President Trump and President Volodymyr Zelensky of Ukraine produced no obvious progress toward a cease-fire."
  },
  {
    "title": "Russia Pushes a State-Controlled ‘Super App’ by Sabotaging Its Rivals",
    "link": "https://www.nytimes.com/2025/10/21/world/europe/russia-max-app.html",
    "summary": "As the Kremlin throttles WhatsApp and Telegram, the new MAX messaging app is moving Russia closer to a restricted internet without foreign technology."
  },
  {
    "title": "How Trump Reprogrammed Funds to Pay Some Workers During the Government Shutdown",
    "link": "https://www.nytimes.com/2025/10/21/us/politics/trump-shutdown-pay.html",
    "summary": "By paying troops and law enforcement officials, the president stretched the limits of his spending powers, posing a fresh test to Congress."
  },
  {
    "title": "How a Long Government Shutdown Could Leave Scars on the Economy",
    "link": "https://www.nytimes.com/2025/10/21/business/economy/government-shutdown-economic-effects.html",
    "summary": "The effect is rippling beyond missing paychecks to federal services that support much of the economy."
  },
  {
    "title": "What Could Torpedo the Stock Rally",
    "link": "https://www.nytimes.com/2025/10/21/business/dealbook/stocks-rally-bulls-bears.html",
    "summary": "The S&amp;P 500 is nearing another record, but some analysts caution that a host of factors may stall its momentum."
  },
  {
    "title": "Trump Officials Move Toward Deal With University of Virginia After Standoff",
    "link": "https://www.nytimes.com/2025/10/21/us/politics/trump-virginia-university.html",
    "summary": "The Trump administration is closing in on a deal with the University of Virginia, four months after government pressure forced the school’s previous president to resign."
  },
  {
    "title": "North Carolina Senate Approves New Map in Effort to Add G.O.P. Congressional Seat",
    "link": "https://www.nytimes.com/2025/10/21/us/north-carolina-congressional-map-republicans.html",
    "summary": "The state House of Representatives is likely to approve the new map later this week, and the governor cannot veto it, per the State Constitution."
  },
  {
    "title": "G.O.P. Senators Oppose Trump Watchdog Nominee After Report of Racist Texts",
    "link": "https://www.nytimes.com/2025/10/21/us/politics/paul-ingrassia-trump-senate.html",
    "summary": "At least four Republican senators, including the Senate majority leader, signaled their opposition to Paul Ingrassia, the president’s pick to lead the Office of Special Counsel."
  },
  {
    "title": "Vance Lands in Israel as U.S. Tries to Shore Up Gaza Cease-Fire Deal",
    "link": "https://www.nytimes.com/2025/10/21/world/middleeast/jd-vance-israel-gaza-ceasefire.html",
    "summary": "Vice President JD Vance appeared undeterred by recent flare-ups of violence in Gaza, and he declined to set a deadline for when Hamas must disarm."
  },
  {
    "title": "Nations Hesitate to Send Troops to Gaza, Fearing Clashes With Hamas",
    "link": "https://www.nytimes.com/2025/10/21/world/middleeast/gaza-ceasefire-international-security-force-hamas.html",
    "summary": "The Trump peace plan calls for an international security force in the Gaza Strip, but countries that might send troops are wary of danger, an unclear mission and being seen as occupiers."
  },
  {
    "title": "Inside Luigi Mangione’s Missing Months",
    "link": "https://www.nytimes.com/2025/10/21/us/luigi-mangione-asia-trip.html",
    "summary": "From beers at a Bangkok bar to a climb up Mount Omine in Japan, The Times traced the pivotal months before Mr. Mangione was charged with killing UnitedHealthcare’s C.E.O."
  },
  {
    "title": "Warner Bros. Discovery Says It Is Considering a Sale",
    "link": "https://www.nytimes.com/2025/10/21/business/media/warner-bros-discovery-sale.html",
    "summary": "The owner of CNN, HBO and the Warner Bros. movie studio revealed that it has received acquisition interest from multiple suitors."
  },
  {
    "title": "Louvre Robbery Raises Questions About Security",
    "link": "https://www.nytimes.com/2025/10/21/world/europe/louvre-robbery-security-paris.html",
    "summary": "Investigators were looking into the alarm systems at an institution that one expert said “wasn’t built with an obsession over security.”"
  },
  {
    "title": "Suspect Charged in Paris Museum Heist (No, Not That One)",
    "link": "https://www.nytimes.com/2025/10/21/world/europe/france-museum-theft-gold-nugget-arrest.html",
    "summary": "A woman from China was charged with stealing gold last month from National Museum of Natural History. It’s one of several high-profile recent thefts from French institutions."
  },
  {
    "title": "This School Has Taught Native Hawaiians Since 1887. Is That Discrimination?",
    "link": "https://www.nytimes.com/2025/10/21/us/politics/hawaii-kamehameha-schools-discrimination-lawsuit.html",
    "summary": "The admissions policy of Kamehameha Schools gives preference to Native Hawaiians. A new lawsuit calls it “blood-based discrimination.”"
  },
  {
    "title": "I Went on a ‘Dark Retreat’ and Spent Three Days in Total Darkness",
    "link": "https://www.nytimes.com/2025/10/21/magazine/dark-retreat-meditation-sensory-deprivation-spirituality.html",
    "summary": "The author spent days in a room with no light. Who would he be when he emerged?"
  },
  {
    "title": "Sanae Takaichi is Japan’s New Prime Minister, and She’s a Heavy Metal Drummer",
    "link": "https://www.nytimes.com/2025/10/21/world/asia/sanae-takaichi-japan-prime-minister.html",
    "summary": "Sanae Takaichi, a fan of Iron Maiden, had an improbable rise to power. Like her mentor, Shinzo Abe, she is expected to lead Japan to the right."
  },
  {
    "title": "Who Is Sanae Takaichi, Japan’s First Female Prime Minister?",
    "link": "https://www.nytimes.com/2025/10/04/world/asia/sanae-takaichi-japan.html",
    "summary": "The hard-line conservative is making history in a country where women are drastically underrepresented at the highest levels of power."
  },
  {
    "title": "More Than 100 Cases of Measles Reported in Utah and Arizona",
    "link": "https://www.nytimes.com/2025/10/21/well/more-than-100-cases-of-measles-reported-in-utah-and-arizona.html",
    "summary": "In the hardest-hit counties, childhood vaccination rates steeply declined during the pandemic."
  },
  {
    "title": "Amazon Plans to Replace More Than Half a Million Jobs With Robots",
    "link": "https://www.nytimes.com/2025/10/21/technology/inside-amazons-plans-to-replace-workers-with-robots.html",
    "summary": "Internal documents show the company that changed how people shop has a far-reaching plan to automate 75 percent of its operations."
  },
  {
    "title": "The Robots Fueling Amazon’s Automation",
    "link": "https://www.nytimes.com/2025/10/21/technology/amazon-robotics-automation.html",
    "summary": "Meet Sparrow, Cardinal and Proteus. They’re the robots that, step by step, are replacing human workers in the company’s warehouses."
  },
  {
    "title": "Curtis Sliwa Has the Spotlight. He’s Not About to Give It Up.",
    "link": "https://www.nytimes.com/2025/10/21/nyregion/curtis-sliwa-mayor.html",
    "summary": "Mr. Sliwa, the Republican nominee for mayor of New York City, finds himself a major player in the race. He’s under heavy pressure to drop out."
  },
  {
    "title": "Cuomo Proposes That New York City Take Partial Control of Subway",
    "link": "https://www.nytimes.com/2025/10/21/nyregion/cuomo-nyc-subway.html",
    "summary": "Andrew Cuomo, whose stewardship of the M.T.A. as governor was contentious, suggested that the authority hand over responsibility for capital construction and maintenance to the city."
  },
  {
    "title": "Trump’s Self-Inflicted Soybean Problem",
    "link": "https://www.nytimes.com/2025/10/21/opinion/trump-soybeans-tariffs.html",
    "summary": "Tariffs don’t seem to be working as planned."
  },
  {
    "title": "Can These Two Women Turn It Around for Democrats?",
    "link": "https://www.nytimes.com/2025/10/21/opinion/sherrill-spanberger-democrats-new-jersey-virginia.html",
    "summary": "Races in New Jersey and Virginia are testing the power of the moderate lane."
  },
  {
    "title": "The Louvre Heist",
    "link": "https://www.nytimes.com/2025/10/21/world/louvre-jewelry-heist.html",
    "summary": "Today, we look at how thieves pulled off this weekend’s brazen daylight robbery in Paris and why they did it."
  },
  {
    "title": "Jan. 6 Rioter Pardoned by Trump Is Charged With Threatening Hakeem Jeffries",
    "link": "https://www.nytimes.com/2025/10/21/us/politics/jan-6-rioter-hakeem-jeffries-threats.html",
    "summary": "The New York man, Christopher Moynihan, appears to be the only rioter so far who has been charged again with committing an offense against an elected official."
  },
  {
    "title": "France Sends Former President Nicolas Sarkozy to Prison to Start 5-Year Sentence",
    "link": "https://www.nytimes.com/2025/10/21/world/europe/sarkozy-france-president-jail.html",
    "summary": "Nicolas Sarkozy, the president of France from 2007 to 2012, received a five-year sentence after being convicted in a campaign finance scandal."
  },
  {
    "title": "Grace Wales Bonner Is Named Creative Director of Men’s Wear at Hermès",
    "link": "https://www.nytimes.com/2025/10/21/style/grace-wales-bonner-hermes-men.html",
    "summary": "Grace Wales Bonner is the new creative director of men’s wear at the French fashion house."
  }
]