[
  {
    "title": "With Military Strike His Predecessors Avoided, Trump Takes a Huge Gamble",
    "link": "https://www.nytimes.com/2025/06/21/us/politics/trump-iran-risks.html",
    "summary": "President Trump is betting the United States can repel whatever retaliation Iran orders, and that it has destroyed the regime’s chances of reconstituting its nuclear program."
  },
  {
    "title": "Senate Official Rejects Food Aid Cuts Proposed by Republicans in Megabill",
    "link": "https://www.nytimes.com/2025/06/21/us/politics/senate-snap-food-stamps.html",
    "summary": "The ruling by the parliamentarian sent G.O.P. lawmakers back to the drawing board to cover the costs of President Trump’s domestic policy bill."
  },
  {
    "title": "Trump Says He Wants to Fund More Trade Schools. Just Not These.",
    "link": "https://www.nytimes.com/2025/06/21/business/job-corps-trump-trade-schools.html",
    "summary": "The Job Corps program has long been the subject of debate, but it is now also a point of contention in the administration’s efforts to pull back the social safety net."
  },
  {
    "title": "The Lessons of Trump’s Fight With Los Angeles Over Immigration",
    "link": "https://www.nytimes.com/2025/06/21/magazine/trump-los-angeles-immigration.html",
    "summary": "The president’s clashes with Los Angeles over immigration were a decade in the making — and their outcome remains unclear."
  },
  {
    "title": "Mahmoud Khalil Returns to New York After Months in Detention",
    "link": "https://www.nytimes.com/2025/06/21/nyregion/mahmoud-khalil-return-to-new-york.html",
    "summary": "The Trump administration remains committed to deporting Mr. Khalil, a Columbia graduate and leading figure in the pro-Palestinian protest movement."
  },
  {
    "title": "Midwest Cities Bake as Heat Wave Blankets the Central U.S.",
    "link": "https://www.nytimes.com/2025/06/21/us/heat-wave-midwest-central-us.html",
    "summary": "St. Louis, Chicago and Des Moines were among the cities that saw heat indexes hit triple digits on Saturday, with the East Coast bracing for similar conditions by Monday."
  },
  {
    "title": "At Least 3 Dead in Tornadoes in North Dakota, Officials Say",
    "link": "https://www.nytimes.com/2025/06/21/weather/tornadoes-deaths-north-dakota-minnesota.html",
    "summary": "The deaths came after a series of large and long-lasting storms moved through North Dakota and Minnesota Friday night."
  },
  {
    "title": "Windy Conditions Fan Forsyth Fire in Utah",
    "link": "https://www.nytimes.com/2025/06/21/weather/windy-conditions-fan-wildfires-in-the-west.html",
    "summary": "The Forsyth fire in Utah threatened a small community in the state’s southwest corner. Farther west, the Conner fire burned rapidly near Lake Tahoe."
  },
  {
    "title": "Europe Is Finally Ready to Spend More on Defense. The Hard Part Is How.",
    "link": "https://www.nytimes.com/2025/06/22/business/europe-nato-defense-spending.html",
    "summary": "After a yearslong debate over NATO spending, European nations are poised to commit more funds to deter Russia. Now the region must decide how to unify its fragmented manufacturing."
  },
  {
    "title": "Far-Right Party Tries to Expand Its Appeal in Germany’s West",
    "link": "https://www.nytimes.com/2025/06/22/world/europe/germany-afd.html",
    "summary": "To reach voters outside its Eastern heartlands, the AfD is putting a new gloss on its anti-immigrant message — while sticking with its agenda."
  },
  {
    "title": "In Final Push for Mayor, Lander Appears With 2 Cuomo Accusers",
    "link": "https://www.nytimes.com/2025/06/21/nyregion/lander-cuomo-women-mayor.html",
    "summary": "The campaign event by Brad Lander, the New York City comptroller running for mayor, came as Andrew Cuomo, the front-runner, appeared with the mother of a murder victim."
  },
  {
    "title": "Walmart Tries to Shed a Stodgy Vibe to Battle Digital-Native Rivals",
    "link": "https://www.nytimes.com/2025/06/21/business/walmart-rebrand-headquarters.html",
    "summary": "The retailing giant is spending billions to attract workers to a new headquarters and woo shoppers with drone delivery and a broader range of items (like Louis Vuitton handbags)."
  },
  {
    "title": "Study Suggests Weight-Loss Pill is as Effective as Ozempic",
    "link": "https://www.nytimes.com/2025/06/21/well/new-weight-loss-drugs.html",
    "summary": "The drugs in development include a pill that a new trial suggests is about as effective as Ozempic."
  },
  {
    "title": "BTS Is Back Together. Does It Still Rule K-Pop?",
    "link": "https://www.nytimes.com/2025/06/21/world/asia/bts-kpop.html",
    "summary": "Suga is the last member of the wildly popular band to complete his national service. After more than two years apart, the challenge is to rekindle the magic."
  },
  {
    "title": "How South Korea Became a Cultural Powerhouse",
    "link": "https://www.nytimes.com/2025/06/21/world/asia/south-korea-kpop-culture.html",
    "summary": "With BTS poised to reunite, “Squid Game” returning and a Broadway show winning awards, the Korean cultural wave keeps on rolling."
  },
  {
    "title": "Three Unknowns for America and the World After Trump’s Strike on Iran",
    "link": "https://www.nytimes.com/2025/06/22/opinion/us-military-iran-strike-trump.html",
    "summary": "Despite Trump’s claim of success, he has created uncertainty and risk."
  },
  {
    "title": "Political Violence Is Here, and It’s Working",
    "link": "https://www.nytimes.com/2025/06/22/opinion/political-violence-trump-shooting.html",
    "summary": "Trump is the Republican Party. That is settled. His violent talk is, then, the official political communication strategy of the ruling party."
  },
  {
    "title": "Influencers Step Onto Center Stage at Cannes",
    "link": "https://www.nytimes.com/2025/06/21/business/cannes-social-media-influencers.html",
    "summary": "Big brands are increasingly courting social media stars, who descended on a major annual festival in France to pitch themselves to advertisers."
  },
  {
    "title": "4 Missing After Medical Helicopter Crashes in Quebec Lake",
    "link": "https://www.nytimes.com/2025/06/21/world/canada/medical-helicopter-crash-canada.html",
    "summary": "The helicopter was carrying four crew members and a patient when it crashed on Friday night, officials said."
  },
  {
    "title": "Nathan Silver, Who Chronicled a Vanished New York, Dies at 89",
    "link": "https://www.nytimes.com/2025/06/21/nyregion/nathan-silver-dead.html",
    "summary": "An architect, he wrote in his book “Lost New York” about the many buildings that were destroyed before passage of the city’s landmarks preservation law."
  }
]