[
  {
    "title": "With Military Strike His Predecessors Avoided, Trump Takes a Huge Gamble",
    "link": "https://www.nytimes.com/2025/06/21/us/politics/trump-iran-risks.html",
    "summary": "President Trump is betting the United States can repel whatever retaliation Iran orders, and that it has destroyed the regime’s chances of reconstituting its nuclear program."
  },
  {
    "title": "Missteps, Confusion and ‘Viral Waste’: The 14 Days That Doomed U.S.A.I.D.",
    "link": "https://www.nytimes.com/2025/06/22/us/politics/usaid-cuts-doge.html",
    "summary": "The rapid dismantling of the global aid agency remains one of the most consequential outcomes of President Trump’s efforts to overhaul the federal government, showing his willingness to tear down institutions in defiance of the courts."
  },
  {
    "title": "‘An Existential Threat’: Food Banks Brace for Fallout From Trump Cuts",
    "link": "https://www.nytimes.com/2025/06/22/nyregion/nyc-food-banks-cuts.html",
    "summary": "New York City food banks aren’t sure how they will survive the administration’s funding cuts, which could also affect the programs they turn to for help."
  },
  {
    "title": "Mahmoud Khalil Returns to New York After Months in Detention",
    "link": "https://www.nytimes.com/2025/06/21/nyregion/mahmoud-khalil-return-to-new-york.html",
    "summary": "The Trump administration remains committed to deporting Mr. Khalil, a Columbia graduate and leading figure in the pro-Palestinian protest movement."
  },
  {
    "title": "It’s About to Get Brutally Hot in New York City",
    "link": "https://www.nytimes.com/2025/06/22/weather/nyc-heat-wave.html",
    "summary": "Temperatures in Central Park are forecast to soar into the high 90s on Monday and Tuesday, but it will feel like it’s 105 degrees outside."
  },
  {
    "title": "Midwest Cities Bake as Heat Wave Blankets the Central U.S.",
    "link": "https://www.nytimes.com/2025/06/21/us/heat-wave-midwest-central-us.html",
    "summary": "St. Louis, Chicago and Des Moines were among the cities that saw heat indexes hit triple digits on Saturday, with the East Coast bracing for similar conditions by Monday."
  },
  {
    "title": "Vera Rubin’s Legacy Lives On in a Troubled Scientific Landscape",
    "link": "https://www.nytimes.com/2025/06/22/science/vera-rubin-women-astronomy.html",
    "summary": "A powerful new telescope will usher in a new era of cosmic discovery, but in a political climate vastly different from when it was named for a once overlooked female astronomer."
  },
  {
    "title": "‘I Feel Like I’ve Been Lied To’: When a Measles Outbreak Hits Home",
    "link": "https://www.nytimes.com/2025/06/22/us/i-feel-like-ive-been-lied-to-when-a-measles-outbreak-hits-home.html",
    "summary": "From a lone clinic in Texas to an entire school district in North Dakota, the virus is upending daily life and revealing a deeper crisis of belief."
  },
  {
    "title": "Brooklyn Laundromats Transform Into Bars, Coffee Shops and Community Hubs",
    "link": "https://www.nytimes.com/2025/06/22/realestate/laundromat-coffee-shop-bar.html",
    "summary": "Entrepreneurs in Brooklyn are opening laundromats that double as coffee shops, bars and hangout spots."
  },
  {
    "title": "Andrew Cuomo’s Complicated Legacy in New York City",
    "link": "https://www.nytimes.com/2025/06/22/nyregion/cuomo-legacy-governor-nyc.html",
    "summary": "Mr. Cuomo, the front-runner in the mayoral race and former governor, has a long — and, his critics say, mixed — record handling important issues in the city."
  },
  {
    "title": "An Actor, a Bookseller and a Chef Walk Into a Voting Booth",
    "link": "https://www.nytimes.com/2025/06/22/nyregion/celebrity-ballots-mayor-nyc.html",
    "summary": "We asked scores of well-known New Yorkers from a broad spectrum of the city to give us their ranked-choice ballots for mayor. Here’s what some told us."
  },
  {
    "title": "Bill Clinton Endorses Andrew Cuomo for NYC Mayor",
    "link": "https://www.nytimes.com/2025/06/22/nyregion/bill-clinton-endorse-cuomo-mayor.html",
    "summary": "The former president’s endorsement is the latest example of how establishment Democrats seem to prefer Mr. Cuomo to his prime rival, Zohran Mamdani."
  },
  {
    "title": "Arkansas May Not Be Ready for a ‘Healing’ Anti-Abortion Monument",
    "link": "https://www.nytimes.com/2025/06/22/us/arkansas-anti-abortion-monument.html",
    "summary": "A design for the state’s official “Monument to Unborn Children” was chosen in 2023. But it remains unbuilt as the debate over abortion grinds on."
  },
  {
    "title": "Europe Is Finally Ready to Spend More on Defense. The Hard Part Is How.",
    "link": "https://www.nytimes.com/2025/06/22/business/europe-nato-defense-spending.html",
    "summary": "After a yearslong debate over NATO spending, European nations are poised to commit more funds to deter Russia. Now the region must decide how to unify its fragmented manufacturing."
  },
  {
    "title": "Far-Right Party Tries to Expand Its Appeal in Germany’s West",
    "link": "https://www.nytimes.com/2025/06/22/world/europe/germany-afd.html",
    "summary": "To reach voters outside its Eastern heartlands, the AfD is putting a new gloss on its anti-immigrant message — while sticking with its agenda."
  },
  {
    "title": "Aide Who Was Sean ‘Diddy’ Combs’s ‘Right Hand’ Draws Scrutiny at His Trial",
    "link": "https://www.nytimes.com/2025/06/22/arts/music/sean-diddy-combs-kristina-khorram-kk.html",
    "summary": "Kristina Khorram, the mogul’s former chief of staff, was not charged in his indictment, but the government has identified her and other staff as co-conspirators."
  },
  {
    "title": "The Three Unknowns After the U.S. Strike on Iran",
    "link": "https://www.nytimes.com/2025/06/22/opinion/us-military-iran-strike-trump.html",
    "summary": "Despite Trump’s claim of success, he has created uncertainty and risk."
  },
  {
    "title": "Roll Back Legal Same-Sex Marriage? Republicans Are Getting It Wrong.",
    "link": "https://www.nytimes.com/2025/06/22/opinion/gay-marriage-republicans-obergefell-hodges.html",
    "summary": "The cultural winds have shifted on many issues, but Republican voters are not clamoring to unravel same-sex marriage rights."
  },
  {
    "title": "America Strikes Iran",
    "link": "https://www.nytimes.com/2025/06/22/briefing/america-trump-iran-strike.html",
    "summary": "We explain what we know about the attacks."
  },
  {
    "title": "Oil Companies Fight Climate Lawsuits by Citing Free Speech",
    "link": "https://www.nytimes.com/2025/06/22/climate/oil-industry-anti-slapp-climate-lawsuits.html",
    "summary": "The firms say their First Amendment rights are being violated when cities and states sue and accuse them of spreading misinformation about climate change."
  },
  {
    "title": "Walmart Tries to Shed a Stodgy Vibe to Battle Digital-Native Rivals",
    "link": "https://www.nytimes.com/2025/06/21/business/walmart-rebrand-headquarters.html",
    "summary": "The retailing giant is spending billions to attract workers to a new headquarters and woo shoppers with drone delivery and a broader range of items (like Louis Vuitton handbags)."
  },
  {
    "title": "4 Missing After Medical Helicopter Crashes in Quebec Lake",
    "link": "https://www.nytimes.com/2025/06/21/world/canada/medical-helicopter-crash-canada.html",
    "summary": "The helicopter was carrying four crew members and a patient when it crashed on Friday night, officials said."
  }
]