[
  {
    "title": "Trump’s Claims About Nigeria Strike Belie a Complex Situation on the Ground",
    "link": "https://www.nytimes.com/2025/12/26/world/africa/trump-isis-strikes-nigeria-christians-facts.html",
    "summary": "President Trump said the targets of airstrikes in Nigeria were Islamic State terrorists responsible for killing Christians, but experts question his framing."
  },
  {
    "title": "What to Know About U.S. Military Action in Nigeria",
    "link": "https://www.nytimes.com/2025/11/03/world/africa/trump-nigeria-military-christians.html",
    "summary": "Before the strikes on Thursday, President Trump said he would halt all aid and go in “guns-a-blazing” to target affiliates of a resurgent Islamic State."
  },
  {
    "title": "Here’s What Is in the 20-Point Peace Plan for Ukraine",
    "link": "https://www.nytimes.com/2025/12/24/world/europe/what-is-in-the-20-point-ukraine-peace-plan.html",
    "summary": "The blueprint covers a broad range of issues, including territory, security guarantees and postwar reconstruction. But Russia has indicated little willingness to end the war."
  },
  {
    "title": "As A.I. Companies Borrow Billions, Debt Investors Grow Wary",
    "link": "https://www.nytimes.com/2025/12/26/business/ai-debt-investors.html",
    "summary": "Artificial intelligence companies looking to raise funds are being made to pay lofty interest rates, as debt investors become cautious."
  },
  {
    "title": "Data Center Surge Reaches India as American Tech Giants Invest Billions",
    "link": "https://www.nytimes.com/2025/12/26/business/india-data-centers-google-amazon-microsoft.html",
    "summary": "Megacities in southern India are attracting enormous investments to help build artificial intelligence infrastructure to serve the world’s most data-hungry country."
  },
  {
    "title": "Why Sears’s Last Great Hope Was a Promise That Never Materialized",
    "link": "https://www.nytimes.com/2025/12/26/business/sears-seritage-edward-lampert.html",
    "summary": "Only five Sears stores remain in the country, with the end likely near for what was once the mightiest American retailer."
  },
  {
    "title": "What It’s Like When Your Wife Goes on Testosterone",
    "link": "https://www.nytimes.com/2025/12/26/magazine/what-its-like-when-your-wife-goes-on-testosterone.html",
    "summary": "She went on testosterone to help with her menopausal symptoms. The effects had unexpected consequences for their marriage."
  },
  {
    "title": "Testosterone Is Giving Women Back Their Sex Drive — With Side Effects",
    "link": "https://www.nytimes.com/2025/10/22/magazine/testosterone-women-health-sex-libido-menopause.html",
    "summary": "There is no F.D.A.-approved testosterone product for women. Insurance won’t cover it. Many doctors won’t prescribe it. It’s become a cultural phenomenon."
  },
  {
    "title": "One Gazan Girl’s Fight to Survive Extreme Hunger",
    "link": "https://www.nytimes.com/2025/12/26/world/middleeast/hoda-gaza-malnutrition-israel.html",
    "summary": "After Israel sealed Gaza’s borders, Hoda Abu al-Naja, 12, who suffered from celiac disease, spent months seeking the food and care she needed to combat malnutrition."
  },
  {
    "title": "2 Killed in Vehicle Ramming and Stabbing in Israel, Officials Say",
    "link": "https://www.nytimes.com/2025/12/26/world/middleeast/israel-car-ramming.html",
    "summary": "The attack comes amid heightened tensions between Israelis and Palestinians in the Israeli-occupied West Bank."
  },
  {
    "title": "8 Killed in Syria Mosque Blast, Government Says",
    "link": "https://www.nytimes.com/2025/12/26/world/middleeast/syria-homs-mosque-explosion.html",
    "summary": "Ansar al-Sunna, which experts say appears to be an ISIS splinter group, claimed responsibility for the explosion, which happened as worshipers were attending Friday Prayer."
  },
  {
    "title": "Northern California Conservatives Are Frustrated They Could Get a Democratic Representative",
    "link": "https://www.nytimes.com/2025/12/26/us/politics/california-redistricting-lamalfa-republicans.html",
    "summary": "The passage of Proposition 50, which redrew California’s congressional map, means that all of the state’s conservative north is likely to be represented by Democrats."
  },
  {
    "title": "A College Freshman Is the Unlikely Source of Alabama’s New Political Maps",
    "link": "https://www.nytimes.com/2025/12/26/us/alabama-redistricting-maps-college-student.html",
    "summary": "Daniel DiDonato, 19, has loved elections since he was in fourth grade. He also loves maps."
  },
  {
    "title": "When the Democratic Door-Knocker Has Something Unscripted to Say",
    "link": "https://www.nytimes.com/2025/12/26/us/politics/democrats-canvassing-door-knocking.html",
    "summary": "Zohran Mamdani’s campaign encouraged canvassers to ditch their scripts in pursuit of genuine, off-the-cuff-conversation. It’s a strategy that some Democratic strategists want to see more of."
  },
  {
    "title": "New York City Braces for Heavy Snow as Winter Storm Approaches",
    "link": "https://www.nytimes.com/2025/12/25/nyregion/snow-storm-nyc-weather-forecast.html",
    "summary": "The region could see accumulations of up to 5 to 7 inches from late Friday into Saturday."
  },
  {
    "title": "More Rain Heading for Southern California, Heightening Flood Risk",
    "link": "https://www.nytimes.com/2025/12/26/weather/rain-flooding-southern-california-storm.html",
    "summary": "More rain was forecast for the Los Angeles Area on Friday, adding to wet weather that prompted emergency declarations across the state."
  },
  {
    "title": "With Help of Lina Khan, Mamdani Looks to Quickly Cut Costs for New Yorkers",
    "link": "https://www.nytimes.com/2025/12/26/nyregion/lina-khan-mamdani-affordability-new-york-city.html",
    "summary": "Mayor-elect Zohran Mamdani’s signature plans for New York City will take time. Lina Khan, the former chair of the Federal Trade Commission, has ideas for making a swift impact."
  },
  {
    "title": "What Can Hundreds of Pieces of Litter Tell Us About Manhattan?",
    "link": "https://www.nytimes.com/2025/12/26/nyregion/nyc-litter.html",
    "summary": "Shoes. A phone. Receipts. A comb. Traces of wild nights and hurried days are all around us."
  },
  {
    "title": "Feral Dogs on the Roof of the World",
    "link": "https://www.nytimes.com/2025/12/26/science/feral-dogs-wildlife-ladakh.html",
    "summary": "As many as 25,000 free-ranging dogs roam the cold, high-altitude desert of Ladakh, India. That’s a problem for wildlife and people alike."
  },
  {
    "title": "Trump Is Getting Weaker, and the Resistance Is Getting Stronger",
    "link": "https://www.nytimes.com/2025/12/26/opinion/trump-weaker-resistance-stronger.html",
    "summary": "It’s become easier to imagine the moment when Trump’s mystique finally evaporates."
  },
  {
    "title": "Sick of Trump News? I’m Here for You.",
    "link": "https://www.nytimes.com/2025/12/26/opinion/good-essays-news-sidneys.html",
    "summary": "Here are the best nonfiction essays of the year, according to me."
  },
  {
    "title": "Flu Cases Climb to Highest Levels in New York City in a Decade",
    "link": "https://www.nytimes.com/2025/12/26/nyregion/nyc-flu-cases.html",
    "summary": "The number of patients going to hospital emergency rooms with flulike symptoms has soared."
  },
  {
    "title": "CVS Worker Fatally Stabbed on Christmas Day on Long Island",
    "link": "https://www.nytimes.com/2025/12/26/nyregion/stabbing-cvs-christmas-lindenhurst.html",
    "summary": "A 23-year-old CVS employee was killed on Thursday in Lindenhurst, the authorities said. Police were searching for a suspect in his 40s who fled on foot."
  },
  {
    "title": "Death Toll in UPS Plane Crash Rises to 15",
    "link": "https://www.nytimes.com/2025/12/25/us/ups-plane-crash-louisville-kentucky.html",
    "summary": "Alain Rodriguez Colina, who was injured when a cargo plane crashed into his Kentucky workplace more than a month ago, died on Christmas Day."
  },
  {
    "title": "From the Shadows to Power: How the Hindu Right Reshaped India",
    "link": "https://www.nytimes.com/2025/12/26/world/asia/india-hindu-right-rss-modi.html",
    "summary": "The far-right group known as the R.S.S., whose members include Prime Minister Narendra Modi, has spent a century trying to make India a Hindu-first nation."
  }
]