[
  {
    "title": "6 Takeaways From Trump’s Address to the Nation",
    "link": "https://www.nytimes.com/2025/12/18/us/politics/6-takeaways-from-trumps-address-to-the-nation.html",
    "summary": "President Trump disparaged Democrats and insisted the economy is booming despite concerns about the cost of living."
  },
  {
    "title": "Fact-Checking Trump’s Prime-Time Address on the Economy",
    "link": "https://www.nytimes.com/2025/12/17/us/politics/fact-checking-trumps-economy-address.html",
    "summary": "The president cited misleading statistics to insist, wrongly, that prices were coming down."
  },
  {
    "title": "Full Transcript of President Trump’s Speech on the Economy",
    "link": "https://www.nytimes.com/2025/12/17/us/politics/trump-speech-transcript-economy.html",
    "summary": "The president sharply attacked his predecessor while insisting that his own record contained nothing but victories."
  },
  {
    "title": "Dan Bongino to Step Down as FBI Deputy Director",
    "link": "https://www.nytimes.com/2025/12/17/us/politics/dan-bongino-steps-down-fbi.html",
    "summary": "The departure of Mr. Bongino had seemed inevitable since August, when the White House hired Missouri’s attorney general, Andrew Bailey, to share his job as deputy director."
  },
  {
    "title": "Trump Administration Aims to Strip More Foreign-Born Americans of Citizenship",
    "link": "https://www.nytimes.com/2025/12/17/us/politics/trump-immigration-citizenship-denaturalization.html",
    "summary": "An official with U.S. Citizenship and Immigration Services said it would prioritize “those who’ve unlawfully obtained U.S. citizenship.”"
  },
  {
    "title": "Trump Unveils Presidential ‘Walk of Fame’ With Jabs at Biden and Obama",
    "link": "https://www.nytimes.com/2025/12/17/us/politics/trump-presidential-walk-of-fame-white-house.html",
    "summary": "The White House unveiled plaques near the Oval Office that describe U.S. presidents with varying levels of accuracy, depending on President Trump’s opinion of them."
  },
  {
    "title": "Venezuelan Navy Escorts Vessels in Defiance of Trump’s Blockade Threat",
    "link": "https://www.nytimes.com/2025/12/17/us/politics/venezuela-blockade-military-escort-trump.html",
    "summary": "Pentagon officials, surprised by President Trump’s orders, scrambled to work out a plan to halt sanctioned tankers as Nicolás Maduro, Venezuela’s leader, vowed resistance."
  },
  {
    "title": "For Hegseth, There Is One Boat Strike He Doesn’t Want the Public to See",
    "link": "https://www.nytimes.com/2025/12/17/us/politics/hegseth-boat-strike-video.html",
    "summary": "The Pentagon has released plenty of video clips that show American missiles blowing boats suspected of carrying drugs out of the water. But the “double tap” strike on Sept. 2 is being kept under wraps."
  },
  {
    "title": "U.S. Military Announces 4 Killed in 26th Boat Strike",
    "link": "https://www.nytimes.com/2025/12/17/us/politics/military-4-dead-boat-strike-pacific-ocean.html",
    "summary": "The attack on Wednesday brings the total number killed to at least 99 since the Trump administration began bombing boats suspected of ferrying drugs in the Caribbean Sea and the Pacific Ocean."
  },
  {
    "title": "Trump’s Claim That Venezuela ‘Stole’ U.S. Oil Fields Sets Off a Nationalist Reaction",
    "link": "https://www.nytimes.com/2025/12/17/world/americas/trump-venezuela-oil-fields-stolen-claims.html",
    "summary": "President Trump said the United States wanted to reclaim expropriated oil assets, setting off a nationalist reaction in a country where the resource holds a mythical status."
  },
  {
    "title": "Shock and Sadness Hang Over the Reiners’ Neighborhood",
    "link": "https://www.nytimes.com/2025/12/17/us/reiner-brentwood-mourning-scene.html",
    "summary": "Neighbors said a pall had fallen over the wealthy Los Angeles area where Rob Reiner and his wife, Michele, were found stabbed to death."
  },
  {
    "title": "Reiner’s Son Appears, Briefly, Before a Judge",
    "link": "https://www.nytimes.com/2025/12/17/us/nick-reiner-court-murder-charges.html",
    "summary": "Nick Reiner, facing murder charges in the deaths of his parents, Rob and Michele Reiner, appeared at an arraignment that lasted just minutes before it was rescheduled for January. He has not entered a plea."
  },
  {
    "title": "Birthrates Are Falling, but Don’t Blame Dogs in Strollers",
    "link": "https://www.nytimes.com/2025/12/18/world/birthrates-falling-dont-blame-dogs.html",
    "summary": "New research suggests that having a pet can actually make people more likely to become parents."
  },
  {
    "title": "Trump Officials Announce More Than $11 Billion in Arms Sales for Taiwan",
    "link": "https://www.nytimes.com/2025/12/18/us/politics/trump-taiwan-weapons-sale.html",
    "summary": "The move may reassure China hawks who are uncertain about the president’s commitment to the self-governing democracy."
  },
  {
    "title": "China Is Feeling Strong and Senses an American Retreat",
    "link": "https://www.nytimes.com/2025/12/18/business/trump-xi-us-china.html",
    "summary": "Beijing is using its messaging tools to show off its prowess at building infrastructure and project power, taking advantage of what it says is “deep anxiety” in U.S. policies."
  },
  {
    "title": "E.U. Leaders Debate Plan for Ukraine Financed by Frozen Russian Assets",
    "link": "https://www.nytimes.com/2025/12/18/world/europe/russia-eu-ukraine-frozen-assets.html",
    "summary": "The European Council convenes on Thursday, and at stake is a contentious deal to back Ukraine and its war effort in 2026 and 2027."
  },
  {
    "title": "Peter Arnett, Pulitzer-Winning War Correspondent, Dies at 91",
    "link": "https://www.nytimes.com/2025/12/17/world/peter-arnett-dead.html",
    "summary": "He won the prestigious award for his daring coverage of the Vietnam War for The Associated Press, and went on to cover conflicts for CNN for nearly two decades."
  },
  {
    "title": "Search for Suspect in Brown University Shooting Stretches to 4th Day",
    "link": "https://www.nytimes.com/2025/12/17/us/brown-shooter-suspect-providence.html",
    "summary": "Officials said that they were working with physical evidence, including DNA, and that they were seeking a second man who appeared to have crossed paths with the possible suspect."
  },
  {
    "title": "Australia to Crack Down on Hate Speech After Bondi Attack",
    "link": "https://www.nytimes.com/2025/12/17/us/australia-hate-speech-legislation.html",
    "summary": "New legislation will be drafted to target those who promote violence and to increase penalties for hate speech, the prime minister said Thursday."
  },
  {
    "title": "Bondi Beach Shooting Is a Reminder of ISIS’s Power to Inspire Attacks",
    "link": "https://www.nytimes.com/2025/12/17/world/europe/islamic-state-attacks-australia.html",
    "summary": "ISIS is too weakened to seize territory, experts said, but its ability to churn out propaganda aimed at provoking violence against the West persists."
  },
  {
    "title": "At Tokyo Zoo, Visitors Worry Pandas Could Be China’s Next Target",
    "link": "https://www.nytimes.com/2025/12/18/world/asia/japan-china-pandas.html",
    "summary": "Pandas have stood for friendship between China and Japan since 1972. But the last two are about to go, and a dispute over Taiwan could get in the way of sending more."
  },
  {
    "title": "Let’s Go Beyond Trump’s Vile Words About Rob Reiner",
    "link": "https://www.nytimes.com/2025/12/17/opinion/trump-rob-reiner.html",
    "summary": "We must do far more to address the national crisis of addiction that leaves so many households in despair as well as danger."
  },
  {
    "title": "The Man Who Rules the Country Presides Over Nothing",
    "link": "https://www.nytimes.com/2025/12/17/opinion/trump-presidential-power-miller-vought.html",
    "summary": "Why are the Supreme Court and Congress conspiring to give him more power?"
  },
  {
    "title": "U.S. Government Admits Liability in Deadly D.C.-Area Air Collision",
    "link": "https://www.nytimes.com/2025/12/17/us/politics/dc-plane-crash-government-liability.html",
    "summary": "A federal court filing says the Army crew piloting a Black Hawk helicopter could have avoided the nighttime accident in January if it had been able to see and avoid a commercial jet."
  },
  {
    "title": "Twelve Men Saturated East Harlem Housing Project With Drugs, U.S. Says",
    "link": "https://www.nytimes.com/2025/12/17/nyregion/sdny-harlem-drug-charges.html",
    "summary": "For more than three and a half years, officials said, the men used the Johnson Houses as “an open drug market” to sell crack cocaine and fentanyl."
  },
  {
    "title": "Christine Choy, Documentarian of Asian American Life, Dies at 76",
    "link": "https://www.nytimes.com/2025/12/17/movies/christine-choy-dead.html",
    "summary": "Her film “Who Killed Vincent Chin?” earned an Oscar nomination in 1988 and was inducted into the National Film Registry for its cultural significance."
  },
  {
    "title": "Ghislaine Maxwell Asks a Judge to Throw Out Her Sex-Abuse Conviction",
    "link": "https://www.nytimes.com/2025/12/17/nyregion/ghislaine-maxwell-prison-jeffrey-epstein.html",
    "summary": "Ms. Maxwell, who conspired with Jeffrey Epstein in a sex-trafficking scheme, argued that she had been denied a fair trial."
  }
]