[
  {
    "title": "Trump Claims the Power to Summarily Kill Suspected Drug Smugglers",
    "link": "https://www.nytimes.com/2025/09/04/us/politics/trump-drug-smugglers-military.html",
    "summary": "The move to treat criminals as if they were wartime combatants escalated an administration pattern of using military force for law enforcement tasks at home and abroad."
  },
  {
    "title": "After Boat Strike, Rubio Says U.S. Will Help Other Nations ‘Blow Up’ Crime Groups",
    "link": "https://www.nytimes.com/2025/09/04/world/americas/rubio-ecuador-crime-groups-boat-strike.html",
    "summary": "The Trump administration aims to carry out more violent strikes against drug cartels, Secretary of State Marco Rubio said as he met with Ecuador’s president."
  },
  {
    "title": "Venezuelan Jets Fly Over U.S. Navy Ship in Show of Force",
    "link": "https://www.nytimes.com/2025/09/04/us/politics/venezuela-jets-us-navy-ship-trump.html",
    "summary": "The flyover took place two days after the United States carried out a military strike on a boat in the Caribbean that U.S. officials said was carrying drugs."
  },
  {
    "title": "Trump to Sign Order Renaming the Defense Department as the Department of War",
    "link": "https://www.nytimes.com/2025/09/04/us/politics/trump-department-of-war-defense.html",
    "summary": "The president is turning back the clock to the name the agency held until shortly after World War II."
  },
  {
    "title": "Justice Dept. Opens Criminal Inquiry Into Lisa Cook, Elevating Trump’s Claims",
    "link": "https://www.nytimes.com/2025/09/04/us/politics/lisa-cook-trump-fed-governor-justice-dept.html",
    "summary": "The move was instigated by Ed Martin, a Trump loyalist who has said it is legitimate for officials to publicly air criminal investigations into people targeted by the president."
  },
  {
    "title": "Melania Trump Has a Warning for Humanity: ‘The Robots Are Here’",
    "link": "https://www.nytimes.com/2025/09/04/us/politics/melania-trump-robots-humanity.html",
    "summary": "The first lady has shown herself to be captivated by the wonders and dangers and opportunities of modern technologies."
  },
  {
    "title": "RFK Jr. Faces Senate Grilling After Vaccine Changes and C.D.C. Shake-Up",
    "link": "https://www.nytimes.com/2025/09/04/us/politics/kennedy-senate-hearing-vaccines-cdc.html",
    "summary": "A three-hour hearing before the Senate Finance Committee revealed that the health secretary was on uncertain ground even with some Republicans who voted to confirm him."
  },
  {
    "title": "5 Takeaways From RFK Jr.’s Senate Hearing",
    "link": "https://www.nytimes.com/2025/09/04/health/rfk-jr-senate-hearing-takeaways.html",
    "summary": "During often tense exchanges, Health Secretary Robert F. Kennedy Jr. defended his positions on Covid vaccines, the Centers for Disease Control and Prevention and autism."
  },
  {
    "title": "Hochul to Sign Order to Get Around U.S. Limits on Covid Vaccine",
    "link": "https://www.nytimes.com/2025/09/04/nyregion/covid-vaccine-hochul-new-york.html",
    "summary": "Gov. Kathy Hochul of New York plans to authorize pharmacists to provide the vaccine to almost anyone who wants it without a prescription."
  },
  {
    "title": "Health Dept. Plans Vaccine Poll Run by Trump Ally’s Firm",
    "link": "https://www.nytimes.com/2025/09/04/us/politics/hhs-vaccines-poll-harrisx-trump-rfk.html",
    "summary": "The no-bid contract was published amid Secretary Robert F. Kennedy Jr.’s effort to move the nation’s health infrastructure away from some vaccines."
  },
  {
    "title": "Adams Considers Dropping Out of Race After Secret Meeting in Florida",
    "link": "https://www.nytimes.com/2025/09/04/nyregion/adams-trump-job-quits.html",
    "summary": "Mayor Eric Adams of New York City has told confidants that he would consider abandoning his re-election bid. President Trump said he favored a “one on one” mayoral race."
  },
  {
    "title": "N.Y.C. Elections Board May Block Ballot Proposals on Housing",
    "link": "https://www.nytimes.com/2025/09/04/nyregion/charter-revision-nyc-housing.html",
    "summary": "The City Council opposes the measures, which would curtail its power. The Board of Elections, appointed by the Council, could prevent voters from weighing in."
  },
  {
    "title": "Meet the Artist Behind Naomi Osaka’s Custom Labubus at the U.S. Open",
    "link": "https://www.nytimes.com/2025/09/04/style/naomi-osaka-labubu-us-open.html",
    "summary": "Every match of a thrilling U.S. Open run has featured a custom crystal-clad creation. Kerin Rose Gold took us behind the scenes."
  },
  {
    "title": "With Trump and Ukraine, Europe’s Leaders Are Playing a Long Game",
    "link": "https://www.nytimes.com/2025/09/05/world/europe/europe-ukraine-trump-war-putin.html",
    "summary": "Leaders on the continent are trying to show the U.S. president that they are serious about laying the groundwork to end the war — and that President Vladimir V. Putin of Russia is not."
  },
  {
    "title": "Trump Administration to End Security Programs Protecting European Allies From Russia",
    "link": "https://www.nytimes.com/2025/09/04/us/politics/trump-europe-russia-security.html",
    "summary": "Ending the longstanding program is expected to impact hundreds of millions of dollars that have gone toward countries that border Russia."
  },
  {
    "title": "Members of Congress Grasp for a Stopgap Deal to Avert a Shutdown",
    "link": "https://www.nytimes.com/2025/09/04/us/politics/congress-stopgap-deal-shutdown.html",
    "summary": "Republicans and Democrats agree they will need a temporary measure to fund the government past Sept. 30, but have yet to come to terms on what it should look like."
  },
  {
    "title": "U.S. Agents Raid Upstate N.Y. Plant and Detain Dozens of Migrants",
    "link": "https://www.nytimes.com/2025/09/04/nyregion/immigration-raid-new-york.html",
    "summary": "Local law enforcement officers helped federal agents carry out an immigration raid near Syracuse. Witnesses said the agents used police dogs in the raid and wielded crowbars to gain entry."
  },
  {
    "title": "Appeals Court Says ‘Alligator Alcatraz’ Detention Center Can Stay Open",
    "link": "https://www.nytimes.com/2025/09/04/us/alligator-alcatraz-florida-appeals.html",
    "summary": "An appeals panel paused a federal judge’s ruling that no additional detainees could be sent to the center, and that much of it had to be dismantled within 60 days."
  },
  {
    "title": "Trump Officials Ask Military Lawyers to Serve as Immigration Judges",
    "link": "https://www.nytimes.com/2025/09/04/us/politics/military-lawyers-immigration-judges.html",
    "summary": "Emails sent out call for volunteers to take six-month assignments hearing asylum and deportation cases."
  },
  {
    "title": "Giorgio Armani, Italian Fashion Designer, Dies at 91",
    "link": "https://www.nytimes.com/2025/09/04/fashion/giorgio-armani-dead.html",
    "summary": "He created a male uniform whose feminized form won favor with women. An alliance with movie stars made his name all but synonymous with red-carpet dressing."
  },
  {
    "title": "Harvard Won Its Money Back, but Will It Actually Get It?",
    "link": "https://www.nytimes.com/2025/09/04/us/harvard-federal-funds-court-victory-trump-administration.html",
    "summary": "A judge ruled that the Trump administration broke the law in canceling billions in federal funds for Harvard. Whether the money is returned matters for the rest of higher education."
  },
  {
    "title": "At Harvard, Judge’s Ruling on Funding Gives Students One More Thing to Ponder",
    "link": "https://www.nytimes.com/2025/09/04/us/harvard-funding-decision-reaction-students.html",
    "summary": "Many students were cautiously hopeful after a judge said the Trump administration could not freeze research funding to the university. But they also had other things on their minds."
  },
  {
    "title": "College Board Cancels Tool for Finding Low-Income High Achievers",
    "link": "https://www.nytimes.com/2025/09/04/us/college-board-diversity-landscape.html",
    "summary": "After the Trump administration criticized the use of what it called “racial proxies,” the group behind the SAT shut down a way for universities to identify promising applicants from disadvantaged communities."
  },
  {
    "title": "Biden Has Surgery to Remove Skin Cancer Lesions",
    "link": "https://www.nytimes.com/2025/09/04/us/politics/biden-skin-cancer.html",
    "summary": "Three months earlier, former President Joseph R. Biden Jr. had a diagnosis of an aggressive form of prostate cancer."
  },
  {
    "title": "Justice Amy Coney Barrett Argues Her Own Case, and the Court’s, in New Book",
    "link": "https://www.nytimes.com/2025/09/04/us/politics/justice-barrett-explaining-law.html",
    "summary": "In a new book, Justice Amy Coney Barrett asks for faith in the Supreme Court but reveals very little."
  },
  {
    "title": "Kavanaugh Acknowledges ‘Difficult Job’ of His Lower-Court Colleagues",
    "link": "https://www.nytimes.com/2025/09/04/us/politics/kavanaugh-lower-court-judges.html",
    "summary": "Speaking at a judicial conference in Memphis, the justice expressed sympathy for the district-court judges whose rulings the Supreme Court has repeatedly paused."
  },
  {
    "title": "Why I Am Not a Liberal",
    "link": "https://www.nytimes.com/2025/09/05/opinion/liberal-conservative-left-right-politics.html",
    "summary": "I don’t think the left grasps reality in all its fullness."
  },
  {
    "title": "China, Russia, Iran and North Korea Sense Their Moment",
    "link": "https://www.nytimes.com/2025/09/05/opinion/china-russia-north-korea-axis.html",
    "summary": "There may never be a better moment for China, Iran, North Korea and Russia to challenge the U.S.-led global system."
  },
  {
    "title": "Kim Jong-un Leaves Beijing With Big Diplomatic Wins",
    "link": "https://www.nytimes.com/2025/09/05/world/asia/north-korea-china-nuclear.html",
    "summary": "Mr. Kim’s presence at a Chinese military parade was a sign of his growing geopolitical ​leverage and that North Korea was being accepted as a de facto nuclear power."
  },
  {
    "title": "A Right-Wing Wave in Britain Produces a Teenage Civic Leader",
    "link": "https://www.nytimes.com/2025/09/05/world/europe/a-right-wing-wave-in-britain-produces-a-teenage-civic-leader.html",
    "summary": "As Reform U.K. meets for its annual conference, the experience of its youngest municipal leader, George Finch, shows a party trying to combine caution and provocation."
  },
  {
    "title": "Pennsylvania Couple Kept 5 Children in ‘Deplorable’ Conditions, Police Say",
    "link": "https://www.nytimes.com/2025/09/04/us/pennsylvania-parents-children-dungeon-arrest.html",
    "summary": "The children, between the ages of 5 and 14, were locked in a room that the authorities said “functioned as a dungeon,” with no beds and boarded-up windows."
  }
]