[
  {
    "title": "2 Deadly Shootings in 2 Days Highlight Israel’s Failure to Address Gaza’s Power Vacuum",
    "link": "https://www.nytimes.com/2025/07/21/world/middleeast/shootings-aid-gaza-analysis.html",
    "summary": "Over the weekend, Israeli soldiers shot Palestinians near an Israeli-backed aid site and a U.N. convoy. Both episodes pointed to Israel’s refusal to allow new governance structures to emerge."
  },
  {
    "title": "Israel Refuses to Renew Visa of Top UN Humanitarian Official for Gaza",
    "link": "https://www.nytimes.com/2025/07/21/world/middleeast/israel-visa-un-gaza.html",
    "summary": "The head of the agency that helps oversee international aid deliveries to the territory had criticized the impact of Israeli policy on civilians."
  },
  {
    "title": "Syrian Government Evacuates Bedouin Families After Deadly Clashes",
    "link": "https://www.nytimes.com/2025/07/21/world/middleeast/syria-clashes-druse-bedouin-evacuations.html",
    "summary": "The violence in Sweida Province between groups from Bedouin tribes and the Druse minority renewed fears of sectarian conflict and drew Israeli attacks before a cease-fire was announced Saturday."
  },
  {
    "title": "How Trump Deflected MAGA’s Wrath Over Epstein, at Least for Now",
    "link": "https://www.nytimes.com/2025/07/21/us/politics/trump-epstein-maga-base.html",
    "summary": "By tapping into other grievances, President Trump managed to turn one of the most fractious moments for his base into a unifying one."
  },
  {
    "title": "An Accuser’s Story Suggests How Trump Might Appear in the Epstein Files",
    "link": "https://www.nytimes.com/2025/07/20/us/politics/epstein-employee-trump-investigation.html",
    "summary": "A former Jeffrey Epstein employee said that she told the F.B.I. in 1996 and 2006 about what she considered a troubling encounter with Donald J. Trump."
  },
  {
    "title": "Conviction of Man in Killing of Etan Patz Is Overturned",
    "link": "https://www.nytimes.com/2025/07/21/nyregion/etan-patz-conviction-overturned.html",
    "summary": "Pedro Hernandez, a former bodega stock clerk, had confessed years after the 1979 crime to luring Etan Patz, 6, into a basement in SoHo. The case shook New York City."
  },
  {
    "title": "Pedro Hernandez Found Guilty of Kidnapping and Killing Etan Patz in 1979",
    "link": "https://www.nytimes.com/2017/02/14/nyregion/etan-patz-pedro-hernandez-guilty.html",
    "summary": "The verdict is a long-awaited step in solving the mystery that bedeviled investigators and forever changed the way parents watched over their children."
  },
  {
    "title": "Judge Challenges Trump Administration in Hearing on Harvard Funding",
    "link": "https://www.nytimes.com/2025/07/21/us/trump-administration-harvard-hearing.html",
    "summary": "In a courtroom in Boston on Monday, a lawyer for Harvard called the Trump administration’s case against the school “cooked up.”"
  },
  {
    "title": "Disabled Americans Fear What Medicaid Cuts Could Do to Them",
    "link": "https://www.nytimes.com/2025/07/21/well/medicaid-bill-disabled-americans.html",
    "summary": "The White House says roughly $1 trillion in Medicaid cuts won’t limit home- and community-based care. Health care experts disagree."
  },
  {
    "title": "An Attack on the Medical Establishment Buried in an 1,800-Page Regulation",
    "link": "https://www.nytimes.com/2025/07/21/upshot/primary-care-doctors-salaries.html",
    "summary": "If approved, a new rule could end the entrenched pay advantages for specialists like surgeons over other doctors."
  },
  {
    "title": "The Trouble With Wanting Men",
    "link": "https://www.nytimes.com/2025/07/21/magazine/men-heterofatalism-dating-relationships.html",
    "summary": "Women are so fed up with dating men that the phenomenon even has a name: heterofatalism. So what do we do with our desire?"
  },
  {
    "title": "A Mill Town Lost Its Mill. What Is It Now?",
    "link": "https://www.nytimes.com/2025/07/21/us/mill-town-canton-north-carolina.html",
    "summary": "Locals in Canton, N.C., are trying to figure out what’s next after losing the thing that gave them an identity: their beloved, stinky paper mill."
  },
  {
    "title": "In Japan, Anti-Establishment Parties Resonate With Young Voters",
    "link": "https://www.nytimes.com/2025/07/21/world/asia/japan-election-analysis.html",
    "summary": "The success of new political parties focused on wages, immigration and an unresponsive political elite highlights the frustrations of many working-age people in Japan."
  },
  {
    "title": "How Did the Number of Missing After Texas Floods Drop So Drastically?",
    "link": "https://www.nytimes.com/2025/07/20/us/texas-floods-missing.html",
    "summary": "Last week, officials said 97 people were missing in Kerr County. Now, it’s down to three. The drop is substantial, but such wild fluctuations can happen after disasters."
  },
  {
    "title": "Russia Launches Heavy Strikes Despite Trump Arms Pledge to Ukraine",
    "link": "https://www.nytimes.com/2025/07/21/world/europe/russia-ukraine-missile-drone-strikes.html",
    "summary": "The barrage of exploding drones and missiles appeared to be the most intense attack since President Trump announced a plan to get more weapons for Kyiv."
  },
  {
    "title": "Ukraine Ups Its Arms Production, Asking Allies to Pay for It",
    "link": "https://www.nytimes.com/2025/07/21/world/europe/ukraine-weapons-industry.html",
    "summary": "There is a growing drive to make the country more self-reliant in weapons manufacturing as it faces Russia’s superior firepower. That requires a lot of money from Western backers."
  },
  {
    "title": "Bangladesh Air Force Jet Crashes Into School, Killing at Least 20",
    "link": "https://www.nytimes.com/2025/07/21/world/asia/bangladesh-military-plane-crash.html",
    "summary": "More than 170 people were injured after the training aircraft crashed, military officials said. The country’s interim leader called the loss “irreparable.”"
  },
  {
    "title": "Opinion: The Path to Peace in the Middle East (and a Nobel Prize for Trump)",
    "link": "https://www.nytimes.com/2025/07/21/opinion/iran-israel-trump-peace.html",
    "summary": "A possible path to peace in the Middle East."
  },
  {
    "title": "Regret, Thy Name Is Hawley. And Murkowski. And Musk.",
    "link": "https://www.nytimes.com/2025/07/21/opinion/trump-hawley-murkowski-musk-regret.html",
    "summary": "The price of pleasing Trump grows steeper."
  },
  {
    "title": "A.I. vs. A.I.",
    "link": "https://www.nytimes.com/2025/07/21/briefing/ai-vs-ai.html",
    "summary": "We examine how the technology is being used against itself."
  },
  {
    "title": "Did Jeju Air Pilots Shut Down Wrong Engine Before Deadly Crash?",
    "link": "https://www.nytimes.com/2025/07/21/world/asia/jeju-air-crash-engine-report.html",
    "summary": "Investigators found the Jeju Air flight crash-landed with only its badly damaged right engine on, but experts warned against drawing early conclusions."
  },
  {
    "title": "Minnesota Lawmaker Convicted of Burglary Plans to Resign, Ending Democratic Majority",
    "link": "https://www.nytimes.com/2025/07/21/us/nicole-mitchell-minnesota-senate-democrats.html",
    "summary": "The resignation of State Senator Nicole Mitchell will leave the State Senate with even numbers of Democrats and Republicans. A special election will break the tie."
  },
  {
    "title": "SkyWest Flight Aborts Landing to Avoid Midair Collision Near Military Base",
    "link": "https://www.nytimes.com/2025/07/21/us/skywest-flight-collision-b52-north-dakota.html",
    "summary": "After the passenger jet landed safely in North Dakota, the pilot told passengers that he had made an “aggressive maneuver” to avoid hitting a military aircraft."
  },
  {
    "title": "Chinese Car Giants Rush Into Brazil With Dreams of Dominating a Continent",
    "link": "https://www.nytimes.com/2025/07/21/climate/china-brazil-electric-vehicles.html",
    "summary": "As the likes of Ford and Mercedes retreat, Great Wall Motor and BYD are building factories and bringing affordable EVs and hybrids to one of the world’s biggest markets."
  }
]