[
  {
    "title": "Democrats Scale Back Shutdown Demands, but G.O.P. Digs In",
    "link": "https://www.nytimes.com/2025/11/07/us/politics/shutdown-democrats-schumer-thune.html",
    "summary": "After weeks of stalemate, Senate Democrats said they were willing to reopen the government in exchange for a one-year extension of health care subsidies. Republicans ruled it out."
  },
  {
    "title": "A Decade Later, Supreme Court Is Asked to Revisit Same-Sex Marriage Decision",
    "link": "https://www.nytimes.com/2025/11/07/us/politics/supreme-court-same-sex-marriage.html",
    "summary": "Kim Davis, a Kentucky county clerk once jailed for refusing to issue same-sex marriage licenses, has asked the court to reconsider its landmark 2015 opinion."
  },
  {
    "title": "Did Trump’s Supreme Court Tariffs Brief Include a Strategic Blunder?",
    "link": "https://www.nytimes.com/2025/11/07/us/trump-statements-supreme-court-tariffs.html",
    "summary": "The justices are generally reluctant to take account of a president’s public statements. But extensive quotes from Mr. Trump in a key filing may change the legal calculus."
  },
  {
    "title": "Hegseth Is Purging Military Leaders With Little Explanation",
    "link": "https://www.nytimes.com/2025/11/07/us/politics/hegseth-firing-military-leaders.html",
    "summary": "The moves to fire or sideline generals and admirals are without precedent in recent decades and have rattled the top brass."
  },
  {
    "title": "Trump Pardons Darryl Strawberry, Former Mets and Yankees Slugger",
    "link": "https://www.nytimes.com/2025/11/07/us/politics/darryl-strawberry-pardon-trump.html",
    "summary": "The eight-time All-Star baseball player pleaded guilty in 1995 to one count of tax evasion. He was sentenced to six months of home confinement."
  },
  {
    "title": "Cornell Reaches Deal With Trump Administration to Restore Research Funds",
    "link": "https://www.nytimes.com/2025/11/07/us/cornell-deal-trump-administration.html",
    "summary": "The Ivy League university had warned of layoffs after the Trump administration stripped it of funds this year. The cuts were among the deepest in higher education."
  },
  {
    "title": "What to Know About Trump’s Transgender Passport Policy After Supreme Court Ruling",
    "link": "https://www.nytimes.com/2025/11/07/travel/supreme-court-transgender-passport-policy.html",
    "summary": "A policy that requires passports to display a person’s sex assigned at birth will come into play during renewals and first-time applications."
  },
  {
    "title": "James D. Watson, Co-Discoverer of the Structure of DNA, Is Dead at 97",
    "link": "https://www.nytimes.com/2025/11/07/science/james-watson-dead.html",
    "summary": "His decoding of the blueprint for life with Francis H.C. Crick made him one of the most important scientists of the 20th century. He wrote a celebrated memoir and later ignited an uproar with racist views."
  },
  {
    "title": "The Kennedy Center Crackup",
    "link": "https://www.nytimes.com/2025/11/07/us/politics/the-kennedy-center-crackup.html",
    "summary": "A Trumpian drama has been playing out inside the performing arts center all year. It has been damaging for business."
  },
  {
    "title": "New York Prepares for a Potential Trump Immigration Crackdown",
    "link": "https://www.nytimes.com/2025/11/07/nyregion/nyc-immigration-raids-trump-mamdani.html",
    "summary": "The election of Zohran Mamdani as mayor has stoked speculation that President Trump might move to send forces into the city."
  },
  {
    "title": "Immigration Agents Arrest Man in L.A. Raid and Drive Off With His Toddler",
    "link": "https://www.nytimes.com/2025/11/07/us/immigration-raid-los-angeles-toddler.html",
    "summary": "The child was later reunited with her grandmother, but the episode alarmed immigrant rights groups. The father, a U.S. citizen, faces a gun possession charge."
  },
  {
    "title": "In Cozying Up to Trump, Leaders Hedge Their Reliance on Moscow and Beijing",
    "link": "https://www.nytimes.com/2025/11/07/us/politics/central-asia-leaders-trump.html",
    "summary": "President Trump has made it easier for countries that are close to Russia and China to build ties with the United States. Those countries are embracing the opportunity."
  },
  {
    "title": "Trump Signals Openness to Exempting Hungary from Russian Oil Sanctions",
    "link": "https://www.nytimes.com/2025/11/07/world/europe/trump-orban-meeting-russia-sanctions.html",
    "summary": "Despite a chummy relationship, new U.S. penalties on Russian energy were likely to be a sticking point as President Trump and Prime Minister Viktor Orban of Hungary met."
  },
  {
    "title": "Nancy Pelosi’s Legacy as a Powerful Speaker in a Fractious House",
    "link": "https://www.nytimes.com/2025/11/07/us/politics/nancy-pelosi-house-speaker.html",
    "summary": "The first female speaker of the House may be the last to truly rule the increasingly unruly chamber."
  },
  {
    "title": "Pelosi Was Among the Most Notable House Speakers",
    "link": "https://www.nytimes.com/2025/11/07/us/politics/nancy-pelosi-house-speaker-history-woman.html",
    "summary": "The first woman to hold the post also made history as one of the most significant speakers in modern times."
  },
  {
    "title": "U.S. Wants Security Council to Adopt Trump Plan for Gaza",
    "link": "https://www.nytimes.com/2025/11/07/world/middleeast/trump-gaza-plan-us-security-council.html",
    "summary": "The alternative, Ambassador Michael Waltz bluntly told diplomats, was to watch the cease-fire between Israel and Hamas give way to a return to war."
  },
  {
    "title": "4 Arrested Over Disruption of Israeli Orchestra’s Concert",
    "link": "https://www.nytimes.com/2025/11/07/arts/music/israel-philharmonic-concert-arrests-france.html",
    "summary": "Several audience members shouted or lit flares as the Israel Philharmonic Orchestra performed in Paris. After the concert, the ensemble received 10 minutes of applause and played the Israeli national anthem."
  },
  {
    "title": "Is A.I. a Journalist or Just a Newsroom Tool?",
    "link": "https://www.nytimes.com/2025/11/07/business/media/ai-news-media.html",
    "summary": "A.I. has set off industrywide soul-searching about its potential and pitfalls."
  },
  {
    "title": "The Farmers’ Almanac Succumbs to the Digital Age",
    "link": "https://www.nytimes.com/2025/11/07/us/farmers-almanac-shutting-down.html",
    "summary": "One of two major American almanacs is ceasing publication after more than two centuries of predicting the weather and offering tidbits of wisdom."
  },
  {
    "title": "Vigilante Lawyers Expose the Rising Tide of A.I. Slop in Court Filings",
    "link": "https://www.nytimes.com/2025/11/07/business/lawyers-ai-vigilantes.html",
    "summary": "More lawyers are using artificial intelligence to write legal briefs. Some colleagues are publicizing the A.I.-generated errors."
  },
  {
    "title": "Why Democrats Could Win the Redistricting War",
    "link": "https://www.nytimes.com/2025/11/07/upshot/democrats-redistricting-gerrymanders.html",
    "summary": "Amending state constitutions seemed like a long shot, but Virginia’s move shows more blue states may be willing to try, opening new possibilities."
  },
  {
    "title": "A Democrat Pushing 80 Confronts the Young(er) and Restless",
    "link": "https://www.nytimes.com/2025/11/07/us/politics/massachusetts-senate-markey-moulton-pressley.html",
    "summary": "A fight brewing in Massachusetts could preview Democrats’ age battles."
  },
  {
    "title": "Deep Beneath Helsinki, the Playgrounds Are Really Bomb Shelters",
    "link": "https://www.nytimes.com/2025/11/07/realestate/deep-beneath-helsinki-the-playgrounds-are-really-bomb-shelters.html",
    "summary": "Finland has spent decades digging caves into its bedrock. Now, as Russia rears its head, nervous Finns want to know: “Where’s my shelter?”"
  },
  {
    "title": "Just How Bad Was Trump’s Very Bad Night?",
    "link": "https://www.nytimes.com/2025/11/07/opinion/ezra-klein-podcast-election.html",
    "summary": "Ezra Klein and Aaron Retica discuss whether affordability is the Democrats’ winning message, Trump’s politics of cruelty and how liberalism can win right now."
  },
  {
    "title": "Trump Is Resurrecting the Gatsby Era. The Hangover Could Be Brutal.",
    "link": "https://www.nytimes.com/2025/11/07/opinion/donald-trump-great-gatsby-roating-20s-sec.html",
    "summary": "Donald Trump’s recent Gatsby party encapsulates this moment of economic peril."
  },
  {
    "title": "Rise in Kidney Disease Tied to Other Chronic Conditions, Study Finds",
    "link": "https://www.nytimes.com/2025/11/07/well/kidney-disease-rise-study.html",
    "summary": "Rates of the disease have been rising for decades, driven in part by diabetes and high blood pressure."
  },
  {
    "title": "Kendrick Lamar, Lady Gaga and Bad Bunny Lead 2026 Grammy Nominees",
    "link": "https://www.nytimes.com/2025/11/07/arts/music/grammy-awards-nominations.html",
    "summary": "Sabrina Carpenter, Leon Thomas, Doechii and Tyler, the Creator will compete in the biggest categories at the awards show in February."
  },
  {
    "title": "Prince Harry Apologizes to Canadians for Wearing an L.A. Dodgers Cap",
    "link": "https://www.nytimes.com/2025/11/07/world/canada/prince-harry-dodgers-cap-world-series.html",
    "summary": "Harry, who referred to the episode as “Hat Gate,” was seen wearing the cap at a World Series game in Los Angeles between the Dodgers and the Toronto Blue Jays."
  },
  {
    "title": "Leaders at COP30 Climate Summit in Belém Focus on the Rising Toll of Warming",
    "link": "https://www.nytimes.com/2025/11/07/climate/cop30-belem-climate-impacts.html",
    "summary": "“All we have to do is look outside,” one delegate said. “The sea rises, the coral dies.”"
  }
]