[
  {
    "title": "C.I.A. Conducted Drone Strike on Port in Venezuela",
    "link": "https://www.nytimes.com/2025/12/29/us/politics/cia-drone-strike-venezuela.html",
    "summary": "The attack last week, on a dock purportedly used for shipping narcotics, did not kill anyone, people briefed on the operation said. But it was the first known U.S. operation inside Venezuela."
  },
  {
    "title": "U.S. Kills 2 in Strike in Pacific, as Trump Pressures Venezuela",
    "link": "https://www.nytimes.com/2025/12/29/us/politics/pacific-trump-venezuela-boat-strike.html",
    "summary": "The attack was the 30th announced by the U.S. military since early September. It came days after President Trump said the U.S. had struck a coastal site related to drugs and Venezuela."
  },
  {
    "title": "C.I.A. Strikes Inside Venezuela, and U.S. Tells U.N. Agencies to ‘Adapt, Shrink or Die’",
    "link": "https://www.nytimes.com/2025/12/30/podcasts/the-headlines/cia-venezuela-un-agencies.html",
    "summary": "Plus, the mountain climbing brothers trying to rewrite the world’s maps."
  },
  {
    "title": "New Year’s Eve Concerts at Kennedy Center Are Canceled",
    "link": "https://www.nytimes.com/2025/12/29/arts/kennedy-center-new-years-eve-concerts-canceled.html",
    "summary": "The jazz drummer Billy Hart said the decision was “evidently” connected to President Trump’s name being added to the arts center."
  },
  {
    "title": "Trump, Pressing Ahead on Ukraine-Russia Talks, Confronts Difficult Realities",
    "link": "https://www.nytimes.com/2025/12/29/us/politics/trump-zelensky-putin-ukraine-russia.html",
    "summary": "The U.S.-led negotiations have made some progress, but still face fundamental challenges, including over security guarantees to counter future Russian aggression."
  },
  {
    "title": "The Cover-Up: Inside the Plot to Conceal Assad’s Crimes",
    "link": "https://www.nytimes.com/2025/12/30/world/middleeast/assad-regime-crimes-syria-documents.html",
    "summary": "Thousands of documents and interviews with Assad-era officials reveal how the regime worked to conceal evidence of its atrocities during the Syrian civil war."
  },
  {
    "title": "How the Assad Regime Covered Up Its Crimes: Key Takeaways",
    "link": "https://www.nytimes.com/2025/12/30/world/middleeast/assad-regime-crimes-syria-documents-takeaways.html",
    "summary": "We documented how the dictator Bashar al-Assad and his henchmen conspired to hide evidence of torture and deaths of detainees during Syria’s long civil war."
  },
  {
    "title": "China Fires Rockets Near Taiwan in Display of Military Power",
    "link": "https://www.nytimes.com/2025/12/30/world/asia/china-taiwan-military-drills.html",
    "summary": "China’s military also sent warships and aircraft during a second day of exercises designed to show its ability to claim the democratic island."
  },
  {
    "title": "Yonaguni, the Japanese Island on the Front Lines of China’s Feud with Japan",
    "link": "https://www.nytimes.com/2025/12/30/world/asia/japan-china-island-yonaguni.html",
    "summary": "Yonaguni, a tiny Japanese island near Taiwan, is getting soldiers, radar and missiles. As China’s dispute with Tokyo escalates, some residents are worried."
  },
  {
    "title": "Gone in 2025: A Yearlong Procession of Giants",
    "link": "https://www.nytimes.com/2025/12/29/obituaries/2025-deaths-obituaries.html",
    "summary": "Marquee names all, they found international fame in the arts, politics, the sciences and beyond."
  },
  {
    "title": "George and Amal Clooney Become French Citizens",
    "link": "https://www.nytimes.com/2025/12/30/world/europe/george-clooney-amal-french-citizenship.html",
    "summary": "Mr. Clooney, who owns a farmhouse in France, has said that living there enabled him and his wife, a human rights lawyer, to pursue a quieter existence with their children."
  },
  {
    "title": "Trump and Netanyahu Praise Each Other After Meeting, Despite Differences Over Gaza",
    "link": "https://www.nytimes.com/2025/12/29/us/politics/trump-netanyahu-israel-meeting.html",
    "summary": "The American and Israeli leaders showed few signs of disagreement after meeting in Florida, giving no public indication of their growing strains over Gaza, Syria and other issues."
  },
  {
    "title": "Saudis Say Airstrike in Yemen Targeted Arms From U.A.E.",
    "link": "https://www.nytimes.com/2025/12/30/world/middleeast/yemen-saudi-strike-uae.html",
    "summary": "The Saudi-led coalition said a strike on a port in southern Yemen was targeting weapons bound for a separatist group that is backed by the United Arab Emirates."
  },
  {
    "title": "Katherine Maher of NPR Has Come Out on Top Despite Battles With Trump and the CPB",
    "link": "https://www.nytimes.com/2025/12/30/business/npr-katherine-maher.html",
    "summary": "Katherine Maher has taken an unyielding approach to NPR’s biggest battles — which has sometimes put her at odds with her colleagues in public media."
  },
  {
    "title": "Mamdani Promised Universal Child Care. How Long Could It Take?",
    "link": "https://www.nytimes.com/2025/12/30/nyregion/mamdani-nyc-mayor-free-childcare.html",
    "summary": "Here is what to expect if you’re expecting relief from the soaring cost of day care in New York City."
  },
  {
    "title": "Mamdani Will Be Sworn In at Abandoned Subway Station Beneath City Hall",
    "link": "https://www.nytimes.com/2025/12/29/nyregion/mamdani-subway-sworn-in-mayor.html",
    "summary": "Hours before Mayor-elect Zohran Mamdani holds an inauguration block party outside City Hall, he will officially become mayor in a small private ceremony."
  },
  {
    "title": "How a Research Trip to Antarctica Deals With Time Zones",
    "link": "https://www.nytimes.com/2025/12/29/climate/antarctica-time-zone.html",
    "summary": "The clocks aboard our icebreaker will be changed several times en route to Antarctica. It’s one of many things that make the expedition feel otherworldly."
  },
  {
    "title": "Can a Corporation Be Complicit in War Crimes? Sweden Is Trying to Find Out.",
    "link": "https://www.nytimes.com/2025/12/30/opinion/the-oil-company-drilled-government-slaughter-guilty.html",
    "summary": "It’s Sweden’s longest criminal trial. I was there because of a different historic distinction."
  },
  {
    "title": "Overlooked Stories",
    "link": "https://www.nytimes.com/2025/12/30/briefing/overlooked-stories.html",
    "summary": "We look at some of our best stories from 2025 that Times editors thought deserved more attention."
  },
  {
    "title": "Khaleda Zia, Bangladesh’s First Female Prime Minister, Dies",
    "link": "https://www.nytimes.com/2025/12/29/world/asia/khaleda-zia-bangladesh-dead.html",
    "summary": "In office for three terms, she traded the country’s leadership with Sheikh Hasina, the head of another political dynasty, over decades. She was believed to be 80."
  },
  {
    "title": "K-Pop Group NewJeans Faces New Uncertainty After Member Is Dropped",
    "link": "https://www.nytimes.com/2025/12/30/world/asia/new-jeans-danielle-ador.html",
    "summary": "The band’s label said it had dropped one of the girl group’s five members. NewJeans’s legal battle has drawn public scrutiny of the K-pop industry."
  },
  {
    "title": "Did Starmer Impose a Curfew in the U.K.? No, It’s a Fake TikTok Video.",
    "link": "https://www.nytimes.com/2025/12/30/world/europe/starmer-uk-tiktok-fake-news.html",
    "summary": "A.I. has made it easy to put words in people’s mouths, and Prime Minister Keir Starmer of Britain has become a favorite target. The motive, experts say, is not political but financial."
  },
  {
    "title": "Hundreds Sue Virginia Hospital and Executives Over Unneeded Surgeries",
    "link": "https://www.nytimes.com/2025/12/29/health/chesapeake-hospital-lawsuit-perwaiz.html",
    "summary": "More than 500 women claimed that they had received unnecessary operations. Hospital leaders said they were not aware of a doctor’s misconduct."
  }
]