[
  {
    "title": "Trump’s Plan to Pack the Fed With Loyalists",
    "link": "https://www.nytimes.com/2025/08/31/business/how-trump-could-overhaul-the-fed.html",
    "summary": "Overhauling the central bank’s Board of Governors would grant the president greater sway over an institution that is supposed to be independent from the White House."
  },
  {
    "title": "Historians See Autocratic Playbook in Trump’s Attacks on Science",
    "link": "https://www.nytimes.com/2025/08/31/science/trump-science-autocrats.html",
    "summary": "Authoritarians have long feared and suppressed science as a rival for social influence. Experts see President Trump as borrowing some of their tactics."
  },
  {
    "title": "Israel Says It Killed Abu Obeida, Spokesman for Hamas’s Armed Wing",
    "link": "https://www.nytimes.com/2025/08/31/world/middleeast/hamas-abu-obeida-israel-gaza-city.html",
    "summary": "Hamas did not immediately comment on the Israeli military’s claim that Abu Obeida, one of the armed group’s best-known officials in the Arab world, had been killed."
  },
  {
    "title": "‘There Was a Death’: A Mother Fights for Justice in the Age of Fentanyl",
    "link": "https://www.nytimes.com/2025/08/31/us/fentanyl-mother-dealer-conviction.html",
    "summary": "After she lost her son to an overdose, Serena Fallon went on a quest to hold someone accountable for his death."
  },
  {
    "title": "Xi Uses Summit, Parade and History to Flaunt China’s Global Pull",
    "link": "https://www.nytimes.com/2025/08/30/world/asia/xi-putin-modi-china-summit.html",
    "summary": "With the leaders of Russia and India visiting, China’s president will show how he can use statecraft, military might and history to push for global influence."
  },
  {
    "title": "America Closed Malls, but China Kept Building Them. Now It Has Too Many.",
    "link": "https://www.nytimes.com/2025/08/31/business/china-shopping-malls.html",
    "summary": "The first closing of an Apple Store in mainland China hints at broader troubles facing the country’s shopping malls as developers open more of them despite a glut."
  },
  {
    "title": "In Austria, Government Health Care Can Look a Bit Like a Spa",
    "link": "https://www.nytimes.com/2025/08/30/well/austria-heart-health.html",
    "summary": "A few weeks of hikes and saunas in wine country? Sometimes, that’s literally just what the doctor ordered."
  },
  {
    "title": "Russian Strikes on Western Assets in Ukraine Send an Ominous Message",
    "link": "https://www.nytimes.com/2025/08/31/world/europe/russia-ukraine-western-targets.html",
    "summary": "Hitting an American-run factory and European diplomatic offices, the Kremlin appeared to signal that it would resist Western efforts to make peace and protect Ukraine, analysts and officials said."
  },
  {
    "title": "If Redistricting Goes as Expected, Which Party Will Come Out Ahead?",
    "link": "https://www.nytimes.com/2025/08/31/upshot/redistricting-analysis-2026-midterms.html",
    "summary": "Democrats would probably need to win the national popular vote by two or three percentage points to retake the House next year."
  },
  {
    "title": "Redistricting Push Creates Chaos for Incumbents in Both Parties",
    "link": "https://www.nytimes.com/2025/08/31/us/politics/redistricting-demcorats-republicans-texas-california.html",
    "summary": "Republicans and Democrats in Congress are wary of the potential consequences of President Trump’s drive to redraw districts."
  },
  {
    "title": "Trump Crime Strategy May Work for Now, but Not for Long, Experts Say",
    "link": "https://www.nytimes.com/2025/08/31/us/trump-crime-strategy-solutions.html",
    "summary": "The president is looking to add  troops to city streets while cutting funds for programs that work, experts and local officials say. But one idea, beautifying neighborhoods, has buy-in."
  },
  {
    "title": "Chicago’s Mayor Rejects Trump’s Plans to Send Troops to His City",
    "link": "https://www.nytimes.com/2025/08/31/us/politics/chicago-order-trump-immigration-crackdown.html",
    "summary": "Mayor Brandon Johnson of Chicago ordered local police officers not to aid the federal crackdown, ramping up the tensions between the White House and state and local officials."
  },
  {
    "title": "In the Hills of Puerto Rico, Feasting on a Very Smelly Fruit",
    "link": "https://www.nytimes.com/2025/08/31/us/puerto-rico-durian.html",
    "summary": "Every summer, superfans of durian converge on a remote farm in western Puerto Rico to devour one of the world’s most polarizing fruits."
  },
  {
    "title": "What Motivated the Minneapolis Church Shooter? We May Never Know.",
    "link": "https://www.nytimes.com/2025/08/31/us/minneapolis-school-shooter-motive.html",
    "summary": "Investigators combing through piles of evidence from an attack on a Minneapolis church cautioned that these kinds of shooters often leave more questions than answers."
  },
  {
    "title": "How Builder.ai Collapsed Amid Silicon Valley’s Biggest Boom",
    "link": "https://www.nytimes.com/2025/08/31/technology/builder-ai-collapse.html",
    "summary": "Builder.ai went from a value of $1.5 billion to zero in a few months, amid questions over the sales of an A.I. product. Its downfall hints at a broader downturn."
  },
  {
    "title": "How ‘Clanker’ Became an Anti-A.I. Rallying Cry",
    "link": "https://www.nytimes.com/2025/08/31/technology/clanker-anti-ai.html",
    "summary": "The term, which was popularized by a “Star Wars” show and is rooted in real frustrations with technology, has become a go-to slur against artificial intelligence and robots."
  },
  {
    "title": "The Corporate Logo That Broke the Internet",
    "link": "https://www.nytimes.com/2025/08/31/opinion/cracker-barrel-sydney-sweeney-rufo-maga.html",
    "summary": "How to bend political reality in two easy steps."
  },
  {
    "title": "Trump Has Obliterated America’s 30-Year Courtship of India",
    "link": "https://www.nytimes.com/2025/08/31/opinion/trump-us-india.html",
    "summary": "India must decide whether go all in with a capricious Trump or hedge its bets through a rapprochement with China."
  },
  {
    "title": "Introducing Our New Game",
    "link": "https://www.nytimes.com/2025/08/31/briefing/pips-new-york-times-games.html",
    "summary": "We show you how to play Pips, a new Times puzzle."
  },
  {
    "title": "Indonesia’s Leader Says He Will Bow to Some Protester Demands After Riots",
    "link": "https://www.nytimes.com/2025/08/31/world/asia/indonesia-protest-politicians-ransack-loot.html",
    "summary": "President Prabowo Subianto of Indonesia acknowledged the concerns of the protesters and said his government would make concessions."
  },
  {
    "title": "The Manhattan Park That Keeps Children Locked Out",
    "link": "https://www.nytimes.com/2025/08/31/nyregion/gw-bridge-park-dolphin-park.html",
    "summary": "A beloved park on state-owned land in Upper Manhattan has been closed for years, with neither the government nor any nonprofit groups willing to step in to operate it."
  },
  {
    "title": "Punjab Floods Devastate Pakistan’s Breadbasket",
    "link": "https://www.nytimes.com/2025/08/31/world/asia/summer-monsoon-floods-pakistan.html",
    "summary": "Housing communities and businesses that rely on agriculture have been destroyed in the country’s largest province."
  }
]