[
  {
    "title": "Wall Street Is Shaking Off Fears of an A.I. Bubble. For Now.",
    "link": "https://www.nytimes.com/2025/12/09/business/wall-street-valuation-ai-bubble.html",
    "summary": "The valuations of some artificial intelligence companies are approaching those of the dot-com boom. But investors worry that pulling money from today’s market risks future gains."
  },
  {
    "title": "Why the A.I. Boom Is Unlike the Dot-Com Boom",
    "link": "https://www.nytimes.com/2025/12/09/technology/ai-boom-unlike-dot-com-boom.html",
    "summary": "Silicon Valley is again betting everything on a new technology. But the mania is not a reboot of the late-1990s frenzy."
  },
  {
    "title": "Judge Says Ghislaine Maxwell Grand Jury Records Can Be Unsealed, Citing New Epstein Law",
    "link": "https://www.nytimes.com/2025/12/09/nyregion/ghislaine-maxwell-epstein-grand-jury-unsealed.html",
    "summary": "The ruling cited a law signed last month by President Trump requiring the Justice Department to release its files on Jeffrey Epstein and his longtime companion, Ghislaine Maxwell."
  },
  {
    "title": "Legal Groups Sue Justice Dept. for Secret Memo Justifying Boat Strikes",
    "link": "https://www.nytimes.com/2025/12/09/nyregion/aclu-lawsuit-justice-department-boat-strikes.html",
    "summary": "“The public deserves to know how the Trump administration has justified the outright murder of civilians as lawful,” the organizations said in their lawsuit."
  },
  {
    "title": "Judge Suggests Lindsey Halligan, Prosecutor on Comey and James Cases, Should Resign",
    "link": "https://www.nytimes.com/2025/12/09/us/politics/comey-james-halligan.html",
    "summary": "Lindsey Halligan’s indictments against James B. Comey, the former F.B.I. director, and Letitia James, the attorney general of New York, were dismissed last month over Ms. Halligan’s appointment."
  },
  {
    "title": "Why Trump Accounts, as Currently Planned, Risk Leaving Out Many Children",
    "link": "https://www.nytimes.com/2025/12/09/upshot/trump-accounts-dell.html",
    "summary": "Michael and Susan Dell are donating $6.25 billion to American children via the accounts, but the details matter."
  },
  {
    "title": "Mackenzie Scott Announces $7 Billion of Giving This Year",
    "link": "https://www.nytimes.com/2025/12/09/business/mackenzie-scott-philanthropy.html",
    "summary": "The philanthropist known for donating to historically Black colleges and nonprofits working on climate change offered the news by updating an October blog post."
  },
  {
    "title": "In L.A., $750 a Month to Live in a Backyard Storage Unit",
    "link": "https://www.nytimes.com/2025/12/09/us/california-backyard-housing-rent-storage-unit.html",
    "summary": "A landlord crowded tenants into his house and yard without running water or power. One, determined to find an alternative, was up against the city’s housing crisis."
  },
  {
    "title": "2025 Best Dishes in America",
    "link": "https://www.nytimes.com/2025/12/09/dining/best-dishes-america.html",
    "summary": "Crispy fish ssam, knife-cut noodles and more of our favorite bites from a year of eating."
  },
  {
    "title": "2025 Best Desserts in America",
    "link": "https://www.nytimes.com/2025/12/09/dining/best-desserts-america.html",
    "summary": "Dulce de leche flan, cherry pie and more of our favorite sweets of the year."
  },
  {
    "title": "Trump Calls Europe ‘Decaying’ and Suggests ‘Size Will Win’ in Ukraine War",
    "link": "https://www.nytimes.com/2025/12/09/us/politics/trump-europe-decaying-weak-ukraine.html",
    "summary": "President Trump’s comments deepened his rift with mainstream European leaders over defense and Ukraine policy."
  },
  {
    "title": "The Territorial Sticking Point Between Russia and Ukraine",
    "link": "https://www.nytimes.com/2025/12/09/world/europe/ukraine-maps-russia-territory.html",
    "summary": "The Kremlin says any peace deal must cede to Russia the entire eastern Donbas region, including territory Ukraine still controls — a nonstarter for Kyiv."
  },
  {
    "title": "Kamala Harris Isn’t Ready to Be Written Off",
    "link": "https://www.nytimes.com/2025/12/09/us/politics/kamala-harris-interview-107-days-book-2028.html",
    "summary": "She was seen for two decades as a future face of the Democratic Party. Is she now suddenly a figure of its past?"
  },
  {
    "title": "Canada Plans to Fast-Track Immigration for US H1-B Visa Holders in New Talent Drive",
    "link": "https://www.nytimes.com/2025/12/09/world/canada/canada-usa-immigration-h1-b-visa-talent.html",
    "summary": "The government says it will fast-track immigration for U.S. H-1B visa holders and spend more than $1 billion to attract researchers from the United States and the rest of the world."
  },
  {
    "title": "Gov. Pritzker Signs Bill Imposing New Limits on Immigration Enforcement in Illinois",
    "link": "https://www.nytimes.com/2025/12/09/us/illinois-immigration-legislation-pritzker.html",
    "summary": "The measure restricts immigration arrests around state courthouses. Republicans have criticized the law and suggested it would face legal challenges."
  },
  {
    "title": "What Streaming TV Could Learn from ‘Mad Men’",
    "link": "https://www.nytimes.com/2025/12/09/arts/television/mad-men-hbo-max.html",
    "summary": "The classic show arrived on HBO Max with an embarrassing remastering error. But the show’s creative mastery remains undeniable."
  },
  {
    "title": "Australia’s Social Media Ban for People Under 16 Takes Effect",
    "link": "https://www.nytimes.com/2025/12/09/world/asia/australia-social-media-ban-under-16.html",
    "summary": "The measure is one of the most sweeping efforts in the world to safeguard children from the harms of the platforms."
  },
  {
    "title": "Some Teens Are on Social Media ‘Almost Constantly,’ Survey Says",
    "link": "https://www.nytimes.com/2025/12/09/well/family/tik-tok-you-tube-teen-use-pew-study.html",
    "summary": "The new Pew report also found that two-thirds of teens said they had used an A.I. chatbot."
  },
  {
    "title": "Europe, Too, Is Worth Fighting For",
    "link": "https://www.nytimes.com/2025/12/09/opinion/national-security-strategy-us-europe.html",
    "summary": "Provided Europeans want to fight for it."
  },
  {
    "title": "Trump Pressures Ukraine",
    "link": "https://www.nytimes.com/2025/12/09/briefing/trump-ukraine-wall-street-ai-bubble.html",
    "summary": "Also, the Supreme Court considers campaign finance limits. Here’s the latest at the end of Tuesday."
  },
  {
    "title": "Student Is Killed in Kentucky State University Shooting",
    "link": "https://www.nytimes.com/2025/12/09/us/shooting-kentucky-state-university.html",
    "summary": "The police said that a suspect was arrested after the shooting in Frankfort, Ky. A second student was injured and in critical but stable condition, a university spokesman said."
  },
  {
    "title": "Seattle’s Plans for a Pride Match at World Cup Infuriates Iran and Egypt",
    "link": "https://www.nytimes.com/2025/12/09/world/middleeast/iran-egypt-world-cup-seattle-pride.html",
    "summary": "The two countries, which criminalize homosexuality and impose severe punishments for it, were picked to play on a day celebrating L.G.B.T.Q. communities."
  },
  {
    "title": "DéLana R.A. Dameron, Writer of the Black South, Dies at 40",
    "link": "https://www.nytimes.com/2025/12/09/books/delana-ra-dameron-dead.html",
    "summary": "An award-winning poet and writer of fiction, she moonlighted as a competitive horsewoman and owned a horse farm outside Columbia, S.C."
  },
  {
    "title": "Bird Flu Is Suspected After Vulture Carcasses Sat Rotting Outside Ohio School",
    "link": "https://www.nytimes.com/2025/12/09/us/dead-vultures-bird-flu-ohio.html",
    "summary": "The birds lingered for days at a Catholic school near Cincinnati as agencies haggled over who was responsible for removing them. Officials said the public health risk was low."
  }
]