[
  {
    "title": "What ‘Security Guarantees’ in Troop Form Could Look Like in Ukraine",
    "link": "https://www.nytimes.com/2025/08/18/world/europe/security-guarantees-troops-ukraine.html",
    "summary": "President Trump has not committed to adding American forces to the mix in Ukraine. No one has detailed publicly what form defenses would take, but there are several options."
  },
  {
    "title": "Trump Administration Discusses Taking 10% Stake in Intel",
    "link": "https://www.nytimes.com/2025/08/18/technology/intel-trump-government-stake.html",
    "summary": "Federal officials are considering the move because Intel, the last leading-edge chipmaker in the United States, has been struggling."
  },
  {
    "title": "In Surprise Move, Trump Taps Missouri Attorney General to Help Run F.B.I.",
    "link": "https://www.nytimes.com/2025/08/18/us/politics/fbi-missouri-attorney-general.html",
    "summary": "The move appears to diminish the authority of the current deputy director, Dan Bongino, whose tumultuous tenure has included a pitched argument over files related to the disgraced financier Jeffrey Epstein."
  },
  {
    "title": "Mississippi and Louisiana Will Send National Guard Troops to D.C.",
    "link": "https://www.nytimes.com/2025/08/18/us/politics/national-guard-dc-trump-mississippi-louisiana.html",
    "summary": "Ohio, West Virginia and South Carolina have also deployed the Guard to Washington to support President Trump’s crackdown on the city."
  },
  {
    "title": "The Madden Sisters Don’t Want to Be Institutionalized",
    "link": "https://www.nytimes.com/2025/08/18/magazine/medicaid-cuts-home-care-disabilities.html",
    "summary": "Medicaid pays for most of the in-home care that lets disabled Americans live independently. Will coming cuts put that care in jeopardy?"
  },
  {
    "title": "Justice Dept. Will Begin Sharing Epstein Files on Friday, Top Republican Says",
    "link": "https://www.nytimes.com/2025/08/18/us/politics/epstein-files-release-trump.html",
    "summary": "The chairman of the House Oversight Committee said the department would miss a Tuesday deadline his panel set in a subpoena but would begin sharing some records on Friday."
  },
  {
    "title": "Republican Bid to Help Trump Move Past Epstein Falls Flat",
    "link": "https://www.nytimes.com/2025/08/18/us/politics/republicans-epstein-files.html",
    "summary": "Republicans in Congress managed to recess for the summer without voting on the issue, but it has continued to dog them and awaits them when they return."
  },
  {
    "title": "Why Rip Currents From Hurricane Erin Are So Dangerous to the East Coast",
    "link": "https://www.nytimes.com/2025/08/18/weather/hurricane-erin-rip-current-east-coast-carolina.html",
    "summary": "Rip currents are the third leading cause of deaths from hurricanes, and they can happen on a sunny day hundreds of miles from the storm."
  },
  {
    "title": "Hamas Accepts New Gaza Cease-Fire Proposal, Officials Say",
    "link": "https://www.nytimes.com/2025/08/18/world/middleeast/hamas-israel-gaza-ceasefire.html",
    "summary": "It was unclear whether Prime Minister Benjamin Netanyahu of Israel was on board with the terms, which came as Qatar and Egypt were intensifying mediation efforts."
  },
  {
    "title": "Israel Is in Talks to Send Gazans to South Sudan, Officials Say",
    "link": "https://www.nytimes.com/2025/08/18/world/middleeast/israel-gazans-south-sudan.html",
    "summary": "Israel has broadened its push, so far unsuccessful, to persuade other countries to take in Gazans en masse. Critics say the relocation could violate international law."
  },
  {
    "title": "As Trump’s Policies Take Hold, Springfield, Ohio, Loses Its Haitian Work Force",
    "link": "https://www.nytimes.com/2025/08/18/us/springfield-ohio-haitian-immigrants-trump.html",
    "summary": "Springfield faced a crisis after Donald Trump falsely claimed Haitians were eating pets. Now his policies are driving out workers like Wilford Rinvil, who left for Canada."
  },
  {
    "title": "Immigration Enforcement Takes Key Role in Trump’s D.C. Crime Crackdown",
    "link": "https://www.nytimes.com/2025/08/18/us/trump-immigration-dc-crime.html",
    "summary": "Immigrants who live and work in the city say they want violent crime lowered but fear that ICE efforts could make it worse."
  },
  {
    "title": "He Sold His Likeness. Now His Avatar Is Shilling Supplements on TikTok.",
    "link": "https://www.nytimes.com/2025/08/17/business/tiktok-ai-avatars.html",
    "summary": "Welcome to a new era of commercial work fueled by generative artificial intelligence."
  },
  {
    "title": "Madison Avenue Is Starting to Love A.I.",
    "link": "https://www.nytimes.com/2025/08/18/business/madison-avenue-is-starting-to-love-ai.html",
    "summary": "Advertisers are increasingly using generative artificial intelligence to make their commercials."
  },
  {
    "title": "Spain Calls in More Soldiers to Fight Wildfires",
    "link": "https://www.nytimes.com/2025/08/18/world/europe/spain-wildfires-europe-heat.html",
    "summary": "Across the Iberian Peninsula, thousands are trying to quell deadly flames amid dangerously hot weather."
  },
  {
    "title": "Dealer Known as ‘Ketamine Queen’ to Plead Guilty in Matthew Perry Case",
    "link": "https://www.nytimes.com/2025/08/18/arts/television/matthew-perry-jasveen-singha-guilty-plea.html",
    "summary": "Jasveen Sangha will plead guilty to selling the ketamine that killed the “Friends” star, prosecutors said. She could face decades in prison."
  },
  {
    "title": "Air Canada Strike Leaves Stranded Passengers Frustrated and Angry",
    "link": "https://www.nytimes.com/2025/08/18/travel/air-canada-strike-refund.html",
    "summary": "Many passengers are still struggling to find alternative transportation and are angry at the airline. “You feel like you’re at their mercy,” said one."
  },
  {
    "title": "Air Canada Flight Attendants Remain on Strike After Walkout Deemed Illegal",
    "link": "https://www.nytimes.com/2025/08/18/world/canada/air-canada-strike-flight-attendant-labor-board.html",
    "summary": "A labor relations board ordered flight attendants back to work on Monday, but the union representing the employees rejected the demand."
  },
  {
    "title": "These Majestic Seabirds Never Stop Pooping",
    "link": "https://www.nytimes.com/2025/08/18/science/seabirds-never-stop-pooping.html",
    "summary": "Streaked shearwaters keep a very regular rhythm throughout their daily foraging flights, shedding about 5 percent of their body mass every hour."
  },
  {
    "title": "Trump Just Reminded Me of Why I’m Still a Neocon",
    "link": "https://www.nytimes.com/2025/08/18/opinion/trump-israel-ukraine-zelensky.html",
    "summary": "By putting the interests of what Trump calls “peace” ahead of the interests of freedom, we are all-but guaranteeing that Ukraine will lose both."
  },
  {
    "title": "What My Daughter Told ChatGPT Before She Took Her Life",
    "link": "https://www.nytimes.com/2025/08/18/opinion/chat-gpt-mental-health-suicide.html",
    "summary": "The medical profession has clear rules and responsibilities. What about the chatbots?"
  },
  {
    "title": "Trump Hosts Zelensky and European Leaders",
    "link": "https://www.nytimes.com/2025/08/18/briefing/trump-hosts-zelensky-and-european-leaders.html",
    "summary": "Also, Texas Democrats ended their walkout over redistricting. Here’s the latest at the end of Monday."
  },
  {
    "title": "Did You Recently Buy a Used E.V.? We Want to Hear From You.",
    "link": "https://www.nytimes.com/2025/08/18/business/used-electric-vehicles-callout.html",
    "summary": "The prices of used electric cars have fallen sharply in recent months, making them a more attractive option."
  },
  {
    "title": "A Pakistani Village Devastated by Flooding: ‘Like Death Visited Every Home’",
    "link": "https://www.nytimes.com/2025/08/18/world/asia/pakistan-floods-village.html",
    "summary": "At least 660 people have died in rain-related incidents across Pakistan since monsoon season began in late June, and 935 more have been injured."
  },
  {
    "title": "The Texas Measles Outbreak Is Over, Officials Say",
    "link": "https://www.nytimes.com/2025/08/18/well/texas-measles-outbreak-over.html",
    "summary": "The larger outbreak, which spread to New Mexico and Oklahoma, is still ongoing."
  },
  {
    "title": "M.T.A. Approves Major Contract to Expand the Second Avenue Subway Line",
    "link": "https://www.nytimes.com/2025/08/18/nyregion/mta-second-avenue-subway-harlem-125th-street.html",
    "summary": "The contract, which will award nearly $2 billion to construction firms, funds crucial aspects of the latest phase of the long-awaited subway expansion into East Harlem."
  },
  {
    "title": "Wegovy Gets F.D.A. Approval for MASH",
    "link": "https://www.nytimes.com/2025/08/18/well/fda-approves-wegovy-mash-liver-disease-fibrosis.html",
    "summary": "Wegovy has been approved for use among the growing number of Americans who have MASH."
  }
]