[
  {
    "title": "Trump Revives Trade War, Threatening Steep Aug. 1 Tariffs on Allies",
    "link": "https://www.nytimes.com/2025/07/07/us/politics/trump-tariffs-japan-south-korea.html",
    "summary": "President Trump said Japan and South Korea would face tariffs of 25 percent unless they reached an agreement with the United States. Other countries received notice of higher levies."
  },
  {
    "title": "As Renewed U.S. Tariffs Loom, Emerging Economies Turn to One Another",
    "link": "https://www.nytimes.com/2025/07/07/world/americas/trump-tariffs-global-trade-economy.html",
    "summary": "With President Trump preparing to revive tariffs this week, some of the world’s biggest exporters are planning a future less dependent on trade with the United States."
  },
  {
    "title": "Here Are Trump’s New Tariff Threats",
    "link": "https://www.nytimes.com/2025/07/07/business/trump-tariffs-trade-deals-august-1.html",
    "summary": "President Trump has told 14 countries that they will face tariffs of at least 25 percent on Aug. 1 if they don’t reach agreements by then."
  },
  {
    "title": "Trump Looks to Avoid Casting Blame in Texas Flood as Democrats Question Cuts",
    "link": "https://www.nytimes.com/2025/07/07/us/politics/trump-texas-floods.html",
    "summary": "The White House rebuked critics for raising questions about the administration’s efforts to shrink federal agencies that deal with disaster preparedness and response."
  },
  {
    "title": "Texas Flood Victims: What We Know",
    "link": "https://www.nytimes.com/2025/07/05/us/texas-flood-victims.html",
    "summary": "A beloved teacher, child and adult campers, camp directors and a counselor are among at least 104 people who have died in the flooding in Central Texas."
  },
  {
    "title": "Three Big Questions After the Texas Floods",
    "link": "https://www.nytimes.com/2025/07/07/us/politics/texas-floods-trump-administration.html",
    "summary": "The Trump administration and its predecessors will face scrutiny over the disaster that has killed more than 100 people."
  },
  {
    "title": "Trump and Netanyahu Meet Amid Gaza Cease-Fire Negotiations",
    "link": "https://www.nytimes.com/2025/07/07/us/politics/trump-netanyahu-dinner-gaza-cease-fire.html",
    "summary": "The two confronted an array of high-stakes Middle East issues. But first they took a victory lap, including the Israeli leader telling President Trump he had nominated him for a Nobel Peace Prize."
  },
  {
    "title": "Trump Administration Acknowledges Lack of Evidence for Jeffrey Epstein ‘Client List’",
    "link": "https://www.nytimes.com/2025/07/07/us/politics/trump-administration-jeffrey-epstein-client-list-suicide.html",
    "summary": "After Attorney General Pam Bondi promised big revelations for months, the Justice Department noted a lack of evidence for conspiracy theories, including a “client list” and a jailhouse murder."
  },
  {
    "title": "I.R.S. Says Churches Can Endorse Candidates From the Pulpit",
    "link": "https://www.nytimes.com/2025/07/07/us/politics/irs-churches-politics-endorse-candidates.html",
    "summary": "In a court filing, the tax agency said a decades-old ban on campaigning by tax-exempt groups should not apply to houses of worship speaking to their own members."
  },
  {
    "title": "Russia Confirms Death of Minister Hours After Kremlin Dismissed Him",
    "link": "https://www.nytimes.com/2025/07/07/world/europe/russia-minister-dead.html",
    "summary": "Roman V. Starovoyt, the transport minister, had governed the Kursk region before Ukrainian forces occupied part of it in 2024."
  },
  {
    "title": "Trump Pledges to Send More Weapons to Ukraine",
    "link": "https://www.nytimes.com/2025/07/07/us/politics/trump-ukraine-weapons.html",
    "summary": "“They have to be able to defend themselves,” the president said, appearing to signal a reversal after his administration paused some weapons transfers just last week."
  },
  {
    "title": "After Mamdani’s Win, Some Democrats Are Determined to Stop Him",
    "link": "https://www.nytimes.com/2025/07/07/nyregion/mamdani-cuomo-adams-democrats.html",
    "summary": "Though Zohran Mamdani scored a resounding victory in New York City’s Democratic primary, some in his own party are strategizing about how to defeat him in November."
  },
  {
    "title": "It’s Hard to Create a Third Party, Even for Elon Musk",
    "link": "https://www.nytimes.com/2025/07/07/us/politics/elon-musk-third-party.html",
    "summary": "Building a viable new political party to rival the Democrats and Republicans is enormously difficult and expensive. Small wonder it hasn’t been done."
  },
  {
    "title": "Haiti’s Landmark Oloffson Hotel is Destroyed in an Apparent Arson Fire",
    "link": "https://www.nytimes.com/2025/07/07/world/americas/haiti-oloffson-hotel-fire-port-au-prince.html",
    "summary": "Haiti’s famed Oloffson Hotel, a cultural landmark and celebrity haven, was incinerated amid rising violence by gangs that control most of the country’s capital."
  },
  {
    "title": "TSA to End Shoe Removal Requirement at Airport Security Checkpoints",
    "link": "https://www.nytimes.com/2025/07/07/travel/tsa-shoes-removal-airport-security.html",
    "summary": "Most passengers had been required to remove their footwear at checkpoints since 2006, a policy later eased only for members of trusted traveler programs."
  },
  {
    "title": "The Brothers Who Came Face to Face in Myanmar’s War",
    "link": "https://www.nytimes.com/2025/07/08/world/asia/myanmar-civil-war-brothers.html",
    "summary": "Bloody conflict has splintered many families in Myanmar over the past four years. But for one set of siblings, a surprise reunion was joyful, if bittersweet."
  },
  {
    "title": "What to Know About P.O.W.s in Myanmar’s Brutal Civil War",
    "link": "https://www.nytimes.com/2025/07/08/world/asia/myanmar-pows-rebels.html",
    "summary": "As the rebels have gained ground, they have detained thousands of prisoners of war. Their enemy, the junta, keeps few captives."
  },
  {
    "title": "This Carmaker Embodies the Industrial Threat China Poses to the U.S.",
    "link": "https://www.nytimes.com/2025/07/08/opinion/byd-china-car-ev.html",
    "summary": "China’s national champion carmaker BYD embodies a state-led industrial model that America may no longer be able to compete with."
  },
  {
    "title": "The Ruthless Ambition of Stephen Miller",
    "link": "https://www.nytimes.com/2025/07/07/opinion/stephen-miller.html",
    "summary": "The most powerful man in the West Wing is getting what he wants. Is Trump?"
  },
  {
    "title": "Macron’s U.K. State Visit: Migrants and the War in Ukraine Are on the Agenda",
    "link": "https://www.nytimes.com/2025/07/08/world/europe/macron-starmer-france-uk-state-visit.html",
    "summary": "President Emmanuel Macron’s state visit to Britain, which begins Tuesday, will be heavy on pageantry. But both he and Prime Minister Keir Starmer hope for practical results."
  },
  {
    "title": "Why Are Protesters in Mexico City Angry at Remote Workers?",
    "link": "https://www.nytimes.com/2025/07/07/world/americas/mexico-city-protests-rent-prices-tourists.html",
    "summary": "Top concerns include the displacement of longtime residents as rents and food prices surge. Ire over the influx of well-heeled foreigners has been building for years."
  },
  {
    "title": "N.Y.P.D. Investigates the Death of an 18-Year-Old in a Bronx Police Station",
    "link": "https://www.nytimes.com/2025/07/07/nyregion/nypd-bronx-custody-death-saniyah-cheatham.html",
    "summary": "Saniyah Cheatham is said to have hanged herself early Saturday after she was arrested in an assault case. Friends said she had been in good spirits a day before."
  },
  {
    "title": "Caltech Settles Case Accusing It of Misleading Students",
    "link": "https://www.nytimes.com/2025/07/07/us/caltech-simplilearn-settlement-bootcamp.html",
    "summary": "A student who paid thousands for a tech boot camp said it was “a Caltech program in name only.”"
  }
]