[
  {
    "title": "In Crisis With Iran, U.S. Military Officials Focus on Strait of Hormuz",
    "link": "https://www.nytimes.com/2025/06/19/us/politics/iran-us-military-strait-of-hormuz.html",
    "summary": "Pentagon officials are trying to prepare for all of the ways Iran could retaliate, as President Trump hints at what he might do."
  },
  {
    "title": "Record Debt Limit Increase Would Break Republican Precedent",
    "link": "https://www.nytimes.com/2025/06/19/business/national-debt-limit-republicans.html",
    "summary": "A proposed $5 trillion debt limit increase could make it hard for Republicans to maintain their fiscal hawk credibility."
  },
  {
    "title": "‘Little Lobbyists’ Urge Senators to Oppose Trump’s Bill Cutting Medicaid",
    "link": "https://www.nytimes.com/2025/06/19/us/little-lobbyists-urge-senators-to-oppose-trumps-bill-cutting-medicaid.html",
    "summary": "Children with disabilities and their parents who rely on the health insurance program took to Capitol Hill this week to warn that the proposed reductions could be ‘devastating.’"
  },
  {
    "title": "William G. Young, a Reagan-Appointed Judge, Is Fast-Tracking Trump to Trial",
    "link": "https://www.nytimes.com/2025/06/18/us/politics/judge-william-g-young-trump.html",
    "summary": "Judge William G. Young’s long career has been punctuated by high-profile cases and outspoken advocacy for the judiciary’s value and fact-finding power."
  },
  {
    "title": "U.S. v. Skrmetti: How the Transgender Rights Movement Bet on the Supreme Court and Lost",
    "link": "https://www.nytimes.com/2025/06/19/magazine/scotus-transgender-care-tennessee-skrmetti.html",
    "summary": "The inside story of the case that could set the movement back a generation."
  },
  {
    "title": "What to Know About United States v. Skrmetti",
    "link": "https://www.nytimes.com/2025/06/19/magazine/transgender-supreme-court-skrmetti-takeaways.html",
    "summary": "A Times examination shows how a landmark case about gender-affirming care for minors was built on flawed politics and uncertain science."
  },
  {
    "title": "China Is Hacking Russia to Steal War Secrets",
    "link": "https://www.nytimes.com/2025/06/19/world/europe/china-hackers-russia-war-ukraine.html",
    "summary": "Since the war in Ukraine began, analysts have monitored a series of intrusions aimed at stealing information about weaponry and warfighting."
  },
  {
    "title": "No Rock Stars, No Mercedes: A Russian Expo Shows the Cost of Divorce With the West",
    "link": "https://www.nytimes.com/2025/06/19/world/europe/russia-ukraine-economic-forum-st-petersburg.html",
    "summary": "The annual economic forum in St. Petersburg used to yield multibillion-dollar deals and feature performances by global music stars. With the war in Ukraine still raging, the mood has shifted."
  },
  {
    "title": "‘SVU’ Star Mariska Hargitay on Her Mother Jayne Mansfield",
    "link": "https://www.nytimes.com/2025/06/19/movies/mariska-hargitay-mom-jayne-mansfield-documentary.html",
    "summary": "In a new documentary made by the “Law & Order: SVU” star, she examines her own clouded origins and the mother she barely knew: Jayne Mansfield."
  },
  {
    "title": "How Black Lung Came Roaring Back to Coal Country",
    "link": "https://www.nytimes.com/2025/06/19/well/black-lung-appalachia-coal-miners.html",
    "summary": "Once nearly eradicated, the “old man’s disease” is back and suffocating younger miners. Federal cuts risk putting a solution further out of reach."
  },
  {
    "title": "Fed’s Interest-Rate Approach Keeps It on Collision Course With Trump",
    "link": "https://www.nytimes.com/2025/06/19/business/fed-interest-rates-trump-powell.html",
    "summary": "The central bank signals little urgency to cut interest rates despite demands from President Trump for lower borrowing costs."
  },
  {
    "title": "Zero Interest Rates Are Back in Europe",
    "link": "https://www.nytimes.com/2025/06/19/business/zero-interest-rates-europe-trump.html",
    "summary": "The Swiss National Bank lowered rates to zero after consumer prices fell last month. Other European central banks are grappling with uncertainty caused by President Trump’s tariffs."
  },
  {
    "title": "U.S. Heat Wave Forecast: When High Temperatures Will Affect You",
    "link": "https://www.nytimes.com/2025/06/19/weather/us-heat-wave-midwest-northeast-forecast.html",
    "summary": "Friday is the first day of summer. And boy, will it feel like it."
  },
  {
    "title": "Hurricane Erick Makes Landfall in Mexico as a Major Storm",
    "link": "https://www.nytimes.com/2025/06/19/world/americas/hurricane-erick-mexico-landfall.html",
    "summary": "The hurricane had been a Category 4 storm as it bore down from the eastern Pacific toward Mexico. The authorities ordered evacuations in Oaxaca and Guerrero."
  },
  {
    "title": "Cannes Lions Festival Plays Host to a Messy Business Divorce",
    "link": "https://www.nytimes.com/2025/06/19/business/media/cannes-lions-uta-michael-kassan-medialink.html",
    "summary": "Michael Kassan, a ringmaster in the media industry, is going head to head at its top event with United Talent Agency, a company that has sued him."
  },
  {
    "title": "TikTok Hits Cannes, Where a U.S. Ban Seems a Distant Dream",
    "link": "https://www.nytimes.com/2025/06/19/business/media/tiktok-cannes-shou-chew.html",
    "summary": "TikTok executives hosted happy hours and played pickleball with influencers on the French Riviera this week, even as a U.S. ban loomed over the company."
  },
  {
    "title": "A Trump Executive Order Could Affect Ukrainian Refugees in Iowa",
    "link": "https://www.nytimes.com/2025/06/19/us/ukrainian-refugees-iowa-trump.html",
    "summary": "The Trump administration suspended a temporary humanitarian program for Ukrainians. Now many are losing their ability to work, and fear deportation."
  },
  {
    "title": "Vera Rubin Observatory Brings Universe’s Darkest Mysteries Into Focus",
    "link": "https://www.nytimes.com/2025/06/19/science/telescope-vera-rubin-dark-matter.html",
    "summary": "As the Vera C. Rubin Observatory surveys the night sky, astrophysicists expect to unlock the secrets of dark matter, dark energy and cosmic phenomena that go “bang!”"
  },
  {
    "title": "Belgian Nonprofit Papy Boom Is Helping Retirement-Home Residents Hit the Clubs",
    "link": "https://www.nytimes.com/2025/06/19/world/europe/papy-booom-brussels-seniors-nightclub-loneliness.html",
    "summary": "A group of Brussels retirement-home residents grooved to electronic music late one night as part of a program to fight loneliness among seniors."
  },
  {
    "title": "The Supreme Court Fails to See Transgender Teens",
    "link": "https://www.nytimes.com/2025/06/19/opinion/the-supreme-court-fails-to-see-transgender-teens.html",
    "summary": "The retrenchment on transgender rights is fueled by fear: fear of the future, fear of unfamiliar concepts, fear of not knowing one’s child."
  },
  {
    "title": "The Progressive Regulator Winning Over the Populist Right",
    "link": "https://www.nytimes.com/2025/06/19/opinion/lina-khan-monopolies-trump.html",
    "summary": "Lina Khan wants to overthrow “the autocrats of trade.”"
  },
  {
    "title": "A Legal Gamble",
    "link": "https://www.nytimes.com/2025/06/19/briefing/a-legal-gamble.html",
    "summary": "We explain the Supreme Court’s ruling on medical treatments for transgender kids."
  },
  {
    "title": "On Juneteenth, This Williamsburg Schoolhouse Finds a New Life",
    "link": "https://www.nytimes.com/2025/06/19/us/bray-school-virginia-juneteenth.html",
    "summary": "Beginning on Juneteenth, a restored Virginia schoolhouse where enslaved and free Black students were taught to read is on view in Colonial Williamsburg."
  },
  {
    "title": "Texas Might Ban Hemp",
    "link": "https://www.nytimes.com/2025/06/19/us/texas-hemp-ban.html",
    "summary": "Gov. Greg Abbott must decide this week whether to sign or veto a bill to ban hemp-derived intoxicants, part of a national debate over the fast-growing industry."
  },
  {
    "title": "Student Who Filmed Himself Raping at Least 10 Women Is Given Life Sentence",
    "link": "https://www.nytimes.com/2025/06/19/world/europe/chinese-student-rapist-uk.html",
    "summary": "Zou Zhenhao, 28, is considered by the police in London to be “one of the most prolific predators” they have encountered. Investigators say there are probably many more victims."
  },
  {
    "title": "The Crane That Ruined Florence’s Skyline Is Gone",
    "link": "https://www.nytimes.com/2025/06/19/world/europe/florence-crane-uffizi-gallery.html",
    "summary": "A reviled crane used during the expansion of the Uffizi Galleries was taken down this week after years of protests."
  }
]