[
  {
    "title": "Russia and Ukraine Agree: A Trump Summit Is a Big Win for Putin",
    "link": "https://www.nytimes.com/2025/08/14/world/europe/trump-putin-alaska-summit.html",
    "summary": "The talks on Friday in Alaska pull the Russian leader out of diplomatic isolation from the West, and Ukrainian and European leaders fear it gives him an opening to sway the American president."
  },
  {
    "title": "Why Does Trump Want to Meet With Putin, and What Are the Risks?",
    "link": "https://www.nytimes.com/2025/08/13/us/politics/trump-putin-alaska-meeting-stakes.html",
    "summary": "President Trump wants to be seen as a peacemaker, but the meeting comes with enormous stakes."
  },
  {
    "title": "As Trump Seizes D.C.’s Police, Critics Say He’s Undercut Its Ability to Fight Crime",
    "link": "https://www.nytimes.com/2025/08/14/us/politics/trump-washington-dc-crime-police.html",
    "summary": "The Trump administration has taken steps that have hobbled Washington’s efforts to reduce crime, such as gutting its U.S. attorney’s office and enacting budget cuts of more than $1 billion."
  },
  {
    "title": "Troops in Washington Remain Largely Unseen So Far",
    "link": "https://www.nytimes.com/2025/08/14/us/troops-washington-trump.html",
    "summary": "Federal agents are assisting the local police, but a surge in National Guard troops hasn’t hit the streets."
  },
  {
    "title": "Newsom Held an Event in L.A. Federal Immigration Agents Showed Up Outside.",
    "link": "https://www.nytimes.com/2025/08/14/us/newsom-la-immigration-agents.html",
    "summary": "The armed and masked agents assembled outside a museum where the governor was speaking in what Mayor Karen Bass of Los Angeles called “a provocative act.”"
  },
  {
    "title": "In L.A., Fear of ICE Raids Put the First Day of School On Edge",
    "link": "https://www.nytimes.com/2025/08/14/us/los-angeles-raids-school-patrols.html",
    "summary": "Officials and volunteers patrolled areas around schools, part of an effort to warn families about potential raids and reassure them that their children were safe at school."
  },
  {
    "title": "Texas Democrats Will Return Home, Allowing Vote on Congressional Map",
    "link": "https://www.nytimes.com/2025/08/14/us/texas-democrats-return.html",
    "summary": "The leader of Democrats in the Texas House said the battle over redistricting, which could determine control of Congress, is likely to continue in the courts."
  },
  {
    "title": "He Was Lost. Could a Shooting Range Like Thunder Ranch Help Him Find Himself?",
    "link": "https://www.nytimes.com/2025/08/14/us/men-shooting-range-thunder-ranch-guns.html",
    "summary": "Thunder Ranch is one of the best-known shooting schools in American gun culture, offering firearms as a way to change your life when all else fails."
  },
  {
    "title": "The Auctioneer and the Treasury Chief: Billy Long’s Quick Fall at the I.R.S.",
    "link": "https://www.nytimes.com/2025/08/14/us/politics/billy-long-scott-bessent-irs-treasury.html",
    "summary": "Treasury Secretary Scott Bessent sought total control over the I.R.S., an agency where Mr. Long, the new commissioner, had started to put his own mark on the job."
  },
  {
    "title": "Judge Blocks White House Effort to Defund Schools With D.E.I. Programs",
    "link": "https://www.nytimes.com/2025/08/14/us/politics/trump-dei-schools.html",
    "summary": "The Trump administration had asked states to certify that their schools did not practice “illegal D.E.I.” and threatened to cut off billions of dollars from schools that did not comply."
  },
  {
    "title": "PBS Slashes Budget by 21% After Federal Funding Cuts",
    "link": "https://www.nytimes.com/2025/08/14/business/pbs-budget-cuts.html",
    "summary": "The nonprofit will receive less revenue from its members, which are under pressure to make up for shortfalls of their own."
  },
  {
    "title": "Adams Pushes to Force Drug Users Off NYC Streets",
    "link": "https://www.nytimes.com/2025/08/14/nyregion/adams-involuntary-drugs-treatment.html",
    "summary": "As he runs a long-shot third-party bid for re-election, Mayor Eric Adams is proposing an aggressive approach, favored by conservatives, of combating open drug use."
  },
  {
    "title": "Eric Adams Vetoes Bill to Raise Wages for Instacart Workers",
    "link": "https://www.nytimes.com/2025/08/14/nyregion/eric-adams-veto-instacart.html",
    "summary": "The City Council is likely to override most of Mayor Eric Adams’s recent vetoes. Still, the mayor seems eager for a fight over bills affecting grocery delivery workers and street vendors."
  },
  {
    "title": "With ‘Zohran’s Law,’ Cuomo Wants to Limit Who Can Live in Rent-Stabilized Homes. How Would That Work?",
    "link": "https://www.nytimes.com/2025/08/14/nyregion/cuomo-mamdani-zohrans-law.html",
    "summary": "Former Gov. Andrew M. Cuomo’s proposal is a dig at Zohran Mamdani, his main opponent in the mayor’s race, but it could upend the housing search for middle-income New Yorkers."
  },
  {
    "title": "Fact-Checking Trump’s Epstein Defenses",
    "link": "https://www.nytimes.com/2025/08/14/us/politics/fact-check-trump-epstein.html",
    "summary": "In the face of mounting discontent over his administration’s handling of the Jeffrey Epstein files, President Trump has turned to deflection, denial and downplaying."
  },
  {
    "title": "A Timeline of What We Know About Trump and Epstein",
    "link": "https://www.nytimes.com/2025/07/17/us/politics/timeline-trump-epstein.html",
    "summary": "Donald Trump was friendly for at least 15 years with Jeffrey Epstein, the multimillionaire financier and convicted sex offender who died in jail in 2019."
  },
  {
    "title": "Plan for Israeli Settlements Advances and Will ‘Bury’ Palestinian Statehood, Minister Vows",
    "link": "https://www.nytimes.com/2025/08/14/world/middleeast/israel-smotrich-settlements-palestinian-state.html",
    "summary": "Bezalel Smotrich, the finance minister, said on Thursday that a plan to significantly expand a settlement near occupied East Jerusalem had won approval. But a procedural step remained."
  },
  {
    "title": "Toronto Film Festival Cancels Screenings of Israeli Documentary About Oct. 7 Attack",
    "link": "https://www.nytimes.com/2025/08/14/world/canada/tiff-israel-oct-7-documentary-canceled.html",
    "summary": "The event’s organizers said the producers of the film, which includes footage of atrocities recorded by Hamas fighters during the attack, had failed to obtain the rights to the videos."
  },
  {
    "title": "For Some Patients, the ‘Inner Voice’ May Soon Be Audible",
    "link": "https://www.nytimes.com/2025/08/14/science/brain-neuroscience-computers-speech.html",
    "summary": "In a recent study, scientists successfully decoded not only the words people tried to say but the words they merely imagined saying."
  },
  {
    "title": "Margaret Boden, Philosopher of Artificial Intelligence, Dies at 88",
    "link": "https://www.nytimes.com/2025/08/14/science/margaret-boden-dead.html",
    "summary": "A cognitive scientist, she used the language of computers to explore the nature of human thought and creativity, offering prescient insights about A.I."
  },
  {
    "title": "Revisiting Carrie Bradshaw’s Apartments in ‘Sex and the City’ and ‘And Just Like That’",
    "link": "https://www.nytimes.com/2025/08/14/realestate/carrie-bradshaw-apartments-sex-and-the-city.html",
    "summary": "The end of “And Just Like That …” means the end of a real estate portfolio that includes a cozy Upper East Side studio and a grand Gramercy townhouse."
  },
  {
    "title": "This Evangelical Pastor Wants to Replace Women’s Right to Vote",
    "link": "https://www.nytimes.com/2025/08/14/opinion/douglas-wilson-evangelical-hegseth.html",
    "summary": "Trump isn’t just shaping the nation; he’s also changing the evangelical church."
  },
  {
    "title": "America’s New Segregation",
    "link": "https://www.nytimes.com/2025/08/14/opinion/trump-democrats-resistance-reform.html",
    "summary": "To be one nation, we have to embrace ground-up social change."
  },
  {
    "title": "Trump Sought to Minimize Expectations for Putin Talks",
    "link": "https://www.nytimes.com/2025/08/14/briefing/trump-putin-talks-chronic-pain.html",
    "summary": "Also, an experimental treatment for chronic pain showed promise. Here’s the latest at the end of Thursday."
  },
  {
    "title": "What Do You Want to See in New York’s Future?",
    "link": "https://www.nytimes.com/2025/08/14/nyregion/future-of-new-york-reader-callouts.html",
    "summary": "We’ve been envisioning how some of today’s biggest dilemmas could transform the city. We’d like you to imagine with us."
  },
  {
    "title": "Big Tech’s A.I. Data Centers Are Driving Up Electricity Bills for Everyone",
    "link": "https://www.nytimes.com/2025/08/14/business/energy-environment/ai-data-centers-electricity-costs.html",
    "summary": "Electricity rates for individuals and small businesses could rise sharply as Amazon, Google, Microsoft and other technology companies build data centers and expand into the energy business."
  },
  {
    "title": "Phil Knight, Ex-Nike Chief, and His Wife Pledge $2 Billion to Oregon Cancer Center",
    "link": "https://www.nytimes.com/2025/08/14/us/phil-knight-nike-oregon-cancer-donation.html",
    "summary": "Oregon Health & Science University said the couple’s donation would be the largest single gift to a higher-learning institution in the United States."
  },
  {
    "title": "The U.S. Is Auctioning a Seized Russian Yacht. Will Anyone Buy It?",
    "link": "https://www.nytimes.com/2025/08/14/world/europe/russian-yacht-seized-sanctions-auction.html",
    "summary": "The Justice Department said the yacht, Amadea, was worth at least $300 million when it was seized in 2022 from a Russian oligarch. It’s unlikely to sell for that price."
  },
  {
    "title": "A 500-Year-Old Receipt for Supplies to Conquer an Empire Is Returned to Mexico",
    "link": "https://www.nytimes.com/2025/08/14/us/fbi-mexico-conquistador-cortes-document.html",
    "summary": "The document describes payments made for expedition supplies, and was signed by Hernán Cortés, who conquered the Aztecs."
  }
]