[
  {
    "title": "On a Quiet Southern Border, Empty Farms and Frightened Workers",
    "link": "https://www.nytimes.com/2025/06/27/us/politics/border-immigration-farms.html",
    "summary": "As federal immigration sweeps have prompted protests across the nation, the border is eerily quiet, as would-be migrants stay away and undocumented workers hide at home."
  },
  {
    "title": "Justice Dept. Says the Trump Administration Plans to Re-Deport Abrego Garcia",
    "link": "https://www.nytimes.com/2025/06/26/us/politics/justice-department-deport-abrego-garcia.html",
    "summary": "The assertion raised questions about how seriously the administration takes the criminal charges filed against the migrant. A White House official reiterated support for prosecuting him in America."
  },
  {
    "title": "The G.O.P. Scramble Over Trump’s Policy Bill, and Tracking Major Supreme Court Rulings",
    "link": "https://www.nytimes.com/2025/06/27/podcasts/the-headlines/trump-big-bill-supreme-court.html",
    "summary": "Plus, the Friday news quiz."
  },
  {
    "title": "With Flu Shot Vote, Kennedy’s Vaccine Skepticism Comes Full Circle",
    "link": "https://www.nytimes.com/2025/06/27/us/politics/rfk-jr-flu-vaccine-thimerosal.html",
    "summary": "The preservative thimerosal started Robert F. Kennedy Jr. down the path of questioning vaccine safety. A panel of experts he appointed will no longer recommend annual flu shots that contain it."
  },
  {
    "title": "Republicans Prepare to Open ‘Pandora’s Box’ of Budget Gimmicks",
    "link": "https://www.nytimes.com/2025/06/27/business/republican-policy-bill-budget.html",
    "summary": "With the broad tax and health care bill they are now trying to muscle into law, Senate Republicans are preparing to upend Washington’s accounting standards."
  },
  {
    "title": "Trump Justice Dept. Pressuring University of Virginia President to Resign",
    "link": "https://www.nytimes.com/2025/06/26/us/politics/university-of-virginia-president-trump.html",
    "summary": "The Justice Department has demanded that James E. Ryan step down to help resolve a civil rights investigation into the school, three people familiar with the matter said."
  },
  {
    "title": "Cuomo Doesn’t Blame Himself for Losing the Primary. Others Do.",
    "link": "https://www.nytimes.com/2025/06/27/nyregion/cuomo-mayor-campaign.html",
    "summary": "Even some of his supporters say Andrew M. Cuomo ran an aloof campaign for mayor that underestimated his chief rival, Zohran Mamdani."
  },
  {
    "title": "Right-wing Republicans in Congress attack Mamdani with Islamophobic comments.",
    "link": "https://www.nytimes.com/live/2025/06/26/us/trump-news/zohran-mamdani-congress-racism",
    "summary": "The responses to Zohran Mamdani’s showing in the New York City mayoral primary were the latest examples of how some G.O.P. lawmakers have grown more overt in using bigoted language and tropes."
  },
  {
    "title": "The Parents Who Helped Shape Zohran Mamdani’s Politics",
    "link": "https://www.nytimes.com/2025/06/26/nyregion/zohran-mamdani-parents-mira-nair.html",
    "summary": "Zohran Mamdani’s parents, a filmmaker and a professor, gave him the foundation for his run for mayor of New York. But their own political views may open him up to attacks."
  },
  {
    "title": "Mark Zuckerberg Ramps Up Meta’s A.I. Spending as Competition Heats Up",
    "link": "https://www.nytimes.com/2025/06/27/technology/mark-zuckerberg-meta-ai.html",
    "summary": "Unhappy with his company’s artificial intelligence efforts, Meta’s C.E.O. is on a spending spree as he reconsiders his strategy in the contest to invent a hypothetical “superintelligence.”"
  },
  {
    "title": "A.I. Frenzy Escalates as OpenAI, Amazon and Meta Supersize Spending",
    "link": "https://www.nytimes.com/2025/06/27/technology/ai-spending-openai-amazon-meta.html",
    "summary": "Companies like OpenAI, Amazon and Meta have supersized their spending on artificial intelligence, with no signs of slowing down."
  },
  {
    "title": "Supreme Court Blocks Planned Parenthood From Suing Over Medicaid Funds",
    "link": "https://www.nytimes.com/2025/06/26/us/supreme-court-planned-parenthood.html",
    "summary": "The question for the justices was whether Medicaid beneficiaries may sue to receive services under a law that lets them choose any qualified provider."
  },
  {
    "title": "Fate of Iran’s Enriched Uranium Is a Mystery",
    "link": "https://www.nytimes.com/2025/06/26/us/politics/iran-nuclear-program-uranium.html",
    "summary": "U.S. intelligence agencies had long assessed that, faced with the possibility of an attack on its nuclear facilities, Iran would try to move its stockpile."
  },
  {
    "title": "Iran’s Foreign Minister Says Nuclear Facilities ‘Seriously Damaged’",
    "link": "https://www.nytimes.com/2025/06/26/world/middleeast/iran-foreign-minister-nuclear-facilities-seriously-damaged.html",
    "summary": "The assessment came hours after the country’s supreme leader had downplayed the damage the U.S. strikes had caused."
  },
  {
    "title": "What We Know About the Fate of Iran’s Nuclear Program",
    "link": "https://www.nytimes.com/2025/06/26/world/middleeast/iran-nuclear-program-israeli-us-attacks.html",
    "summary": "President Trump’s claimed Iran’s capabilities were “obliterated.” The full extent of the damage is still emerging."
  },
  {
    "title": "How Trump Upended 60 Years of Civil Rights in Two Months",
    "link": "https://www.nytimes.com/2025/06/27/magazine/trump-civil-rights-law-discrimination.html",
    "summary": "An assault on federal protections may bring about a new era of unchecked discrimination."
  },
  {
    "title": "Trump’s Tariffs Have Unsettled Thailand’s Pet Food Exporters",
    "link": "https://www.nytimes.com/2025/06/27/business/thailand-pet-food-exports.html",
    "summary": "After rapid growth, Thailand is the biggest overseas supplier of pet food in the United States. Volatility in policy has some importers looking elsewhere."
  },
  {
    "title": "China Confirms Trade Framework With U.S. to Lift Export Controls",
    "link": "https://www.nytimes.com/2025/06/27/world/asia/us-china-trade.html",
    "summary": "The deal involves loosening exports of rare earths to the United States and the lifting of some restrictions on U.S. goods to China, China’s Ministry of Commerce said."
  },
  {
    "title": "He Searched for His Past in Children’s Books. He Found His Wife’s.",
    "link": "https://www.nytimes.com/2025/06/26/world/europe/uk-book-collector-wife.html",
    "summary": "Steve Mills has been collecting secondhand books in England to reawaken lost memories. His search revealed more about his family’s past than he thought possible."
  },
  {
    "title": "The Senate Should Let Trump’s Bill Die",
    "link": "https://www.nytimes.com/2025/06/27/opinion/trump-budget-big-beautiful-bill.html",
    "summary": "Debt payments already exceed military spending. The president’s bill will make things worse."
  },
  {
    "title": "How’s It Playing? POTUS Wants to Know.",
    "link": "https://www.nytimes.com/2025/06/27/opinion/trump-iran-israel-policy.html",
    "summary": "Foreign policy by FOMO is not a sustainable strategy."
  },
  {
    "title": "The Century’s Best Movies",
    "link": "https://www.nytimes.com/2025/06/27/briefing/the-centurys-best-movies.html",
    "summary": "We compiled the list by polling more than 500 people in and around the film industry."
  },
  {
    "title": "Diego Luna Gives Jimmy Kimmel the Gift of Fox News Coverage",
    "link": "https://www.nytimes.com/2025/06/27/arts/television/diego-luna-jimmy-kimmel-fox.html",
    "summary": "While filling in for Kimmel this week, the actor-director got the attention of Laura Ingraham, who said she’d never seen the show before."
  },
  {
    "title": "Starmer Backtracks on Planned Social Cuts, Raising Doubts About His Leadership",
    "link": "https://www.nytimes.com/2025/06/27/world/europe/uk-starmer-welfare-reversal.html",
    "summary": "The British prime minister had pressed ahead with the proposal despite pushback from within his party, but a parliamentary vote on it was expected to fail."
  },
  {
    "title": "A Runestone That May Be North America’s Oldest Turns Up in a Canada Forest",
    "link": "https://www.nytimes.com/2025/06/27/world/canada/canada-runestone-ontario.html",
    "summary": "Researchers spent years quietly studying a stone carved with 255 runes and the image of a boat found in northern Ontario. Now, revealing the stone’s existence, they’re asking the public for help."
  },
  {
    "title": "As Celebrities Arrive in Venice for the Jeff Bezos-Lauren Sánchez Wedding, Details Are Scant",
    "link": "https://www.nytimes.com/2025/06/26/style/jeff-bezos-lauren-sanchez-wedding-privacy.html",
    "summary": "As A-listers gather in Venice to celebrate the union of Jeff Bezos and Lauren Sánchez, the couple is following a familiar playbook of how to control the message."
  },
  {
    "title": "A Hospital Was in Critical Condition. Could $1.1 Billion Fix It?",
    "link": "https://www.nytimes.com/2025/06/27/nyregion/brooklyn-hospital-new-york-state-funding.html",
    "summary": "University Hospital at Downstate in Brooklyn faces many of the problems plaguing other medical centers in New York, but the state has reversed course and is investing in it."
  }
]