[
  {
    "title": "U.S. Forces Attacked in Syria, State Media Says",
    "link": "https://www.nytimes.com/2025/12/13/world/middleeast/us-forces-attacked-syria.html",
    "summary": "The Pentagon said two soldiers and a civilian interpreter were killed while supporting counterterror operations. They are the first U.S. casualties in Syria since the fall of the dictator Bashar al-Assad"
  },
  {
    "title": "Israel Says It Killed Senior Hamas Commander, Despite Cease-Fire",
    "link": "https://www.nytimes.com/2025/12/13/world/middleeast/israel-hamas-commander-gaza-strike.html",
    "summary": "Hamas said the attack on Saturday was a breach of the truce. The militant group did not comment on Israel’s claim to have killed one of its members."
  },
  {
    "title": "Can Trump’s Grand Plans for Gaza Get Off the Drawing Board?",
    "link": "https://www.nytimes.com/2025/12/13/world/middleeast/trump-gaza-plans-postwar.html",
    "summary": "The next steps for the president’s 20-point Gaza peace plan have been mired in uncertainty and a lack of detail, but that may be set to change. Here’s what to know."
  },
  {
    "title": "MAHA Moms Are Angry at the E.P.A. Lee Zeldin Is Trying to Win Them Back.",
    "link": "https://www.nytimes.com/2025/12/13/climate/maha-moms-epa-lee-zeldin.html",
    "summary": "A split is emerging within Trump’s base as health activists accuse Mr. Zeldin of leading the agency to prioritize chemical industry interests over public health."
  },
  {
    "title": "Trump’s ‘Pardon’ of Tina Peters Rejected by Colorado Officials",
    "link": "https://www.nytimes.com/2025/12/13/us/politics/trump-tina-peters.html",
    "summary": "The president’s stated intention to pardon Tina Peters, jailed for tampering with election machines in 2020, has set off a legal fight over the extent of Mr. Trump’s pardon powers."
  },
  {
    "title": "The Young Conservatives Fixated on H-1B Visas",
    "link": "https://www.nytimes.com/2025/12/13/style/h1b-visa-young-conservatives-maga.html",
    "summary": "For some Gen Z conservatives, H-1B visas are a hot new topic."
  },
  {
    "title": "Venezuela Oil Tanker Seized by U.S. Was Part of Effort to Finance Cuba",
    "link": "https://www.nytimes.com/2025/12/12/world/americas/venezuela-cuba-oil-tanker.html",
    "summary": "Firms with ties to Cuba are getting a larger share of Venezuelan oil exports, as the island’s security agents boost President Nicolás Maduro’s defenses."
  },
  {
    "title": "Biden Has Raised Little of What He Needs to Build a Presidential Library",
    "link": "https://www.nytimes.com/2025/12/13/us/politics/biden-presidential-library-delaware.html",
    "summary": "His library foundation has told the I.R.S. that by the end of 2027 it expects to bring in just $11.3 million — not nearly enough for a traditional presidential library."
  },
  {
    "title": "Russia Bombs Ukraine Port of Odesa Amid Peace Talks",
    "link": "https://www.nytimes.com/2025/12/13/world/europe/russia-ukraine-odesa-attack.html",
    "summary": "Much of Ukraine’s largest Black Sea port was without power, heat and water on Saturday after strikes from Russia, which has shown little appetite for a deal to end the war."
  },
  {
    "title": "Ivan Urgant Was Russia’s Late-Night King Until Putin’s War in Ukraine",
    "link": "https://www.nytimes.com/2025/12/13/world/europe/russia-ivan-urgant-late-night.html",
    "summary": "Ivan Urgant was an unstoppable Russian megastar. Then he expressed opposition to President Vladimir V. Putin’s invasion of Ukraine."
  },
  {
    "title": "Clean, Limitless Energy Exists. China Is Going Big in the Race to Harness It.",
    "link": "https://www.nytimes.com/2025/12/13/climate/china-us-fusion-energy.html",
    "summary": "Beijing is pouring vast resources into fusion research, while the U.S. wants private industry to lead the way. The winner could reshape civilization."
  },
  {
    "title": "We Should Teach Our Students How to Think, Not What to Believe",
    "link": "https://www.nytimes.com/2025/12/13/opinion/teachers-activists-censorship.html",
    "summary": "Gaza has turned California classrooms into political battlegrounds."
  },
  {
    "title": "Baby Steps",
    "link": "https://www.nytimes.com/2025/12/13/briefing/baby-steps.html",
    "summary": "The antidote to our increasingly disembodied lives may lie in letting go of our inhibitions and dancing like kids do."
  },
  {
    "title": "Woody Allen Is Not Sorry About His Friendship With Jeffrey Epstein",
    "link": "https://www.nytimes.com/2025/12/13/style/allen-epstein.html",
    "summary": "The nonagenarian director is taking a slightly different tack than many of the other powerful people associated with the disgraced former financier."
  },
  {
    "title": "Eric Adams Swaggered Into City Hall, and Now He’s Swaggering Out",
    "link": "https://www.nytimes.com/2025/12/13/nyregion/eric-adams-interview.html",
    "summary": "Interviewed as he prepares to leave office, Mayor Eric Adams said that he hadn’t gotten the credit he deserved and that certain forces had always been arrayed against him."
  },
  {
    "title": "Jo Ann Allen Boyce Dies at 84; Braved Mobs in Integrating a School",
    "link": "https://www.nytimes.com/2025/12/13/us/jo-ann-allen-boyce-dead.html",
    "summary": "She was one of the Clinton 12, Black students who broke a race barrier by entering a Tennessee high school in 1956 in the face of harassment by white segregationists."
  },
  {
    "title": "A Measles Outbreak Brings With It Echoes of the Pandemic",
    "link": "https://www.nytimes.com/2025/12/13/us/measles-outbreak-south-carolina-quarantine.html",
    "summary": "In South Carolina, parents struggle to deal with infections that have brought quarantines and remote learning. Health care workers are bracing for an increase in cases."
  }
]