[
  {
    "title": "A Sidelined Europe Seeks a Voice as Trump and Putin Prepare to Meet",
    "link": "https://www.nytimes.com/2025/08/09/world/europe/europe-ukraine-russia-us.html",
    "summary": "Ukraine and its allies are concerned that President Trump and President Vladimir V. Putin of Russia will do a deal without them and then try to impose it on Kyiv."
  },
  {
    "title": "Zelensky Rejects Ceding Territory to Russia After Trump Suggests a Land Swap",
    "link": "https://www.nytimes.com/2025/08/09/world/europe/zelensky-trump-ukraine-russia.html",
    "summary": "The Ukrainian leader’s blunt comments risk angering President Trump, who has made a peace deal between Ukraine and Russia one of his signature foreign policy goals."
  },
  {
    "title": "Russia Goes After Ukraine With Distant Strikes and New Tactics",
    "link": "https://www.nytimes.com/2025/08/09/world/europe/russia-ukraine-frontline.html",
    "summary": "Assaults on Ukraine have been intensifying even as President Trump has threatened new sanctions on Moscow, and now is preparing to meet with Russia’s leader."
  },
  {
    "title": "How a Top Mexican Cartel Smuggles Fentanyl to the U.S.",
    "link": "https://www.nytimes.com/2025/08/09/world/americas/fentanyl-us-mexico-route-cartel-smuggling.html",
    "summary": "New York Times reporters documented how fentanyl was concealed by Mexico’s most powerful criminal syndicate, which is adapting in the face of a crackdown by two governments."
  },
  {
    "title": "These Are Drug Cartels Designated as Terrorists by the U.S.",
    "link": "https://www.nytimes.com/2025/08/09/world/americas/drug-cartels-us-terrorist-designation.html",
    "summary": "President Trump has signed an order telling the Pentagon to begin using military force against certain criminal gangs that the United States has named terror organizations."
  },
  {
    "title": "Ousted F.D.A. Vaccine Chief Returns to Agency",
    "link": "https://www.nytimes.com/2025/08/09/us/politics/fda-vaccine-chief-returns.html",
    "summary": "Dr. Vinay Prasad’s rehiring was an unusual instance of a federal official targeted by the right-wing activist Laura Loomer being brought back into the Trump administration."
  },
  {
    "title": "Flattery, Lobbyists and a Business Deal: Crypto’s Richest Man Campaigns for a Pardon",
    "link": "https://www.nytimes.com/2025/08/09/us/politics/changpeng-zhao-pardon-trump.html",
    "summary": "A sophisticated operation is pushing President Trump to forgive Changpeng Zhao, which would boost the chances for his company, Binance, to break into the U.S. market."
  },
  {
    "title": "This Federal Judge Is the ‘Tip of the Spear’ of Trump-Era Conservatism",
    "link": "https://www.nytimes.com/2025/08/09/us/judge-ho-trump-border.html",
    "summary": "Judge James C. Ho has recast the role of jurist as a vociferous combatant in the culture wars. Could that be exactly what Trump is looking for?"
  },
  {
    "title": "Netanyahu Says Israel Wants ‘Arab Forces’ to Run Gaza. What Does That Mean?",
    "link": "https://www.nytimes.com/2025/08/09/world/middleeast/israel-gaza-arab-forces-postwar.html",
    "summary": "The Israeli cabinet agreed to Prime Minister Benjamin Netanyahu’s military plan, but the quandary of who will eventually govern Gaza remains intractable."
  },
  {
    "title": "This Blood Drive Might Be a Way into Hollywood’s Exclusive Magic Castle",
    "link": "https://www.nytimes.com/2025/08/09/style/magic-castle-la-blood-drive.html",
    "summary": "The Hollywood landmark has hosted blood drives since 2014. Donors do a good deed, but the perk is entry into the private club."
  },
  {
    "title": "The Head of the A.D.L. on Antisemitism, Anti-Zionism and Free Speech",
    "link": "https://www.nytimes.com/2025/08/09/magazine/jonathan-greenblatt-interview.html",
    "summary": "How Jonathan Greenblatt thinks about the line between legitimate protest and anti-Jewish hate."
  },
  {
    "title": "Gunman in Deadly C.D.C. Shooting Fixated on Covid Vaccine, Officials Say",
    "link": "https://www.nytimes.com/2025/08/09/us/gunman-cdc-shooting-vaccines.html",
    "summary": "The shooting in Atlanta, which killed a police officer, followed the spread of false information around Covid vaccines and animosity directed at the agency, public health workers say."
  },
  {
    "title": "C.D.C. Workers Say Shooting Manifests Worst Fears About Anger Among Public",
    "link": "https://www.nytimes.com/2025/08/09/us/politics/cdc-shooting-staff.html",
    "summary": "Employees expressed horror at a shooting at the agency’s headquarters, and some said they viewed it as part of a pattern of threats and assaults on health workers."
  },
  {
    "title": "How Older People Are Reaping Brain Benefits From New Tech",
    "link": "https://www.nytimes.com/2025/08/09/health/technology-cognition-older-people.html",
    "summary": "Overuse of digital gadgets harms teenagers, research suggests. But ubiquitous technology may be helping older Americans stay sharp."
  },
  {
    "title": "Alexa Got an A.I. Brain Transplant. How Smart Is It Now?",
    "link": "https://www.nytimes.com/2025/08/09/business/alexa-artificial-intelligence-amazon.html",
    "summary": "It took Amazon several years to overcome technical hurdles as it remade its voice assistant with new artificial intelligence technology."
  },
  {
    "title": "After a Young Arts Patron’s Donation Did Not Clear, He Was Found Dead",
    "link": "https://www.nytimes.com/2025/08/09/arts/music/met-opera-frick-donor-death.html",
    "summary": "Shortly before Matthew Christopher Pietras’s body was discovered, the Metropolitan Opera had been told that the $10 million he had just donated did not belong to him."
  },
  {
    "title": "Cuomo Opens Line of Attack Over Mamdani’s Rent-Stabilized Apartment",
    "link": "https://www.nytimes.com/2025/08/09/nyregion/cuomo-mamdani-apartment-rent-control.html",
    "summary": "The former governor’s post, written on X on Friday, reflected how he has adopted a stance of more aggressive, personal jabs."
  },
  {
    "title": "The Secret to One Swing State Democrat’s Rise? Wonky TikTok Videos.",
    "link": "https://www.nytimes.com/2025/08/09/us/north-carolina-attorney-general-jeff-jackson.html",
    "summary": "Jeff Jackson was elected to attorney general in North Carolina the same year that President Trump won the state for the third time. Supporters see lessons for Democrats in Mr. Jackson’s rise."
  },
  {
    "title": "Union Leaders Get Tough With Democrats as Members Drift Toward Trump",
    "link": "https://www.nytimes.com/2025/08/09/us/politics/democrats-labor-unions-nevada.html",
    "summary": "Doubtful that President Trump has their best interests in mind, top union officials are redoubling efforts to push the Democratic Party to appeal more to their rank and file."
  },
  {
    "title": "President Midas’ Terrible Touch",
    "link": "https://www.nytimes.com/2025/08/09/opinion/trump-design-rococo-gold.html",
    "summary": "He never promised us a Rose Garden."
  },
  {
    "title": "Losing Vision and Seeing a New World",
    "link": "https://www.nytimes.com/2025/08/09/opinion/vision-blindness-art.html",
    "summary": "Surrounded by the work of Impressionists who dedicated themselves to capturing felt experience rather than reality, I sensed that I would be OK with my altered sight."
  },
  {
    "title": "ICE Deported Him. His Father Heard Nothing for Months. Then, a Call.",
    "link": "https://www.nytimes.com/2025/08/09/nyregion/ice-deportation-el-salvador-venezuela.html",
    "summary": "Merwil Gutièrrez is one of many immigrants across the United States who have been taken into custody by federal authorities, their whereabouts unknown or unclear."
  },
  {
    "title": "What’s Behind the Thailand-Cambodia Conflict",
    "link": "https://www.nytimes.com/video/world/asia/100000010327404/whats-behind-the-thailand-cambodia-conflict.html",
    "summary": "A series of border skirmishes between Thailand and Cambodia escalated into a military conflict in July that killed dozens of people and rattled the region. As negotiations take place, Sui-Lee Wee, The New York Times’s Southeast Asia bureau chief, talks to Katrin Bennhold, a senior writer on the International desk, about the context behind the evolving dispute."
  },
  {
    "title": "How the U.S. and Mexico Are Fighting Deadly Flesh-Eating Screwworms",
    "link": "https://www.nytimes.com/2025/08/09/us/screwworm-cattle-gene-editing.html",
    "summary": "The American and Mexican governments are exploring “all options” to battle a deadly parasite threatening cattle and wildlife."
  },
  {
    "title": "Petunia Wins the Ugliest Dog Contest by Being Loved, Not by Looking Perfect",
    "link": "https://www.nytimes.com/2025/08/09/us/worlds-ugliest-dog-2025-winner.html",
    "summary": "Rescued from neglect, the hairless bulldog claimed the World’s Ugliest Dog Contest title on Friday but her prize came long before the competition results were announced."
  },
  {
    "title": "Times Square Shooting Leaves 3 Injured and a Suspect Is in Custody",
    "link": "https://www.nytimes.com/2025/08/09/nyregion/times-square-nyc-shooting.html",
    "summary": "A 17-year-old boy was charged on Saturday in connection with the shooting, which left three people hospitalized, the police said."
  }
]