[
  {
    "title": "Gazans Are Dying of Starvation",
    "link": "https://www.nytimes.com/2025/07/24/world/middleeast/gaza-starvation.html",
    "summary": "Severe hunger has gripped the war-torn Palestinian enclave, where growing numbers of people are starving and the doctors treating them are working on empty stomachs."
  },
  {
    "title": "Trump’s Name in the Epstein Files, and Rare Protests in Ukraine",
    "link": "https://www.nytimes.com/2025/07/24/podcasts/the-headlines/trump-epstein-files-ukraine-protests.html",
    "summary": "Plus, how many steps do you really need a day?"
  },
  {
    "title": "In Epstein, Democrats Find Weapon Against Trump and Republicans",
    "link": "https://www.nytimes.com/2025/07/24/us/politics/epstein-democrats-republicans.html",
    "summary": "A conspiracy theory many of them once dismissed has given Democrats a potent tool for exploiting G.O.P. divisions, even if it has little to do with what many regard as their best line of attack against Republicans."
  },
  {
    "title": "Bondi Told Trump His Name Appeared in Epstein Files",
    "link": "https://www.nytimes.com/2025/07/23/us/politics/trump-epstein-files-named.html",
    "summary": "It was not clear what those documents were, or in what context the president’s name was raised."
  },
  {
    "title": "Gabbard Releases New Documents Targeting Obama Administration, as Justice Dept. Forms Task Force",
    "link": "https://www.nytimes.com/2025/07/23/us/politics/trump-russia-obama-gabbard.html",
    "summary": "The director of national intelligence intensified attacks on assessments about Russia’s role in the 2016 presidential election."
  },
  {
    "title": "Columbia Agrees to $200 Million Fine to Settle Fight With Trump",
    "link": "https://www.nytimes.com/2025/07/23/nyregion/columbia-trump-funding-deal.html",
    "summary": "The White House had canceled more than $400 million in research funding to the university, saying it had failed to protect Jewish students from harassment."
  },
  {
    "title": "Columbia’s Deal With Trump: What We Know",
    "link": "https://www.nytimes.com/2025/07/23/nyregion/columbia-trump-settlement-what-to-know.html",
    "summary": "The university entered into an agreement to settle claims that it allegedly violated federal anti-discrimination laws."
  },
  {
    "title": "How a Chinese Border Town Keeps Russia’s Economy Afloat",
    "link": "https://www.nytimes.com/2025/07/24/business/manzhouli-china-russia-economy.html",
    "summary": "The flow of goods in Manzhouli, China’s main border crossing with Russia, underscores increasingly close ties between the two countries, complicating China’s relationship with Europe."
  },
  {
    "title": "South Korea Jockeys for a Deal With Trump at Least as Good as Japan’s",
    "link": "https://www.nytimes.com/2025/07/24/business/south-korea-trump-tariffs.html",
    "summary": "The agreement Japan secured has added pressure on South Korea to defuse the threat of high tariffs on its exports to the United States."
  },
  {
    "title": "Chinese and European Leaders Agree on Climate but Not Much Else",
    "link": "https://www.nytimes.com/2025/07/23/business/china-eu-trade-ukraine.html",
    "summary": "European Union officials and China’s top leaders arrived at a summit in Beijing split over trade. They came together on the need to address climate change."
  },
  {
    "title": "How Trump’s Japan Deal Could Give Japanese Cars a Leg Up in the U.S.",
    "link": "https://www.nytimes.com/2025/07/24/business/trump-japan-trade-deal-cars.html",
    "summary": "President Trump’s 15 percent tariff on cars from Japan has angered U.S. automakers, which make cars in Canada and Mexico subject to 25 percent tariffs."
  },
  {
    "title": "What to Know About the Thailand-Cambodia Clash",
    "link": "https://www.nytimes.com/2025/07/24/world/asia/thailand-cambodia-border-fight.html",
    "summary": "The countries traded fire across their shared border on Thursday. Thailand said at least 11 civilians and one soldier had been killed, while Cambodia did not immediately comment on any casualties."
  },
  {
    "title": "Trump’s A.I. Challenge: Focus on Weapon Concerns or Woke-ism?",
    "link": "https://www.nytimes.com/2025/07/23/us/politics/trump-ai-nuclear-weapons.html",
    "summary": "In the Biden era, the government feared AI models would guide the spread of chemical, biological or nuclear weapons. President Trump signed an order on “Preventing Woke A.I. in the Federal Government.”"
  },
  {
    "title": "The Chatbot Culture Wars Are Here",
    "link": "https://www.nytimes.com/2025/07/23/technology/trump-ai-chatbots-bias.html",
    "summary": "Conservatives, including President Trump, are accusing A.I. companies of left-wing bias, following a playbook that worked well against social media platforms."
  },
  {
    "title": "How an M&M Sparked the Search for the Next Perfect Peanut",
    "link": "https://www.nytimes.com/2025/07/24/dining/peanut.html",
    "summary": "With funding from the candy giant Mars, scientists at the University of Georgia are genetically designing a peanut that can thrive in a changing climate."
  },
  {
    "title": "Democrats Have Few Tools to Counter G.O.P. Redistricting",
    "link": "https://www.nytimes.com/2025/07/24/us/politics/texas-redistricting-republicans-democrats.html",
    "summary": "A plan in Texas that could give Republicans at least five more House seats has Democrats fuming, and without many paths to fight it."
  },
  {
    "title": "Do Democrats Want a Fight Over Colbert?",
    "link": "https://www.nytimes.com/2025/07/23/us/politics/colbert-trump-democrats.html",
    "summary": "Some Democrats are irate over the end of Stephen Colbert’s show, but others see a lack of focus on real issues."
  },
  {
    "title": "Opendoor and Krispy Kreme Are Part of a New Generation of Meme Stocks",
    "link": "https://www.nytimes.com/2025/07/24/business/opendoor-krispy-kreme-meme-stocks.html",
    "summary": "A new generation of meme stocks are soaring and falling again."
  },
  {
    "title": "How to Host a Hamptons Gala for the Super-Rich",
    "link": "https://www.nytimes.com/2025/07/24/nyregion/parrish-museum-hamptons-gala.html",
    "summary": "Facing federal funding cuts, the Parrish Art Museum is among the institutions increasingly relying on elaborate parties to lure the nation’s elites to pitch in."
  },
  {
    "title": "Colbert’s Ouster Was Just Another Late-Night Death Rattle",
    "link": "https://www.nytimes.com/2025/07/24/opinion/colbert-fired-cbs-paramount.html",
    "summary": "What happened to Stephen Colbert is a harbinger of what’s to come for Jimmy Fallon, Jimmy Kimmel and Seth Meyers, I’m sorry to say."
  },
  {
    "title": "What’s in a Name?",
    "link": "https://www.nytimes.com/2025/07/24/briefing/whats-in-a-name.html",
    "summary": "All politicians try to play the frame game. President Trump is a master at it."
  },
  {
    "title": "Late Night Comedians Revel in the Latest Trump-Epstein Development",
    "link": "https://www.nytimes.com/2025/07/24/arts/television/late-night-trump-epstein.html",
    "summary": "Stephen Colbert feigned surprise at reports that the president had already been told he was in the Epstein files: “But he said he hardly knew the guy!”"
  },
  {
    "title": "Plane With 49 Onboard Crashes in Russia’s Far East",
    "link": "https://www.nytimes.com/2025/07/24/world/europe/plane-crash-russia.html",
    "summary": "The plane was traveling to the town of Tynda when it went off the radar, the regional governor said."
  },
  {
    "title": "Prosecutor Fired by Trump Officials Defiantly Says She Is Set to Take Job",
    "link": "https://www.nytimes.com/2025/07/23/nyregion/desiree-grace-new-jersey-us-attorney.html",
    "summary": "Desiree Grace, in a social media post, said she was prepared to follow a judicial order and take over as U.S. attorney in New Jersey “in accordance with the law.”"
  },
  {
    "title": "Spain Is Reluctant to Spend More on Security Despite NATO Pressure",
    "link": "https://www.nytimes.com/2025/07/24/world/europe/spain-nato-spending-weapons.html",
    "summary": "Spain was the only NATO ally not to commit to a large increase in military expenditures. Its embrace of a social safety net is a key reason."
  },
  {
    "title": "Why One of the Causes of Falling Birthrates May Be Prosperity",
    "link": "https://www.nytimes.com/2025/07/24/world/falling-birthrates-economic-growth-pronatalism.html",
    "summary": "Economic growth has the unintended side effects of making parenthood more difficult and expensive."
  }
]