[
  {
    "title": "How Delcy Rodríguez, Venezuela’s Leader, Became Vital to Trump’s Plans for the Country",
    "link": "https://www.nytimes.com/2026/01/10/world/americas/delcy-rodriguez-venezuela-economy-trump.html",
    "summary": "Delcy Rodríguez, a guerrilla’s daughter, started out as a provocateur. She pivoted to revive a ravaged economy, making her vital to U.S. plans to run Venezuela."
  },
  {
    "title": "Trump’s $100 Billion Venezuela Oil Plan Gets a Cool Reception",
    "link": "https://www.nytimes.com/2026/01/09/business/energy-environment/trump-venezuela-oil-executives.html",
    "summary": "President Trump met with oil and gas executives on Friday in an effort to push them to invest money in Venezuela, a plan many of them are reluctant to embrace."
  },
  {
    "title": "A (Lawyerly) Spat Erupts Over the Defense of Nicolás Maduro",
    "link": "https://www.nytimes.com/2026/01/10/nyregion/nicolas-maduro-lawyers.html",
    "summary": "Disputes among lawyers are not exactly rare, but in the case of Mr. Maduro, the captive leader of Venezuela, the stakes are high and the interested parties are many."
  },
  {
    "title": "Inside Iran’s Protests: How a Plunging Currency Set Off Wide Unrest",
    "link": "https://www.nytimes.com/2026/01/10/world/europe/iran-protests-economy-currency-collapse.html",
    "summary": "In a serious challenge to Iran’s authoritarian government, angry protests have spread from the markets and universities of major cities to the impoverished towns in the hinterland."
  },
  {
    "title": "Iran Braces for More Protests: What to Know",
    "link": "https://www.nytimes.com/article/iran-protests-inflation-currency.html",
    "summary": "Demonstrations that began as outrage at the state of the economy have spread to cities across the country, amid an escalating crackdown by the authorities."
  },
  {
    "title": "Trump Eyes Greenland, and Europe Figures Its Best Bet Is a Negotiation",
    "link": "https://www.nytimes.com/2026/01/10/world/europe/trump-greenland-europe.html",
    "summary": "European officials were stunned that President Trump restated his desire for Greenland after a yearlong effort to dissuade him, according to diplomats and others."
  },
  {
    "title": "Why Putin Went Quiet When Challenged by Trump Over Venezuela",
    "link": "https://www.nytimes.com/2026/01/10/world/europe/trump-putin-venezuela.html",
    "summary": "For the Russian leader, courting President Trump to secure a favorable resolution in Ukraine, and possibly more, is far more important."
  },
  {
    "title": "Trump’s Steep Science Budget Cuts to Be Turned Back by Congress",
    "link": "https://www.nytimes.com/2026/01/10/science/trump-science-budget-cuts-congress.html",
    "summary": "After the White House called for billions of dollars in funding reductions, senators and representatives are rescinding the proposed cuts and even boosting funds for basic research."
  },
  {
    "title": "Judge Blocks Trump Officials From Freezing Billions in Social Services Funds",
    "link": "https://www.nytimes.com/2026/01/09/us/politics/trump-child-care-funding-freeze.html",
    "summary": "The ruling temporarily halted plans to freeze more than $10 billion in funds for anti-poverty programs bound for five Democratic-led states."
  },
  {
    "title": "What Happens if ICE Agents and Local Police Stop Getting Along?",
    "link": "https://www.nytimes.com/2026/01/10/us/federal-agents-law-enforcement-trump.html",
    "summary": "Cooperation among law enforcement agencies is critical to many investigations, experts say. After a series of shootings by immigration agents, the relationship is showing cracks."
  },
  {
    "title": "New Cellphone Video Shows ICE Agent’s Perspective Before Minneapolis Shooting",
    "link": "https://www.nytimes.com/2026/01/09/us/ice-agent-video-minneapolis-shooting.html",
    "summary": "The Department of Homeland Security posted a clip of the video on social media and said it was taken by the agent, who killed a 37-year-old woman in the shooting."
  },
  {
    "title": "She Was Born Two Days Before the Altadena Fire Took Her Home",
    "link": "https://www.nytimes.com/2026/01/10/us/eaton-fire-altadena-la-family.html",
    "summary": "She was the family’s first baby in 16 years. And she came into their world as the Altadena fire changed everything. They struggled for months to find housing, stability and peace."
  },
  {
    "title": "What Would Peace on Immigration Look Like?",
    "link": "https://www.nytimes.com/2026/01/10/opinion/ice-shooting-minneapolis-equilibrium.html",
    "summary": "A tough issue for stabilization in our politics and public institutions."
  },
  {
    "title": "The ‘Attention Economy’ Is a Lie",
    "link": "https://www.nytimes.com/2026/01/10/opinion/attention-world-war-2-technology-nazis.html",
    "summary": "It started in a laboratory. No one could have predicted where it would end."
  },
  {
    "title": "Acquired Tastes",
    "link": "https://www.nytimes.com/2026/01/10/briefing/acquired-tastes.html",
    "summary": "The dream of cohabitating with a group of friends is an attractive fantasy, but we can benefit from its lessons, regardless of our living situation."
  },
  {
    "title": "Do You Frequently Order Food Delivery? We Want to Hear From You.",
    "link": "https://www.nytimes.com/2026/01/09/dining/food-delivery-user-questions.html",
    "summary": "Your responses can help as we report on the immense growth of food delivery and its effects on how we live."
  },
  {
    "title": "What It Takes to Drill Into an Antarctic Glacier",
    "link": "https://www.nytimes.com/video/climate/100000010631924/what-it-takes-to-drill-into-an-antarctic-glacier.html",
    "summary": "Our climate reporter Raymond Zhong meets with Paul Anker, a drilling engineer aboard the icebreaker Araon, to discuss the stakes, preparations and pressure of the mission to drill a hole in the Thwaites Glacier to measure the water beneath."
  },
  {
    "title": "For Mamdani, 2 Contentious Hires Yield 2 Different Outcomes",
    "link": "https://www.nytimes.com/2026/01/10/nyregion/mamdani-cea-weaver-cat-da-costa.html",
    "summary": "The past social media posts of two hires have led to a public debate about how much the new mayor is willing to tolerate."
  },
  {
    "title": "Bird Flu Viruses Raise Mounting Concerns Among Scientists",
    "link": "https://www.nytimes.com/2026/01/10/health/bird-flu-viruses-health.html",
    "summary": "Researchers are not just worried about the virus popping up on American farms. Other types are causing trouble around the world."
  },
  {
    "title": "Six Dead in Mississippi Shooting; Suspect in Custody, Clay County Sheriff Says",
    "link": "https://www.nytimes.com/2026/01/10/us/shooting-west-point-mississippi.html",
    "summary": "In a social media post, the Clay County sheriff said that “multiple innocent lives were lost” and that one person was in custody."
  },
  {
    "title": "Gavin Newsom on Democrats, 2028 and His Fruit-Only Breakfasts",
    "link": "https://www.nytimes.com/2026/01/09/us/politics/gavin-newsom-california-democrats.html",
    "summary": "The California governor is powered by smoothies and bursting with thoughts about U.S. politics."
  }
]