[
  {
    "title": "Under Trump, U.S. Adds Fuel to a Heating Planet",
    "link": "https://www.nytimes.com/2026/01/12/climate/under-trump-us-adds-fuel-to-a-heating-planet.html",
    "summary": "The president’s embrace of fossil fuels and withdrawal from the global fight against climate change will make it hard to keep warming at safe levels, scientists said."
  },
  {
    "title": "Federal Prosecutors Open Investigation Into Fed Chair Powell",
    "link": "https://www.nytimes.com/2026/01/11/us/politics/jerome-powell-fed-inquiry-trump.html",
    "summary": "The investigation, which is said to center on renovations of the Federal Reserve’s headquarters in Washington, signals an escalation in the long-running clash between President Trump and the chair."
  },
  {
    "title": "Two Hours, Scores of Questions, 23,000 Words: Our Interview With President Trump",
    "link": "https://www.nytimes.com/2026/01/11/us/politics/trump-interview-transcript.html",
    "summary": "Four New York Times reporters pressed Mr. Trump about a range of topics in a nearly two-hour interview. Here is a transcript of their conversation."
  },
  {
    "title": "Trump Says Civil Rights Led to White People Being ‘Very Badly Treated’",
    "link": "https://www.nytimes.com/2026/01/11/us/politics/trump-interview-white-people-discrimination.html",
    "summary": "President Trump’s comments were a blunt distillation of his administration’s racial politics, which rest on the belief that white people have become the real victims of discrimination in America."
  },
  {
    "title": "The Justice Department’s New Target in D.C., and a Surge of Federal Agents in Minnesota",
    "link": "https://www.nytimes.com/2026/01/12/podcasts/the-headlines/jerome-powellfederal-agents-minnesota.html",
    "summary": "Plus, Russia’s push to indoctrinate Ukrainian kids."
  },
  {
    "title": "As Death Toll Surges in Iran, Leaders Take Tough Line Against Protesters",
    "link": "https://www.nytimes.com/2026/01/11/world/middleeast/iran-president-protests-economy-response.html",
    "summary": "Despite an internet blackout, reports are emerging of a rise in deadly violence as protests spurred by economic woes have snowballed into a mass movement."
  },
  {
    "title": "Iran Prepared for War but Ready to Negotiate With U.S., Foreign Minister Says",
    "link": "https://www.nytimes.com/2026/01/12/world/middleeast/iran-protests-trump-us.html",
    "summary": "The comments came after President Trump said he was “ looking at some very strong options” to curb Iran’s harsh repression of antigovernment protests."
  },
  {
    "title": "Deposed Shah’s Son Hopes Trump Will Put Iran Regime ‘Down for Good’",
    "link": "https://www.nytimes.com/2026/01/11/world/europe/iran-protests-shah-son-trump.html",
    "summary": "Reza Pahlavi, once the crown prince of Iran, says protesters there have been emboldened by President Trump suggesting that he could take military action."
  },
  {
    "title": "U.S. Citizens Are Joining the Military to Protect Undocumented Parents",
    "link": "https://www.nytimes.com/2026/01/12/us/politics/oregon-guard-undocumented-parents.html",
    "summary": "Amid an ICE crackdown in her area, an Oregon National Guard recruiter offers U.S. citizens a way to save their immigrant parents."
  },
  {
    "title": "A Push to Expand the Rights of Immigrants in Defiance of Trump",
    "link": "https://www.nytimes.com/2026/01/12/nyregion/immigration-policy-new-jersey.html",
    "summary": "An effort by New Jersey Democrats is seen as a provocative statement of principle in a state with the country’s second largest percentage of immigrants, after California."
  },
  {
    "title": "What We Know About the Fatal ICE Shooting in Minneapolis",
    "link": "https://www.nytimes.com/2026/01/07/us/ice-shooting-minneapolis-renee-good.html",
    "summary": "Thousands of people rallied across the country this weekend to protest the fatal shooting of Renee Good, a 37-year-old Minneapolis woman, by a federal agent."
  },
  {
    "title": "Russian Missiles Failed in Venezuela During U.S. Attack",
    "link": "https://www.nytimes.com/2026/01/12/world/americas/venezuela-russian-weapons-fail.html",
    "summary": "The Venezuelan regime had high-powered air defense systems from its allies in the Kremlin, but failed to set much of it up."
  },
  {
    "title": "Nikki Glaser’s Monologue, Teyana Taylor’s Speech and Other Moments From the 2026 Globes",
    "link": "https://www.nytimes.com/2026/01/12/movies/golden-globes-best-worst-moments.html",
    "summary": "Nikki Glaser returned as host and killed, while Teyana Taylor delivered the speech of the night. Then there were those awful production choices."
  },
  {
    "title": "Golden Globe Awards 2026: Best Looks From Teyana Taylor, Jennifer Lawrence and More",
    "link": "https://www.nytimes.com/2026/01/12/style/golden-globes-red-carpet-2026-most-stylish.html",
    "summary": "Sheer gowns, slouchy tuxedos, chunky-soled boots and more."
  },
  {
    "title": "Golden Globes Winners 2026: Full List Including ’One Battle After Another,’ ‘Sinners’ and ‘Adolescence’",
    "link": "https://www.nytimes.com/2026/01/11/movies/golden-globes-winners-list.html",
    "summary": "The winning films, TV shows, actors and production teams at the 2026 Golden Globe Awards."
  },
  {
    "title": "Golden Globes 2026 Photos: Stars of ‘Hamnet,’ ‘One Battle After Another’ and More",
    "link": "https://www.nytimes.com/2026/01/11/movies/golden-globes-awards-2026-photos.html",
    "summary": "Our photographer is capturing behind-the-scenes moments with stars at Sunday night’s awards show."
  },
  {
    "title": "Supreme Court to Consider West Virginia’s Trans Athlete Law. It Applies to One Girl.",
    "link": "https://www.nytimes.com/2026/01/12/us/politics/supreme-court-transgender-sports.html",
    "summary": "The Supreme Court on Tuesday will hear a case that could affect laws in 27 states that bar transgender athletes from joining girls’ and women’s sports teams."
  },
  {
    "title": "Nearly 15,000 Nurses Go on Strike at Major New York City Hospitals",
    "link": "https://www.nytimes.com/2026/01/12/nyregion/nurses-strike-hospitals-nyc.html",
    "summary": "Workers are demanding more robust staffing levels and higher pay. The strike comes three years after a smaller job action won significant gains."
  },
  {
    "title": "Mamdani’s Schools Chief Begins Shaping Agenda Around Rigor and Equity",
    "link": "https://www.nytimes.com/2026/01/12/nyregion/mamdanis-schools-chief-samuels-agenda.html",
    "summary": "In his first week on the job, Kamar H. Samuels started to sketch out his priorities for leading America’s largest school system."
  },
  {
    "title": "Mayor Mamdani Is Moving On Up to Gracie Mansion",
    "link": "https://www.nytimes.com/2026/01/11/nyregion/mamdani-gracie-mansion-nyc.html",
    "summary": "Mayor Zohran Mamdani and his wife, Rama Duwaji, have begun moving their belongings from their Queens apartment to the official mayor’s residence in Manhattan."
  },
  {
    "title": "How the MAGA Plan to Control TV Triggered a Free-Speech Fight",
    "link": "https://www.nytimes.com/2026/01/12/magazine/fcc-tv-networks.html",
    "summary": "Under Trump, the F.C.C. has used obscure regulatory powers to crack down on network TV. Some conservatives are pushing back."
  },
  {
    "title": "Trump Wants Greenland — but He’s Not Alone in the Arctic Tug of War",
    "link": "https://www.nytimes.com/2026/01/11/world/europe/svalbard-norway-arctic-control.html",
    "summary": "For decades, an Arctic archipelago called Svalbard has served as a rare refuge of international cooperation. Those days are over."
  },
  {
    "title": "How Mississippi Transformed Its Schools From Worst to Best",
    "link": "https://www.nytimes.com/2026/01/11/us/mississippi-schools-transformation.html",
    "summary": "Since 2013, Mississippi has skyrocketed on national tests, while blue states lag. What is it doing right?"
  },
  {
    "title": "The Battle Over House Maps Spills Into 2026, Where an X-Factor Awaits",
    "link": "https://www.nytimes.com/2026/01/12/us/politics/gerrymandering-redistricting-virginia-florida-maryland.html",
    "summary": "As the race to gerrymander House districts narrows to a few states, Democrats are trying to go on offense. But a Supreme Court ruling could give Republicans a major edge."
  },
  {
    "title": "How Pete Wells, Former New York Times Restaurant Critic, Made His Kitchen Healthier",
    "link": "https://cooking.nytimes.com/article/pete-wells-kitchen-health-cooking",
    "summary": "In the second part of a monthlong series, Pete Wells and experts say the easiest way to a better diet is to surround yourself with the right foods."
  },
  {
    "title": "The Rare Republican Who Brawls With Trump — and Is Ready for More",
    "link": "https://www.nytimes.com/2026/01/12/opinion/thomas-massie-kentucky-trump-republicans.html",
    "summary": "Thomas Massie says his primary against a Trump-supported challenger will be a referendum on whether you can “have a thought that diverges from the president’s.”"
  },
  {
    "title": "This Rural Congresswoman Thinks Democrats Have Lost Their Minds. She Has a Point.",
    "link": "https://www.nytimes.com/2026/01/12/opinion/marie-gluesenkamp-perez.html",
    "summary": "Marie Gluesenkamp Perez thinks too many members of her party miss what’s really driving the alienation and anger in our society."
  },
  {
    "title": "Once Again, Oldest Mississippi Synagogue Is Attacked With Fire",
    "link": "https://www.nytimes.com/2026/01/11/us/mississippi-synagogue-arson-attack-suspect.html",
    "summary": "A suspect was in custody and charged with arson and accused of setting the Saturday morning fire. It’s not the first time the Beth Israel house of worship has been attacked."
  },
  {
    "title": "Bob Weir Was the Dead’s Invisible Thread",
    "link": "https://www.nytimes.com/2026/01/11/arts/music/bob-weir-grateful-dead-remembered.html",
    "summary": "The songwriter, guitarist and singer, who died at 78, animated the Grateful Dead from within."
  },
  {
    "title": "Victoria and Michael Wolff Document Their Lifestyle in ‘Our Amagansett House’",
    "link": "https://www.nytimes.com/2026/01/06/style/michael-wolff-victoria-wolff-our-amagansett-house.html",
    "summary": "The author and Trump antagonist Michael Wolff has his wife, Victoria, to thank for his latest chapter: lifestyle influencer. Now she’s becoming one, too."
  },
  {
    "title": "New Children’s Vaccine Schedule May Not Be the Last of RFK Jr.’s Big Changes",
    "link": "https://www.nytimes.com/2026/01/11/health/kennedy-vaccines-children.html",
    "summary": "Comments by Robert F. Kennedy Jr. and his allies suggest the revised schedule may presage an approach to immunization that prizes individual autonomy and downplays scientific expertise."
  }
]