[
  {
    "title": "The Lessons of Trump’s Fight With Los Angeles Over Immigration",
    "link": "https://www.nytimes.com/2025/06/21/magazine/trump-los-angeles-immigration.html",
    "summary": "The president’s clashes with Los Angeles over immigration were a decade in the making — and their outcome remains unclear."
  },
  {
    "title": "Mahmoud Khalil Returns to New York After Months in Detention",
    "link": "https://www.nytimes.com/2025/06/21/nyregion/mahmoud-khalil-return-to-new-york.html",
    "summary": "The Trump administration remains committed to deporting Mr. Khalil, a Columbia graduate and leading figure in the pro-Palestinian protest movement."
  },
  {
    "title": "Trump’s Immigration Crackdown Endures Despite Release of Targeted Students",
    "link": "https://www.nytimes.com/2025/06/21/nyregion/mahmoud-khalil-immigration-crackdown.html",
    "summary": "An effort to expel students the administration says are a national security threat has given way to a broad campaign that touches many corners of American life."
  },
  {
    "title": "Senate Official Rejects Food Aid Cuts Proposed by Republicans in Megabill",
    "link": "https://www.nytimes.com/2025/06/21/us/politics/senate-snap-food-stamps.html",
    "summary": "The ruling by the parliamentarian sent G.O.P. lawmakers back to the drawing board to cover the costs of President Trump’s domestic policy bill."
  },
  {
    "title": "Trump Says He Wants to Fund More Trade Schools. Just Not These.",
    "link": "https://www.nytimes.com/2025/06/21/business/job-corps-trump-trade-schools.html",
    "summary": "The Job Corps program has long been the subject of debate, but it is now also a point of contention in the administration’s efforts to pull back the social safety net."
  },
  {
    "title": "Harvard and Trump Restart Talks to Potentially End Bitter Dispute",
    "link": "https://www.nytimes.com/2025/06/20/us/politics/harvard-federal-funding-trump.html",
    "summary": "Details about the discussions emerged after President Trump said the two sides, which have been locked in court battles for weeks, might reach a settlement soon."
  },
  {
    "title": "Midwest Cities Bake as Heat Wave Blankets the Central U.S.",
    "link": "https://www.nytimes.com/2025/06/21/us/heat-wave-midwest-central-us.html",
    "summary": "St. Louis, Chicago and Des Moines were among the cities that saw heat indexes hit triple digits on Saturday, with the East Coast bracing for similar conditions by Monday."
  },
  {
    "title": "At Least 3 Dead in Tornadoes in North Dakota, Officials Say",
    "link": "https://www.nytimes.com/2025/06/21/weather/tornadoes-deaths-north-dakota-minnesota.html",
    "summary": "The deaths came after a series of large and long-lasting storms moved through North Dakota and Minnesota Friday night."
  },
  {
    "title": "Windy Conditions Fan Forsyth Fire in Utah",
    "link": "https://www.nytimes.com/2025/06/21/weather/windy-conditions-fan-wildfires-in-the-west.html",
    "summary": "The Forsyth fire in Utah threatened a small community in the state’s southwest corner. Farther west, the Conner fire burned rapidly near Lake Tahoe."
  },
  {
    "title": "In Final Push for Mayor, Lander Appears With 2 Cuomo Accusers",
    "link": "https://www.nytimes.com/2025/06/21/nyregion/lander-cuomo-women-mayor.html",
    "summary": "The campaign event by Brad Lander, the New York City comptroller running for mayor, came as Andrew Cuomo, the front-runner, appeared with the mother of a murder victim."
  },
  {
    "title": "The Question Dividing New Yorkers: Is the City Sinking or Bouncing Back?",
    "link": "https://www.nytimes.com/2025/06/21/nyregion/state-of-new-york-city.html",
    "summary": "On the cusp of choosing the city’s next mayor, New Yorkers are taking stock of their town. But many are split on whether it’s back on track, or off the rails."
  },
  {
    "title": "What to Know About the Wedding of Jeff Bezos and Lauren Sánchez",
    "link": "https://www.nytimes.com/2025/06/20/style/jeff-bezos-lauren-sanchez-wedding.html",
    "summary": "The second marriage for both is taking place in Venice, Italy, under a shroud of secrecy and amid a swarm of speculation."
  },
  {
    "title": "Walmart Tries to Shed a Stodgy Vibe to Battle Digital-Native Rivals",
    "link": "https://www.nytimes.com/2025/06/21/business/walmart-rebrand-headquarters.html",
    "summary": "The retailing giant is spending billions to attract workers to a new headquarters and woo shoppers with drone delivery and a broader range of items (like Louis Vuitton handbags)."
  },
  {
    "title": "A White Nationalist at University of Florida Wrote a Paper Promoting Racist Views. It Won Him an Award.",
    "link": "https://www.nytimes.com/2025/06/21/us/white-supremacist-university-of-florida-paper.html",
    "summary": "The University of Florida student won an academic honor after he argued in a paper that the Constitution applies only to white people. From there, the situation spiraled."
  },
  {
    "title": "Study Suggests Weight-Loss Pill is as Effective as Ozempic",
    "link": "https://www.nytimes.com/2025/06/21/well/new-weight-loss-drugs.html",
    "summary": "The drugs in development include a pill that a new trial suggests is about as effective as Ozempic."
  },
  {
    "title": "BTS Is Back Together. Does It Still Rule K-Pop?",
    "link": "https://www.nytimes.com/2025/06/21/world/asia/bts-kpop.html",
    "summary": "Suga is the last member of the wildly popular band to complete his national service. After more than two years apart, the challenge is to rekindle the magic."
  },
  {
    "title": "How South Korea Became a Cultural Powerhouse",
    "link": "https://www.nytimes.com/2025/06/21/world/asia/south-korea-kpop-culture.html",
    "summary": "With BTS poised to reunite, “Squid Game” returning and a Broadway show winning awards, the Korean cultural wave keeps on rolling."
  },
  {
    "title": "Is Donald Trump an Antagonist or Champion of the Gay Community?",
    "link": "https://www.nytimes.com/2025/06/21/style/trump-lgbtq-gay-maga.html",
    "summary": "Gay backers of Donald Trump say he is blind to sexuality. Not everyone agrees."
  },
  {
    "title": "‘Jaws’ at 50: Scientists Are Still Studying the Mysteries of Sharks",
    "link": "https://www.nytimes.com/2025/06/21/science/jaws-sharks-research.html",
    "summary": "The film’s release in 1975 haunted the reputation of sharks worldwide. But a generation of scientists helped to turn the tide."
  },
  {
    "title": "Why ‘Jaws’ Would Never Be Made Today",
    "link": "https://www.nytimes.com/video/arts/100000010232767/why-jaws-would-never-be-made-today.html",
    "summary": "Would “Jaws,” the first blockbuster, be greenlit today? Probably not. Alissa Wilkinson, a New York Times film critic, breaks down why."
  },
  {
    "title": "Why Israel Had to Act",
    "link": "https://www.nytimes.com/2025/06/21/opinion/israel-iran-attack-nuclear-pre-emptive-strike.html",
    "summary": "The Oct. 7 Hamas attack on Israel showed the need for Israel to pre-empt threats against it rather than react defensively."
  },
  {
    "title": "We Don’t Have to Give In to the Smartphones",
    "link": "https://www.nytimes.com/2025/06/18/opinion/parents-smartphones-tiktok-facebook.html",
    "summary": "They haven’t defeated us. Yet."
  },
  {
    "title": "Influencers Step Onto Center Stage at Cannes",
    "link": "https://www.nytimes.com/2025/06/21/business/cannes-social-media-influencers.html",
    "summary": "Big brands are increasingly courting social media stars, who descended on a major annual festival in France to pitch themselves to advertisers."
  },
  {
    "title": "4 Missing After Medical Helicopter Crashes in Quebec Lake",
    "link": "https://www.nytimes.com/2025/06/21/world/canada/medical-helicopter-crash-canada.html",
    "summary": "The helicopter was carrying four crew members and a patient when it crashed on Friday night, officials said."
  },
  {
    "title": "Nathan Silver, Who Chronicled a Vanished New York, Dies at 89",
    "link": "https://www.nytimes.com/2025/06/21/nyregion/nathan-silver-dead.html",
    "summary": "An architect, he wrote in his book “Lost New York” about the many buildings that were destroyed before passage of the city’s landmarks preservation law."
  }
]