[
  {
    "title": "How a Scholar Nudged the Supreme Court Toward Its Troop Deployment Ruling",
    "link": "https://www.nytimes.com/2025/12/24/us/politics/georgetown-scholar-supreme-court.html",
    "summary": "Accepting an argument from a law professor that no party to the case had made, the Supreme Court handed the Trump administration a stinging loss that could lead to more aggressive tactics."
  },
  {
    "title": "Trump Administration Downplays A.I. Risks, Ignoring Economists’ Concerns",
    "link": "https://www.nytimes.com/2025/12/24/us/politics/trump-artificial-intelligence-economy-risks.html",
    "summary": "The administration has downplayed concerns — from mass job losses, to a potential financial bubble — as President Trump cheers soaring stock prices and faster growth."
  },
  {
    "title": "They Seek to Curb Online Hate. The U.S. Accuses Them of Censorship.",
    "link": "https://www.nytimes.com/2025/12/24/business/europe-us-online-censorship-free-speech.html",
    "summary": "The Trump administration said five regulators and researchers who work to tackle disinformation and abuse on the internet had been barred from entering the United States."
  },
  {
    "title": "Zelensky Open to Pulling Back Troops in Eastern Ukraine to Reach Peace Deal With Russia",
    "link": "https://www.nytimes.com/2025/12/24/world/europe/zelensky-demilitarized-zone-offer.html",
    "summary": "The offer was the closest Mr. Zelensky has come to addressing the thorny territorial disputes in Donetsk that have repeatedly derailed peace talks."
  },
  {
    "title": "Here’s What Is in the 20-Point Peace Plan for Ukraine",
    "link": "https://www.nytimes.com/2025/12/24/world/europe/what-is-in-the-20-point-ukraine-peace-plan.html",
    "summary": "The blueprint covers a broad range of issues, including territory, security guarantees and postwar reconstruction. But Russia has indicated little willingness to end the war."
  },
  {
    "title": "Blast Kills Three in Moscow Near Site of General’s Car Bombing",
    "link": "https://www.nytimes.com/2025/12/24/world/europe/moscow-bomb-blast-police-officers.html",
    "summary": "Two police officers died in the explosion, the authorities said. Earlier this week a car bomb killed a military commander in the same area of Russia’s capital."
  },
  {
    "title": "DOJ Releases Another Batch of Epstein Files: Key Takeaways",
    "link": "https://www.nytimes.com/2025/12/23/us/politics/epstein-files-trump-takeaways.html",
    "summary": "The new documents — nearly 30,000 in all — contain hundreds of references to President Trump and include different versions of Jeffrey Epstein’s will."
  },
  {
    "title": "Redacted Material in Some Epstein Files Is Easily Recovered",
    "link": "https://www.nytimes.com/2025/12/23/us/politics/epstein-files-redactions-doj.html",
    "summary": "The ease of recovering information that was not properly redacted digitally suggests that at least some of the documents released by the Justice Department were hastily censored."
  },
  {
    "title": "Pro-Trump Influencers Stay Conspicuously Quiet About Epstein Files",
    "link": "https://www.nytimes.com/2025/12/23/us/politics/pro-trump-influencers-epstein-files.html",
    "summary": "Their silence contrasted with the uproar made over the weekend when the Justice Department’s first release focused on former President Bill Clinton."
  },
  {
    "title": "Long Carrier Deployment Projects Strength in U.S. Pressure Campaign on Venezuela, and Carries Costs",
    "link": "https://www.nytimes.com/2025/12/24/us/politics/aircraft-carrier-deployment-caribbean-costs.html",
    "summary": "The U.S.S. Ford has been deployed for six months, now in the Caribbean as part of President Trump’s pressure campaign on Venezuela. Maintenance woes and strains on sailors will likely mount."
  },
  {
    "title": "Trump’s Seizures of Oil Tankers Challenge Maritime Rules and Customs",
    "link": "https://www.nytimes.com/2025/12/24/business/trump-venezuela-oil-tankers.html",
    "summary": "Recent U.S. actions against ships near Venezuela may embolden other countries to seize or detain ships, legal experts said."
  },
  {
    "title": "‘Jingle All the Way,’ and the Super Bad Dad Superhero",
    "link": "https://www.nytimes.com/2025/12/23/movies/jingle-all-the-way-christmas-movie.html",
    "summary": "Arnold Schwarzenegger, Sinbad, Phil Hartman and Rita Wilson served a platter of high-octane holiday high jinks in this unhinged 1996 comedy."
  },
  {
    "title": "A Father and Son’s $108 Billion Hostile Bid for Warner Bros. Discovery",
    "link": "https://www.nytimes.com/2025/12/24/business/media/larry-david-ellison-warner-bros-discovery-cbs.html",
    "summary": "Larry and David Ellison didn’t always have a close relationship. Now they’re one of the most intriguing partnerships in business."
  },
  {
    "title": "Pulled ’60 Minutes’ Report, Briefly Streamed in Canada, Is All Over the Internet Now",
    "link": "https://www.nytimes.com/2025/12/23/business/media/60-minutes-cbs-news.html",
    "summary": "At the last minute, CBS News held a segment about Venezuelan men who were deported by the Trump administration to a prison in El Salvador. It surfaced online anyway."
  },
  {
    "title": "Weight-Loss Drugs Ended Their Sex Life. Could It Bounce Back?",
    "link": "https://www.nytimes.com/2025/12/24/well/weight-loss-drugs-ended-their-sex-life-could-it-bounce-back.html",
    "summary": "She expected her body to change when she started taking Zepbound. But nobody told her what might happen to her marriage."
  },
  {
    "title": "Weight Loss Drugs and Their Lesser Known Side Effects on Relationships",
    "link": "https://www.nytimes.com/2025/02/02/magazine/weight-loss-side-effects-sex-ozempic.html",
    "summary": "Doctors warn about their physical side effects, but they can also have unexpected effects on intimacy."
  },
  {
    "title": "The Deposed Assad Henchmen Plotting to Retake Syria",
    "link": "https://www.nytimes.com/2025/12/24/world/middleeast/assad-henchmen-retake-syria-plots.html",
    "summary": "Hacked communications and a social media analysis reveal how former regime leaders are trying to arm fighters and exert influence as far away as Washington."
  },
  {
    "title": "After the Assad Regime’s Fall, His Enforcers Are Lying Low and Living Large",
    "link": "https://www.nytimes.com/2025/12/22/world/middleeast/assad-syria-enforcers-lives-now.html",
    "summary": "A Times investigation into the whereabouts of top Syrian officials who fled after the regime’s fall shows many remain free — shielded by wealth and accommodating host nations."
  },
  {
    "title": "Investors Warn of ‘Rot in Private Equity’ as Funds Strike Circular Deals",
    "link": "https://www.nytimes.com/2025/12/24/business/private-equity-continuation-funds.html",
    "summary": "Buyout firms have struggled to sell companies they own and have instead found a workaround to get cash back to clients: Selling the companies to themselves."
  },
  {
    "title": "Crypto for Christmas? Gen Z-ers Are Cautiously Open to the Idea.",
    "link": "https://www.nytimes.com/2025/12/24/business/gen-z-crypto.html",
    "summary": "Despite recent volatility in the crypto market, younger generations are still open to receiving digital currencies as gifts."
  },
  {
    "title": "Suspect in Brown University Shooting Worked in Portugal After Leaving University",
    "link": "https://www.nytimes.com/2025/12/23/us/brown-university-shooting-suspect-portugal.html",
    "summary": "One friend said Claudio Neves Valente appeared to live a detached life, upset that “he couldn’t be the genius he thought he should be.”"
  },
  {
    "title": "Flood Warnings Issued in Southern California as Intense Storm Sweeps In",
    "link": "https://www.nytimes.com/2025/12/24/weather/rain-flooding-los-angeles-storm.html",
    "summary": "Heavy rain, strong winds, flooding and debris flow could affect Los Angeles County and the surrounding areas on Christmas Eve and Christmas Day."
  },
  {
    "title": "$100 for a Cab to the Airport? It May Soon Get Worse.",
    "link": "https://www.nytimes.com/2025/12/24/nyregion/nyc-airports-taxi-ride-share-fee-hike.html",
    "summary": "The Port Authority is preparing to increase the charge for drivers to pick up and drop off passengers at the airports."
  },
  {
    "title": "Former Fire Boss, Who Is Jewish, Wants to Move on From Mamdani Criticism",
    "link": "https://www.nytimes.com/2025/12/23/nyregion/zohran-mamdani-fire-commissioner.html",
    "summary": "Zohran Mamdani chose Lillian Bonsignore to be fire commissioner, weeks after the former commissioner, Robert S. Tucker, resigned, citing Mr. Mamdani’s views on Israel."
  },
  {
    "title": "A Democrat, a Republican and a Supermarket Baron Go to ‘Marty Supreme’",
    "link": "https://www.nytimes.com/2025/12/23/nyregion/hochul-blakeman-red-carpet.html",
    "summary": "A “Marty Supreme” showing took a political turn when John Catsimatidis, who has a small role in the movie, invited both Gov. Kathy Hochul and her Republican rival, Bruce Blakeman."
  },
  {
    "title": "How Service Dogs Help Treat Veterans’ PTSD",
    "link": "https://www.nytimes.com/2025/12/24/well/ptsd-service-dogs.html",
    "summary": "There’s research suggesting that these four-legged “battle buddies” can reduce symptoms of depression and anxiety. But shortages and long wait times pose barriers."
  },
  {
    "title": "The Year America Blew Up the Process",
    "link": "https://www.nytimes.com/2025/12/24/opinion/democracy-america-bureaucracy.html",
    "summary": "The 2025 revolt against process signaled the final collapse of a powerful idea that once promised to hold the country together."
  },
  {
    "title": "Stephen Colbert’s ‘Late Show’ Fulfills Its Promise",
    "link": "https://www.nytimes.com/2025/12/24/opinion/stephen-colbert-late-show-canceled.html",
    "summary": "After winning an Emmy, Stephen Colbert spoke about creating a “show about love.” In its homestretch, “The Late Show” is fulfilling that promise."
  },
  {
    "title": "Inside the Oval Office",
    "link": "https://www.nytimes.com/2025/12/24/briefing/inside-the-oval-office.html",
    "summary": "Today we take a look at President Trump’s interior design."
  },
  {
    "title": "The Truce Is 2 Months Old. So Why Have Hundreds of Gazans Been Killed?",
    "link": "https://www.nytimes.com/2025/12/24/world/middleeast/gaza-killings-israel-cease-fire.html",
    "summary": "Since the cease-fire took effect, Israel says it has targeted only militants. But death can come for Gazans while on a family outing or sleeping in a tent."
  },
  {
    "title": "Pennsylvania Nursing Home Explosion Kills 2",
    "link": "https://www.nytimes.com/2025/12/23/us/explosion-bristol-nursing-home.html",
    "summary": "A resident and an employee were killed after two explosions at the Bristol Health and Rehab Center resulted in a large fire and partial collapse of the building, officials said."
  },
  {
    "title": "In Pursuit of the Monarch’s Magnetic Sense",
    "link": "https://www.nytimes.com/2025/12/23/science/neuroscience-monarch-butterflies-migration.html",
    "summary": "The magnetic compass is the last unknown sense in migrating animals. For some scientists, the monarch butterfly is leading the way."
  },
  {
    "title": "China Is Shifting Its Nuclear Forces to Swifter Footing, Pentagon Says",
    "link": "https://www.nytimes.com/2025/12/24/world/asia/china-nuclear-forces-pentagon-report.html",
    "summary": "The country’s production of nuclear warheads has slowed, but its missiles may be poised to strike back fast in case of an attack, an annual assessment found."
  }
]