[
  {
    "title": "Somalis Fled Civil War and Built a Community. Now They Are a Target.",
    "link": "https://www.nytimes.com/2026/01/11/us/somalis-fled-civil-war-and-built-a-community-now-they-are-a-target.html",
    "summary": "A fraud scandal has made the Somali community in Minnesota a focus of the Trump administration’s crackdown on immigrants."
  },
  {
    "title": "Who Was Renee Good, the Woman Killed by an ICE Agent in Minneapolis?",
    "link": "https://www.nytimes.com/2026/01/10/us/rennee-good-ice-shooting-minnesota.html",
    "summary": "Ms. Good, 37, was a poet and a mother who grew up in Colorado. Her wife said the couple had “stopped to support our neighbors” when Ms. Good was shot."
  },
  {
    "title": "As Death Toll Surges in Iran, Leaders Take Tough Line Against Protesters",
    "link": "https://www.nytimes.com/2026/01/11/world/middleeast/iran-president-protests-economy-response.html",
    "summary": "President Masoud Pezeshkian expressed sympathy for protesters’ economic pain, but said the state must respond to “rioters.” Rights groups reported a big spike in the death toll."
  },
  {
    "title": "Trump Is Briefed on Options for Striking Iran as Protests Continue",
    "link": "https://www.nytimes.com/2026/01/10/us/politics/trump-iran-strikes.html",
    "summary": "The president has said he will be “hitting them very hard” if Iranian leaders kill protesters amid widespread demonstrations calling for wholesale changes in the country."
  },
  {
    "title": "Trump’s ‘Superstar’ Appellate Judges Have Voted 133 to 12 in His Favor",
    "link": "https://www.nytimes.com/2026/01/11/us/politics/trumps-appeals-court-judges.html",
    "summary": "President Trump promised to fill the appeals courts with “my judges.” They have formed a nearly united phalanx to defend his agenda from legal challenges."
  },
  {
    "title": "Trump Shakes up Latin American Politics",
    "link": "https://www.nytimes.com/2026/01/11/world/americas/trump-latin-america-politics.html",
    "summary": "The U.S. capture of Nicolás Maduro has divided the region. But every nation wants to avoid being next."
  },
  {
    "title": "Smithsonian Removes Label Noting Trump Impeachments",
    "link": "https://www.nytimes.com/2026/01/10/arts/smithsonian-trump-impeachment-portrait-gallery.html",
    "summary": "When the National Portrait Gallery replaced a portrait of President Trump this week, it took down a biography of his first term."
  },
  {
    "title": "Bob Weir Was the Dead’s Invisible Thread",
    "link": "https://www.nytimes.com/2026/01/11/arts/music/bob-weir-grateful-dead-remembered.html",
    "summary": "The songwriter, guitarist and singer, who died at 78, animated the Grateful Dead from within."
  },
  {
    "title": "Bob Weir, Guitarist and Founding Member of The Grateful Dead, Dies at 78",
    "link": "https://www.nytimes.com/2026/01/10/obituaries/bob-weir-dead-grateful-dead.html",
    "summary": "His songwriting and rhythm guitar playing helped shape the San Francisco band’s sound as it became an American institution."
  },
  {
    "title": "Bob Weir: 10 Essential Songs",
    "link": "https://www.nytimes.com/2026/01/10/arts/music/bob-weir-grateful-dead-songs.html",
    "summary": "The guitarist, singer and songwriter, who died at 78, cut his own path among his elders in the Grateful Dead, and beyond."
  },
  {
    "title": "How Wagner Moura Stayed True to Himself and Earned a Golden Globe Nomination",
    "link": "https://www.nytimes.com/2026/01/10/movies/wagner-moura-the-secret-agent-golden-globes.html",
    "summary": "The Brazilian star of “The Secret Agent” is a major Oscar contender, though some at home turned against him for criticizing the right-wing government."
  },
  {
    "title": "Golden Globe 2026 Nominees: Full List Including ‘One Battle After Another’",
    "link": "https://www.nytimes.com/2025/12/08/movies/golden-globes-nominees-2026-list.html",
    "summary": "The movies and TV series competing for the 83rd Golden Globes. The ceremony will air on Jan. 11."
  },
  {
    "title": "How to Watch the Golden Globes 2026: Date, Time and Streaming",
    "link": "https://www.nytimes.com/2026/01/11/movies/golden-globes-how-to-watch.html",
    "summary": "Nikki Glaser is back as host, there’s a new podcast category and “One Battle After Another” looks to have a big night."
  },
  {
    "title": "Why on Earth Have I Seen the Same Broadway Show 13 Times? An Investigation.",
    "link": "https://www.nytimes.com/2026/01/11/magazine/operation-mincemeat-obsession-broadway.html",
    "summary": "As a journalist, I thought I’d never join the ranks of obsessive superfans — until I suddenly became one."
  },
  {
    "title": "Venezuela, Renee Good and Trump’s ‘Assault on Hope’",
    "link": "https://www.nytimes.com/2026/01/10/opinion/ezra-klein-podcast-m-gessen.html",
    "summary": "The Opinion columnist M. Gessen examines how the president governs through spectacle, and the message his displays of force are meant to send."
  },
  {
    "title": "An Education Success Story",
    "link": "https://www.nytimes.com/2026/01/11/briefing/an-education-success-story.html",
    "summary": "We bring you some good news about schools in a place you might not expect."
  },
  {
    "title": "Once Again, Oldest Mississippi Synagogue Is Attacked With Fire",
    "link": "https://www.nytimes.com/2026/01/11/us/mississippi-synagogue-arson-suspect-custody-attack.html",
    "summary": "A suspect is in custody and has been charged with arson for setting the Saturday morning fire. It’s not the first time the Beth Israel house of worship has been attacked."
  },
  {
    "title": "Thiel Gives $3 Million to Group Seeking to Block California Wealth Tax",
    "link": "https://www.nytimes.com/2026/01/11/us/politics/peter-thiel-california-wealth-tax.html",
    "summary": "More large donations from wealthy Silicon Valley figures are expected as they try to marshal opposition to a proposed ballot measure that would impose a new tax on billionaires."
  },
  {
    "title": "Where Does Candidate Mamdani End and Mayor Mamdani Begin?",
    "link": "https://www.nytimes.com/2026/01/11/nyregion/new-york-mayor-zohran-mamdani-week-one.html",
    "summary": "In his first week as mayor of New York City, Zohran Mamdani tried to bridge the political theater of his campaign with the much harder work of governing."
  },
  {
    "title": "New York Seeks Ban on A.I.-Generated Images of Candidates",
    "link": "https://www.nytimes.com/2026/01/11/nyregion/ny-hochul-ai-candidates.html",
    "summary": "Last year, the Cuomo campaign released a video created by artificial intelligence that depicted Zohran Mamdani eating rice with his hands. Gov. Kathy Hochul wants to ban such tactics."
  }
]