[
  {
    "title": "C.I.A. Conducted Drone Strike on Port in Venezuela",
    "link": "https://www.nytimes.com/2025/12/29/us/politics/cia-drone-strike-venezuela.html",
    "summary": "The attack last week, on a dock purportedly used for shipping narcotics, did not kill anyone, people briefed on the operation said. But it was the first known U.S. operation inside Venezuela."
  },
  {
    "title": "How Russia and Ukraine Are Fighting to Shape Trump’s View of the War",
    "link": "https://www.nytimes.com/2025/12/30/world/europe/russia-ukraine-trump-influence.html",
    "summary": "Off the battlefield, each side is trying to influence President Trump’s perception of the military conflict as they look to negotiate a peace settlement in their favor."
  },
  {
    "title": "Trump Upended the Federal Government. The Full Scope of the Impact Is Still Unclear.",
    "link": "https://www.nytimes.com/2025/12/30/us/politics/trump-federal-government-fallout.html",
    "summary": "President Trump achieved his goal of shrinking the work force. But many current and former officials say the government is less dependable and efficient than it was a year ago."
  },
  {
    "title": "New Year’s Eve Concerts at Kennedy Center Are Canceled",
    "link": "https://www.nytimes.com/2025/12/29/arts/kennedy-center-new-years-eve-concerts-canceled.html",
    "summary": "The jazz drummer Billy Hart said the decision was “evidently” connected to President Trump’s name being added to the arts center."
  },
  {
    "title": "Cheap Solar Is Transforming Lives and Economies Across Africa",
    "link": "https://www.nytimes.com/2025/12/30/climate/solar-south-africa-china.html",
    "summary": "Chinese panels are now so affordable that businesses and families are snapping them up, slashing their bills and challenging utilities."
  },
  {
    "title": "Gone in 2025: A Yearlong Procession of Giants",
    "link": "https://www.nytimes.com/2025/12/29/obituaries/2025-deaths-obituaries.html",
    "summary": "Marquee names all, they found international fame in the arts, politics, the sciences and beyond."
  },
  {
    "title": "Protests Over Iran’s Currency Crash and Inflation Spread to Universities",
    "link": "https://www.nytimes.com/2025/12/30/world/middleeast/iran-protests-currency-inflation-universities.html",
    "summary": "Iranian leaders face pressure over a currency collapse and threats of possible military strikes from Israel and the United States over Tehran’s nuclear activities."
  },
  {
    "title": "Saudis Say Airstrike in Yemen Targeted Arms From U.A.E.",
    "link": "https://www.nytimes.com/2025/12/30/world/middleeast/yemen-saudi-strike-uae.html",
    "summary": "Saudi-led forces struck an Emirati shipment early Tuesday, worsening tensions between the once-close allies. The Saudis said the shipment had arms for a separatist group, which the Emiratis denied."
  },
  {
    "title": "The Cover-Up: Inside the Plot to Conceal Assad’s Crimes",
    "link": "https://www.nytimes.com/2025/12/30/world/middleeast/assad-regime-crimes-syria-documents.html",
    "summary": "Thousands of documents and interviews with Assad-era officials reveal how the regime worked to conceal evidence of its atrocities during the Syrian civil war."
  },
  {
    "title": "How the Assad Regime Covered Up Its Crimes: Key Takeaways",
    "link": "https://www.nytimes.com/2025/12/30/world/middleeast/assad-regime-crimes-syria-documents-takeaways.html",
    "summary": "We documented how the dictator Bashar al-Assad and his henchmen conspired to hide evidence of torture and deaths of detainees during Syria’s long civil war."
  },
  {
    "title": "She Tried to Kill a President. He Loved Her Anyway.",
    "link": "https://www.nytimes.com/2025/12/30/style/she-tried-to-kill-a-president-he-loved-her-anyway.html",
    "summary": "A retired widower married Sara Jane Moore, who shot at President Ford in 1975. It tore his family apart."
  },
  {
    "title": "Katherine Maher of NPR Has Come Out on Top Despite Battles With Trump and the CPB",
    "link": "https://www.nytimes.com/2025/12/30/business/npr-katherine-maher.html",
    "summary": "Katherine Maher has taken an unyielding approach to NPR’s biggest battles — which has sometimes put her at odds with her colleagues in public media."
  },
  {
    "title": "Death at a Mississippi Jail: Brutal Beating or a Fall From Bed?",
    "link": "https://www.nytimes.com/2025/12/30/us/mississippi-jail-death-rankin-county.html",
    "summary": "An inmate says that no one wanted to listen when he tried repeatedly to confess to a crime at a facility known for violence."
  },
  {
    "title": "Cornelius Eady to Recite Poem at Mamdani’s Inauguration",
    "link": "https://www.nytimes.com/2025/12/30/nyregion/mamdani-poem-cornelius-eady-inauguration.html",
    "summary": "Cornelius Eady, a National Book Award finalist, shared an excerpt from “Proof,” an original poem he has written for Zohran Mamdani’s inauguration as mayor of New York City."
  },
  {
    "title": "Mamdani Promised Universal Child Care. How Long Could It Take?",
    "link": "https://www.nytimes.com/2025/12/30/nyregion/mamdani-nyc-mayor-free-childcare.html",
    "summary": "Here is what to expect if you’re expecting relief from the soaring cost of day care in New York City."
  },
  {
    "title": "Carmen de Lavallade, Dancer Whose Career Spanned the Arts, Dies at 94",
    "link": "https://www.nytimes.com/2025/12/30/arts/dance/carmen-de-lavallade-dead.html",
    "summary": "Over six decades she worked in theater, opera, film and television alongside luminaries like Alvin Ailey, Lena Horne, Agnes de Mille and Harry Belafonte."
  },
  {
    "title": "When the Best New Year’s Plans Are No New Year’s Plans",
    "link": "https://www.nytimes.com/2025/12/29/style/new-years-eve-no-plans.html",
    "summary": "Many opt out of the revelry, either as their own time-honored tradition or because of a different outlook this year."
  },
  {
    "title": "How America Loses Vaccine Access",
    "link": "https://www.nytimes.com/2025/12/30/opinion/kennedy-vaccines-hhs-cdc.html",
    "summary": "America could all but lose vaccine access. Here’s how."
  },
  {
    "title": "Can a Corporation Be Complicit in War Crimes? Sweden Is Trying to Find Out.",
    "link": "https://www.nytimes.com/2025/12/30/opinion/the-oil-company-drilled-government-slaughter-guilty.html",
    "summary": "It’s Sweden’s longest criminal trial. I was there because of a different historic distinction."
  },
  {
    "title": "Overlooked Stories",
    "link": "https://www.nytimes.com/2025/12/30/briefing/overlooked-stories.html",
    "summary": "We look at some of our best stories from 2025 that Times editors thought deserved more attention."
  },
  {
    "title": "George and Amal Clooney Become French Citizens",
    "link": "https://www.nytimes.com/2025/12/30/world/europe/george-clooney-amal-french-citizenship.html",
    "summary": "Mr. Clooney, who owns a farmhouse in France, has said that living there enabled him and his wife, a human rights lawyer, to pursue a quieter existence with their children."
  },
  {
    "title": "PostNord, Denmark’s Main Postal Carrier, Ends Letter Delivery",
    "link": "https://www.nytimes.com/2025/12/30/world/europe/denmark-letter-delivery-postnord-mailboxes.html",
    "summary": "PostNord, the country’s longtime service, is delivering its last letters. Few Danes send snail mail anymore, but some are mourning the end of an era."
  },
  {
    "title": "Eurostar Trains Face Day of Delays After Power Failure",
    "link": "https://www.nytimes.com/2025/12/30/world/europe/eurostar-canceled-channel-tunnel-london-paris.html",
    "summary": "The high-speed service between Britain and continental Europe was paralyzed during one of the busiest travel weeks of the year because of a power outage in the Channel Tunnel."
  },
  {
    "title": "More Rain Forecast for Los Angeles Starting on New Year’s Eve",
    "link": "https://www.nytimes.com/2025/12/30/weather/rain-los-angeles-new-years.html",
    "summary": "After Christmas-week storms, two rounds of rainfall starting on New Year’s Eve could cause more flooding and mudslides."
  }
]