[
  {
    "title": "6 Takeaways From the First Batch of the Epstein Files",
    "link": "https://www.nytimes.com/2025/12/19/us/politics/epstein-files-takeaways.html",
    "summary": "Many of the Justice Department documents were heavily redacted, and President Trump’s name was rarely mentioned. The White House also sought to make political hay of the release of photos of Bill Clinton."
  },
  {
    "title": "Epstein Victims Upset About Lack of Transparency in Newly Released Files",
    "link": "https://www.nytimes.com/2025/12/19/us/epstein-files-victims-reaction.html",
    "summary": "Several victims said they were frustrated by the heavy redactions of photos and documents that the Justice Department released on Friday."
  },
  {
    "title": "Epstein Files Include 1996 Child Porn Complaint That F.B.I. Ignored",
    "link": "https://www.nytimes.com/2025/12/19/us/epstein-fbi-complaint-1996-maria-farmer.html",
    "summary": "Newly released files show how Maria Farmer, who worked for Mr. Epstein in the 1990s, had urged the F.B.I. to investigate him. The case went nowhere for years."
  },
  {
    "title": "U.S. Strikes Islamic State Targets in Syria",
    "link": "https://www.nytimes.com/2025/12/19/us/politics/us-islamic-state-strikes-syria.html",
    "summary": "American forces struck dozens of suspected ISIS sites, making good on President Trump’s vow to avenge two American soldiers and a civilian U.S. interpreter killed by the group last week."
  },
  {
    "title": "Trump Picks New Leader for Southern Command as Venezuela Pressure Grows",
    "link": "https://www.nytimes.com/2025/12/19/us/politics/frank-donovan-southern-command-trump.html",
    "summary": "Lt. Gen. Francis L. Donovan, a Marine general with expansive experience in special operations and the Middle East, would take over after the abrupt departure of the previous commander."
  },
  {
    "title": "Elise Stefanik Drops Out of N.Y. Governor’s Race and Will Leave Congress",
    "link": "https://www.nytimes.com/2025/12/19/nyregion/elise-stefanik-drops-out-governor.html",
    "summary": "Ms. Stefanik, a Republican congresswoman and staunch ally of President Trump, abruptly ended her bid to unseat Gov. Kathy Hochul and said she would not seek another House term."
  },
  {
    "title": "Elise Stefanik Tried Everything to Please Trump. He Still Jilted Her.",
    "link": "https://www.nytimes.com/2025/12/19/us/politics/elise-stefanik-trump-governor-congress.html",
    "summary": "The G.O.P. congresswoman who ran as a moderate but became an “ultra MAGA” Trump acolyte ultimately found herself undermined by the president and politically adrift."
  },
  {
    "title": "Suspected Killer of M.I.T. Professor Studied With Victim, Graduating Top of Their Class",
    "link": "https://www.nytimes.com/2025/12/19/us/mit-professor-shooting-suspect-portugal-lisbon-physics.html",
    "summary": "The parents of the suspect in the Brown and M.I.T. killings had not seen or heard from him since he left Portugal to enroll at a graduate program at Brown more than two decades ago."
  },
  {
    "title": "Suspect in Brown and M.I.T. Killings Died 2 Days Before He Was Found, Autopsy Shows",
    "link": "https://www.nytimes.com/2025/12/19/us/suspect-brown-mit-autopsy.html",
    "summary": "The examination confirmed that the suspect had died from a self-inflicted gunshot wound. His body was found late Thursday in a storage unit in New Hampshire."
  },
  {
    "title": "How a Reddit Post Helped the Police Identify a Suspect in the Brown University Shooting",
    "link": "https://www.nytimes.com/2025/12/19/us/brown-mit-shooting-investigation-reddit.html",
    "summary": "A Reddit user provided information that helped identify Claudio Manuel Neves Valente as the suspect not only in the campus shooting but also in the murder of an M.I.T. professor."
  },
  {
    "title": "52 Places to Go, So Little Time: Where We Went in 2025",
    "link": "https://www.nytimes.com/2025/12/19/travel/visiting-places-to-go.html",
    "summary": "Our writers and photographers were on the ground to find out what makes the destinations on our annual list rise above the rest."
  },
  {
    "title": "R.F.K. Jr. Likely to Swap U.S. Childhood Vaccine Schedule for Denmark’s",
    "link": "https://www.nytimes.com/2025/12/19/health/kennedy-childhood-vaccine-schedule-denmark.html",
    "summary": "The shift would mean fewer shots recommended for children. But a Danish health official found the idea baffling, saying the United States was getting “crazier and crazier in public health.”"
  },
  {
    "title": "How the T.S.A. Is Helping ICE",
    "link": "https://www.nytimes.com/video/us/100000010579727/how-the-tsa-is-helping-ice.html",
    "summary": "In a previously undisclosed partnership, the Transportation Security Administration and Immigration and Customs Enforcement are sharing data to identify passengers on upcoming flights whom ICE can arrest. Our reporter Hamed Aleaziz, who learned of this partnership, describes what to know about it and the ICE arrests that have followed."
  },
  {
    "title": "Kennedy Center, Memorial to JFK, Is Trump’s Now, Too",
    "link": "https://www.nytimes.com/2025/12/19/us/politics/kennedy-center-trump-sign.html",
    "summary": "The Kennedy Center installed President Trump’s name on the facade of the arts center, which had been designated as a living memorial to President John F. Kennedy."
  },
  {
    "title": "Immigration Officials Deport Queens 6-Year-Old and Father Who Fled China",
    "link": "https://www.nytimes.com/2025/12/19/nyregion/child-father-deported-china-nyc.html",
    "summary": "Hundreds of people had rallied for the family in New York City after they were separated by Immigration and Customs Enforcement agents in November."
  },
  {
    "title": "Rubio Meets (and Meets, and Meets … ) the Press",
    "link": "https://www.nytimes.com/2025/12/19/us/politics/marco-rubio-briefing-reporters.html",
    "summary": "The secretary of state held a marathon news conference, offering little news but more respect for reporters than most others in the Trump administration."
  },
  {
    "title": "Sudanese Refugees Describe Their Escape From Darfur",
    "link": "https://www.nytimes.com/2025/12/20/world/africa/sudan-el-fasher-refugees-chad.html",
    "summary": "No one knows the true toll of the massacre, and the city remains isolated. Now, refugee camps in Chad are flooded with newly displaced Sudanese."
  },
  {
    "title": "Vivek Ramaswamy Challenges Conservatives on Surging Anti-Indian Hate",
    "link": "https://www.nytimes.com/2025/12/19/us/politics/vivek-ramaswamy-anti-indian-hate.html",
    "summary": "The leading Republican candidate for Ohio governor is calling out his party for rising intolerance, including against Indian American immigrants and their children, like him."
  },
  {
    "title": "‘Where’s the Humanity?’ Bondi Attack Leaves Suspects’ Neighborhood Stunned",
    "link": "https://www.nytimes.com/2025/12/20/us/wheres-the-humanity-bondi-attack-leaves-suspects-neighborhood-stunned.html",
    "summary": "The alleged gunmen in the shooting, Sajid Akram, 50 and his son, Naveed Akram, 24, were from Bonnyrigg, a diverse, multilingual suburb miles from Sydney’s Bondi Beach."
  },
  {
    "title": "Bumpy Rollout for New Gates Meant to Stop Subway Fare Evasion",
    "link": "https://www.nytimes.com/2025/12/19/nyregion/nyc-subway-fare-gates-mta.html",
    "summary": "At a demonstration of devices designed to replace turnstiles, one rider got hit in the neck, and another sneaked through without paying."
  },
  {
    "title": "Metro-North and LIRR Commuters to Be Fined for ‘Repeatedly’ Activating Tickets on Train",
    "link": "https://www.nytimes.com/2025/12/19/nyregion/nyc-commuters-ticket-activation-fee-lirr-metro-north.html",
    "summary": "Passengers on Metro-North and Long Island Rail Road trains could face $8 fines if they keep waiting until after the train leaves to activate their mobile tickets."
  },
  {
    "title": "Hochul Expected to Veto Bill Requiring 2-Person Crews on Subway Trains",
    "link": "https://www.nytimes.com/2025/12/19/nyregion/hochul-mta-conductors-twu.html",
    "summary": "The bill, which would ensure that every train has a conductor and a driver, as most now do, was supported by the transit workers’ union and opposed by many transit advocates."
  },
  {
    "title": "Hochul Reaches Deal on A.I. Regulation in New York",
    "link": "https://www.nytimes.com/2025/12/19/nyregion/ai-bill-regulations-ny.html",
    "summary": "The bill, which lawmakers passed in June, will be modified to more closely match a similar law in California, at Big Tech’s urging."
  },
  {
    "title": "Mamdani Revamps Hiring After Old Antisemitic Remarks Prompt Aide to Quit",
    "link": "https://www.nytimes.com/2025/12/19/nyregion/mamdani-vetting-overhaul-da-costa-antisemitic.html",
    "summary": "Mayor-elect Zohran Mamdani said he did not know about the antisemitic posts and would not have hired the woman who made them if he had."
  },
  {
    "title": "Lou Cannon, Journalist Who Chronicled Reagan in Books, Dies at 92",
    "link": "https://www.nytimes.com/2025/12/20/books/lou-cannon-dead.html",
    "summary": "He was a foremost authority on the president, tracking his career from his first term as California governor through his eight years in the White House."
  },
  {
    "title": "Mitt Romney: Tax the Rich, Like Me",
    "link": "https://www.nytimes.com/2025/12/19/opinion/romney-tax-the-rich.html",
    "summary": "There’s no getting around this if we want to avoid the deficit cliff ahead."
  },
  {
    "title": "Times Readers Open Up About the Real Cost of Motherhood",
    "link": "https://www.nytimes.com/2025/06/25/opinion/motherhood-penalty-career.html",
    "summary": "What’s the real cost of motherhood? Here’s what our readers said."
  },
  {
    "title": "Toss a Coin in the Trevi Fountain? That’ll Be 2 Euros, Wish Not Included",
    "link": "https://www.nytimes.com/2025/12/19/world/europe/trevi-fountain-2-euro-fee.html",
    "summary": "Starting on Feb. 1, Rome will charge tourists a fee to go down into the basin of the famed 18th-century fountain. Not every one is happy (except Romans, who won’t have to pay)."
  },
  {
    "title": "Greg Biffle’s Plane Turned Back Minutes After Takeoff",
    "link": "https://www.nytimes.com/2025/12/19/us/politics/greg-biffle-plane-crash.html",
    "summary": "The National Transportation Safety Board is investigating the crash at a North Carolina airport, which killed seven people, including the driver Greg Biffle and his wife and children."
  },
  {
    "title": "High Winds in Denver Prompt Warnings About Dangerous Fire Risk",
    "link": "https://www.nytimes.com/2025/12/19/weather/denver-winds-fire-colorado.html",
    "summary": "Emergency authorities across the region urged people to stay home, and a utility company cut off power to 100,000 of its customers near Denver."
  },
  {
    "title": "Two NJ Transit Trains Collide, Injuring More Than a Dozen People",
    "link": "https://www.nytimes.com/2025/12/20/nyregion/nj-transit-crash.html",
    "summary": "The incident Friday evening shut down the Montclair-Boonton Line in Montclair, N.J."
  }
]