[
  {
    "title": "How Jared Kushner, a Self-Described ‘Deal Guy,’ Helped Broker a Gaza Breakthrough",
    "link": "https://www.nytimes.com/2025/10/09/us/politics/jared-kushner-gaza-deal.html",
    "summary": "Trained in New York City real estate, the president’s son-in-law had a single goal: Get to a yes first, and hash out the details later. “It’s just different being deal guys — just a different sport,” he said."
  },
  {
    "title": "Who Are the Hostages Believed Alive in Gaza?",
    "link": "https://www.nytimes.com/2025/10/09/world/middleeast/hostages-profiles.html",
    "summary": "Israel says 20 living hostages are held by Hamas, set for release in a prisoner exchange together with the remains of those who died. Here’s what we know about them."
  },
  {
    "title": "What a National Guard Deployment Means",
    "link": "https://www.nytimes.com/video/us/100000010446054/how-trump-is-using-the-national-guard.html",
    "summary": "John Ismay, who reports on the Pentagon for The New York Times, describes what National Guard troops and civilian law enforcement are doing in cities where President Trump has mobilized them."
  },
  {
    "title": "Trump Has His Eyes on a Nobel Peace Prize. Will He Get It?",
    "link": "https://www.nytimes.com/2025/10/09/us/politics/trump-nobel-peace-prize.html",
    "summary": "President Trump has coveted the prize for years. The winner will be unveiled 48 hours after President Trump announced a breakthrough in the Israel-Hamas war."
  },
  {
    "title": "L.A. County Considers Emergency Declaration Over Immigration Raids",
    "link": "https://www.nytimes.com/2025/10/09/us/los-angeles-county-ice-raids-emergency.html",
    "summary": "The declaration would allow the Los Angeles County Board of Supervisors to enact an eviction moratorium and other protections for immigrants."
  },
  {
    "title": "Big Investors Await Windfall From Trump’s Argentina Bailout",
    "link": "https://www.nytimes.com/2025/10/09/us/politics/argentina-bailout-investors.html",
    "summary": "The United States finalized a $20 billion lifeline for Argentina that will benefit Treasury Secretary Scott Bessent’s allies."
  },
  {
    "title": "Peru Ousts President Amid Crime Surge",
    "link": "https://www.nytimes.com/2025/10/10/world/americas/peru-ousts-president-amid-crime-surge.html",
    "summary": "Growing outrage over crime and political scandals eroded support for President Dina Boluarte, the country’s most unpopular leader in recent history."
  },
  {
    "title": "Who Can Afford Three Kids in New York City?",
    "link": "https://www.nytimes.com/2025/10/09/nyregion/who-can-afford-three-kids-in-new-york-city.html",
    "summary": "The number of city households with three or more children has dropped by nearly 17 percent over the past decade as families struggle with the cost of child care and rent."
  },
  {
    "title": "New York City: Where Street Parking Is Free, but Comes at a Cost",
    "link": "https://www.nytimes.com/2025/10/09/nyregion/new-york-city-parking-alternate-side.html",
    "summary": "After a TikTok video of a woman charging to “car sit” gained attention, New Yorkers were reminded that the price of street parking is rarely paid at a meter."
  },
  {
    "title": "Mamdani Maintains 13-Point Lead as Cuomo Gains Ground After Adams’s Exit",
    "link": "https://www.nytimes.com/2025/10/09/nyregion/mayor-poll-nyc-quinnipiac.html",
    "summary": "While former Gov. Andrew M. Cuomo benefited from Mayor Eric Adams’s departure, Zohran Mamdani still enjoyed a sizable lead in the Quinnipiac University poll."
  },
  {
    "title": "Democratic Alarm Over an Unbound Trump Fuels Shutdown Standoff",
    "link": "https://www.nytimes.com/2025/10/09/us/politics/democrats-shutdown-trump-administration.html",
    "summary": "The threat of rising Obamacare premiums has been Democrats’ main focus in the public debate, but the president’s defiance of laws, norms and congressional constraints has helped hold them together in opposition."
  },
  {
    "title": "Senate Passes Bipartisan $925 Billion Defense Policy Bill",
    "link": "https://www.nytimes.com/2025/10/09/us/senate-passes-bipartisan-925-billion-defense-policy-bill.html",
    "summary": "The legislation would provide a 3.8 percent pay raise for American troops, while funding weapons and overhauling military procurement."
  },
  {
    "title": "Why China Built 162 Square Miles of Solar Panels on the World’s Highest Plateau",
    "link": "https://www.nytimes.com/2025/10/10/business/china-solar-tibetan-plateau.html",
    "summary": "China is using the high-altitude expanse for immense solar panel farms and wind turbines and has begun work on the world’s largest hydroelectric dams."
  },
  {
    "title": "Judge Rejects ‘Unprecedented’ Indictment Amid Trump’s D.C. Clampdown",
    "link": "https://www.nytimes.com/2025/10/09/us/politics/judge-rejects-indictment-dc.html",
    "summary": "The federal magistrate judge, Zia M. Faruqui, accused prosecutors of relying on a “facially invalid” indictment to charge a man with felony gun possession."
  },
  {
    "title": "Sister Jean, Loyola Basketball Superfan and Team Chaplain, Dies at 106",
    "link": "https://www.nytimes.com/2025/10/10/sports/ncaabasketball/sister-jean-dolores-schmidt-dead.html",
    "summary": "She led the Ramblers’ players in pregame prayers, pointed out opponents’ strengths and weaknesses and supported the team in N.C.A.A. tournaments."
  },
  {
    "title": "Nobel Prizes This Year Offer Three Cheers for Slow Science",
    "link": "https://www.nytimes.com/2025/10/09/science/nobel-prizes-science-basic-research.html",
    "summary": "The scientific Nobels announced this week — in Physiology or Medicine, Physics and Chemistry — honored achievements rooted in fundamental research from decades ago."
  },
  {
    "title": "Laszlo Krasznahorkai Is Awarded Nobel Prize in Literature",
    "link": "https://www.nytimes.com/2025/10/09/books/laszlo-krasznahorkai-nobel-prize-in-literature.html",
    "summary": "​The prize committee said the Hungarian writer’s work “reaffirms the power of art.”"
  },
  {
    "title": "Trump’s Peace Plan is Tailor-Made for Israel. It Still Might Work.",
    "link": "https://www.nytimes.com/2025/10/10/opinion/israel-gaza-hamas-peace-plan.html",
    "summary": "A deal offers some possibility of a broader solution, but the hurdles are enormous."
  },
  {
    "title": "Cameroon Is in Thrall to a 92-Year-Old Man",
    "link": "https://www.nytimes.com/2025/10/10/opinion/cameroon-paul-biya-election.html",
    "summary": "President Paul Biya of Cameroon, in power for 43 years, is not going anywhere."
  },
  {
    "title": "Who is Jonathan Rinderknecht? What We Know About The Palisades Fire Arrest",
    "link": "https://www.nytimes.com/2025/10/08/us/palisades-fire-arrest-jonathan-rinderknecht.html",
    "summary": "More details are emerging about Jonathan Rinderknecht, 29, who was accused of starting a small blaze in January that later rekindled and grew into the fire that devastated Pacific Palisades."
  },
  {
    "title": "Bob Ross’s ‘Happy Little’ Paintings Will Be Auctioned",
    "link": "https://www.nytimes.com/2025/10/09/us/bob-ross-paintings-auction.html",
    "summary": "Thirty canvases, many created for viewers of Ross’s PBS series, “The Joy of Painting,” will be sold to benefit public television stations grappling with funding cuts."
  },
  {
    "title": "Librarian Fired in Books Dispute to Receive $700,000 Settlement",
    "link": "https://www.nytimes.com/2025/10/09/us/wyoming-library-settlement-book-bans-terri-lesley.html",
    "summary": "County officials in Wyoming fired Terri Lesley, a library director, after she refused to purge children and young adult books that contained sexual content and L.G.B.T.Q. themes."
  }
]