[
  {
    "title": "Maurene Comey, Prosecutor of Jeffrey Epstein, Is Fired",
    "link": "https://www.nytimes.com/2025/07/16/nyregion/maurene-comey-prosecutor-fired-jeffrey-epstein.html",
    "summary": "Maurene Comey, who is the daughter of the former F.B.I. director James Comey, worked on the criminal cases against Jeffrey Epstein and his associate Ghislaine Maxwell."
  },
  {
    "title": "Senate Democrats Rail at ‘Sloppy, Rushed’ State Dept. Firings",
    "link": "https://www.nytimes.com/2025/07/16/us/politics/senate-state-department-firings.html",
    "summary": "Republicans on the Senate Foreign Relations Committee said the changes were needed and called the outrage overblown."
  },
  {
    "title": "Rum, Fisheries and a Sculpture Garden: The Quiet Winners in Trump’s Big Bill",
    "link": "https://www.nytimes.com/2025/07/16/us/politics/winners-in-trumps-policy-bill.html",
    "summary": "The president’s marquee policy legislation is best known for slashing taxes and cutting social safety net programs. But the sweeping measure also included many little-noticed goodies and add-ons."
  },
  {
    "title": "Vance Tries to Sell the Benefits of Trump’s Megabill but Ignores the Costs",
    "link": "https://www.nytimes.com/2025/07/16/us/politics/vance-trump-pennsylvania-legislation.html",
    "summary": "In a visit to Pennsylvania, Vice President JD Vance stressed tax cuts and savings accounts for newborns, with no mention of trims to Medicaid and nutritional assistance programs many Trump voters rely on."
  },
  {
    "title": "How Republicans Supersized Silicon Valley’s Favorite Tax Break",
    "link": "https://www.nytimes.com/2025/07/16/us/politics/startup-tax-trump-bill-qsbs.html",
    "summary": "Tucked into the huge set of tax cuts that Republicans passed into law this month was the expansion of an unusually valuable tax break for start-up investors."
  },
  {
    "title": "Republican Tax Bill Is a Losing Deal for Gamblers",
    "link": "https://www.nytimes.com/2025/07/16/us/politics/republican-tax-bill-gambling-industry.html",
    "summary": "The law is creating backlash from the gambling industry and bettors who could owe taxes even if they break even."
  },
  {
    "title": "Trump Has Penned Letter To Fire Fed Chair Jerome Powell",
    "link": "https://www.nytimes.com/2025/07/16/us/politics/trump-powell-firing-letter.html",
    "summary": "The president waved a copy of a draft letter firing Jerome H. Powell at a meeting in the Oval Office with House Republicans. It remains to be seen whether he follows through with his threat."
  },
  {
    "title": "Can Trump Fire Powell? He Likely Lacks Case to Remove Fed Chair, Experts Say.",
    "link": "https://www.nytimes.com/2025/07/16/us/politics/trump-powell-fed-renovations.html",
    "summary": "The Trump administration is toying with removing Jerome H. Powell as chair of the Federal Reserve, accusing him of mismanaging a multibillion-dollar update to its Washington headquarters."
  },
  {
    "title": "Public Views of the Fed Chair Are Polarized as Trump Mulls His Firing",
    "link": "https://www.nytimes.com/2025/07/16/us/politics/trump-powell-firing-poll.html",
    "summary": "Few Americans have confidence in the chairman, Jerome Powell, to do the right thing on the economy, though attitudes are deeply partisan."
  },
  {
    "title": "Trump’s National Guard Troops Are Questioning Their Mission in L.A.",
    "link": "https://www.nytimes.com/2025/07/16/us/trump-national-guard-california.html",
    "summary": "Thousands of National Guard members have served in the L.A. region since last month. Six soldiers spoke in interviews about low morale over the deployment."
  },
  {
    "title": "Documenting L.A.’s Surge in Immigration Arrests",
    "link": "https://www.nytimes.com/video/us/politics/100000010259953/documenting-las-surge-in-immigration-arrests.html",
    "summary": "Jennifer Medina, a political reporter at The New York Times who is based in Los Angeles, speaks with a witness who recorded an immigration raid near a Home Depot."
  },
  {
    "title": "Lawyers for Kilmar Abrego Garcia Question Evidence in Criminal Case",
    "link": "https://www.nytimes.com/2025/07/16/us/politics/kilmar-abrego-garcia-trump-deportations.html",
    "summary": "The exchanges unfolded at a hearing in Federal District Court in Nashville intended to determine whether Kilmar Armando Abrego Garcia should be freed from criminal custody as he awaits trial."
  },
  {
    "title": "The Chaotic Early Days Inside Florida’s ‘Alligator Alcatraz’ Detention Center",
    "link": "https://www.nytimes.com/2025/07/16/us/the-chaotic-early-days-inside-floridas-alligator-alcatraz-detention-center.html",
    "summary": "Several immigrant detainees described high tension and anxiety at the remote, hastily constructed facility over a lack of information, recreation and access to medication."
  },
  {
    "title": "Immigrants File Class-Action Lawsuit to Stop ICE Courthouse Arrests",
    "link": "https://www.nytimes.com/2025/07/16/nyregion/trump-ice-arrests-lawsuit-immigrants.html",
    "summary": "The detentions have become a relatively easy way for Immigration and Customs Enforcement agents to detain immigrants who are appearing for court dates."
  },
  {
    "title": "Ex-Commissioner Sues, Saying Adams Ran N.Y.P.D. as a Criminal Enterprise",
    "link": "https://www.nytimes.com/2025/07/16/nyregion/nypd-lawsuit-rico-donlon-eric-adams.html",
    "summary": "Thomas G. Donlon, who served only weeks as police commissioner, said in a lawsuit that New York City’s mayor and top department officials had manipulated the system for personal and political gain."
  },
  {
    "title": "Adams Eclipses Mamdani in Recent Fund-Raising, as Cuomo Lags Behind",
    "link": "https://www.nytimes.com/2025/07/16/nyregion/mamdani-adams-donors-money.html",
    "summary": "Mayor Eric Adams reported raising $1.5 million over the last month, but his inability to qualify for matching funds may hamper his re-election bid."
  },
  {
    "title": "Israel Strikes Syria’s Capital, Sending Warning to Government",
    "link": "https://www.nytimes.com/2025/07/16/world/middleeast/israel-syria-damascus-strikes.html",
    "summary": "Israel threatened to escalate attacks on Syrian government forces unless they withdrew from Sweida, a southern province dominated by the country’s Druse minority."
  },
  {
    "title": "Is This Restaurant the Only Thing Democrats and Republicans Agree On?",
    "link": "https://www.nytimes.com/2025/07/16/dining/ama-restaurant-washington-dc-maha.html",
    "summary": "In polarized Washington, Ama is drawing leaders from both camps with an anti-additive menu and a vow to bar all manner of toxicity."
  },
  {
    "title": "Trump Has Promised More Tariffs on Mexico. What Happens Next?",
    "link": "https://www.nytimes.com/2025/07/16/world/americas/trump-tariffs-mexico-cartels.html",
    "summary": "President Trump has threatened to increase Mexico’s tariff rate to 30 percent starting Aug. 1, claiming the country hasn’t sufficiently tackled drug cartels."
  },
  {
    "title": "Carney Moves to Reduce Canada’s Chinese Steel Imports in Response to Trump’s Tariffs",
    "link": "https://www.nytimes.com/2025/07/16/world/canada/carney-trump-us-canada-steel-tariffs.html",
    "summary": "Canada’s steel industry fears that Chinese steel facing steep tariffs in the United States will be sent north and overwhelm the Canadian market."
  },
  {
    "title": "Paulette Jiles, 82, Dies; Novelist Evoked the West in ‘News of the World’",
    "link": "https://www.nytimes.com/2025/07/16/books/paulette-jiles-dead.html",
    "summary": "A poet and memoirist as well, she drew a wide readership with her historical fiction, notably with a Civil War-era tale that was adapted for a movie starring Tom Hanks."
  },
  {
    "title": "The Epstein Story Is Both Conspiracy Theory and Genuine Scandal",
    "link": "https://www.nytimes.com/2025/07/16/opinion/epstein-trump-scandal.html",
    "summary": "More than a client list, MAGA is looking for meaning."
  },
  {
    "title": "Trump’s Plans to Put Emil Bove on the Supreme Court",
    "link": "https://www.nytimes.com/2025/07/16/opinion/emil-bove-trump-loyalty.html",
    "summary": "Trump wants his people calling the shots. And Bove has proved, above all, that he belongs to the president."
  },
  {
    "title": "Lightning Kills 1 and Injures 13 on Archery Range in New Jersey, Police Say",
    "link": "https://www.nytimes.com/2025/07/16/us/lightning-strike-new-jersey.html",
    "summary": "The victims range in age from 7 to 61, according to the authorities."
  },
  {
    "title": "Broadway’s ‘Gypsy’ Revival, Starring Audra McDonald, Will Close",
    "link": "https://www.nytimes.com/2025/07/16/theater/broadway-gypsy-audra-mcdonald-closing.html",
    "summary": "The show is the sixth musical to announce a closing date since last month’s Tony Awards, reflecting financial challenges facing producers."
  },
  {
    "title": "Scandal-Ridden Fyre Festival Is Sold for $245,000 on eBay",
    "link": "https://www.nytimes.com/2025/07/16/us/fyre-fesival-sold-ebay.html",
    "summary": "Billy McFarland, who served nearly four years in prison for fraud, said in April that he would put the beleaguered brand that he founded up for sale."
  },
  {
    "title": "Henry Raymont, First to Report Bay of Pigs Invasion, Dies at 98",
    "link": "https://www.nytimes.com/2025/07/16/business/media/henry-raymont-dead.html",
    "summary": "On assignment for U.P.I. in Cuba, he learned of the U.S.- backed effort to overthrow Fidel Castro and was imprisoned. He later worked for The New York Times."
  }
]