[
  {
    "title": "In Joyful Victory Speech, Mamdani Vows to Work for ‘Each and Every New Yorker’",
    "link": "https://www.nytimes.com/2025/06/25/nyregion/mamdani-speech-watch-party.html",
    "summary": "A crowd in Queens celebrated the triumph of Zohran Mamdani, the presumptive winner of the Democratic primary for mayor of New York City."
  },
  {
    "title": "Zohran Mamdani’s Success Is Especially Meaningful for Muslim New Yorkers",
    "link": "https://www.nytimes.com/2025/06/25/nyregion/mamdani-muslim-nyc.html",
    "summary": "Mr. Mamdani would be the first Muslim mayor of New York City, and his faith played a role in expanding the diverse coalition that propelled his campaign."
  },
  {
    "title": "A Stunned Cuomo Watch Party Finds Itself With Little to Celebrate.",
    "link": "https://www.nytimes.com/2025/06/24/nyregion/cuomo-watch-party-manhattan.html",
    "summary": "The former governor’s supporters were in a low-key mood even before Mr. Cuomo told them that Zohran Mamdani had won the primary."
  },
  {
    "title": "The Bombing of Iran May Teach an Unwelcome Lesson on Nuclear Weapons",
    "link": "https://www.nytimes.com/2025/06/25/world/middleeast/iran-trump-nuclear-weapons.html",
    "summary": "Will America’s pre-emptive strike discourage other countries from pursuing a weapon — or just the opposite?"
  },
  {
    "title": "Strike Set Back Iran’s Nuclear Program by Only a Few Months, U.S. Report Says",
    "link": "https://www.nytimes.com/2025/06/24/us/politics/iran-nuclear-sites.html",
    "summary": "Preliminary classified findings indicate that the attack sealed off the entrances to two facilities but did not collapse their underground buildings."
  },
  {
    "title": "How Iran Became Isolated",
    "link": "https://www.nytimes.com/video/world/middleeast/100000010248215/how-iran-became-isolated.html",
    "summary": "Christina Goldbaum, a New York Times reporter, and Katrin Bennhold, a senior writer on the international desk, discuss how the power dynamics in the Middle East could change as Iran has become more isolated."
  },
  {
    "title": "Intel Report on Iran Upends Victory Lap Trump Was Hoping for at NATO",
    "link": "https://www.nytimes.com/2025/06/24/us/politics/trump-nato-iran.html",
    "summary": "President Trump had been eager to celebrate the U.S. strikes on Iran, but a new report indicates the attack set back Iran’s nuclear program by only a few months."
  },
  {
    "title": "How People Are Coping With the East Coast Heat Spike",
    "link": "https://www.nytimes.com/2025/06/24/us/heat-wave-east-coast.html",
    "summary": "A brutally hot day across the Eastern United States left residents struggling to find relief."
  },
  {
    "title": "A Heat Wave Hits New York Earlier Than Usual for a Second Year in a Row",
    "link": "https://www.nytimes.com/2025/06/24/nyregion/nyc-heat-wave.html",
    "summary": "Climate change is increasingly making weather extremes more common."
  },
  {
    "title": "Toronto Sees Record Temperatures as Extreme Heat Settles Over Canada",
    "link": "https://www.nytimes.com/2025/06/24/world/canada/toronto-heat-wave.html",
    "summary": "Sweltering temperatures not seen in Toronto in nearly a decade have prompted health alerts, pool closures and warnings to students to expect “uncomfortable conditions.”"
  },
  {
    "title": "House Conservatives Warn They Can’t Back Senate Bill to Enact Trump’s Agenda",
    "link": "https://www.nytimes.com/2025/06/24/us/politics/house-conservatives-senate-big-beautiful-bill.html",
    "summary": "Both President Trump and Senate Republican leaders are pressing for the House to accept their version of the sprawling domestic policy bill, but some right-wing holdouts are opposed to key pieces."
  },
  {
    "title": "Returning to Supreme Court, Trump Accuses Judge in Migrant Case of Defiance",
    "link": "https://www.nytimes.com/2025/06/24/us/supreme-court-migrants-sudan.html",
    "summary": "After the justices let the administration deport migrants to countries with which they had no connection, a federal judge blocked the removal of eight men."
  },
  {
    "title": "Cassidy, in Break With RFK Jr., Calls for Vaccine Meeting Delay",
    "link": "https://www.nytimes.com/2025/06/24/us/politics/cassidy-kennedy-vaccine-committee.html",
    "summary": "The Senate health committee chairman said new members of a key advisory panel who were appointed by Robert F. Kennedy Jr. “lack experience.”"
  },
  {
    "title": "How a Birthday Boat Ride on Lake Tahoe Turned Tragic",
    "link": "https://www.nytimes.com/2025/06/24/us/lake-tahoe-deaths-weather.html",
    "summary": "Eight people died when a surprise storm caused dangerous waves on the lake along the California-Nevada border, upending boats and tossing passengers into the frigid water."
  },
  {
    "title": "Marcia Resnick, Whose Camera Captured New York’s ‘Bad Boys’, Dies at 74",
    "link": "https://www.nytimes.com/2025/06/24/arts/marcia-resnick-dead.html",
    "summary": "A conceptual artist, she used photography to make surrealistic images and then went on to document Manhattan’s downtown scene and its mostly male provocateurs."
  },
  {
    "title": "A Colorado County Shows Why Mike Lee’s Plan to Sell Public Land Failed",
    "link": "https://www.nytimes.com/2025/06/24/us/politics/mike-lee-public-lands-selloff-colorado.html",
    "summary": "Senator Mike Lee hoped to sell millions of acres of federal land through President Trump’s policy bill, in part to ease housing costs. The opposition was bipartisan, in Congress and the West."
  },
  {
    "title": "Women in Menopause Don’t Care",
    "link": "https://www.nytimes.com/2025/06/24/well/menopause-melani-sanders-club.html",
    "summary": "The “We Do Not Care” club, founded by influencer Melani Sanders, celebrates women who have stopped trying to please everyone."
  },
  {
    "title": "If This Mideast War Is Over, Get Ready for Some Interesting Politics",
    "link": "https://www.nytimes.com/2025/06/24/opinion/iran-israel-regime-change.html",
    "summary": "Everyone went all the way in the Israel-Iran conflict, bursting through psychological and military barriers we never imagined would be breached."
  },
  {
    "title": "Lauren Sánchez, Jeff Bezos and the Triumph of Tacky",
    "link": "https://www.nytimes.com/2025/06/25/opinion/jeff-bezos-lauren-sanchez-wedding.html",
    "summary": "In the wake of President Trump’s second election, it’s the luxe life at full volume."
  },
  {
    "title": "Takeaways From Hard Fork’s Interview With OpenAI’s Sam Altman",
    "link": "https://www.nytimes.com/2025/06/25/technology/hard-fork-sam-altman.html",
    "summary": "Mr. Altman discussed President Trump’s understanding of artificial intelligence, the war for A.I. talent and OpenAI’s relationship with Microsoft."
  },
  {
    "title": "Missing Bolts and Other Failures Caused Plane Panel to Blow Off, N.T.S.B. Says",
    "link": "https://www.nytimes.com/2025/06/24/us/politics/boeing-alaska-airlines-plane-737-panel-accident.html",
    "summary": "A panel came off an Alaska Airlines Boeing 737 Max 9 midair last year in an incident that was nearly disastrous but for the heroics of the crew, according to government investigators."
  },
  {
    "title": "Mick Ralphs, of Mott the Hoople and Bad Company, Dies at 81",
    "link": "https://www.nytimes.com/2025/06/24/arts/music/mick-ralphs-of-dead.html",
    "summary": "A guitarist and songwriter, he ditched glam rock at its peak and scored with meatier stadium-rock anthems like “Can’t Get Enough” and “Feel Like Making Love.”"
  },
  {
    "title": "The Yellow Sea Dispute Between China and South Korea",
    "link": "https://www.nytimes.com/2025/06/24/world/asia/china-south-korea-sea-dispute.html",
    "summary": "China has installed large steel cages and a former oil drilling rig in the Yellow Sea, raising concerns in South Korea that they could be used for military purposes."
  }
]