[
  {
    "title": "As Trump Weighs Possible Iran Strikes, U.S. Military Moves Into Place",
    "link": "https://www.nytimes.com/2026/02/18/us/politics/us-military-iran.html",
    "summary": "President Trump has given no indication that he has made a decision about how to proceed, as diplomatic talks continue."
  },
  {
    "title": "Maps: Where the U.S. Is Building Up Military Force Near Iran",
    "link": "https://www.nytimes.com/2026/01/29/us/politics/trump-iran-us-military-maps.html",
    "summary": "President Trump has not authorized military action in Iran, but the United States has built up its presence in the region in recent weeks. Now it’s sending even more firepower."
  },
  {
    "title": "Sugar Bowl Academy Says Multiple Victims Were Tied to Its Ski Resort School",
    "link": "https://www.nytimes.com/2026/02/18/us/tahoe-avalanche-skiers-sugar-bowl-school.html",
    "summary": "Sugar Bowl Academy, a ski-focused private school in the Sierra Nevada, said that multiple people on the fatal trek were connected to its program."
  },
  {
    "title": "Satellite Feature on iPhone Allowed Skiers to Seek Help After Avalanche",
    "link": "https://www.nytimes.com/2026/02/18/us/apple-iphone-sos-satellite-rescue.html",
    "summary": "The Emergency SOS feature on iPhones can send texts to emergency responders via satellite when there is no cell tower nearby."
  },
  {
    "title": "As ICE Buys Up Warehouses, Even Some Trump Voters Say No",
    "link": "https://www.nytimes.com/2026/02/18/us/politics/ice-warehouses-trump-voters.html",
    "summary": "The agency is ramping up arrests, but local pushback is complicating efforts to expand detention capacity and prevent overcrowding."
  },
  {
    "title": "Donald J. Trump International Airport? The President’s Company Trademarked It.",
    "link": "https://www.nytimes.com/2026/02/18/us/politics/trump-trademark-airport-name.html",
    "summary": "The Trump organization said the move was necessary to protect the brand as Florida prepares to rename an airport after the president."
  },
  {
    "title": "Officials Violated Court Orders on Immigration in New Jersey, Justice Dept. Tells Judge",
    "link": "https://www.nytimes.com/2026/02/18/us/politics/court-orders-new-jersey-immigrants.html",
    "summary": "The violations stemmed from immigration cases. Judges across the country have expressed alarm about illegal transfers and missed deadlines."
  },
  {
    "title": "Administration Targets Noncitizen Voting, Despite Finding It Rare",
    "link": "https://www.nytimes.com/2026/02/18/us/politics/voting-trump-immigrants-midterms.html",
    "summary": "The intensified push is part of an extraordinary all-fronts effort to insert federal law enforcement into the machinery of American elections ahead of the midterms."
  },
  {
    "title": "Texas Election Season Heats Up as Early Voting in Senate Primaries Begins",
    "link": "https://www.nytimes.com/2026/02/18/us/politics/texas-elections-senate-primary.html",
    "summary": "Both parties’ Senate primary races are kicking into high gear."
  },
  {
    "title": "These Olympians Excel on Two Types of Tracks",
    "link": "https://www.nytimes.com/2026/02/19/world/olympics/these-olympians-excel-on-two-types-of-tracks.html",
    "summary": "Among elite athletes exists an even more exclusive club: people who compete at both the Summer and Winter Games. Many are sprinters who turn to bobsled."
  },
  {
    "title": "Russia Celebrated Him. Now He’s Accused of Having Troops Shoot Themselves.",
    "link": "https://www.nytimes.com/2026/02/19/world/europe/russia-military-corruption.html",
    "summary": "A lieutenant colonel is on trial after being accused of skimming payments for battlefield injuries. He denies the specifics of Russia’s accusation but acknowledges engaging in a payouts scheme."
  },
  {
    "title": "The Behind the Scenes Search for Compromise on Territory in Ukraine Talks",
    "link": "https://www.nytimes.com/2026/02/18/world/europe/ukraine-russia-peace-talks-demilitarized-zone.html",
    "summary": "The latest round of talks ended with no indication of progress, but negotiators are bargaining over who will control land in eastern Ukraine if they reach a settlement."
  },
  {
    "title": "Money Talks as India Searches for Its Place in Global A.I.",
    "link": "https://www.nytimes.com/2026/02/19/business/india-ai-impact-summit.html",
    "summary": "Narendra Modi, the prime minister, convened foreign leaders, the richest Silicon Valley companies and thousands of Indian entrepreneurs for a week of deal making."
  },
  {
    "title": "Defense Department and Anthropic Square Off in Dispute Over A.I. Safety",
    "link": "https://www.nytimes.com/2026/02/18/technology/defense-department-anthropic-ai-safety.html",
    "summary": "How artificial intelligence will be used in future battlefields is an issue that has turned increasingly political and may put Anthropic in a bind."
  },
  {
    "title": "Kansas, Idaho, Utah, Oklahoma in New Push to Restrict Transgender Rights",
    "link": "https://www.nytimes.com/2026/02/18/us/republican-states-transgender-rights-restrictions.html",
    "summary": "In states that once focused mainly on health care and sports for transgender minors, debates now revolve around the validity of transgender identity."
  },
  {
    "title": "After Activist’s Killing, Tensions Erupt Between France’s Far-Right and Far-Left",
    "link": "https://www.nytimes.com/2026/02/18/world/europe/france-beating-activist-far-left-right.html",
    "summary": "The beating death of Quentin Deranque has quickly become a flashpoint between the far right and far left as France prepares for local elections next month and presidential elections next year."
  },
  {
    "title": "What To Know About the Trial of Yoon Suk Yeol, South Korea’s Ousted Leader",
    "link": "https://www.nytimes.com/2026/02/19/world/asia/yoon-sentencing-south-korea.html",
    "summary": "Judges will rule on Thursday in the insurrection trial of former President Yoon Suk Yeol. He could get the death penalty for his short-lived imposition of martial law in 2024."
  },
  {
    "title": "In Guthrie Mystery, Rampant Speculation Is Like ‘Salt on the Open Wound’",
    "link": "https://www.nytimes.com/2026/02/18/us/nancy-guthrie-kidnapping-theories-true-crime.html",
    "summary": "True crime obsessives, internet theorizers and livestreamers are complicating the investigation of the kidnapping of Nancy Guthrie, the mother of the “Today” show host Savannah Guthrie."
  },
  {
    "title": "Ethan Hawke on ‘Blue Moon,’ ‘Reality Bites’ and the Lessons He’s Learned",
    "link": "https://www.nytimes.com/2026/02/18/movies/ethan-hawke-blue-moon-interview.html",
    "summary": "A best actor Oscar contender for “Blue Moon,” the star reflects on turbulent times in Hollywood and the notion of selling out: “I think about it constantly.”"
  },
  {
    "title": "With a New Oscar on the Line, How Do You Judge Casting?",
    "link": "https://www.nytimes.com/2026/02/18/movies/casting-oscar-marty-supreme.html",
    "summary": "Contenders say the criteria for judging the category can vary from, say, the number of newcomers to the seamlessness of the ensemble."
  },
  {
    "title": "Kennedy’s MAHA Coalition Is a Mess",
    "link": "https://www.nytimes.com/2026/02/18/opinion/kennedy-maha-moderna.html",
    "summary": "A political movement cannot survive on spite alone."
  },
  {
    "title": "One Man Stole $660 Million. He’ll Never Pay It Back.",
    "link": "https://www.nytimes.com/2026/02/18/opinion/corruption-trump-accountability.html",
    "summary": "Ordinary citizens have a range of legal tools to hold the rich and politically connected accountable."
  },
  {
    "title": "Bernie Sanders Urges Support of California Billionaire Tax at Los Angeles Rally",
    "link": "https://www.nytimes.com/2026/02/19/us/bernie-sanders-california-billionaire-tax.html",
    "summary": "The senator from Vermont was the only elected leader at the event, which formally kicked off a health care union’s campaign to put the tax proposal on the ballot."
  },
  {
    "title": "Texas Congressman’s Aide Told Co-Worker of Affair Before Killing Herself",
    "link": "https://www.nytimes.com/2026/02/18/us/politics/texas-gonzales-suicide-affair.html",
    "summary": "The co-worker, who no longer works for Representative Tony Gonzales, shared screenshots of the text exchange with The New York Times. Mr. Gonzales accused his Republican primary challenger of being behind the revelation."
  },
  {
    "title": "Shipwreck Found at the Bottom of Lake Michigan After Nearly 150 Years",
    "link": "https://www.nytimes.com/2026/02/18/us/shipwreck-lac-la-belle-discovered-lake-michigan.html",
    "summary": "The steamer Lac La Belle, which was carrying passengers and cargo, sank in a storm in 1872. Eight people died when one of its lifeboats capsized."
  },
  {
    "title": "Police Chief Hired to Help Lead N.Y.C. Hospital Patrols Abruptly Quits",
    "link": "https://www.nytimes.com/2026/02/18/nyregion/jamiel-altaheri-hamtramck-nyc-hospitals.html",
    "summary": "The assistant chief, Jamiel Altaheri, resigned almost immediately after starting the job, after The New York Times asked about misconduct allegations while he was a police chief in Michigan."
  }
]