[
  {
    "title": "Former Palm Beach Police Chief Said Trump Told Him ‘Everyone’ Knew About Epstein in 2006",
    "link": "https://www.nytimes.com/2026/02/10/us/politics/trump-epstein.html",
    "summary": "Michael Reiter, a former Palm Beach police chief, described a 2006 conversation with Donald Trump to the F.B.I. years later, according to a newly released document."
  },
  {
    "title": "Lutnick Acknowledges Traveling to Epstein’s Island",
    "link": "https://www.nytimes.com/2026/02/10/us/politics/howard-lutnick-jeffrey-epstein-island.html",
    "summary": "The commerce secretary, Howard Lutnick, acknowledged at a Senate hearing that he and his family visited Jeffrey Epstein on his private island."
  },
  {
    "title": "Peter Attia’s Ties to Epstein Spark a Backlash From Doctors",
    "link": "https://www.nytimes.com/2026/02/10/well/peter-attia-jeffrey-epstein-doctors-backlash.html",
    "summary": "What started as a rebuke of Dr. Attia has become a discussion about his credentials, longevity medicine and whom patients should trust."
  },
  {
    "title": "Epstein Files Reveal Efforts to Build Ties With Russian Officials, Including Putin",
    "link": "https://www.nytimes.com/2026/02/10/business/epstein-files-russia-putin.html",
    "summary": "New documents detail Jeffrey Epstein’s efforts to foster strategic, sometimes reciprocal relationships with Russian officials."
  },
  {
    "title": "Georgia Ballot Inquiry Originated With Election Denier in Trump White House",
    "link": "https://www.nytimes.com/2026/02/10/us/politics/fulton-county-kurt-olsen-fbi-search-2020-ballots.html",
    "summary": "A newly unsealed affidavit showed that a criminal investigation into the 2020 election in Fulton County, Ga., relied heavily on claims about ballots that have been widely debunked."
  },
  {
    "title": "Pentagon to Send 200 Troops to Nigeria",
    "link": "https://www.nytimes.com/2026/02/10/us/politics/us-troops-nigeria.html",
    "summary": "The troops will help train Nigerians to fight militants, but will not be involved in combat. U.S. forces have been assisting local soldiers with identifying potential terrorist targets."
  },
  {
    "title": "Before Trump Blasted U.S.-Canada Bridge, Owner of Competing Span Lobbied Administration",
    "link": "https://www.nytimes.com/2026/02/10/world/canada/bridge-owner-trump-lutnick.html",
    "summary": "A Detroit billionaire met with Howard Lutnick, the commerce secretary, hours before President Trump said he would block the opening of a new bridge connecting Detroit to Canada, officials said."
  },
  {
    "title": "Michigan Judge Rebukes Justice Department’s Effort to Obtain Voter Data",
    "link": "https://www.nytimes.com/2026/02/10/us/politics/michigan-judge-voter-data.html",
    "summary": "The ruling from a Trump-appointed federal judge is the third in recent weeks to reject the administration’s demand for voters’ personal data from nearly every state."
  },
  {
    "title": "‘No Reason He Should Have Died’: Alex Pretti’s Parents Open Up",
    "link": "https://www.nytimes.com/2026/02/10/us/alex-pretti-parents-interview.html",
    "summary": "In their first sit-down interview, Michael and Susan Pretti avoided recriminations and recalled the son that Michael called “an exceptionally kind, caring man.”"
  },
  {
    "title": "Don Lemon Hires Federal Prosecutor Joseph H. Thompson in Minneapolis Church Protest Case",
    "link": "https://www.nytimes.com/2026/02/10/us/joseph-thompson-don-lemon-minneapolis-protest.html",
    "summary": "Facing charges over his role at a church protest, Mr. Lemon, a journalist, retained a veteran litigator who recently resigned from the U.S. attorney’s office in Minnesota."
  },
  {
    "title": "F.D.A. Refuses to Review Moderna Flu Vaccine",
    "link": "https://www.nytimes.com/2026/02/10/health/fda-moderna-mrna-flu-vaccine.html",
    "summary": "The vaccine maker’s shots involve the successful Covid vaccines’ RNA technology. Health Secretary Robert F. Kennedy Jr. has broadly rejected it, canceling millions of dollars in research projects."
  },
  {
    "title": "Republican Cash Edge Threatens to Swamp Democrats in the Midterms",
    "link": "https://www.nytimes.com/2026/02/10/us/politics/republicans-democrats-midterms-fund-raising.html",
    "summary": "“Donald Trump has 99 problems going into the midterms,” one Democratic strategist said. “But money ain’t one.”"
  },
  {
    "title": "Susan Collins Runs for Re-election, in One of 2026’s Top Senate Fights",
    "link": "https://www.nytimes.com/2026/02/10/us/politics/susan-collins-maine-senate-2026.html",
    "summary": "The Maine Republican is one of her party’s most vulnerable senators, and her seat is crucial to Democratic hopes of retaking control of the chamber."
  },
  {
    "title": "Analilia Mejia Declares Victory in NJ Race After Her Main Rival Concedes",
    "link": "https://www.nytimes.com/2026/02/10/nyregion/new-jersey-special-election-winner.html",
    "summary": "Tom Malinowski, who was battered by negative advertising, congratulated Analilia Mejia, a progressive political organizer running for Gov. Mikie Sherrill’s vacant seat in Congress, on a “hard-won victory.”"
  },
  {
    "title": "Climate Change Is Erased From Reference Manual on Scientific Evidence for Judges",
    "link": "https://www.nytimes.com/2026/02/10/climate/judge-manual-climate-change-chapter.html",
    "summary": "After Republican criticism, a group that offers professional resources to judges withdrew a climate science chapter from its Reference Manual on Scientific Evidence."
  },
  {
    "title": "Behind the E.P.A.’s Rush to Repeal the Endangerment Finding",
    "link": "https://www.nytimes.com/2026/02/10/climate/epa-endangerment-supreme-court.html",
    "summary": "The agency is racing to repeal a scientific finding that requires it to fight global warming. Experts say the goal is to get the matter before the justices while President Trump is still in office."
  },
  {
    "title": "A Desperate Father, a Troubled Son and Death in a 5-Star Hotel",
    "link": "https://www.nytimes.com/2026/02/10/nyregion/henry-mcgowan-ireland-murder.html",
    "summary": "Henry McGowan headed for Europe, showing signs of mental distress. His father, John McGowan, raced after him. This week, the son will stand trial in Ireland, accused of his father’s murder."
  },
  {
    "title": "Hamas Would Keep Some Weapons Initially in Draft Gaza Plan",
    "link": "https://www.nytimes.com/2026/02/10/world/middleeast/hamas-weapons-draft-plan.html",
    "summary": "Israel is unlikely to withdraw its troops from the enclave before Hamas and other militant groups lay down their arms."
  },
  {
    "title": "Israelis Protest Surge in Gun Crime Within Arab Community",
    "link": "https://www.nytimes.com/2026/02/10/world/middleeast/israelis-protest-surge-in-gun-crime-within-arab-community.html",
    "summary": "Palestinian and Jewish citizens of Israel joined forces to demand government action in the face of a spiraling death toll from criminal violence among Arabs."
  },
  {
    "title": "Mexican Cartel’s Seized Ammunition Is Traced to U.S. Army Plant",
    "link": "https://www.nytimes.com/2026/02/10/world/americas/mexico-cartel-ammunition-us-army.html",
    "summary": "About 137,000 .50-caliber rounds have been seized since 2012, and of those, 47 percent came from a plant in Kansas City, Mo., Mexico’s defense secretary said."
  },
  {
    "title": "Bad Bunny’s Super Bowl Halftime Show and the Everyday People Who Made It Authentic",
    "link": "https://www.nytimes.com/2026/02/10/arts/music/bad-bunny-super-bowl-show-everyday-people.html",
    "summary": "A priest from Sacramento. A bar owner from New York. A taquero from Los Angeles. Puerto Rico came alive at the Super Bowl because of hundreds of non-famous performers."
  },
  {
    "title": "Lost Soviet Luna 9 Moon Lander May Have Been Found",
    "link": "https://www.nytimes.com/2026/02/10/science/luna-9-moon-lander-soviet.html",
    "summary": "Two research teams have identified possible landing sites for Luna 9, the first human-made object to safely reach the lunar surface. “One of them is wrong,” an expert said."
  },
  {
    "title": "Dissidents Are Silenced, and the West Moves On",
    "link": "https://www.nytimes.com/2026/02/10/opinion/jimmy-lai-hong-kong-freedom.html",
    "summary": "On Jimmy Lai and the future of freedom."
  },
  {
    "title": "A.I. May Put Progressives to the Test",
    "link": "https://www.nytimes.com/2026/02/10/opinion/ai-politics-left-progressive.html",
    "summary": "The left needs a sharper A.I. politics."
  },
  {
    "title": "New Video Shows a Masked Figure at Nancy Guthrie’s Door",
    "link": "https://www.nytimes.com/2026/02/10/briefing/video-nancy-guthrie-republicans-cash-advantage.html",
    "summary": "Also, Republicans have a huge cash advantage. Here’s the latest at the end of Tuesday."
  },
  {
    "title": "Britney Spears Sells Her Song Catalog",
    "link": "https://www.nytimes.com/2026/02/10/arts/music/britney-spears-catalog-deal.html",
    "summary": "The pop hitmaker, who hasn’t released a new album in 10 years, sold the rights to her music to Primary Wave."
  },
  {
    "title": "Ford Says Electric Vehicle Losses Will Continue for Three More Years",
    "link": "https://www.nytimes.com/2026/02/10/business/ford-earnings-electric-vehicles.html",
    "summary": "Ford Motor reported a big loss for 2025 because of its troubled electric vehicle division, which it has significantly scaled back."
  },
  {
    "title": "Man Is Charged in 2021 Acid Attack Against Woman on Long Island",
    "link": "https://www.nytimes.com/2026/02/10/nyregion/acid-attack-long-island-charges.html",
    "summary": "Terrell Campbell, 29, was charged with assaulting Nafiah Ikram outside her home. Mr. Campbell later described the assault in a rap lyric, prosecutors said."
  },
  {
    "title": "Russia Further Restricts Telegram, Escalating Internet Clampdown",
    "link": "https://www.nytimes.com/2026/02/10/world/europe/telegram-throttled-internet-russia.html",
    "summary": "The throttling of the communication app, used by more than 100 million Russians, endangers what remains of the country’s free internet."
  }
]