[
  {
    "title": "Federal Workers’ ‘Emotional Roller Coaster’: Fired, Rehired, Fired Again",
    "link": "https://www.nytimes.com/2025/07/15/us/politics/fired-federal-workers-trump.html",
    "summary": "Former government employees are finding that perhaps the only thing harder than getting laid off from the federal government is staying that way."
  },
  {
    "title": "Supreme Court Allows Trump to Gut Education Department With Mass Firings",
    "link": "https://www.nytimes.com/2025/07/14/us/politics/supreme-court-education-department.html",
    "summary": "The move by the justices represents an expansion of executive power, allowing President Trump to dismantle the inner workings of a government department."
  },
  {
    "title": "What to Know About Trump’s Cuts to the Education Department",
    "link": "https://www.nytimes.com/2025/07/14/us/trump-administration-education-department-dismantle.html",
    "summary": "Cuts have hit most of the department’s main functions, which include investigating civil rights complaints, providing financial aid, researching what works in education, testing students and disbursing federal funding."
  },
  {
    "title": "Student Loan Repayments Are About to Look Very Different",
    "link": "https://www.nytimes.com/2025/07/15/your-money/student-loans/student-loan-repayment-plans.html",
    "summary": "By next summer, new borrowers will have just two repayment options, streamlining the previous menu to pay off higher-education debt. Here’s what to know."
  },
  {
    "title": "Trump’s New Ultimatum for Putin, and an Epstein Backlash",
    "link": "https://www.nytimes.com/2025/07/15/podcasts/the-headlines/trumps-new-ultimatum-for-putin-and-an-epstein-backlash.html",
    "summary": "Plus, the origins of an iconic TV theme song."
  },
  {
    "title": "Behind Trump’s Tough Talk on Russia and Putin, Doubts and Missing Details",
    "link": "https://www.nytimes.com/2025/07/14/us/politics/trump-russia-ukraine-nato.html",
    "summary": "Pentagon officials said details were still being worked out, and experts doubted Mr. Trump’s threat of huge tariffs for Russian trading partners."
  },
  {
    "title": "What We Know About the U.S. Deal for a Weapons Pipeline to Ukraine",
    "link": "https://www.nytimes.com/2025/07/15/world/europe/ukraine-weapons-us-nato.html",
    "summary": "NATO allies will buy arms, then give them to Ukraine, President Trump said."
  },
  {
    "title": "China’s Economy Grows Steadily Despite Trump’s Tariffs",
    "link": "https://www.nytimes.com/2025/07/14/business/china-economy-gdp-q2.html",
    "summary": "Official figures showed modest growth in the second quarter as exports shifted to other countries and Beijing invested in manufacturing and infrastructure."
  },
  {
    "title": "Nvidia Says U.S. Has Lifted Restrictions on A.I. Chip Sales to China",
    "link": "https://www.nytimes.com/2025/07/14/technology/nvidia-ai-chip-sales-china.html",
    "summary": "The Silicon Valley chip giant said the Trump administration, which had shut down its sales to China three months ago, had assured it that licenses for the sales would now be granted."
  },
  {
    "title": "For Big Banks, the Trump Era Is Proving Profitable Thus Far",
    "link": "https://www.nytimes.com/2025/07/15/business/jpmorgan-wells-fargo-citi-banks-economy.html",
    "summary": "JPMorgan’s Jamie Dimon lauded the “resilient” U.S. economy as his bank reported bumper quarterly earnings."
  },
  {
    "title": "Clearer Skies Expected in Northeast as Storms Move Southward",
    "link": "https://www.nytimes.com/2025/07/15/nyregion/rain-storms-northeast-forecast.html",
    "summary": "Lingering showers were forecast for the New York City area, but heavy rain and threats of flash flooding were predicted to shift south on Tuesday."
  },
  {
    "title": "The First 2025 Emmy Nominations Are Announced",
    "link": "https://www.nytimes.com/2025/07/15/arts/television/emmy-nominations-2025.html",
    "summary": "The nominees for best talk show and reality series were named, with the slates for the other categories set to be announced later this morning at the Television Academy’s Los Angeles headquarters."
  },
  {
    "title": "Israel and Iran Usher In New Era of Psychological Warfare",
    "link": "https://www.nytimes.com/2025/07/15/technology/israel-iran-psychological-warfare.html",
    "summary": "The 12-day conflict was marked by a flurry of propaganda, disinformation and covert operations aided by artificial intelligence and spread by social media."
  },
  {
    "title": "Israel Targets Syria and Lebanon in Wave of Airstrikes",
    "link": "https://www.nytimes.com/2025/07/15/world/middleeast/airstrikes-israel-syria-lebanon.html",
    "summary": "In Syria, Israel launched rare attacks on forces of the new government, while in Lebanon it took aim at the Iran-backed militant group Hezbollah."
  },
  {
    "title": "Three Universities Will Face Congress Over Antisemitism Allegations",
    "link": "https://www.nytimes.com/2025/07/15/us/politics/antisemitism-hearing-uc-berkeley-georgetown-cuny.html",
    "summary": "Leaders from Georgetown, the City University of New York and the University of California, Berkeley, will become the latest to testify about accusations of campus antisemitism."
  },
  {
    "title": "PBS and NPR’s Last-Ditch Fight to Save Funding",
    "link": "https://www.nytimes.com/2025/07/15/business/media/npr-pbs-funding-fight.html",
    "summary": "As a vote to cut more than $500 million per year in federal funding nears, stations are making their pitches to lawmakers, listeners and “Viewers Like You.”"
  },
  {
    "title": "A Summer Camp Reopens in the Texas Hill Country",
    "link": "https://www.nytimes.com/2025/07/15/us/texas-flood-camp-reopens.html",
    "summary": "Barely a week after devastating floods destroyed Camp Mystic and killed at least 132, Camp CAMP, which serves disabled youth, reopened Monday, thanks to a herculean cleanup led by a volunteer army."
  },
  {
    "title": "Fewer Than 100 Unaccounted For in Texas Flood as Officials Decry ‘Blame Game’",
    "link": "https://www.nytimes.com/2025/07/14/us/texas-kerr-county-flood-response.html",
    "summary": "In Kerr County, where the most deaths occurred, officials said they were receiving threats, even as they continued to deflect questions about flood warnings."
  },
  {
    "title": "Democrats Are Workshopping New Tactics After Losses of 2024",
    "link": "https://www.nytimes.com/2025/07/15/us/politics/democrats-voters-ads-campaigns.html",
    "summary": "Among the ideas being promoted: knocking on every single door in a House district and awarding cash prizes for the most effective new ways to reach voters."
  },
  {
    "title": "Democrats Must ‘Toughen Up’ Against Trump, Obama Tells Donors",
    "link": "https://www.nytimes.com/2025/07/14/us/politics/barack-obama-trump-democrats.html",
    "summary": "Frustrated that prominent Democrats have not fought harder, former President Barack Obama said in a speech that his party’s leaders needed to step up."
  },
  {
    "title": "John MacArthur, Firebrand Preacher and Culture Warrior, Dies at 86",
    "link": "https://www.nytimes.com/2025/07/15/us/john-macarthur-dead.html",
    "summary": "He was a theologically uncompromising pastor in Southern California who influenced generations of evangelical preachers."
  },
  {
    "title": "Even Grave Errors at Rehab Hospitals Go Unpenalized and Undisclosed",
    "link": "https://www.nytimes.com/2025/07/15/health/even-grave-errors-at-rehab-hospitals-go-unpenalized-and-undisclosed.html",
    "summary": "For-profit hospitals provide most inpatient physical therapy but tend to have worse readmission rates to general hospitals. Medicare doesn’t tell consumers about troubling inspections."
  },
  {
    "title": "How to Find the Right Medical Rehab Services",
    "link": "https://www.nytimes.com/2025/07/15/health/how-to-find-the-right-medical-rehab-services.html",
    "summary": "Specialized hospitals, nursing homes, clinics and home health agencies provide rehab therapy. Insurers may limit the services you can get."
  },
  {
    "title": "Blazes in Northern Ireland Recall an Old Message: You Are Not Welcome Here",
    "link": "https://www.nytimes.com/2025/07/15/world/europe/northern-ireland-bonfire-arson-ballymena-riots.html",
    "summary": "A bonfire topped with an effigy of a migrant boat. Homes set alight. During the Troubles, similar tactics were used to target Irish Catholics in the territory."
  },
  {
    "title": "I’m a Genocide Scholar. I Know It When I See It.",
    "link": "https://www.nytimes.com/2025/07/15/opinion/israel-gaza-holocaust-genocide-palestinians.html",
    "summary": "A scholar of genocide comes to a painful conclusion about Israel’s actions in Gaza."
  },
  {
    "title": "If You Like 35 Percent Inflation, Go Ahead, Fire the Fed Chair",
    "link": "https://www.nytimes.com/2025/07/15/opinion/fed-trump-fire-powell.html",
    "summary": "Comparisons to what happened in Turkey and Hungary are not far-fetched."
  },
  {
    "title": "The Epstein Saga",
    "link": "https://www.nytimes.com/2025/07/15/briefing/maga-bondi-epstein-files.html",
    "summary": "We explore the MAGA base’s attachment to Jeffrey Epstein conspiracy theories."
  },
  {
    "title": "Seth Meyers Is Amused by MAGA’s Epstein Infighting",
    "link": "https://www.nytimes.com/2025/07/15/arts/television/seth-meyers-jeffrey-epstein-trump.html",
    "summary": "President Trump’s most conspiracy-minded supporters can’t believe he wants them to forget about the Jeffrey Epstein conspiracy theories."
  },
  {
    "title": "The D.E.I. Industry, Scorned by the White House, Turns to ‘Safer’ Topics",
    "link": "https://www.nytimes.com/2025/07/15/business/trump-dei-race-gender-mental-health.html",
    "summary": "To avoid government scrutiny, companies are asking for fewer trainings focused on race and gender and more on neurodivergence and generational differences."
  },
  {
    "title": "Lingering Moose Shuts Down Popular Adirondack Trail for a Month",
    "link": "https://www.nytimes.com/2025/07/15/nyregion/moose-goodman-mountain-trail.html",
    "summary": "Sickness, not stubbornness, is the most likely explanation for the animal’s “unusual behaviors,” which prompted the unusually long closure, officials said."
  },
  {
    "title": "Australian Premier Albanese Meets China’s Xi in Beijing",
    "link": "https://www.nytimes.com/2025/07/15/world/asia/china-australia-trade-security.html",
    "summary": "Prime Minister Anthony Albanese is trying to deepen ties with China, his country’s biggest trading partner, while being under pressure from the United States."
  },
  {
    "title": "Unreleased Beyoncé Music Stolen During Cowboy Carter Tour in Atlanta, Police Say",
    "link": "https://www.nytimes.com/2025/07/14/us/beyonce-unreleased-music-stolen-atlanta.html",
    "summary": "Two members of Beyoncé’s team said that their S.U.V. was broken into  on July 8, just before a series of concerts in Atlanta, the authorities said. The police said a suspect had emerged."
  }
]