[
  {
    "title": "New York City Faces Its Second Big Storm in Weeks",
    "link": "https://www.nytimes.com/2026/02/22/weather/storm-nyc-preparations-mamdani.html",
    "summary": "The storm in late January was bad enough. This one is bringing true blizzard conditions, and the city has stepped up its response."
  },
  {
    "title": "Trump Considers Targeted Strike Against Iran, Followed by Larger Attack",
    "link": "https://www.nytimes.com/2026/02/22/us/politics/trump-iran-strike-attack.html",
    "summary": "The top negotiators plan to meet in Geneva on Thursday for last-ditch talks, debating a new proposal that could create an off-ramp as two carrier groups massed within striking distance of Iran."
  },
  {
    "title": "Iran Could Direct Proxies to Attack U.S. Targets Abroad, Officials Warn",
    "link": "https://www.nytimes.com/2026/02/22/us/politics/iran-terrorist-attacks-proxies-trump.html",
    "summary": "Security officials are monitoring increasingly worrisome signs as President Trump considers another military campaign against Iran."
  },
  {
    "title": "Inside Iran’s Preparations for War and Plans for Survival",
    "link": "https://www.nytimes.com/2026/02/22/world/middleeast/iran-larijani-khamenei-pezeshkian.html",
    "summary": "Ayatollah Ali Khamenei has entrusted Ali Larijani, the top national security official, to ensure the Islamic Republic endures any military attacks and targeted killings."
  },
  {
    "title": "Armed Man Is Fatally Shot at Mar-a-Lago, Secret Service Says",
    "link": "https://www.nytimes.com/2026/02/22/us/politics/mar-a-lago-shooting-secret-service.html",
    "summary": "The local sheriff identified the man as a 21-year-old resident of Cameron, N.C. The president was not at his resort in Florida and has not commented on the shooting."
  },
  {
    "title": "Armed Man Shot Dead at Mar-a-Lago by Trump’s Secret Service Was a 21-Year-Old From N.C.",
    "link": "https://www.nytimes.com/2026/02/22/us/north-carolina-man-shot-html.html",
    "summary": "The 21-year-old man, from North Carolina, was killed by law enforcement officers after he entered secure perimeter of Mar-a-Lago."
  },
  {
    "title": "Here Are the Rare Instances of Fatal Shootings by the Secret Service",
    "link": "https://www.nytimes.com/2026/02/22/us/politics/secret-service-fatal-shootings.html",
    "summary": "Sunday’s shooting of an armed man at President Trump’s Florida club is one of only a handful of fatal encounters that the agency has had in its 160-year history."
  },
  {
    "title": "Mexican Forces Kill ‘El Mencho,’ Nation’s Most-Wanted Cartel Boss",
    "link": "https://www.nytimes.com/2026/02/22/world/americas/jalisco-new-generation-cartel-leader-killed.html",
    "summary": "“El Mencho” was the longtime head of one of the nation’s most powerful cartels. Armed groups set fire to cars and buildings across Mexico in the wake of his death."
  },
  {
    "title": "What to Know About the Killing of ‘El Mencho’",
    "link": "https://www.nytimes.com/2026/02/22/world/americas/el-mencho-mexico-what-we-know.html",
    "summary": "The Mexican government has killed Nemesio Oseguera Cervantes, the longtime leader of one of Mexico’s most powerful gangs, the Jalisco New Generation Cartel."
  },
  {
    "title": "Trump Aides Project Confidence on Tariffs After Court Loss",
    "link": "https://www.nytimes.com/2026/02/22/business/trump-administration-tariffs-supreme-court-loss.html",
    "summary": "Administration officials maintain that they can replicate the sky-high duties recently invalidated by the Supreme Court."
  },
  {
    "title": "When Faced With Claims of Racism, Trump Points to His Black Friends",
    "link": "https://www.nytimes.com/2026/02/22/us/politics/trump-black-people-history.html",
    "summary": "President Trump has often invoked his unnamed Black friends, or name-checked celebrities and athletes, when asked to discuss anything related to Black voters."
  },
  {
    "title": "F.B.I. Director Celebrates Olympic Hockey Victory on Day of Mar-a-Lago Shooting",
    "link": "https://www.nytimes.com/2026/02/22/us/politics/fbi-director-patel-olympics-mar-a-lago.html",
    "summary": "Kash Patel’s trip to Italy came at a fraught and frenetic time for the bureau and Mr. Patel, who has shown little willingness to curb his jet-setting."
  },
  {
    "title": "Anti-Trump Republicans Face Divisions and an Uncertain Future",
    "link": "https://www.nytimes.com/2026/02/22/us/politics/anti-trump-republicans-divisions-2028-president.html",
    "summary": "Divisions over what and who should come next were evident as G.O.P. critics of the president, weakened in their party, gathered at a summit near Washington."
  },
  {
    "title": "How A.I. Money Is Flooding Into the Midterm Elections",
    "link": "https://www.nytimes.com/2026/02/21/us/politics/ai-money-midterms-openai-anthropic.html",
    "summary": "A.I. companies, along with allied groups and executives, spent at least $83 million on federal elections last year, and huge amounts are set to arrive this year."
  },
  {
    "title": "Inside the Big Tech Lobbying Machine Aiming to Halt Social Media Bans",
    "link": "https://www.nytimes.com/2026/02/21/business/dealbook/big-tech-lobbying-social-media-bans.html",
    "summary": "Tech giants, including Meta and Alphabet, are spending lavishly on splashy billboard ads, courting on-the-fence politicians and bulking up their ranks of lobbyists."
  },
  {
    "title": "2026 BAFTAs Winners: ‘One Battle After Another’ Wins Best Film, Besting ‘Sinners’",
    "link": "https://www.nytimes.com/2026/02/22/movies/baftas-2026.html",
    "summary": "Paul Thomas Anderson’s comedy drama won six awards at the British equivalent of the Oscars. The best actor choice, however, was a surprise."
  },
  {
    "title": "12 Unforgettable Looks at the BAFTAs: Kate Middleton, Prince William and More",
    "link": "https://www.nytimes.com/2026/02/22/style/bafta-2026-awards-red-carpet-looks.html",
    "summary": "Swishy suits, mermaid skirts, skunk feet and more."
  },
  {
    "title": "Fat Signing Bonuses, and Concierge Service, for Family Doctors",
    "link": "https://www.nytimes.com/2026/02/22/world/canada/fat-signing-bonuses-and-concierge-service-for-family-doctors.html",
    "summary": "In a country where a quarter of the population lacks a family doctor, Canadian communities compete in a zero-sum battle to recruit family doctors."
  },
  {
    "title": "Tour Montparnasse is One of Paris’s Uglier Landmarks. It’s Getting a Makeover.",
    "link": "https://www.nytimes.com/2026/02/23/world/europe/tour-montparnasse-paris-makeover-piano.html",
    "summary": "The Tour Montparnasse is one of Paris’s least-loved landmarks. After half a century, it’s finally being remodeled."
  },
  {
    "title": "Willie Colón Played Up the Bad Guy With Purpose",
    "link": "https://www.nytimes.com/2026/02/22/style/willie-colon-played-up-the-bad-guy-with-purpose.html",
    "summary": "By styling himself after mobsters and blaxploitation characters early in his career, Mr. Colón, the legend of salsa music who died on Saturday, crafted an everlasting image."
  },
  {
    "title": "No, Trump Isn’t Good for Putin",
    "link": "https://www.nytimes.com/2026/02/23/opinion/putin-trump-russia-ukraine.html",
    "summary": "Russian hopes for respect have been dashed."
  },
  {
    "title": "Historians Confirm: Tomorrow Won’t Be Better Than Today",
    "link": "https://www.nytimes.com/2026/02/22/opinion/history-hope-delusion.html",
    "summary": "The human capacity for hope is an essential quality. But hope can also turn into delusion."
  },
  {
    "title": "Susan Sheehan, Pulitzer-Winning Chronicler of Lives on the Margins, Dies at 88",
    "link": "https://www.nytimes.com/2026/02/22/books/susan-sheehan-dead.html",
    "summary": "As a journalist and author, she wrote meticulous portraits of people for The New Yorker. Her book “Is There No Place on Earth for Me?” won the Pulitzer Prize."
  },
  {
    "title": "At Least 15 Have Died on Tahoe-Area Slopes This Year",
    "link": "https://www.nytimes.com/2026/02/22/us/tahoe-ski-deaths.html",
    "summary": "Three more skiers have died in the Lake Tahoe area since the deadliest avalanche in modern California history on Tuesday killed nine."
  },
  {
    "title": "Hunter College to Review Professor’s ‘Abhorrent’ Remarks at Meeting",
    "link": "https://www.nytimes.com/2026/02/22/nyregion/hunter-college-professor-remarks-students.html",
    "summary": "A student objected to the potential closure of her New York City middle school. The professor, speaking on a hot mic, said, “They’re too dumb to know they’re in a bad school.” The comment was assailed as racist."
  },
  {
    "title": "Russia Attacks Ukraine Ahead of Invasion’s 4th Anniversary",
    "link": "https://www.nytimes.com/2026/02/22/world/europe/ukraine-russia-attacks-lviv.html",
    "summary": "At least one man was killed in Kyiv as Moscow launched a wave of drones and missiles, days after the latest round of U.S.-mediated talks to end the war."
  }
]