[
  {
    "title": "How Politics Is Changing the Way History Is Taught",
    "link": "https://www.nytimes.com/2025/10/27/us/history-lessons-ethnic-studies-retreat.html",
    "summary": "History lessons are being wiped from the internet, and California is retreating from ethnic studies, as education swings away from curriculums that are seen as too progressive."
  },
  {
    "title": "‘No Idea How Long People Can Hold Out’: Federal Workers Feel Brunt of Shutdown",
    "link": "https://www.nytimes.com/2025/10/26/us/politics/federal-workers-shutdown-pay.html",
    "summary": "As more than one million government employees go without pay, many are turning to side jobs and food banks to make ends meet."
  },
  {
    "title": "Will Trump’s Tariffs Survive Supreme Court’s ‘Major Questions’ Test?",
    "link": "https://www.nytimes.com/2025/10/27/us/politics/trump-tariffs-supreme-courts-major-questions-doctrine.html",
    "summary": "The justices used the doctrine, a judicially created method of reading statutes, to thwart several major Biden programs."
  },
  {
    "title": "Food Banks Brace for Growing Demand, and Putin’s New Missile Test",
    "link": "https://www.nytimes.com/2025/10/27/podcasts/the-headlines/food-banks-putins-missile-trump-asia.html",
    "summary": "Plus, this year’s top Halloween costumes."
  },
  {
    "title": "Japan’s New Prime Minister Has an Advantage in Winning Over Trump",
    "link": "https://www.nytimes.com/2025/10/26/world/asia/japan-trump-takaichi.html",
    "summary": "As Sanae Takaichi seeks reassurance from President Trump on trade and security, she will likely play up her ties to Shinzo Abe, a mutual friend."
  },
  {
    "title": "Why Trump’s Asia Visit Is Consequential",
    "link": "https://www.nytimes.com/video/world/asia/100000010477965/why-trumps-asia-visit-is-consequential.html",
    "summary": "President Trump has embarked on a six-day diplomatic tour of Asia, testing his role as a statesman and negotiator as he pursues a trade deal with China. Erica L. Green, the White House correspondent for The New York Times, explains what’s at stake."
  },
  {
    "title": "As This President Tours Asia, Democracy’s Ideals Aren’t on the Agenda",
    "link": "https://www.nytimes.com/2025/10/27/us/politics/trump-asia-democracy.html",
    "summary": "Several of the leaders President Trump will encounter are either autocrats or presiding over fragile democracies. And some admire his willingness to break the rules."
  },
  {
    "title": "As New Yorkers Flood Early Voting Sites, Undecideds Become Prized Target",
    "link": "https://www.nytimes.com/2025/10/27/nyregion/early-voting-mayors-race-mamdani-cuomo-sliwa.html",
    "summary": "Zohran Mamdani, the front-runner for mayor of New York City, has built his lead in part by relying on a huge ground-game operation."
  },
  {
    "title": "Mamdani and the Left’s Biggest Stars Unite Before a Sea of Supporters",
    "link": "https://www.nytimes.com/2025/10/26/nyregion/mamdani-sanders-aoc-rally.html",
    "summary": "As Senator Bernie Sanders and Representative Alexandria Ocasio-Cortez joined Zohran Mamdani on Sunday at Forest Hills Stadium, a bigger test for the left may still lie ahead."
  },
  {
    "title": "Laurie Metcalf and Other Steppenwolf Members on 50 Years of ‘Freedom Onstage’",
    "link": "https://www.nytimes.com/2025/10/27/theater/steppenwolf-theater-chicago-50-anniversary.html",
    "summary": "Laurie Metcalf, Gary Sinise and other members of the Chicago company reminisce about unexpected performances, stunning monologues and career-changing roles."
  },
  {
    "title": "Diphtheria, a Once Vanquished Killer of Children, Is Resurgent",
    "link": "https://www.nytimes.com/2025/10/27/health/diptheria-somalia-vaccines.html",
    "summary": "A Somali hospital ward packed with gasping children shows how war, climate and mistrust of vaccines is fueling the disease’s return."
  },
  {
    "title": "Javier Milei’s Party Triumphs in Argentina Midterm Election",
    "link": "https://www.nytimes.com/2025/10/26/world/americas/argentina-election-javier-milei.html",
    "summary": "The result, which gives Mr. Milei enough legislative support to keep his vetoes from being overturned, showed that many voters still back the president’s libertarian experiment."
  },
  {
    "title": "A New Dynamic in the Trump-Netanyahu Relationship",
    "link": "https://www.nytimes.com/2025/10/27/world/middleeast/trump-netanyahu-relationship.html",
    "summary": "Since an Israel-Hamas cease-fire deal came into effect, the U.S. effort to sustain it appears to have constrained Prime Minister Benjamin Netanyahu."
  },
  {
    "title": "U.S. Assessment of Israeli Shooting of Journalist Divided American Officials",
    "link": "https://www.nytimes.com/2025/10/27/world/middleeast/shooting-palestinian-american-journalist.html",
    "summary": "A U.S. colonel has gone public with his concern that official findings about the 2022 killing of a Palestinian American reporter were soft-pedaled to appease Israel."
  },
  {
    "title": "Turkey Offered to Help in Postwar Gaza. Israel Isn’t About to Say Yes.",
    "link": "https://www.nytimes.com/2025/10/26/world/middleeast/turkey-postwar-gaza-reconstruction-ceasefire.html",
    "summary": "As a guarantor of the cease-fire, Turkey is keen to play a role in Gaza’s future, seeing political and economic benefits. Israel is having none of it."
  },
  {
    "title": "How the Firebombing of His Home Changed Josh Shapiro",
    "link": "https://www.nytimes.com/2025/10/27/us/politics/josh-shapiro-political-violence.html",
    "summary": "In an interview, the Pennsylvania governor offered his most detailed accounting yet of the April attack — and how he’s grappling with its aftermath."
  },
  {
    "title": "Reviving California’s Kelp Forests, One Dive at a Time",
    "link": "https://www.nytimes.com/2025/10/21/climate/california-kelp-restoration.html",
    "summary": "Cove by cove, scientists, divers and volunteers are hauling up urchins to protect kelp."
  },
  {
    "title": "The Insidious Joviality of Nigel Farage",
    "link": "https://www.nytimes.com/2025/10/27/opinion/nigel-farage-britain-reform.html",
    "summary": "His rise is both a symptom and a cause of the newly febrile mood in Britain."
  },
  {
    "title": "Being Latino in the United States Should Not Be a Crime",
    "link": "https://www.nytimes.com/2025/10/27/opinion/immigration-enforcement-latino-discrimination.html",
    "summary": "Trump’s immigration tactics violate both the law and human decency."
  },
  {
    "title": "Is A.I. a Bubble?",
    "link": "https://www.nytimes.com/2025/10/27/briefing/is-ai-a-bubble.html",
    "summary": "We explain the fears on Wall Street."
  },
  {
    "title": "2 U.S. Navy Aircraft Go Down in South China Sea",
    "link": "https://www.nytimes.com/2025/10/27/world/asia/navy-aircraft-crash-south-china-sea.html",
    "summary": "A helicopter and a fighter jet went down in separate incidents while operating from a U.S. aircraft carrier on Sunday, the Navy said. The crews were rescued."
  },
  {
    "title": "In U.K., China Is a Threat and a Coveted Trade Partner",
    "link": "https://www.nytimes.com/2025/10/27/world/europe/britain-china-national-security-economy.html",
    "summary": "A botched spying case prompted accusations that the British government was soft on China, highlighting tensions between economic and national security interests."
  },
  {
    "title": "Strains in Short-Term Markets Raise Urgency of Fed Balance Sheet Debate",
    "link": "https://www.nytimes.com/2025/10/27/business/federal-reserve-balance-sheet-tightening.html",
    "summary": "Warning signs in crucial money markets have raised the prospect that the central bank will soon stop reducing its portfolio of government debt and mortgage bond holdings."
  },
  {
    "title": "Saudi Arabia, Rich With Oil, Wants to Be Known as the A.I. Exporter",
    "link": "https://www.nytimes.com/2025/10/27/technology/saudi-arabia-ai-exporter.html",
    "summary": "The kingdom is pouring money into data centers and working with U.S. and Chinese tech giants, landing its A.I. ambitions in the middle of a geopolitical tussle for tech power."
  }
]