[
  {
    "title": "After Deadly Earthquake in Afghanistan, Emergency Aid Trickles In",
    "link": "https://www.nytimes.com/2025/09/02/world/asia/afghanistan-earthquake.html",
    "summary": "Villages remain cut off in the remote, mountainous areas in the east that have been hardest hit by the disaster, which has killed at least 1,400 people."
  },
  {
    "title": "Landslide Kills Hundreds in Sudan",
    "link": "https://www.nytimes.com/2025/09/02/world/africa/sudan-landslide.html",
    "summary": "The landslide leveled a village in the remote Marra mountains, a local rebel group said. Its leader appealed for urgent help, saying, “This is a nightmare.”"
  },
  {
    "title": "Scientists Denounce Trump Administration’s Climate Report",
    "link": "https://www.nytimes.com/2025/09/02/climate/climate-science-report-energy-department.html",
    "summary": "Scores of researchers reviewed the Energy Department’s argument about greenhouse gases and found serious deficiencies."
  },
  {
    "title": "White House Counsel Eases Trump’s Path on Aggressive Agenda",
    "link": "https://www.nytimes.com/2025/09/02/us/politics/white-house-counsel-david-warrington.html",
    "summary": "David Warrington, the top lawyer inside the West Wing, focuses on “the art of the possible,” as one Trump adviser said."
  },
  {
    "title": "House Oversight Committee Is Set to Meet With Accusers of Jeffrey Epstein",
    "link": "https://www.nytimes.com/2025/09/02/us/politics/epstein-accusers-house-oversight-committee.html",
    "summary": "Lawmakers are continuing their inquiry into Mr. Epstein, the disgraced financier, despite the Trump administration’s efforts to quell public demand for information."
  },
  {
    "title": "In Protest, He Turned the Camera on China’s Surveillance State",
    "link": "https://www.nytimes.com/2025/09/02/business/china-chongqing-protest.html",
    "summary": "Before fleeing China, an activist in Chongqing staged an elaborate one-man demonstration against the Communist Party that doubled as performance art."
  },
  {
    "title": "Ukraine Pursues a Weapons Buildup More Potent Than Any Security Guarantee",
    "link": "https://www.nytimes.com/2025/09/02/world/europe/ukraine-weapons-security.html",
    "summary": "Kyiv sees a well-equipped army as a stronger deterrent to Moscow than any Western pledges to defend it. It is working to attract billions to buy more arms."
  },
  {
    "title": "Putin and Xi Invoke Wartime Unity as They Hail Ties in Beijing",
    "link": "https://www.nytimes.com/2025/09/02/world/asia/china-putin-xi.html",
    "summary": "The Russian and Chinese leaders drew on a shared view of their countries’ roles in World War II to cast their modern-day partnership as a challenge to the West."
  },
  {
    "title": "The Millionaire Who Left Wall Street to Become a Paramedic",
    "link": "https://www.nytimes.com/2025/09/02/nyregion/rescue-medic-wall-street-.html",
    "summary": "After making millions in a job he came to hate, Jonathan Kleisner joined the Fire Department as a rookie paramedic at the age of 41. Now he’s determined to be the best rescue medic anywhere."
  },
  {
    "title": "How Jair Bolsonaro Tried, and Failed, to Stage a Coup in Brazil",
    "link": "https://www.nytimes.com/2025/09/02/world/americas/jair-bolsonaro-brazil-coup-trial.html",
    "summary": "Brazil’s former president, Jair Bolsonaro, stands trial on Tuesday, accused of plotting a coup after losing the 2022 elections. Evidence suggests this is how he tried to do it."
  },
  {
    "title": "Jair Bolsonaro, Charged With Plotting a Coup, Is Not at His Trial",
    "link": "https://www.nytimes.com/2025/09/02/world/americas/bolsonaro-trial-brazil.html",
    "summary": "Brazil’s Supreme Court began judging the case against the former president, who did not attend the proceedings because of poor health, his defense team said."
  },
  {
    "title": "What Does Vogue Mean Today?",
    "link": "https://www.nytimes.com/2025/09/02/style/vogue-chloe-malle.html",
    "summary": "The magazine has a new editor in Chloe Malle. It may also need a new identity."
  },
  {
    "title": "Vogue Names Chloe Malle as Its New Editor",
    "link": "https://www.nytimes.com/2025/09/02/business/media/vogue-chloe-malle-new-editor.html",
    "summary": "Ms. Malle, 39, succeeds Anna Wintour, a titan in fashion. “There has to be a noticeable shift that makes this mine,” Ms. Malle said in an interview."
  },
  {
    "title": "‘Who Am I Without Birth Control?’",
    "link": "https://www.nytimes.com/2025/09/02/style/birth-control-skepticism-wellness-tiktok.html",
    "summary": "As social media and wellness podcasters bombard young women with messages about the pill, many are questioning what they’ve long been told."
  },
  {
    "title": "Is ‘The Wizard of Oz’ at Sphere the Future of Cinema? Or the End of It?",
    "link": "https://www.nytimes.com/2025/09/01/movies/wizard-of-oz-sphere-review.html",
    "summary": "Our critic went to Las Vegas to see the immersive presentation of the classic 1939 film. What she saw defied easy categorization."
  },
  {
    "title": "After Court Defeat, Trump Warns of Economic Chaos From Loss of Tariffs",
    "link": "https://www.nytimes.com/2025/09/02/us/politics/trump-tariffs-appeals-court-ruling-economy.html",
    "summary": "The president and his advisers have suggested they will fight a federal appeals court’s ruling that found many of the administration’s tariffs to be illegal."
  },
  {
    "title": "A Move to the U.S. to Avoid Tariffs? There Are Trade-Offs.",
    "link": "https://www.nytimes.com/2025/09/02/world/europe/germany-tariffs-bizerba-us-move.html",
    "summary": "Bizerba, a German company that makes industrial slicers for Subway, is thinking about shifting production to the United States, if it can overcome the challenges."
  },
  {
    "title": "Giuliani Finds a Home Away From Home in New Hampshire",
    "link": "https://www.nytimes.com/2025/09/02/nyregion/rudy-giuliani-new-hampshire.html",
    "summary": "Before his car crash, the former mayor of New York City was taking in a minor-league baseball game in Manchester, N.H., a city where he’s been known to enjoy a good cigar."
  },
  {
    "title": "Poor Amazon Rains Linked to Brazil Deforestation",
    "link": "https://www.nytimes.com/2025/09/02/climate/amazon-brazil-drought-rain-deforestation.html",
    "summary": "Deforestation is playing a greater role than researchers expected, according to a new study."
  },
  {
    "title": "Animal Activists Target Farmers in Sonoma, Known as ‘America’s Provence’",
    "link": "https://www.nytimes.com/2025/09/02/us/california-farmers-animal-activists-bay-area-sonoma.html",
    "summary": "A new generation of activists has used extreme tactics and viral video to challenge farmers in Sonoma County, a region known for some of the industry’s most humane practices."
  },
  {
    "title": "The One Danger That Should Unite the U.S. and China",
    "link": "https://www.nytimes.com/2025/09/02/opinion/ai-us-china.html",
    "summary": "The U.S. and China must agree on a trust architecture for A.I., or rogue entities will destabilize the two superpowers long before they fight a war."
  },
  {
    "title": "Forced Drug Treatment Isn’t Horrific. It’s a Relief.",
    "link": "https://www.nytimes.com/2025/09/02/opinion/forced-drug-treatment-rehab.html",
    "summary": "Besides, addicted people are not the only ones affected by their behavior."
  },
  {
    "title": "We Answer Your Questions About Education",
    "link": "https://www.nytimes.com/2025/09/02/briefing/we-answer-your-questions-about-education.html",
    "summary": "Our reporters address reader concerns about K-12 schooling."
  },
  {
    "title": "Reduced Screening May Have Led to Rise in Advanced Prostate Cancer Diagnoses",
    "link": "https://www.nytimes.com/2025/09/02/science/prostate-cancer-rise-reduced-screening.html",
    "summary": "Changes in screening recommendations over a decade ago may have inadvertently resulted in later diagnosis of the most common cancer in men, a new study has found."
  },
  {
    "title": "Maduro Says War With Venezuela Would Stain Trump’s Hands with Blood",
    "link": "https://www.nytimes.com/2025/09/02/world/americas/maduro-trump-venezuela-war.html",
    "summary": "As U.S. warships and troops gather in the Caribbean, Mr. Maduro threatened an “armed fight” in response to any military action. He also appealed for peace."
  },
  {
    "title": "How Protests, Tear Gas and Looting Roiled Indonesia",
    "link": "https://www.nytimes.com/2025/09/02/world/asia/indonesia-jakarta-protests-economy.html",
    "summary": "Deep-rooted resentment between the haves and have-nots set off a wave of antigovernment protests that have turned violent."
  },
  {
    "title": "Kraft Heinz to Split Into Two Businesses",
    "link": "https://www.nytimes.com/2025/09/02/business/kraft-heinz-break-up.html",
    "summary": "Food companies are coming under pressure for growth as the maker of Velveeta breaks up and an activist investor takes a stake in PepsiCo."
  }
]