[
  {
    "title": "The Olympics Are a Show Of Global Harmony. The World is Anything But.",
    "link": "https://www.nytimes.com/2026/02/06/world/europe/olympics-world-order-war.html",
    "summary": "The Winter Games, which officially open in Italy on Friday, are rooted in international cooperation. That feels out of place to some in a world where old rules no longer apply."
  },
  {
    "title": "Jessie Diggins is the Olympian Testing the Limits of Endurance",
    "link": "https://www.nytimes.com/2026/02/05/magazine/jessie-diggins-ski-winter-olympics-milan.html",
    "summary": "Jessie Diggins has become the best-ever American cross-country skier because of what she pushes her body through."
  },
  {
    "title": "Milan Winter Olympics Opening Ceremony: How to Watch, Timing and More",
    "link": "https://www.nytimes.com/2026/02/06/world/europe/milan-winter-olympics-opening-ceremony-how-to-watch.html",
    "summary": "They will take place at 2 p.m. Eastern on Friday across four separate venues in Northern Italy."
  },
  {
    "title": "Bitcoin Drops to Lowest Price Since Trump Was Elected as Crypto Faces Slump",
    "link": "https://www.nytimes.com/2026/02/05/technology/bitcoin-price-drop-crypto-market.html",
    "summary": "The price of Bitcoin is now lower than when President Trump was elected in 2024, raising concerns of a new “crypto winter\" in the industry."
  },
  {
    "title": "Amazon’s $200 Billion Spending Plan Raises Stakes in A.I. Race",
    "link": "https://www.nytimes.com/2026/02/05/technology/amazon-200-billion-ai.html",
    "summary": "The company reported a strong holiday quarter on Thursday. But its spending, like that at other big technology companies, is starting to make investors nervous."
  },
  {
    "title": "U.S. and Iran Set for Talks in Oman",
    "link": "https://www.nytimes.com/2026/02/06/world/europe/us-and-iran-set-for-talks-in-oman-as-regional-leaders-seek-to-prevent-war.html",
    "summary": "Middle Eastern diplomats see a chance for negotiations on Iran’s nuclear program but have slim hopes for progress on other U.S. demands."
  },
  {
    "title": "Senators Clash Over Immigration Enforcement, Risking a D.H.S. Shutdown",
    "link": "https://www.nytimes.com/2026/02/05/us/politics/senate-immigration-enforcement-dhs-shutdown.html",
    "summary": "With eight days until a deadline to keep the Department of Homeland Security running, bipartisan talks on reining in federal immigration agents’ tactics appeared to sputter before they had even gotten underway."
  },
  {
    "title": "TrumpRx, the President’s Online Drugstore, Opens for Business",
    "link": "https://www.nytimes.com/2026/02/05/health/trumprx-online-drugstore-prices.html",
    "summary": "TrumpRx is aimed at helping patients use their own money to buy medicines. But researchers who study drug pricing warned that many patients could pay too much if they use the site."
  },
  {
    "title": "Kennedy Makes Unfounded Claim That Keto Diet Can ‘Cure’ Schizophrenia",
    "link": "https://www.nytimes.com/2026/02/05/us/politics/kennedy-keto-diet-schizophrenia.html",
    "summary": "The claim vastly overstates preliminary research into whether the high-fat, low-carbohydrate diet might help people with the disorder, experts said."
  },
  {
    "title": "Trump Strips Job Protections From Thousands of Federal Workers",
    "link": "https://www.nytimes.com/2026/02/05/us/politics/trump-federal-workers-protections.html",
    "summary": "The policy change makes it easier for the president to discipline or remove up to 50,000 employees, another push in the administration’s campaign to reshape the federal work force."
  },
  {
    "title": "The G.O.P. Senator Who Can’t Stop Thinking About the Boy ICE Detained",
    "link": "https://www.nytimes.com/2026/02/05/us/politics/katie-britt-trump-immigration.html",
    "summary": "Katie Britt is uniquely positioned to reason with the Trump administration — when she chooses to speak up."
  },
  {
    "title": "Argentina and U.S. Sign Sweeping Trade Deal as Alliance Deepens",
    "link": "https://www.nytimes.com/2026/02/05/world/americas/argentina-us-trade-deal-trump-milei.html",
    "summary": "The deal reduces reciprocal tariffs and expands quotas for key trading goods, including Argentine beef — a flashpoint for American ranchers."
  },
  {
    "title": "Carney Increases E.V. Investments as Trump’s Trade Policy Disrupts Canada’s Auto Industry",
    "link": "https://www.nytimes.com/2026/02/05/world/canada/carney-canada-electric-vehicles-trump-trade.html",
    "summary": "Prime Minister Mark Carney announced several measures Thursday aimed at making Canada a global leader in electric vehicles and rescuing an industry ravaged by U.S. trade policy."
  },
  {
    "title": "Uber Found Liable in Rape by Driver, Setting Stage for Thousands of Cases",
    "link": "https://www.nytimes.com/2026/02/05/business/uber-safety-rape-verdict.html",
    "summary": "In a federal bellwether case, the jury ordered the ride-hailing giant to pay $8.5 million to Jaylynn Dean, who said one of its drivers assaulted her in 2023."
  },
  {
    "title": "At Ukraine’s Request, Starlink Denies Internet Access to Russian Troops",
    "link": "https://www.nytimes.com/2026/02/05/world/europe/starlink-blocks-russian-troops-access.html",
    "summary": "It’s unclear what effect the change will have on Russia’s ability to wage war, but Russian military bloggers said troops were experiencing internet outages that hampered frontline communications."
  },
  {
    "title": "Camera Was Disconnected From Nancy Guthrie’s Home Shortly Before Disappearance",
    "link": "https://www.nytimes.com/2026/02/04/us/savannah-guthrie-plea-statement.html",
    "summary": "The authorities confirmed that blood on Ms. Guthrie’s doorstep belonged to her. Her daughter Savannah, the “Today” anchor, released a video asking for proof that her mother is alive."
  },
  {
    "title": "Savannah Guthrie’s Video Shows a Rare and Anguished Reality",
    "link": "https://www.nytimes.com/2026/02/05/arts/television/savannah-guthrie-mother-video.html",
    "summary": "Morning show hosts have shown a vulnerable, candid side to their audiences before, but not like this."
  },
  {
    "title": "What to Know About the Disappearance of Savannah Guthrie’s Mom, Nancy",
    "link": "https://www.nytimes.com/2026/02/03/us/savannah-guthrie-mom-missing.html",
    "summary": "Nancy Guthrie, 84, the “Today” show host’s mother, was last seen on Saturday night, the authorities said. The disappearance is being investigated as a possible kidnapping."
  },
  {
    "title": "New Jersey House Primary Remains Too Close to Call",
    "link": "https://www.nytimes.com/2026/02/06/nyregion/new-jersey-special-election-results-congress.html",
    "summary": "Two Democrats, Analilia Mejia and Tom Malinowski, were leading in a race for their party’s nomination to replace Gov. Mikie Sherrill in the House."
  },
  {
    "title": "N.Y. House Democrats Unite to Endorse Hochul on Eve of Convention",
    "link": "https://www.nytimes.com/2026/02/05/nyregion/hochul-endorsement-convention.html",
    "summary": "Gov. Kathy Hochul is expected to receive the Democratic nomination at the party’s state convention on Friday, even as her running-mate selection has drawn some debate."
  },
  {
    "title": "Virginia Democrats Propose New Congressional Maps Ahead of Midterms",
    "link": "https://www.nytimes.com/2026/02/05/us/politics/virginia-redistricting-maps-midterms.html",
    "summary": "As they appeal a ruling blocking their redistricting efforts, the state’s Democrats proposed redrawing districts in a way that would strongly favor them."
  },
  {
    "title": "She’s Upending Japanese Politics With Two Words: ‘I’m Pregnant’",
    "link": "https://www.nytimes.com/2026/02/06/world/asia/japan-election-pregnant-candidate.html",
    "summary": "Hikaru Fujita, who’s running in Sunday’s parliamentary election, is a standout in a country where expectant mothers rarely enter national politics."
  },
  {
    "title": "Rare Deep-Sea Giant Phantom Jellyfish Sighting Is Recorded on Video",
    "link": "https://www.nytimes.com/2026/02/05/science/giant-phantom-jellyfish-sighting-video.html",
    "summary": "During a dive off Argentina, scientists documented a rare jellyfish discovered a little over a century ago and seldom seen since, as well as the fish that keep it company."
  },
  {
    "title": "We’re All Canadian Now",
    "link": "https://www.nytimes.com/2026/02/06/opinion/canada-america-anger-carney.html",
    "summary": "The world is angry. Canada’s been there all along."
  },
  {
    "title": "America’s Rare-Earths Solution Is Hiding in Plain Sight",
    "link": "https://www.nytimes.com/2026/02/06/opinion/china-us-rare-earths.html",
    "summary": "The real threat to a secure and sustainable supply of rare earths is not that they are scarce, but that so much is wasted."
  },
  {
    "title": "The Louvre Thieves Dropped This Priceless Crown. Now It Looks Like This.",
    "link": "https://www.nytimes.com/2026/02/05/world/europe/louvre-heist-crown-damage-eugenie-empress.html",
    "summary": "Empress Eugénie’s crown was left lying on the sidewalk after the Louvre Museum heist in October. The museum has now released pictures of the damage."
  },
  {
    "title": "C.I.A. World Factbook Ends Publication After 6 Decades",
    "link": "https://www.nytimes.com/2026/02/05/us/world-factbook-cia.html",
    "summary": "The Factbook, a version of which dates to 1962, provided facts, figures, maps and more to generations of economists, professors, journalists and others."
  },
  {
    "title": "Toronto Police Charged in Sweeping Drug and Corruption Case",
    "link": "https://www.nytimes.com/2026/02/05/world/canada/toronto-police-arrested-drugs-corruption.html",
    "summary": "After hit men targeted the home of a prison manager in June, investigators say, the schemes of a criminal network involving the police unraveled."
  },
  {
    "title": "12 Columbia Professors and Students Are Arrested at Anti-ICE Protest",
    "link": "https://www.nytimes.com/2026/02/05/nyregion/columbia-professors-students-protest-arrests.html",
    "summary": "Demonstrators, who were demanding that the university provide more protection for international students, blocked Broadway."
  }
]