[
  {
    "title": "What Is Operation Allies Welcome, the Program That Gave Some Afghans Entry to the U.S.?",
    "link": "https://www.nytimes.com/2025/11/26/us/operation-allies-welcome-dc-shooting.html",
    "summary": "The Biden administration set up the initiative after the Taliban retook power in Afghanistan in August 2021 for those who assisted U.S. troops."
  },
  {
    "title": "For Spouses of U.S. Citizens, Green Card Interviews End in Handcuffs",
    "link": "https://www.nytimes.com/2025/11/26/us/trump-green-card-interview-arrests.html",
    "summary": "Agents are arresting foreign-born spouses when they report for the final step to obtain permanent residency, and charging them with visa violations that could result in deportation."
  },
  {
    "title": "ICE Detains Mother of White House Press Secretary Karoline Leavitt’s Nephew",
    "link": "https://www.nytimes.com/2025/11/26/us/karoline-leavitt-ice-family-member-bruna-ferreira.html",
    "summary": "Bruna Caroline Ferreira, the mother of a nephew of the White House press secretary, Karoline Leavitt, was pulled over and arrested on her way to pick up her son from school, Ms. Ferreira’s lawyer said."
  },
  {
    "title": "‘In Triage Every Day’: A Beleaguered Speaker Says He’s Overwhelmed",
    "link": "https://www.nytimes.com/2025/11/26/us/politics/speaker-mike-johnson-beleagured.html",
    "summary": "In a podcast interview, Speaker Mike Johnson opened up about the crushing demands of a job that he joked was his in name only."
  },
  {
    "title": "Dominican Republic Allows U.S. to Use Territory to Fight International Organized Crime",
    "link": "https://www.nytimes.com/2025/11/26/us/politics/dominican-republic-us-military.html",
    "summary": "The Dominican leader, Luis Abinader, said the Pentagon could use restricted areas within the San Isidro Air Base and Las Américas International Airport for refueling and transporting equipment and technical personnel."
  },
  {
    "title": "Signs of Fatigue: Trump Faces Realities of Aging in Office",
    "link": "https://www.nytimes.com/2025/11/25/us/politics/trump-age-health.html",
    "summary": "President Trump has always used his stamina and energy as a political strength. But that image is getting harder for him to sustain."
  },
  {
    "title": "Hong Kong Arrests 3 Tied to Construction Company After Deadly Apartment Fire",
    "link": "https://www.nytimes.com/2025/11/26/world/asia/arrests-hong-kong-fire-manslaughter.html",
    "summary": "The police said that building materials used by the company for the work at Wang Fuk Court may not have been up to fire safety standards. The police did not identify the company or who was arrested."
  },
  {
    "title": "What to Know About the Deadly Fire at a Hong Kong Apartment Complex",
    "link": "https://www.nytimes.com/2025/11/26/world/asia/hong-kong-fire-what-to-know.html",
    "summary": "Firefighters were still working to end the blaze nearly a day later. At least 44 people were killed, and many more were feared trapped inside the towers."
  },
  {
    "title": "Five-Ingredient, Easy Thanksgiving Recipes",
    "link": "https://cooking.nytimes.com/article/five-ingredient-thanksgiving-recipes",
    "summary": "Turkey, potatoes and dessert don’t need to be fussy. Keep the shopping and cooking simple so you can enjoy the day."
  },
  {
    "title": "Heading to the Mideast, Pope Leo May Show ‘Who He Really Is’",
    "link": "https://www.nytimes.com/2025/11/27/world/middleeast/pope-leo-trip.html",
    "summary": "The pontiff begins a trip to Turkey and Lebanon on Thursday — the first foreign voyage of his papacy, and his biggest test yet."
  },
  {
    "title": "Leaked Transcript of Witkoff Call Shows U.S. Deference to Russia",
    "link": "https://www.nytimes.com/2025/11/26/us/politics/witkoff-leaked-transcript-deference-russia.html",
    "summary": "The White House envoy’s conversation suggests that President Trump is determined to make a deal to end the war in Ukraine, even if it is mostly on Russia’s terms."
  },
  {
    "title": "U.S. Army Secretary’s Unusual Role in Ukraine Peace Negotiations",
    "link": "https://www.nytimes.com/2025/11/26/us/politics/ukraine-russia-peace-talks-daniel-driscoll.html",
    "summary": "Daniel Driscoll has met with Ukrainian and Russian officials during a whirlwind of trips as the Trump administration pushes its latest proposal."
  },
  {
    "title": "Top U.S. Negotiator Warned Europeans That Russia Is Stockpiling Missiles",
    "link": "https://www.nytimes.com/2025/11/26/world/europe/ukraine-peace-talks-russia-missiles.html",
    "summary": "Daniel P. Driscoll, the U.S. Army secretary, used the growing threat from Moscow as a way to sell a quick peace deal unfavorable to Ukraine."
  },
  {
    "title": "Did the Giant Heads of Easter Island Once Walk?",
    "link": "https://www.nytimes.com/2025/11/26/science/archaeology-easter-island-rapa-nui.html",
    "summary": "Scholars have long debated how the massive stone figures of Rapa Nui got to where they stand today. A new study offers one possible explanation."
  },
  {
    "title": "Larry Bushart Posted a Charlie Kirk Meme. He Went to Jail for 37 Days.",
    "link": "https://www.nytimes.com/2025/11/26/opinion/charlie-kirk-free-speech-bushart.html",
    "summary": "The best way to honor Charlie Kirk is not to criminalize speech."
  },
  {
    "title": "The Real Meaning of MAHA Is ‘You’re On Your Own’",
    "link": "https://www.nytimes.com/2025/11/26/opinion/maha-pandemic-public-health.html",
    "summary": "The N.I.H. director has learned all the wrong lessons from Covid."
  },
  {
    "title": "Campbell’s Says Executive Accused of Offensive Remarks Has Left the Company",
    "link": "https://www.nytimes.com/2025/11/26/business/campbells-executive-insulting-audio.html",
    "summary": "The comments came to light after an audiotape was released, tied to a lawsuit filed by a former employee."
  },
  {
    "title": "Dubrovnik, Known for Its Beauty, Faces a Mound of New Trash",
    "link": "https://www.nytimes.com/2025/11/26/world/europe/croatia-trash-dubrovnik-plastic.html",
    "summary": "Officials in Dubrovnik, Croatia, say the strong currents of the Adriatic Sea washed ashore a vast amount of garbage, mostly from Albania, during a recent storm."
  },
  {
    "title": "How to Watch the 2025 Macy’s Thanksgiving Day Parade",
    "link": "https://www.nytimes.com/2025/11/26/nyregion/macys-thanksgiving-day-parade-how-to-watch.html",
    "summary": "The 99th edition of the New York parade will feature performances from Cynthia Erivo and Busta Rhymes, as well as dozens of floats and balloons."
  },
  {
    "title": "David Lerner, a Mr. Fix-it of Apple Computers, Dies at 72",
    "link": "https://www.nytimes.com/2025/11/26/technology/personaltech/david-lerner-dead.html",
    "summary": "He and a partner founded Tekserve, a Manhattan emergency room for frozen hard drives, keyboards, screens and their confounded owners."
  }
]