[
  {
    "title": "Dismissals at Justice Dept. Would Bypass Civil Service and Whistle-Blower Laws",
    "link": "https://www.nytimes.com/2025/07/15/us/politics/justice-department-dismissals-civil-service-laws.html",
    "summary": "In court filings and dismissal letters, the Justice Department’s political leadership claims sweeping authority to fire career law enforcement officials without cause."
  },
  {
    "title": "Do Doctors Profit Off Vaccines? Fact-Checking RFK Jr.’s Claims",
    "link": "https://www.nytimes.com/2025/07/15/well/rfk-jr-doctors-vaccines-profit-fact-check.html",
    "summary": "Experts said the health secretary’s remarks send a dangerous message: Don’t trust your physician."
  },
  {
    "title": "Appeals Court Delays Decision on Contempt Plan in Venezuelan Migrant Deportation Case",
    "link": "https://www.nytimes.com/2025/07/15/us/politics/appeals-court-trump-contempt-el-salvador-deportation.html",
    "summary": "The three-judge panel has allowed the case to languish in a kind of legal limbo, catching the eye of some legal experts."
  },
  {
    "title": "What to Know About the Fallout Around the Epstein Files and the Trump Administration",
    "link": "https://www.nytimes.com/2025/07/15/us/politics/jeffrey-epstein-files-trump.html",
    "summary": "Here’s what to know about the disturbing facts and unsubstantiated suspicions that make Jeffrey Epstein, a registered sex offender, a politically potent obsession."
  },
  {
    "title": "CPI Shows US Inflation Sped Up in June as Trump’s Tariffs Pushed Up Prices",
    "link": "https://www.nytimes.com/2025/07/15/business/cpi-report-inflation-june.html",
    "summary": "The Consumer Price Index rose 2.7 percent from a year earlier, as the global trade war started to bite."
  },
  {
    "title": "E.U. Nations Plan Retaliatory Tariffs Against Trump and U.S., but Would They Do It?",
    "link": "https://www.nytimes.com/2025/07/15/world/europe/eu-tariffs-trump-us-retaliate.html",
    "summary": "European Union officials have drawn up plans to impose levies on American imports, but questions abound about whether they would go through with them."
  },
  {
    "title": "JPMorgan, Wells Fargo and Citi Report Solid Earnings Despite Trump Tariff Risks",
    "link": "https://www.nytimes.com/2025/07/15/business/jpmorgan-wells-fargo-citi-banks-economy.html",
    "summary": "JPMorgan’s chief, Jamie Dimon, lauded the “resilient” U.S. economy as his bank reported bumper quarterly earnings."
  },
  {
    "title": "Trump Adds 17% Tariff on Tomatoes From Mexico",
    "link": "https://www.nytimes.com/2025/07/14/business/economy/trump-tariff-mexican-tomatoes.html",
    "summary": "The Trump administration is adding a 17 percent tariff to a year-round grocery store staple, while funneling more business to domestic tomato growers, largely in Florida."
  },
  {
    "title": "Why the New York Subway System Keeps Flooding",
    "link": "https://www.nytimes.com/2025/07/15/nyregion/nyc-subway-flooding-why.html",
    "summary": "The century-old system faces infrastructure and climate challenges that are making its water problem worse."
  },
  {
    "title": "Flash Floods Fill N.Y.C. Subway Station",
    "link": "https://www.nytimes.com/2025/07/15/nyregion/nyc-subway-flood-storm.html",
    "summary": "Passengers on an uptown No. 1 train saw floodwaters swamping the station at 28th Street and Seventh Avenue in Manhattan."
  },
  {
    "title": "Trump’s Shift on Ukraine Is Good News for Europe, for Now",
    "link": "https://www.nytimes.com/2025/07/15/world/europe/ukraine-weapons-europe-trump.html",
    "summary": "After European leaders stepped up military spending, President Trump aligned himself more closely with them on the war. But his tariffs threats have left bruises."
  },
  {
    "title": "What We Know About the U.S. Deal for a Weapons Pipeline to Ukraine",
    "link": "https://www.nytimes.com/2025/07/15/world/europe/ukraine-weapons-us-nato.html",
    "summary": "NATO allies will buy arms, then give them to Ukraine, President Trump said."
  },
  {
    "title": "2025 Emmy Nominations: ‘Severance’ and ‘The Penguin’ Lead the Pack",
    "link": "https://www.nytimes.com/2025/07/15/arts/television/emmy-nominations-2025.html",
    "summary": "The nominees were announced Tuesday morning at the Television Academy’s Los Angeles headquarters."
  },
  {
    "title": "Emmy Nomination Snubs and Surprises: ‘Squid Game,’ ‘The Handmaid’s Tale’ and More",
    "link": "https://www.nytimes.com/2025/07/15/arts/television/emmy-nominations-snubs-surprises.html",
    "summary": "Some big names (Alfonso Cuarón, Elisabeth Moss) were left off the Emmy nomination list while some underdogs (Jeff Hiller, “Common Side Effects”) sneaked on."
  },
  {
    "title": "Emmy Nominees 2025: See the Complete List",
    "link": "https://www.nytimes.com/2025/07/15/arts/television/emmy-nominees-list-2025.html",
    "summary": "The 77th Emmy Awards ceremony is planned for Sept. 14. See all the nominees below."
  },
  {
    "title": "Mayor Adams Loses Another Round in Bid to Receive Public Matching Funds",
    "link": "https://www.nytimes.com/2025/07/15/nyregion/eric-adams-nyc-mayor-matching-funds.html",
    "summary": "The New York City Campaign Finance Board rejected Mayor Eric Adams’s request for millions of dollars from the city’s generous matching-funds program."
  },
  {
    "title": "Mamdani Prepares to Meet With New York City’s Wary Business Leaders",
    "link": "https://www.nytimes.com/2025/07/15/business/mamdani-nyc-business-leaders.html",
    "summary": "On Tuesday, Zohran Mamdani, a democratic socialist running for mayor, will meet with the who’s who of the corporate world as he prepares for the general election."
  },
  {
    "title": "21 Questions About the NYC Mayoral Race, Answered",
    "link": "https://www.nytimes.com/2025/07/15/nyregion/nyc-mayor-mamdani-questions.html",
    "summary": "Readers from around the world asked about Assemblyman Zohran Mamdani’s surprising primary win, its effect on national politics and how The Times covers elections."
  },
  {
    "title": "This Math Tutor Keeps Popping Up in Wes Anderson Films",
    "link": "https://www.nytimes.com/2025/07/15/arts/mike-maggart-wes-anderson-acting.html",
    "summary": "Michael Maggart, a high school friend of Anderson’s, has no training or aspirations to be an actor. The director keeps casting him anyway."
  },
  {
    "title": "Netanyahu’s Ultra-Orthodox Allies Threaten His Coalition Government",
    "link": "https://www.nytimes.com/2025/07/15/world/middleeast/netanyahu-ultra-orthodox-draft.html",
    "summary": "Some of the prime minister’s political allies have quit over a proposal to make religious students serve in military, and more are threatening to do so."
  },
  {
    "title": "Israel Targets Syria and Lebanon in Wave of Airstrikes",
    "link": "https://www.nytimes.com/2025/07/15/world/middleeast/airstrikes-israel-syria-lebanon.html",
    "summary": "In Syria, Israel launched rare attacks on forces of the new government, while in Lebanon it took aim at the Iran-backed militant group Hezbollah."
  },
  {
    "title": "China Puts New Restrictions on E.V. Battery Manufacturing Technology",
    "link": "https://www.nytimes.com/2025/07/15/business/china-electric-vehicle-battery-manufacturing.html",
    "summary": "Beijing will now require government licenses for any effort to transfer abroad the technologies crucial for producing inexpensive electric cars."
  },
  {
    "title": "Nvidia Says U.S. Has Lifted Restrictions on A.I. Chip Sales to China",
    "link": "https://www.nytimes.com/2025/07/14/technology/nvidia-ai-chip-sales-china.html",
    "summary": "The Silicon Valley chip giant said the Trump administration, which had shut down its sales to China three months ago, had assured it that licenses for the sales would now be granted."
  },
  {
    "title": "I’m a Genocide Scholar. I Know It When I See It.",
    "link": "https://www.nytimes.com/2025/07/15/opinion/israel-gaza-holocaust-genocide-palestinians.html",
    "summary": "A professor of Holocaust and genocide studies comes to a painful conclusion about Israel’s actions in Gaza."
  },
  {
    "title": "When It Comes to Undermining America, We Have a Winner",
    "link": "https://www.nytimes.com/2025/07/15/opinion/trump-authoritarianism-republican-party-democracy.html",
    "summary": "Trump may be winning the battle to weaken our democracy, but he has not won the war."
  },
  {
    "title": "The Epstein Saga",
    "link": "https://www.nytimes.com/2025/07/15/briefing/maga-bondi-epstein-files.html",
    "summary": "We explore the MAGA base’s attachment to Jeffrey Epstein conspiracy theories."
  },
  {
    "title": "Blazes in Northern Ireland Recall an Old Message: You Are Not Welcome Here",
    "link": "https://www.nytimes.com/2025/07/15/world/europe/northern-ireland-bonfire-arson-ballymena-riots.html",
    "summary": "A bonfire topped with an effigy of a migrant boat. Homes set alight. During the Troubles, similar tactics were used to target Irish Catholics in the territory."
  },
  {
    "title": "Men Who Felled Sycamore Gap Tree Are Given Prison Sentences in U.K.",
    "link": "https://www.nytimes.com/2025/07/15/world/europe/sycamore-gap-tree-sentencing-prison.html",
    "summary": "The tree, a beloved landmark that stood by Hadrian’s Wall in northern England, was found illegally cut down in 2023."
  },
  {
    "title": "Three Aid Workers Were ‘Intentionally Killed’ in Tigray Region of Ethiopia, M.S.F. Says",
    "link": "https://www.nytimes.com/2025/07/15/world/africa/ethiopia-tigray-msf.html",
    "summary": "The aid group accused Ethiopia’s government of failing to properly investigate the slayings, which took place in the Tigray region in 2021. A New York Times investigation found that Ethiopian soldiers were responsible."
  },
  {
    "title": "The D.E.I. Industry, Scorned by the White House, Turns to ‘Safer’ Topics",
    "link": "https://www.nytimes.com/2025/07/15/business/trump-dei-race-gender-mental-health.html",
    "summary": "To avoid government scrutiny, companies are asking for fewer trainings focused on race and gender and more on neurodivergence and generational differences."
  }
]