[
  {
    "title": "In Sydney Suburb Where Suspects Lived, Neighbor Saw ‘No Dramas’",
    "link": "https://www.nytimes.com/2025/12/16/world/australia/sydney-bondi-suspects-neighborhood-bonnyrigg.html",
    "summary": "He said the people in the house were relatively new to the area and largely kept to themselves."
  },
  {
    "title": "At a Dark Moment, Jews in New York Celebrate the Festival of Lights",
    "link": "https://www.nytimes.com/2025/12/15/nyregion/hanukkah-menorah-nyc-jews-australia.html",
    "summary": "After the mass shooting at a Hanukkah celebration in Sydney, Australia, Jewish New Yorkers said they felt the need to stand up for their community."
  },
  {
    "title": "Ahmed el Ahmed, Who Tackled One of the Bondi Beach Gunmen, Is Recovering in a Hospital",
    "link": "https://www.nytimes.com/2025/12/15/world/australia/ahmed-bondi-shooting-hero-tackled-shooter-injured.html",
    "summary": "Video of Ahmed el Ahmed disarming one of the gunmen has gone viral, and officials around the world have hailed his bravery."
  },
  {
    "title": "Nick Reiner’s Struggles With Drugs Left His Parents ‘Desperate’",
    "link": "https://www.nytimes.com/2025/12/15/movies/nick-reiner-drugs-rehab-heroin-cocaine.html",
    "summary": "Mr. Reiner, who was arrested in connection with the deaths of Rob and Michele Reiner, once estimated he had been in drug treatment 18 times as a teenager."
  },
  {
    "title": "Trump’s Post Attacking Rob Reiner After Stabbing Death Draws Immediate Outrage",
    "link": "https://www.nytimes.com/2025/12/15/us/politics/trump-rob-reiner.html",
    "summary": "The president attributed the killing to “Trump derangement syndrome,” but his disparaging comments drew backlash even from conservative allies who said they were inappropriate."
  },
  {
    "title": "Rob Reiner Made Clear What He Believed In, Onscreen and Off",
    "link": "https://www.nytimes.com/2025/12/15/movies/rob-reiner-films-activism.html",
    "summary": "In films like “A Few Good Men,” the director’s ideas of honor and morality were stated as plainly as could be."
  },
  {
    "title": "FBI Director Kash Patel, Eager for Spotlight, Casts Aside Caution in Social Media Posts",
    "link": "https://www.nytimes.com/2025/12/15/us/politics/kash-patel-fbi.html",
    "summary": "Kash Patel’s impulse to publicize the work of the bureau under his leadership has revived questions about his competence and his future in the administration."
  },
  {
    "title": "Kushner’s Firm Pulls Out of Trump-Branded Hotel Deal in Serbia",
    "link": "https://www.nytimes.com/2025/12/15/us/politics/kushner-trump-hotel-deal-serbia.html",
    "summary": "The announcement came just hours after prosecutors there charged four government officials with corruption in connection with the half-billion-dollar project."
  },
  {
    "title": "Donald Trump Jr. Is Engaged to Bettina Anderson, a Palm Beach Socialite",
    "link": "https://www.nytimes.com/2025/12/15/us/donald-trump-jr-engaged-bettina-anderson.html",
    "summary": "The relationship between the president’s son and Ms. Anderson had been the subject of tabloid speculation during his previous engagement to Kimberly Guilfoyle."
  },
  {
    "title": "Trump Files $10 Billion Suit Over BBC Documentary",
    "link": "https://www.nytimes.com/2025/12/15/us/politics/trump-sues-bbc.html",
    "summary": "The British broadcaster, which has expressed regret over the editing of video clips about the president, has rejected claims that the error was evidence of a fundamental bias in its news reporting."
  },
  {
    "title": "Volkswagen to End Production at German Plant, a First in Company History",
    "link": "https://www.nytimes.com/2025/12/16/business/volkswagen-dresden-factory-closed.html",
    "summary": "The auto giant stopped making cars at the plant in Dresden, which opened in 2001, as it faces weaker demand and steep U.S. tariffs."
  },
  {
    "title": "Ford Will Take $19.5 Billion Hit as It Rolls Back E.V. Plans",
    "link": "https://www.nytimes.com/2025/12/15/business/ford-electric-vehicles-hybrids.html",
    "summary": "Ford Motor said the costs came from its decision to make fewer electric vehicles than it had planned and more hybrids that use both gasoline engines and batteries."
  },
  {
    "title": "Pelosi Long Resisted Stock-Trading Ban for Congress, Fueling Suspicion",
    "link": "https://www.nytimes.com/2025/12/15/us/politics/pelosi-stock-trading-ban.html",
    "summary": "The former speaker failed to appreciate the groundswell of support for banning the practice, refusing to give an inch amid G.O.P. accusations that she was corrupt."
  },
  {
    "title": "Anthony Geary, Luke on ‘General Hospital,’ Dies at 78",
    "link": "https://www.nytimes.com/2025/12/15/arts/television/anthony-geary-dead.html",
    "summary": "Portraying Luke Spencer, he was one of the best-known soap opera stars in American television. His onscreen romance with Laura Webber, played by Genie Francis, changed the landscape of daytime television."
  },
  {
    "title": "The 52 Best Breakup Lines (Said in Real Life)",
    "link": "https://www.nytimes.com/2025/12/15/style/best-breakup-lines.html",
    "summary": "To mark the winter holidays — an especially popular time to break up — we asked people around the world for their most striking parting words to each other."
  },
  {
    "title": "Joe Ely, Texas-Born Troubadour of the Open Road, Dies at 78",
    "link": "https://www.nytimes.com/2025/12/15/obituaries/joe-ely-dead.html",
    "summary": "Thanks to his eclectic style and tireless touring, he was among the most influential artists in the early days of Americana and alt-country music."
  },
  {
    "title": "Europe Is in Decline. Good.",
    "link": "https://www.nytimes.com/2025/12/16/opinion/europe-decline-economy-china.html",
    "summary": "Demotion need not be traumatic."
  },
  {
    "title": "600 Readers Told Us About the Best Gifts They Ever Got. These Are the Top 13.",
    "link": "https://www.nytimes.com/2025/12/15/opinion/contributors/holiday-gifts-presents-free.html",
    "summary": "We asked readers to tell us about the most memorable presents they’ve received."
  },
  {
    "title": "Ukraine and Allies Agree on Security Guarantee for Peace Proposal",
    "link": "https://www.nytimes.com/2025/12/15/world/europe/zelensky-berlin-ukraine-witkoff-russia-peace-talks.html",
    "summary": "Crucial details on the future security of Ukraine remain unsettled as negotiators seek a deal that Russia will approve."
  },
  {
    "title": "Robert Samuelson, Award-Winning Economics Columnist, Dies at 79",
    "link": "https://www.nytimes.com/2025/12/15/business/media/robert-samuelson-dead.html",
    "summary": "He was a familiar byline in Newsweek and The Washington Post for decades, explaining the intricacies of economic policy in reader-friendly vernacular."
  },
  {
    "title": "U.S. Soldiers and Translator Killed in Syria Are Identified",
    "link": "https://www.nytimes.com/2025/12/15/us/syria-killed-soldiers-iowa-national-guard.html",
    "summary": "The shooting attack in Palmyra, Syria, on Saturday struck Iowa National Guard troops. Two were killed, along with an American civilian interpreter; three others were wounded."
  },
  {
    "title": "How the Pandemic Lockdowns Changed a Songbird’s Beak",
    "link": "https://www.nytimes.com/2025/12/15/science/covid-ecology-anthropause-birds.html",
    "summary": "For ecologists, the Covid-19 pandemic has presented a remarkable natural experiment in what can happen to wild animals when humans stay home."
  }
]