[
  {
    "title": "Behind Wall Street’s Abrupt Flip on Crypto",
    "link": "https://www.nytimes.com/2025/08/13/business/wall-street-banks-crypto-stablecoins.html",
    "summary": "The reversal risks declawing a century of consumer financial protections and replacing the backbone of bank accounts."
  },
  {
    "title": "Trump Administration Can Withhold Billions in Foreign Aid, Appeals Court Rules",
    "link": "https://www.nytimes.com/2025/08/13/us/politics/foreign-aid-trump-appeals-ruling.html",
    "summary": "In a 2-to-1 vote, a federal appeals court panel ruled that foreign aid groups that sued to recover funds that President Trump froze cannot challenge the decision."
  },
  {
    "title": "At the Kennedy Center, Trump Puts His Pop Culture Obsession on Display",
    "link": "https://www.nytimes.com/2025/08/13/us/politics/trump-kennedy-center-pop-culture.html",
    "summary": "President Trump held forth about the nature of show business and his own tortured relationship with celebrity."
  },
  {
    "title": "Trump Will Visit Kennedy Center to Announce New Honorees",
    "link": "https://www.nytimes.com/2025/08/13/us/politics/trump-kennedy-center-nominees.html",
    "summary": "The president has taken a strong interest in the Kennedy Center’s affairs ever since naming himself chairman in February, when he restocked its traditionally bipartisan board with loyalists."
  },
  {
    "title": "Bessent Has Yet to Fully Divest Assets, Raising Concern at Ethics Agency",
    "link": "https://www.nytimes.com/2025/08/13/us/politics/scott-bessent-conflicts-of-interest.html",
    "summary": "The Treasury secretary has been slow to shed assets, including farmland, posing potential conflicts of interest."
  },
  {
    "title": "Man Charged With Assaulting Federal Agent With Sandwich in D.C.",
    "link": "https://www.nytimes.com/2025/08/13/us/politics/federal-agent-trump-sandwich-dc.html",
    "summary": "A video showed a man repeatedly calling a group of officers “fascists” before throwing a sub sandwich at one."
  },
  {
    "title": "After Reassuring Europe, Trump Strikes a Different Tone About Russian Threats",
    "link": "https://www.nytimes.com/2025/08/13/us/politics/trump-putin-russian-threats.html",
    "summary": "Hours after presenting a united front with allies, President Trump warned Vladimir V. Putin of “severe consequences” if Russia refuses to end the war in Ukraine. But he also suggested that he has limited power to alter the Russian leader’s behavior."
  },
  {
    "title": "The Hardest Part of Setting a Guinness World Record? Getting People to Show Up.",
    "link": "https://www.nytimes.com/2025/08/13/magazine/guinness-world-record.html",
    "summary": "When it comes to mass-participation events, would-be record setters are finding it harder than ever to draw a crowd. But it’s still fun to try."
  },
  {
    "title": "Gaza Plan Stokes Tension Between Israel’s Military Chief and Government",
    "link": "https://www.nytimes.com/2025/08/13/world/middleeast/israel-gaza-plan-military-government-zamir.html",
    "summary": "Lt. Gen. Eyal Zamir has pushed back against a proposal to control Gaza City, according to officials. One hard-right member of the government suggested he could be dismissed."
  },
  {
    "title": "What It Takes to Find Food in Gaza",
    "link": "https://www.nytimes.com/video/world/middleeast/100000010322362/what-it-takes-to-find-food-in-gaza.html",
    "summary": "Starvation has spread in Gaza, as the prices of basic goods have skyrocketed and getting aid is difficult and often deadly. Ashley Wu, a graphics reporter for The New York Times, explains the dire choices that many Gazans face, as Israel faces growing condemnation over the crisis."
  },
  {
    "title": "Top Iranian Official Visits Lebanon as Hezbollah Bucks Calls to Disarm",
    "link": "https://www.nytimes.com/2025/08/13/world/europe/iran-lebanon-hezbollah-disarm.html",
    "summary": "The visit by Ali Larijani, the head of Iran’s top security body, came as the Lebanese government moves to disarm Hezbollah, the militant group that has long been Tehran’s most powerful regional ally."
  },
  {
    "title": "Trump Administration Plan to Oversee Smithsonian Exhibits Draws Criticism From Historians",
    "link": "https://www.nytimes.com/2025/08/13/arts/design/trump-smithsonian-exhibits-review-historians-alarmed.html",
    "summary": "The Trump administration’s plan to, in effect, audit the content of Smithsonian museums drew criticism from groups that represent scholars and promote free speech."
  },
  {
    "title": "Mario Paglino, 52, and Gianni Grossi, 54, Die; Designers Made Barbies Into Art",
    "link": "https://www.nytimes.com/2025/08/13/arts/design/mario-paglino-gianni-grossi-dead.html",
    "summary": "They transformed dolls into one-of-a-kind pieces that sold for thousands of dollars. A married couple, they died in a car crash in Italy."
  },
  {
    "title": "Hispanic Democratic Officials in Texas Plead Not Guilty to Voter Fraud",
    "link": "https://www.nytimes.com/2025/08/13/us/politics/voter-fraud-texas.html",
    "summary": "Texas’ attorney general, Ken Paxton, has now used his “election integrity unit” to indict 15 Latino Democrats under a 2021 statute that outlawed delivering ballots for other voters."
  },
  {
    "title": "U.K. Secretly Spent $3.2 Million to Stop Journalists From Reporting on Data Breach",
    "link": "https://www.nytimes.com/2025/08/13/world/europe/uk-data-breach-afghan.html",
    "summary": "After British authorities accidentally exposed information about 19,000 Afghans, the government sought a legal order preventing disclosure of the breach."
  },
  {
    "title": "Homeless and Burning in Phoenix, America’s Hottest City",
    "link": "https://www.nytimes.com/2025/08/13/well/homeless-heat-phoenix.html",
    "summary": "As the summer heat becomes increasingly extreme in Phoenix, people who can’t escape the sun are suffering third-degree burns, heatstroke and dehydration."
  },
  {
    "title": "Canada’s Wildfire Season Is One of Its Worst Ever, and It’s Not Over Yet",
    "link": "https://www.nytimes.com/2025/08/13/world/canada/canada-wildfire-season-newfoundland-saskatchewan.html",
    "summary": "Thousands have been evacuated as quick moving wildfires burn in Eastern Canada."
  },
  {
    "title": "Mendenhall River Hit Record High From Glacier Melt",
    "link": "https://www.nytimes.com/2025/08/13/climate/alaska-juneau-flood-glacier.html",
    "summary": "An overflowing glacial lake caused a surge in the Mendenhall River on Wednesday, prompting flood alerts and evacuations in Juneau."
  },
  {
    "title": "Taylor Swift Announces ‘The Life of a Showgirl’ Details on ‘New Heights’ Podcast",
    "link": "https://www.nytimes.com/2025/08/13/arts/music/taylor-swift-travis-kelce-new-heights-podcast.html",
    "summary": "Swift spoke about her upcoming album on “New Heights,” a sports and pop culture podcast co-hosted by her boyfriend."
  },
  {
    "title": "How Scientists Use Drones to Tag Sperm Whales",
    "link": "https://www.nytimes.com/2025/08/13/science/whales-drones-acoustics-tagging.html",
    "summary": "A new tagging method called tap-and-go allows researchers to gather more data on the health and behavior of whales, with less disruption."
  },
  {
    "title": "Why Economists Are Worried About Trump’s B.L.S. Changes",
    "link": "https://www.nytimes.com/2025/08/13/opinion/trump-bls-nominee-antoni.html",
    "summary": "Most of us just accept that government economic data is the best possible estimate of the economy. That could change, and that would be bad for all of us."
  },
  {
    "title": "Some Democrats Panicked Over Mamdani. Obama Called Him.",
    "link": "https://www.nytimes.com/2025/08/13/opinion/mamdani-obama-democrats.html",
    "summary": "Obamaworld seems interested in understanding Zohran Mamdani’s sudden rise to prominence."
  },
  {
    "title": "Bakers on Texas-Mexican Border Are Found Guilty of Harboring Illegal Workers",
    "link": "https://www.nytimes.com/2025/08/13/us/border-bakery-undocumented-immigrants.html",
    "summary": "Leonardo Baez and his wife were among the first employers prosecuted for taking on undocumented immigrants at their bakery in Los Fresnos, Texas. They face up to 10 years in prison."
  },
  {
    "title": "Taxi Drivers Near $140 Million Settlement Over N.Y.C. Suspension Practices",
    "link": "https://www.nytimes.com/2025/08/13/nyregion/nyc-taxi-drivers-settlement.html",
    "summary": "New York City could grant payouts to some 20,000 taxi drivers whose professional licenses were summarily suspended without sufficient due process."
  },
  {
    "title": "U.S. Pilot Stranded in Antarctica Says It’s ‘Isolating and Lonely’",
    "link": "https://www.nytimes.com/2025/08/13/world/americas/ethan-guo-pilot-antarctica-chile.html",
    "summary": "Ethan Guo, a content creator, said that he has been effectively trapped at a Chilean base since June. The authorities had said he landed there without permission."
  },
  {
    "title": "Billy Howton, Top Green Bay Packers Receiver in the ’50s, Dies at 95",
    "link": "https://www.nytimes.com/2025/08/13/sports/football/billy-howton-dead.html",
    "summary": "He retired as the N.F.L.’s leading career receiver but was soon surpassed. In retirement, he went to prison for bilking investors in an $8 million fraud."
  }
]