[
  {
    "title": "Iran’s Currency Collapse Pushes Protesters to the Streets",
    "link": "https://www.nytimes.com/2025/12/29/world/middleeast/iran-currency-collapse-rial-inflation-protests.html",
    "summary": "High inflation and a currency collapse have squeezed Iranians’ budgets, challenging the country’s leaders."
  },
  {
    "title": "Grim Evidence of Trump’s Boat Strikes Washes Ashore on a Colombian Peninsula",
    "link": "https://www.nytimes.com/2025/12/29/world/americas/trump-boat-strikes-gulf-of-venezuela-wreckage.html",
    "summary": "First came the scorched boat. Then the mangled bodies. Then the packets with traces of marijuana. Now, fishermen fear the ocean that feeds them."
  },
  {
    "title": "Trump Says the U.S. Struck a ‘Big Facility’ in Campaign Against Venezuela",
    "link": "https://www.nytimes.com/2025/12/28/us/politics/trump-drug-facility-venezuela.html",
    "summary": "The administration provided no details of what the president said was an attack last week linked to U.S. efforts to disrupt drug trafficking from Latin America."
  },
  {
    "title": "For Zelensky, Just Keeping Trump Talking About Ukraine Peace Deal Counts as a Win",
    "link": "https://www.nytimes.com/2025/12/29/world/europe/zelensky-trump-ukraine-peace-talks.html",
    "summary": "Though discussions produced little tangible progress, President Volodymyr Zelensky of Ukraine at least avoided the type of setbacks that have blighted earlier meetings."
  },
  {
    "title": "The Status of the 20-Point Peace Plan for Ukraine",
    "link": "https://www.nytimes.com/2025/12/24/world/europe/what-is-in-the-20-point-ukraine-peace-plan.html",
    "summary": "The blueprint covers a broad range of issues, including territory, security guarantees and postwar reconstruction. But Russia has indicated little willingness to end the war."
  },
  {
    "title": "Inside Marjorie Taylor Greene’s Break With Trump and MAGA",
    "link": "https://www.nytimes.com/2025/12/29/magazine/marjorie-taylor-greene-trump-maga-split.html",
    "summary": "How the Georgia congresswoman went from the president’s loudest cheerleader to his loudest Republican critic."
  },
  {
    "title": "Four Takeaways From the New York Times Profile of Marjorie Taylor Greene",
    "link": "https://www.nytimes.com/2025/12/29/magazine/marjorie-taylor-greene-interview-takeaways.html",
    "summary": "The congresswoman discussed her break with President Trump and her journey from MAGA zealot to political isolation."
  },
  {
    "title": "How We’ll Eat in 2026: Food Forecasters Predict More Caution and More Crunch",
    "link": "https://www.nytimes.com/2025/12/29/dining/food-trends-2026-predictions.html",
    "summary": "Food forecasters see a year of quieter tastes: little bursts of pleasure, less-jangling restaurants and healthy foods worthy of the ideal Grandma."
  },
  {
    "title": "Claire Brosseau Wants to Die. Will Canada Let Her?",
    "link": "https://www.nytimes.com/2025/12/29/health/assisted-death-mental-illness-canada.html",
    "summary": "Ms. Brosseau says mental illness has made her life unbearable. She wants a medically assisted death. Even her psychiatrists are split over whether she should have one."
  },
  {
    "title": "Uber Flags Sexual Misconduct but Many Drivers Stay on the Road",
    "link": "https://www.nytimes.com/2025/12/29/business/uber-sexual-assault-drivers-complaints.html",
    "summary": "The company monitors passenger feedback for risky driver behavior. Some accused of serious sexual assault had prior records of complaints."
  },
  {
    "title": "Experts Question Denmark’s Vaccine Program as a Model for the U.S.",
    "link": "https://www.nytimes.com/2025/12/29/world/europe/denmark-vaccine-schedule-rfk.html",
    "summary": "The United States is expected to adopt the vaccine schedule used by Denmark, a much smaller country with universal health care."
  },
  {
    "title": "As Mamdani Leaves Queens for the Upper East Side, a Cool Welcome Awaits",
    "link": "https://www.nytimes.com/2025/12/29/nyregion/mamdani-gracie-neighborhood-astoria.html",
    "summary": "Mayor-elect Zohran Mamdani loves his Astoria, Queens, neighborhood, and the feeling is mutual. But voters who live near Gracie Mansion, his new home, really wanted his opponent to win."
  },
  {
    "title": "Meet a U.S. Start-Up Trying to Break China’s Rare-Earth Monopoly",
    "link": "https://www.nytimes.com/2025/12/29/business/energy-environment/rare-earth-processing-phoenix-tailings.html",
    "summary": "Companies like Phoenix Tailings, which recently began producing metal in New Hampshire, are using new processing methods to compete with Chinese suppliers."
  },
  {
    "title": "Who Says Rock Is Dead?",
    "link": "https://www.nytimes.com/2025/12/29/arts/music/year-in-rock-geese-turnstile.html",
    "summary": "In 2025, rock was still hanging in. As artificial intelligence infiltrates music, the genre’s handmade imperfections are more crucial than ever."
  },
  {
    "title": "A Bold Alliance Ends as Innovative Opera Director Bows Out in Detroit",
    "link": "https://www.nytimes.com/2025/12/29/arts/music/yuval-sharon-detroit-opera.html",
    "summary": "Yuval Sharon will leave the financially strained Detroit Opera after this season. In March, he brings his unorthodox vision to Wagner at the Metropolitan Opera."
  },
  {
    "title": "One of America’s Most Successful Experiments Is Coming to a Shuddering Halt",
    "link": "https://www.nytimes.com/2025/12/29/opinion/indian-americans-trump.html",
    "summary": "Amid an astonishing wave of anti-Indian animus, Indian Americans are questioning their place in the country."
  },
  {
    "title": "Why We Keep Falling for Narcissistic Leaders",
    "link": "https://www.nytimes.com/2025/12/29/opinion/why-we-fall-for-narcissistic-leaders-starting-in-grade-school.html",
    "summary": "We should know better."
  },
  {
    "title": "Our Visual Journalism",
    "link": "https://www.nytimes.com/2025/12/29/briefing/our-visual-journalism.html",
    "summary": "We look at the best graphics from The Times in 2025."
  },
  {
    "title": "China Will Hold Live-Fire Military Exercises Around Taiwan",
    "link": "https://www.nytimes.com/2025/12/29/world/asia/china-taiwan-military-exercises.html",
    "summary": "The exercises ended months of relative calm across the Taiwan Strait, and came after the Trump administration announced plans for arms sales to the island."
  },
  {
    "title": "Melanie Watson Bernhardt, ‘Diff’rent Strokes’ Actress, Dies at 57",
    "link": "https://www.nytimes.com/2025/12/29/arts/melanie-watson-dead-different-strokes.html",
    "summary": "Her four episodes on the sitcom marked a rarity: a disabled actress onscreen."
  },
  {
    "title": "Parts of New York and New England Brace for Ice Storm",
    "link": "https://www.nytimes.com/2025/12/29/us/new-york-new-england-ice-storm.html",
    "summary": "Several states were under weather warnings or advisories after the same winter storm battered the Midwest over the weekend. Tens of thousands of power customers faced outages."
  }
]