[
  {
    "title": "China Wins as Trump Cedes Leadership of the Global Economy",
    "link": "https://www.nytimes.com/2026/01/22/business/davos-trump-xi-china.html",
    "summary": "The president used a keynote speech at the World Economic Forum in Switzerland to renounce the last vestiges of the liberal democratic order."
  },
  {
    "title": "Trump’s ‘Board of Peace’ Would Have Global Scope but One Man in Charge",
    "link": "https://www.nytimes.com/2026/01/21/us/politics/trump-board-peace-united-nations.html",
    "summary": "The initiative is the latest example of the president dismantling the post-World War II international system and building a new one, with himself at the center."
  },
  {
    "title": "New Poll Shows Trump’s Support Slipping, and Clintons Face Contempt Vote in Epstein Inquiry",
    "link": "https://www.nytimes.com/2026/01/22/podcasts/the-headlines/trump-poll-clintons-epstein-inquiry.html",
    "summary": "Plus, how A.I. is judging your résumé."
  },
  {
    "title": "Few Voters Say Trump’s Second Term Has Made the Country Better, Poll Finds",
    "link": "https://www.nytimes.com/2026/01/22/us/politics/trump-poll-second-term.html",
    "summary": "A majority of voters said that Mr. Trump had focused on the wrong priorities and that they disapproved of his handling of top issues, but the president still enjoys strong support from Republicans."
  },
  {
    "title": "The Voters Who Have Taken a U-Turn on Trump",
    "link": "https://www.nytimes.com/2026/01/22/upshot/trump-poll-analysis-times-siena.html",
    "summary": "One year later, the second Trump coalition has come apart, a Times/Siena poll finds."
  },
  {
    "title": "Cuban Detainee in El Paso ICE Facility Died by Homicide, Autopsy Shows",
    "link": "https://www.nytimes.com/2026/01/21/us/el-paso-ice-detainee-homicide.html",
    "summary": "The report from the county medical examiner said the detainee, Geraldo Lunas Campos, was asphyxiated and restrained by law enforcement. Federal officials described his death as a suicide."
  },
  {
    "title": "‘High Alert, All the Time’: Minneapolis Sees ICE Around Every Corner",
    "link": "https://www.nytimes.com/2026/01/22/us/minnesota-scene-ice.html",
    "summary": "Federal agents have been carrying out an immigration crackdown in Minnesota for weeks. Some residents say they carry a sense of dread even on empty streets."
  },
  {
    "title": "Winter Storm Forecast: What to Expect as Snow and Ice Move Across the U.S. This Weekend",
    "link": "https://www.nytimes.com/2026/01/22/weather/winter-storm-forecast-snow-ice.html",
    "summary": "Half the U.S. population will likely see some effect from the sprawling storm that will move across the country this weekend, meteorologists said."
  },
  {
    "title": "Snow Maps and More: Everything You Could Want to Know About This Winter Storm",
    "link": "https://www.nytimes.com/2026/01/21/weather/winter-storm-forecast.html",
    "summary": "Here’s a look at the latest forecasts, and how to prepare."
  },
  {
    "title": "2026 Oscar Nominations to Be Unveiled by Danielle Brooks and Lewis Pullman",
    "link": "https://www.nytimes.com/2026/01/22/business/media/oscar-nominations-announcement.html",
    "summary": "The nominations are being announced by Danielle Brooks and Lewis Pullman from the headquarters of the Academy of Motion Picture Arts and Sciences."
  },
  {
    "title": "Jack Smith to Testify Before Congress on Trump Investigations",
    "link": "https://www.nytimes.com/2026/01/22/us/politics/jack-smith-trump-testimony-congress.html",
    "summary": "The appearance provides Mr. Smith with what is likely to be his best opportunity to challenge President Trump’s assertion that he was persecuted for his politics, not for his misdeeds."
  },
  {
    "title": "Supreme Court Seems Poised to Reject Trump’s Attempt to Immediately Fire a Fed Governor",
    "link": "https://www.nytimes.com/2026/01/21/us/politics/supreme-court-trump-fed-cook.html",
    "summary": "During arguments, key justices appeared concerned that the president’s efforts to oust Lisa Cook could imperil the central bank’s independence."
  },
  {
    "title": "Former Uvalde Officer Adrian Gonzales Found Not Guilty of Endangering Children in Mass Shooting",
    "link": "https://www.nytimes.com/2026/01/21/us/former-police-officer-who-failed-to-confront-uvalde-gunman-found-not-guilty.html",
    "summary": "Adrian Gonzales had faced 29 charges for his actions in the 2022 shooting, in which 19 children were killed by a gunman at Robb Elementary School in Texas."
  },
  {
    "title": "Takeaways From the Times’ Look at Kash Patel’s FBI: Misleading Stats, Mismanagement and Meltdowns",
    "link": "https://www.nytimes.com/2026/01/22/magazine/trump-fbi-kash-patel-takeaways.html",
    "summary": "Many current and former employees say Kash Patel’s first year as F.B.I. director was marred by vendettas, mismanagement and meltdowns."
  },
  {
    "title": "Murder Rate Drops to Lowest Level Since at Least 1900, New Report Says",
    "link": "https://www.nytimes.com/2026/01/22/us/murder-rate-drop-report.html",
    "summary": "A decline in homicides across the country was a stunning reversal after crime rose during the pandemic."
  },
  {
    "title": "Elon Musk’s Grok A.I. Chatbot Made Millions of Sexualized Images, New Estimates Show",
    "link": "https://www.nytimes.com/2026/01/22/technology/grok-x-ai-elon-musk-deepfakes.html",
    "summary": "Over nine days, Elon Musk’s Grok chatbot generated and posted 4.4 million images, of which at least 41 percent were sexualized images of women."
  },
  {
    "title": "Saving La Clef Cinema, With Help From Scorsese and Tarantino",
    "link": "https://www.nytimes.com/2026/01/21/movies/la-clef-paris.html",
    "summary": "After a saga that kept its supporters on the edge of their seats for years, a beloved art-house cinema is now open for business once more, run by volunteers this time."
  },
  {
    "title": "Donald Trump, Live From Davos",
    "link": "https://www.nytimes.com/2026/01/22/opinion/trump-davos-greenland-minnesota.html",
    "summary": "It’s striking how clearheadedly and defiantly Europeans are reacting to the president’s provocations."
  },
  {
    "title": "The Health Care Diaries of Five Americans",
    "link": "https://www.nytimes.com/2026/01/22/opinion/health-insurance-obamacare-subsidies-america.html",
    "summary": "We heard from 300 people about what they are paying in health insurance premiums after Affordable Care Act subsidies expired."
  },
  {
    "title": "Malfunction Forces Japan to Take Restarted Nuclear Plant Offline",
    "link": "https://www.nytimes.com/2026/01/22/business/japan-nuclear-offline.html",
    "summary": "The setback occurred hours after one of the world’s largest nuclear complexes restarted, ending more than a decade of dormancy following the 2011 Fukushima Daiichi meltdown."
  },
  {
    "title": "Scammers Keep Stealing Food Stamps. New Cards Might Stop Them.",
    "link": "https://www.nytimes.com/2026/01/22/nyregion/ebt-food-stamp-skimming.html",
    "summary": "New York is joining the small group of states switching to chip-and-pin cards to evade skimming devices that siphon money for food from low-income people."
  },
  {
    "title": "He Wants New Yorkers to Have a Stake in the Knicks and the Rangers",
    "link": "https://www.nytimes.com/2026/01/22/nyregion/msg-pension-ownership-bunkeddeko.html",
    "summary": "Adem Bunkeddeko, a state comptroller candidate, wants to use some of New York’s $290 billion pension fund to buy a percentage of Madison Square Garden Sports."
  },
  {
    "title": "National Park Service Removes Sign on Climate Change From Fort Sumter",
    "link": "https://www.nytimes.com/2026/01/22/climate/park-service-erases-climate-facts-at-fort-sumter-where-the-civil-war-began.html",
    "summary": "The historic site, on an island in South Carolina, could be inundated by rising seas in decades to come. A display on the threat has been removed."
  }
]