[
  {
    "title": "Fed Pick Puts Pressure on Bessent to Deliver for Trump",
    "link": "https://www.nytimes.com/2025/12/03/us/politics/fed-chair-bessent-hassett.html",
    "summary": "Treasury Secretary Scott Bessent, who is leading the search for the next Federal Reserve chair, could face President Trump’s wrath if the person chosen does not quickly lower interest rates."
  },
  {
    "title": "Trump Calls Affordability a ‘Con Job’ as His Edge on the Economy Slips",
    "link": "https://www.nytimes.com/2025/12/02/us/politics/trump-affordability-economy-messaging.html",
    "summary": "President Trump is growing frustrated as Americans struggle with higher prices and pessimism over the state of the economy."
  },
  {
    "title": "Bitcoin’s Sky-High Prices Have Not Panned Out",
    "link": "https://www.nytimes.com/2025/12/03/technology/cryptocurrencies-tumble-trump-rally.html",
    "summary": "Bitcoin has plunged more than 30 percent and Ether is down around 40 percent in recent months, as gains from President Trump’s pro-crypto policies evaporated."
  },
  {
    "title": "Trump’s Xenophobic Outburst, and a Planned Donation to 25 Million U.S. Kids",
    "link": "https://www.nytimes.com/2025/12/03/podcasts/the-headlines/trump-somalis-donation-to-25-million-kids.html",
    "summary": "Plus, the 10 best books of the year."
  },
  {
    "title": "Trump and Hegseth Comments on Boat Strike Leave Adm. Bradley Exposed",
    "link": "https://www.nytimes.com/2025/12/02/us/politics/admiral-bradley-boat-strikes.html",
    "summary": "Adm. Frank M. Bradley will soon face questions from lawmakers, as Republicans and Democrats express concerns about a Sept. 2 attack on a boat in the Caribbean."
  },
  {
    "title": "Hegseth Says He Did Not See Survivors of Boat Strike Clinging to Wreckage",
    "link": "https://www.nytimes.com/2025/12/02/us/politics/hegseth-boat-strikes.html",
    "summary": "The defense secretary supported the admiral he said called for the second strike on Sept. 2 against a boat the administration says was smuggling drugs."
  },
  {
    "title": "Europe Wants to Get the Word Out: Russia Is to Blame for Sabotage",
    "link": "https://www.nytimes.com/2025/12/03/world/europe/europe-russia-hybrid-attacks.html",
    "summary": "Officials are accusing Russia of smaller-scale assaults. President Vladimir V. Putin sought to turn the tables, saying that if Europe were to start a war, Russia is ready."
  },
  {
    "title": "Putin and Witkoff Meet in Russia as U.S. Pushes Ukraine Deal",
    "link": "https://www.nytimes.com/2025/12/02/world/europe/putin-witkoff-trump-ukraine-meeting.html",
    "summary": "The two sides did not reach any specific compromises, an aide to President Vladimir V. Putin said, as the United States pushes a plan to end the war in Ukraine."
  },
  {
    "title": "Heading Toward Midterms, the G.O.P. Continues to Slip",
    "link": "https://www.nytimes.com/2025/12/02/upshot/election-tennessee-republicans-democrats.html",
    "summary": "Almost every election night this year has gone poorly for the Republicans — a familiar position for the party that occupies the White House."
  },
  {
    "title": "Matt Van Epps Wins Tennessee House Race After a Trump-Led Rescue Mission",
    "link": "https://www.nytimes.com/2025/12/02/us/politics/tennessee-special-election-winner-matt-van-epps.html",
    "summary": "Matt Van Epps fended off a Democrat to protect Republicans’ slim House majority, but the relatively close margin in a red district sent the party a warning shot before the 2026 midterms."
  },
  {
    "title": "James Solomon Wins Jersey City Mayoral Runoff Election, Beating Jim McGreevey",
    "link": "https://www.nytimes.com/2025/12/02/nyregion/james-solomon-jim-mcgreevey-jersey-city.html",
    "summary": "Mr. Solomon was elected mayor over Mr. McGreevey, who was hoping for a comeback after resigning in 2004 as New Jersey’s governor amid a sex scandal."
  },
  {
    "title": "Liberal Group to Air Ads Attacking Democrats for Confirming Trump Judges",
    "link": "https://www.nytimes.com/2025/12/03/us/politics/demand-justice-attacks-senate-democrats.html",
    "summary": "The three being targeted are Senators John Fetterman, Maggie Hassan and Angus King, an independent who caucuses with Democrats. None are up for re-election next year."
  },
  {
    "title": "Best Movies of 2025",
    "link": "https://www.nytimes.com/2025/12/02/movies/best-movies-2025.html",
    "summary": "Our film critics rank their 10 favorites of the year."
  },
  {
    "title": "The Oscar Best Picture Race Has 5 Sure Bets. What About the Rest?",
    "link": "https://www.nytimes.com/2025/12/03/movies/best-picture-oscar-sinners-one-battle-after-another.html",
    "summary": "“One Battle After Another,” “Sinners,” “Hamnet,” “Marty Supreme” and “Sentimental Value” are almost certain to be nominated. After that, it’s anyone’s guess."
  },
  {
    "title": "Why Harvard Has Not Reached a Deal with Trump",
    "link": "https://www.nytimes.com/2025/12/03/us/politics/trump-harvard.html",
    "summary": "President Trump promised a deal last summer. Other universities have agreed to pay millions to settle with the federal government since then, but Harvard, which was asked to pay much more, has not."
  },
  {
    "title": "Pardon Undoes a Climactic Win in Drug Prosecutions Led by a Trump Ally",
    "link": "https://www.nytimes.com/2025/12/03/nyregion/bove-trump-honduras-pardon.html",
    "summary": "Emil Bove III’s work as a prosecutor, before he was a Trump lawyer and official, helped lead to the conviction of the Honduran ex-leader whom President Trump freed this week."
  },
  {
    "title": "Trump Appears to Fight Sleep During Cabinet Meeting",
    "link": "https://www.nytimes.com/2025/12/02/us/politics/trump-sleep-cabinet-meeting.html",
    "summary": "President Trump began the meeting by criticizing media coverage about him showing signs of fatigue. Last month, he appeared to doze off during a meeting in the Oval Office."
  },
  {
    "title": "South Korea Says the U.S. Agreed to Help It Secure Fuel for Reactors",
    "link": "https://www.nytimes.com/2025/12/03/world/asia/south-korea-nuclear-reactor-fuel.html",
    "summary": "President Lee Jae Myung reaffirmed wanting to build nuclear-powered submarines at home, despite President Trump’s suggestion that they be built in the United States."
  },
  {
    "title": "Police in a Louisiana City Welcome a Federal Crackdown. Immigrants Are in Hiding.",
    "link": "https://www.nytimes.com/2025/12/03/us/kenner-louisiana-border-patrol-immigration.html",
    "summary": "Kenner, a suburb of New Orleans, has been transformed by an infusion of newcomers. Immigrants there have been on edge all year, particularly in recent weeks."
  },
  {
    "title": "Immigration Officials Target Afghans for Deportation in Wake of D.C. Shooting",
    "link": "https://www.nytimes.com/2025/12/02/us/politics/afghans-deportation-shooting.html",
    "summary": "The stepped-up enforcement comes as the Trump administration has also moved to reassess the vetting of Afghans who came to the country under the Biden administration."
  },
  {
    "title": "Trump Calls Somalis ‘Garbage’ He Doesn’t Want in the Country",
    "link": "https://www.nytimes.com/2025/12/02/us/politics/trump-somalia.html",
    "summary": "President Trump has a history of insulting people from African countries, but the outburst was shocking in its unapologetic bigotry. Vice President JD Vance banged the table in encouragement."
  },
  {
    "title": "U.S. Pauses Immigration Applications From Nations on Travel Ban List",
    "link": "https://www.nytimes.com/2025/12/02/us/politics/trump-travel-ban-citizenship-green-cards-dc-shooting.html",
    "summary": "The pause, which will halt green card and U.S. citizenship processing for broad swaths of people, deepens a remarkable crackdown on legal immigration pathways in recent days."
  },
  {
    "title": "Nature Retracts Study Predicting Catastrophic Climate Toll",
    "link": "https://www.nytimes.com/2025/12/03/business/economy/study-climate-damage-retracted.html",
    "summary": "While growing evidence shows that carbon emissions are harming the economy, the journal Nature found that an outlier paper had deep flaws."
  },
  {
    "title": "Canada Turns to the World’s Polar Bear Capital to Defend its Arctic",
    "link": "https://www.nytimes.com/2025/12/03/world/canada-arctic-churchill-polar-bears.html",
    "summary": "The tiny town of Churchill has two of Canada’s largest pieces of Arctic infrastructure, but years of neglect have left them in poor shape amid growing superpower rivalry in the region."
  },
  {
    "title": "Visiting Turkey and Lebanon, Pope Leo Echoed Francis’s Message, Not His Style",
    "link": "https://www.nytimes.com/2025/12/03/world/europe/pope-leo-first-trip-francis-turkey-lebanon.html",
    "summary": "Traveling through the Mideast, Leo XIV channeled many of his predecessor’s messages. Leo’s deliberate manner differed from Francis."
  },
  {
    "title": "The Hong Kong Fire: A Crisis in the National Security Era",
    "link": "https://www.nytimes.com/2025/12/03/world/asia/hong-kong-fire-national-security-arrests.html",
    "summary": "The authorities quickly arrested critics demanding accountability, signaling an expansive use of the security law to silence dissent over nonpolitical tragedies."
  },
  {
    "title": "Why Does A.I. Write Like … That?",
    "link": "https://www.nytimes.com/2025/12/03/magazine/chatbot-writing-style.html",
    "summary": "If only they were robotic! Instead, chatbots have developed a distinctive — and grating — voice."
  },
  {
    "title": "How NYC Is Trying to Stop Subway Fare Evasion: Spikes, Fins, Guards",
    "link": "https://www.nytimes.com/2025/12/03/nyregion/nyc-subway-fare-evasion-mta.html",
    "summary": "Subway and bus fare evasion cost New York’s transit system nearly $1 billion last year. Will an arsenal of new tricks turn the tide?"
  },
  {
    "title": "Centrists Were Supposed to Save Europe. Instead, They’re Condemning It to Horrors.",
    "link": "https://www.nytimes.com/2025/12/03/opinion/europe-britain-france-germany-centrist.html",
    "summary": "Centrist governments are failing badly in Europe’s leading economies, setting the stage for a far-right sweep."
  },
  {
    "title": "Lily Allen’s West End Girl Midlife Crisis Is Inspiring",
    "link": "https://www.nytimes.com/2025/12/03/opinion/lily-allen-david-harbour-west-end-girl.html",
    "summary": "A singer’s almost totally relatable look at the woes of aging."
  },
  {
    "title": "Inside Venezuela",
    "link": "https://www.nytimes.com/2025/12/03/briefing/inside-venezuela.html",
    "summary": "We explain how President Nicolás Maduro is responding to threats from the Trump administration."
  },
  {
    "title": "Late Night Reviews Trump’s ‘Social Media Blitzkrieg’",
    "link": "https://www.nytimes.com/2025/12/03/arts/television/late-night-trump-truth-social.html",
    "summary": "The president posted 160 times on Truth Social in one night, according to news reports. One host says his “thumbs were as swollen as his ankles.”"
  },
  {
    "title": "Storm Floodwaters in Indonesia Turned Logs Into Floating Projectiles",
    "link": "https://www.nytimes.com/2025/12/03/world/asia/indonesia-sumatra-floods-timber-logs.html",
    "summary": "Many logs became forces of destruction in Indonesia last week, in a sign that deforestation compounded the devastation wrought by a cyclone."
  },
  {
    "title": "A Question Circling Sydney’s Beaches: Do We Still Need Shark Nets?",
    "link": "https://www.nytimes.com/2025/12/03/world/australia/sydney-shark-nets-australia.html",
    "summary": "Critics say the nets harm marine life and aren’t the best way to keep swimmers safe. Recent shark attacks have complicated a plan to remove some of them."
  },
  {
    "title": "Supreme Court Considers Whether Street Preacher Can Sue to Be Heard",
    "link": "https://www.nytimes.com/2025/12/03/us/politics/supreme-court-street-preacher.html",
    "summary": "Arrested after violating an ordinance on demonstrations outside an amphitheater in Brandon, Miss., Gabriel Olivier wants to block future enforcement of the law."
  }
]