[
  {
    "title": "Florida Says It Plans to End All Vaccine Mandates",
    "link": "https://www.nytimes.com/2025/09/03/us/florida-says-it-plans-to-end-all-vaccine-mandates.html",
    "summary": "The state would be the first to scrap requirements that children be vaccinated to attend school, among other rules."
  },
  {
    "title": "Snubbing RFK Jr., States Announce Plans to Coordinate on Vaccines",
    "link": "https://www.nytimes.com/2025/09/03/us/rfk-jr-vaccines-western-health-alliance.html",
    "summary": "Governors in California, Oregon and Washington said their states would work together on vaccine guidance in a time of turmoil at the Centers for Disease Control and Prevention."
  },
  {
    "title": "Trump Advisers Have Discussed a Job for Adams if He Quits Mayor’s Race",
    "link": "https://www.nytimes.com/2025/09/03/nyregion/trump-adams-sliwa-quit-nyc-mayor.html",
    "summary": "The conversations have also involved Curtis Sliwa with the goal of giving Andrew Cuomo a better chance of defeating Zohran Mamdani in November."
  },
  {
    "title": "As Zohran Mamdani’s Stature Grows, He Tries to Shed Some Past Stances",
    "link": "https://www.nytimes.com/2025/09/03/nyregion/zohran-mamdani-policy-shifts.html",
    "summary": "Zohran Mamdani, the Democratic nominee for mayor of New York City, once called for defunding the police and decriminalizing prostitution. He says he has changed."
  },
  {
    "title": "Trump Team Urges G.O.P. to Rebrand Signature Policy Law",
    "link": "https://www.nytimes.com/2025/09/03/us/politics/trump-gop-big-beautiful-bill.html",
    "summary": "Top campaign officials told House Republicans they should rebrand the measure the president dubbed the “One Big Beautiful Bill,” in a nod to its unpopularity with voters."
  },
  {
    "title": "Putin Takes His ‘Limo Diplomacy’ to China",
    "link": "https://www.nytimes.com/2025/09/03/world/europe/putin-limo-china-xi-relations-modi-india-trump.html",
    "summary": "Rides in his hulking bulletproof Aurus with the Indian and North Korean leaders offered the Russian leader an ideal setting for deepening ties."
  },
  {
    "title": "Xi Parades Military Strength as Trump Accuses Him of Conspiring With Putin and Kim",
    "link": "https://www.nytimes.com/2025/09/02/world/asia/xi-putin-kim-parade.html",
    "summary": "The parade, attended by the leaders of Russia and North Korea, had a defiant message. President Trump fired back, accusing Xi Jinping of ignoring America’s role in World War II."
  },
  {
    "title": "White House Orders Agencies to Escalate Fight Against Offshore Wind",
    "link": "https://www.nytimes.com/2025/09/03/climate/trump-administration-offshore-wind.html",
    "summary": "The effort involves several agencies that typically have little to do with wind power, including the Health and Human Services Department."
  },
  {
    "title": "The Communist Warrior Stranded for Decades in an ‘American Colony’",
    "link": "https://www.nytimes.com/2025/09/03/world/asia/communist-stranded-south-korea.html",
    "summary": "Ahn Hak-sop was captured during the Korean War by the South and imprisoned for more than 40 years. Now 95, he wants to return to the North to die."
  },
  {
    "title": "Hegseth Says Boat Strike Is Start of Campaign Against Venezuelan Cartels",
    "link": "https://www.nytimes.com/2025/09/03/us/politics/hegseth-venezuela-drug-strike.html",
    "summary": "The defense secretary and President Trump said a small boat was carrying drugs but offered little evidence and few details."
  },
  {
    "title": "Venezuela, Drug Boats and Trump’s Latest Claim: What to Know",
    "link": "https://www.nytimes.com/2025/09/03/world/americas/venezuela-drug-boat-trump-us.html",
    "summary": "The Trump administration says Venezuela is sending vast amounts of cocaine to the United States. Venezuela’s role in the drug trade is overstated, experts say."
  },
  {
    "title": "Claudia Sheinbaum Walks a Political Tightrope as Rubio Visits Mexico",
    "link": "https://www.nytimes.com/2025/09/03/world/americas/mexico-rubio-sheinbaum.html",
    "summary": "U.S. pressure to crack down on corrupt politicians has squeezed President Claudia Sheinbaum of Mexico ahead of her meeting with Secretary of State Marco Rubio."
  },
  {
    "title": "The Met Opera Turns to Saudi Arabia to Help Solve Its Financial Woes",
    "link": "https://www.nytimes.com/2025/09/03/arts/music/met-opera-saudi-arabia-finances.html",
    "summary": "The Met, which has withdrawn $120 million from its endowment since the pandemic, reached a lucrative deal to perform in Saudi Arabia for three weeks each winter."
  },
  {
    "title": "Google Must Share Search Data With Rivals, Judge Rules in Antitrust Case",
    "link": "https://www.nytimes.com/2025/09/02/technology/google-search-antitrust-decision.html",
    "summary": "Judge Amit P. Mehta said the company must hand over some of its search data to rivals, but did not force other big changes the U.S. wanted."
  },
  {
    "title": "Did Google Just Get Spared? Investors Think So.",
    "link": "https://www.nytimes.com/2025/09/03/business/dealbook/google-search-antitrust-breakup.html",
    "summary": "The nuclear option for addressing the tech giant’s search dominance — a break-up — is off the table. That’s lifting Big Tech stocks."
  },
  {
    "title": "Dan Kleban Joins Maine Democratic Primary, Seeking to Unseat Senator Susan Collins",
    "link": "https://www.nytimes.com/2025/09/03/us/politics/democrats-maine-senate-race.html",
    "summary": "Dan Kleban enters a crowded Democratic primary as party leaders wait for Maine’s Democratic governor, Janet Mills, who is “seriously considering” a run for Senate."
  },
  {
    "title": "John E. Sununu Is Exploring a Senate Run in New Hampshire",
    "link": "https://www.nytimes.com/2025/09/03/us/politics/john-sununu-senate-new-hampshire.html",
    "summary": "The former senator has been out of office for more than 15 years, but his last name is synonymous with Republican politics in a state where party leaders see a chance to flip a seat."
  },
  {
    "title": "This Is the Moment We Find Out if Trump Is for Real",
    "link": "https://www.nytimes.com/2025/09/03/opinion/trump-congress-term-president.html",
    "summary": "What comes next?"
  },
  {
    "title": "How to Rethink A.I.",
    "link": "https://www.nytimes.com/2025/09/03/opinion/ai-gpt5-rethinking.html",
    "summary": "Building bigger A.I. isn’t leading to better A.I."
  },
  {
    "title": "A Protest in China Doubles as Performance Art",
    "link": "https://www.nytimes.com/2025/09/03/briefing/a-protest-in-china-doubles-as-performance-art.html",
    "summary": "We explore an act of defiance in China. But first, a look at President Trump’s health."
  },
  {
    "title": "N.Y. Attorney General Sues Far-Right Group VDARE for Misusing Funds",
    "link": "https://www.nytimes.com/2025/09/03/us/politics/letitia-james-nonprofit-castle.html",
    "summary": "The suit says the nonprofit’s leaders — who helped bring anti-immigrant ideas into the G.O.P. mainstream — used donor money to buy a castle-like home."
  },
  {
    "title": "What We Saw at a Job Fair for ICE",
    "link": "https://www.nytimes.com/video/us/politics/100000010354368/what-we-saw-at-a-job-fair-for-ice.html",
    "summary": "As ICE ramps up for more deportations under President Trump, Nicholas Nehamas, a Washington correspondent for The New York Times, talks with applicants at an ICE recruitment fair in Texas."
  },
  {
    "title": "Far-right Israeli Minister Calls for West Bank Annexation",
    "link": "https://www.nytimes.com/2025/09/03/world/middleeast/israel-west-bank-annexations.html",
    "summary": "Bezalel Smotrich said Israel should take over most of the territory, partly in response to growing international moves to recognize a Palestinian state."
  },
  {
    "title": "Federal Courts Slow to Fix Vulnerable System After Repeated Hacking",
    "link": "https://www.nytimes.com/2025/09/03/us/politics/federal-courts-computer-hacks.html",
    "summary": "After a 2020 breach thought to be Russia’s work, the courts told Congress that they would harden a system storing sealed documents. Five years later, the system was hacked again."
  }
]