[
  {
    "title": "The A.I. Spending Frenzy Is Propping Up the Real Economy, Too",
    "link": "https://www.nytimes.com/2025/08/27/business/economy/ai-investment-economic-growth.html",
    "summary": "The trillions of dollars that tech companies are pouring into new data centers are starting to show up in economic growth. For now, at least."
  },
  {
    "title": "Trump Raises Tariffs on India to 50% Over Russian Oil",
    "link": "https://www.nytimes.com/2025/08/27/business/india-tariffs-trump-russia-oil.html",
    "summary": "As punishment for buying Russian oil, President Trump is doubling the tax on goods imported from India, jeopardizing a relationship decades in the making."
  },
  {
    "title": "How A.I. Is Propping Up the Economy, and a Surge of ‘Swatting’ on Campus",
    "link": "https://www.nytimes.com/2025/08/27/podcasts/the-headlines/ai-economy-swatting-college-campus.html",
    "summary": "Plus, why men aren’t going to the doctor."
  },
  {
    "title": "Trump Again Escalates Power Grabs in Bid to Fire Fed Member",
    "link": "https://www.nytimes.com/2025/08/26/us/politics/trump-power-federal-reserve.html",
    "summary": "President Trump claimed he has cause to remove a member of the independent board who has not obeyed his demands to vote for lower interest rates."
  },
  {
    "title": "Trump Plays Reality Television Host at Cabinet Meeting That Lasts Hours",
    "link": "https://www.nytimes.com/2025/08/26/us/politics/trump-cabinet-meeting.html",
    "summary": "As hours ticked by, President Trump played reality television host — “This has never been done before!” — as his cabinet members offered praise. It was a glimpse of how he runs his presidency."
  },
  {
    "title": "FEMA Suspends Staff Who Signed a Letter Criticizing Trump",
    "link": "https://www.nytimes.com/2025/08/26/climate/fema-suspends-staff-who-criticized-trump-cuts.html",
    "summary": "The letter, sent to Congress on Monday, said cuts made by the Trump administration had erased improvements made to disaster response since Hurricane Katrina."
  },
  {
    "title": "Federal Money Is a ‘Lifeline’ for This Republican School District",
    "link": "https://www.nytimes.com/2025/08/27/us/federal-funding-education-department-republican-school-district.html",
    "summary": "President Trump wants to cut federal spending for education. The money often goes toward disadvantaged students in Republican states."
  },
  {
    "title": "Purging ‘Equity’ Programs, G.O.P. Defunded Its Own Roads",
    "link": "https://www.nytimes.com/2025/08/26/us/politics/republicans-transportation-grants.html",
    "summary": "When Republicans repealed a Biden-era “access and equity” grant program for transportation, they canceled funding for projects in some of their own districts."
  },
  {
    "title": "Targeted by the Emirates, an Arab Dissident Vanished Across Borders",
    "link": "https://www.nytimes.com/2025/08/27/world/middleeast/qaradawi-dissident-uae-extradition.html",
    "summary": "After criticizing the United Arab Emirates on social media, an Egyptian activist was extradited to the Gulf country, where he has been detained without trial for months."
  },
  {
    "title": "Van Gogh Museum in Fight With Dutch State That Threatens Its Future",
    "link": "https://www.nytimes.com/2025/08/27/arts/design/van-gogh-museum-renovation.html",
    "summary": "Its director says that the Amsterdam museum could close unless the culture ministry increases funding to pay for a refurbishment."
  },
  {
    "title": "With Fuzzy Racket Bag, Venus Williams Highlights ERL and Other American Labels",
    "link": "https://www.nytimes.com/2025/08/27/style/venus-williams-fuzzy-bag-erl.html",
    "summary": "In her return at the U.S. Open, Ms. Williams decided to highlight labels based in the United States. Her shearling racket bag was hard to miss."
  },
  {
    "title": "In a Lab, a Hunt for a Killer: The Germ Causing a Legionnaires’ Outbreak",
    "link": "https://www.nytimes.com/2025/08/27/nyregion/legionnaires-disease-new-york-lab.html",
    "summary": "Six people in New York City have died this summer from Legionnaires’ disease, and more than 100 others have been sickened."
  },
  {
    "title": "They’re (Mostly) Good Dogs and Even Better Film Symbols",
    "link": "https://www.nytimes.com/2025/08/27/movies/dogs-film-symbolism.html",
    "summary": "Directors use our canine friends to convey connection even as we’ve grown more disconnected from the animal world."
  },
  {
    "title": "Taylor Swift’s Engagement Ring Marks a Return to Vintage Elegance",
    "link": "https://www.nytimes.com/2025/08/26/style/taylor-swift-engagement-ring.html",
    "summary": "The pop star’s antique-inspired sparkler channels the “heirloom look,” reflecting a return to antique stones."
  },
  {
    "title": "This Couple Predicted Taylor Swift and Travis Kelce’s Relationship 5 Years Ago",
    "link": "https://www.nytimes.com/2025/08/26/arts/taylor-swift-travis-kelce-engagement-halloween-costume-prediction.html",
    "summary": "They needed a Halloween costume. Five years later, some have suggested that they manifested the “Tayvis” marriage."
  },
  {
    "title": "The Rise of the Democratic National Security Mom",
    "link": "https://www.nytimes.com/2025/08/27/opinion/spanberger-sherrill-women-governor-virginia-new-jersey.html",
    "summary": "The party is counting on a new type of leader to counteract Trump."
  },
  {
    "title": "This Is Why New Orleans Never Recovered From Katrina",
    "link": "https://www.nytimes.com/2025/08/27/opinion/new-orleans-katrina-funds.html",
    "summary": "New Orleans after Katrina is a cautionary tale for every place in America that will one day face its own disaster."
  },
  {
    "title": "The New State Interventions",
    "link": "https://www.nytimes.com/2025/08/27/briefing/intel-tariffs-the-fed-state-intervention.html",
    "summary": "Protectionism, industrial policy and government ownership — all once conservative boogeymen — have become official doctrine."
  },
  {
    "title": "Denmark Summons U.S. Envoy Over Espionage Allegations",
    "link": "https://www.nytimes.com/2025/08/27/world/europe/trump-denmark-greenland-us-embassy.html",
    "summary": "It’s the latest twist in the Greenland drama. President Trump wants the island, but Denmark refuses to hand it over."
  },
  {
    "title": "Floods and Landslides Kill Dozens on Pilgrimage Route in Kashmir",
    "link": "https://www.nytimes.com/2025/08/27/world/asia/kashmir-deadly-flooding.html",
    "summary": "Rescue workers pulled bodies from the debris after rain sent boulders and mud crashing down."
  },
  {
    "title": "UK Summers, and Houses, Are Getting Hotter",
    "link": "https://www.nytimes.com/2025/08/27/world/europe/uk-summer-heat-houses.html",
    "summary": "Built for a cooler climate, many homes need to be retrofitted for warming temperatures. It won’t be as simple as installing air-conditioning."
  },
  {
    "title": "Cracker Barrel Drops New Logo Design After Conservative Backlash",
    "link": "https://www.nytimes.com/2025/08/26/business/cracker-barrel-logo-rebrand.html",
    "summary": "The chain, known for its farmhouse aesthetic, ignited a social media firestorm when it announced its “fresh” rebrand last week."
  }
]