[
  {
    "title": "Inside the Trump Administration’s Push to Prosecute James Comey",
    "link": "https://www.nytimes.com/2025/09/27/us/politics/trump-comey-justice-department.html",
    "summary": "President Trump’s campaign of retribution began to intensify in mid-July and hit a fever pitch over the last week, culminating in the indictment of one of his foremost enemies."
  },
  {
    "title": "Trump’s Repeated Attacks May Undercut Case Against Comey",
    "link": "https://www.nytimes.com/2025/09/27/us/politics/trump-comey-vindictive-prosecution.html",
    "summary": "The president’s voluble vitriol could provide defense lawyers with an avenue to protect the very people he most wants to punish."
  },
  {
    "title": "Examining James Comey’s 2020 Testimony at the Heart of His Indictment",
    "link": "https://www.nytimes.com/2025/09/26/us/politics/james-comey-testimony-trump.html",
    "summary": "The charges against the former F.B.I. director center on an appearance he made before a Senate committee in September 2020. Here’s a closer look."
  },
  {
    "title": "Trump Says He Has Ordered Troops to Portland, Oregon, to Protect ICE Facilities",
    "link": "https://www.nytimes.com/2025/09/27/us/politics/trump-portland-troops.html",
    "summary": "The president characterized Immigration and Customs Enforcement facilities as being under siege from domestic terrorists."
  },
  {
    "title": "FBI Fires Agents Seen Kneeling During 2020 Racial Justice Protests",
    "link": "https://www.nytimes.com/2025/09/27/us/politics/kash-patel-fbi-firing.html",
    "summary": "Agents group says the latest dismissals are part of a “dangerous pattern” of weakening the nation’s top law enforcement agency."
  },
  {
    "title": "Trump Displays Little Interest in Fostering Unity Amid Political Violence",
    "link": "https://www.nytimes.com/2025/09/27/us/politics/political-violence-kirk-trump.html",
    "summary": "After an assassination attempt, Gov. George Wallace, the segregationist, got a surprise visitor: Shirley Chisholm, the first Black woman elected to Congress. Could this happen today?"
  },
  {
    "title": "Des Moines Schools Superintendent Arrested By ICE Is Placed on Leave",
    "link": "https://www.nytimes.com/2025/09/27/us/des-moines-schools-superintendent-ice-leave.html",
    "summary": "School Board members in Iowa’s capital made the decision one day after immigration officials accused the superintendent, Ian Roberts, of being in the country illegally."
  },
  {
    "title": "Restoring the Sound, if Not the Fury, of William Faulkner’s Piano",
    "link": "https://www.nytimes.com/2025/09/27/arts/music/william-faulkner-museum-piano.html",
    "summary": "Hoping to draw more visitors to Rowan Oak, Faulkner’s home in Oxford, Miss., a group helped refurbish its piano."
  },
  {
    "title": "Netanyahu’s Defiant U.N. Speech Aimed at Home as Well as the World",
    "link": "https://www.nytimes.com/2025/09/27/world/middleeast/israel-netanyahu-united-nations.html",
    "summary": "The Israeli prime minister faced walkouts and protests at the United Nations, but signaled that resisting Palestinian statehood could become the core of his appeal to Israeli voters."
  },
  {
    "title": "U.S. Ambassador to Israel Is Expected to Make Rare Visit to Egypt",
    "link": "https://www.nytimes.com/2025/09/27/world/middleeast/ambassador-huckabee-istael-egypt-travel.html",
    "summary": "Ambassador Mike Huckabee is to travel to Cairo for talks that officials said would focus on the Gaza war and tensions between Israel and Egypt."
  },
  {
    "title": "Iranians Brace for Economic Impact of New U.N. Sanctions",
    "link": "https://www.nytimes.com/2025/09/27/world/middleeast/sanctions-iran-economy-snapback.html",
    "summary": "Already suffering a 40 percent inflation rate and critical shortages of power and water, many in Iran expect conditions to get worse."
  },
  {
    "title": "New Retail Leaders Confront Trump’s Tariffs, Policy Shifts and Weak Spending",
    "link": "https://www.nytimes.com/2025/09/27/business/trump-tariffs-policies-economy-retail.html",
    "summary": "New retail C.E.O.s are facing unexpected challenges, like tariffs and worried shoppers, as they try to address existing ones."
  },
  {
    "title": "Oura Heath’s C.E.O. Knows the Secret to Better Sleep",
    "link": "https://www.nytimes.com/2025/09/27/business/oura-ring-tom-hale.html",
    "summary": "Oura Health makes a pricey smart ring that busy executives, celebrities and others use to track health measures like their sleep patterns. It expects $1 billion in sales this year."
  },
  {
    "title": "His Parents Disappeared. In a TV Studio, He Confessed to Killing Them.",
    "link": "https://www.nytimes.com/2025/09/27/nyregion/albany-parent-murders-interview.html",
    "summary": "After investigators came looking, Lorenz Kraus told a reporter he had strangled Franz and Theresia Kraus eight years ago. Two bodies were buried in their backyard."
  },
  {
    "title": "Frida Kahlo’s Prequel: A New Museum Shows Her Family Roots",
    "link": "https://www.nytimes.com/2025/09/27/arts/design/frida-kahlo-museum-mexico-city.html",
    "summary": "In a former residence in Mexico City, passed down through the Kahlo family, it presents an intimate side of the Mexican painter’s life."
  },
  {
    "title": "C.T.E. Looms Over Friday Night Lights",
    "link": "https://www.nytimes.com/2025/09/27/us/cte-high-school-football.html",
    "summary": "Parents revealed conflicting emotions after the finding that a gunman who killed four people in July had the brain disease that has been linked with football and other contact sports."
  },
  {
    "title": "Why Comey Should Not Have Been Indicted, According to Trump",
    "link": "https://www.nytimes.com/2025/09/27/opinion/james-comey-indictment.html",
    "summary": "Why James Comey should not have been indicted, according to Trump."
  },
  {
    "title": "We’re All Going to Die — Soonish!",
    "link": "https://www.nytimes.com/2025/09/27/opinion/grok-ai-companions-x.html",
    "summary": "Even with big blue eyes or amazing pecs, A.I.’s allure can be deadly."
  },
  {
    "title": "Giuliani and Dominion Voting Systems Settle $1.3 Billion Defamation Suit",
    "link": "https://www.nytimes.com/2025/09/27/us/politics/rudy-giuliani-dominion-case-settlement.html",
    "summary": "The election technology company Dominion Voting Systems had accused Rudolph W. Giuliani of waging “a viral disinformation campaign” over the 2020 election."
  },
  {
    "title": "Stampede at Actor’s Political Rally Kills at Least 36 in India",
    "link": "https://www.nytimes.com/2025/09/27/world/asia/stampede-vijay-rally-india.html",
    "summary": "The stampede took place at an event for Joseph Vijay Chandrasekhar, the popular actor known professionally as Vijay. A health official said the toll was likely to rise."
  },
  {
    "title": "Neil Kraft, Visionary Adman Who Sold ‘a Mood and a Lifestyle,’ Dies at 67",
    "link": "https://www.nytimes.com/2025/09/27/business/media/neil-kraft-dead.html",
    "summary": "His ads for Calvin Klein and others captured a fizzy moment in the 1980s and ’90s, featuring celebrities like the young rapper Marky Mark wearing nothing but underwear and a grin."
  }
]