[
  {
    "title": "Man Rushes Ilhan Omar at Minneapolis Town Hall and Sprays Her",
    "link": "https://www.nytimes.com/2026/01/27/us/ilhan-omar-town-hall-minnesota.html",
    "summary": "A man who had been sitting in the front row rushed at the Democratic representative and sprayed her with a strong-smelling liquid. He was removed by security and later booked into jail."
  },
  {
    "title": "Stephen Miller Suggests Federal Agents May Have Diverted From ‘Protocol’ Before Minneapolis Shooting",
    "link": "https://www.nytimes.com/2026/01/28/us/stephen-miller-alex-pretti-shooting.html",
    "summary": "The comments by Mr. Miller, the influential White House deputy chief of staff, came after days of blaming Alex Pretti, who was fatally shot by federal agents."
  },
  {
    "title": "As Minneapolis Rages, Legislators Move to Restrict ICE in Their States",
    "link": "https://www.nytimes.com/2026/01/28/us/politics/minneapolis-ice-states.html",
    "summary": "Efforts to curtail federal law enforcement tactics began last year, but with the deaths of Alex Pretti and Renee Good, Democratic lawmakers are pushing harder."
  },
  {
    "title": "Trump Threatens Iran With ‘Massive Armada’ and Presses a Set of Demands",
    "link": "https://www.nytimes.com/2026/01/28/us/politics/trump-iran-armada.html",
    "summary": "U.S. and European officials say they have put three demands in front of the Iranians, including a permanent end to all enrichment of uranium."
  },
  {
    "title": "Iran Killed Thousands of Protesters. Here Are Five of Their Stories.",
    "link": "https://www.nytimes.com/2026/01/28/world/middleeast/iran-protester-deaths.html",
    "summary": "“He went out for freedom,” said the cousin of one of those who was killed when Iranian authorities mounted a deadly crackdown on protests across the country."
  },
  {
    "title": "Iraq’s Nominee for Prime Minister Rejects Trump Threats",
    "link": "https://www.nytimes.com/2026/01/28/world/middleeast/trump-iraq-prime-minister-al-maliki.html",
    "summary": "Nuri Kamal al-Maliki, a former prime minister, was nominated to lead Iraq once again, but President Trump said he would cut U.S. support if that went ahead."
  },
  {
    "title": "Fed Meeting Comes at Pivotal Moment for Central Bank’s Independence",
    "link": "https://www.nytimes.com/2026/01/28/business/economy/fed-trump-powell-interest-rates.html",
    "summary": "The Trump administration has unleashed a barrage of attacks on the Federal Reserve, including a criminal investigation into its chair, Jerome H. Powell."
  },
  {
    "title": "What Americans Really Mean by ‘Affordability’",
    "link": "https://www.nytimes.com/2026/01/28/upshot/poll-affordability-housing-prices.html",
    "summary": "A few key necessities are driving dissatisfaction, particularly among the young, our poll finds."
  },
  {
    "title": "In Kherson, Ukraine, Every Step Outside Risks Death by Drone",
    "link": "https://www.nytimes.com/2026/01/28/world/europe/kherson-ukraine-drones-russia.html",
    "summary": "Russian attacks on civilians in Kherson, in southern Ukraine, have forced important aspects of life to go underground, offering a vision of a postapocalyptic future."
  },
  {
    "title": "After Russian Strike Kills Five, Train Sheds Burned Cars and Carries On",
    "link": "https://www.nytimes.com/2026/01/28/world/europe/ukraine-train-attack.html",
    "summary": "One Ukrainian passenger, who escaped injury after stepping out of a carriage for a cigarette, recalled carrying a bloodied woman away from the burning train."
  },
  {
    "title": "Sundance Film Festival Says Goodbye to Park City, Utah",
    "link": "https://www.nytimes.com/2026/01/28/business/media/sundance-film-festival-park-city-boulder.html",
    "summary": "“It’s hard not to feel a disturbance in the force,” said Ethan Hawke, whose acting career took off after his early movies appeared at the Utah festival in the 1990s."
  },
  {
    "title": "Did a Luxury Nursing Home Hold a 91-Year-Old Woman Captive?",
    "link": "https://www.nytimes.com/2026/01/28/nyregion/diana-multare-nursing-home-standoff.html",
    "summary": "Her memory was failing, and the $28,000-a-month assisted living facility wouldn’t let her leave. Was it protecting her from an untrustworthy guardian?"
  },
  {
    "title": "Another Weekend Winter Storm? Forecast Details and Updates.",
    "link": "https://www.nytimes.com/2026/01/27/weather/next-winter-storm-forecast-snow-ice.html",
    "summary": "Meteorologists are watching another storm that could hit the East Coast."
  },
  {
    "title": "Loose Rules Let New York State Police Hand Out Lax Penalties for Serious Misconduct",
    "link": "https://www.nytimes.com/2026/01/28/us/new-york-state-police-discipline.html",
    "summary": "New York State troopers used the badge to settle personal scores and elicit favors. Still, they remained on the job, an investigation found."
  },
  {
    "title": "How We Tracked Down Thousands of Police Misconduct Files",
    "link": "https://www.nytimes.com/2026/01/28/us/how-we-tracked-down-thousands-of-police-misconduct-files.html",
    "summary": "Freedom of Information requests led to the discovery of varied offenses by officers around New York State."
  },
  {
    "title": "How the Online SAT May be Vulnerable to Cheating",
    "link": "https://www.nytimes.com/2026/01/28/us/politics/how-the-online-sat-may-be-vulnerable-to-cheating.html",
    "summary": "Sites in China are selling test questions, and online forums offer software that can bypass test protections, according to tutors and testing experts raising alarms."
  },
  {
    "title": "Radar Scans of Antarctica Offer Clues to What’s Happening on Jupiter’s Moon",
    "link": "https://www.nytimes.com/2026/01/27/climate/antarctica-thwaites-radar.html",
    "summary": "Scientists are using radar to study damaged ice both in Antarctica and, with the help of a NASA spacecraft, on Jupiter’s ocean moon of Europa."
  },
  {
    "title": "In Nigeria, a Catholic Bishop Tries to Tone Down the Uproar After U.S. Missile Strikes",
    "link": "https://www.nytimes.com/2026/01/28/world/africa/nigeria-catholic-bishop-muslims-trump.html",
    "summary": "Bishop Matthew Hassan Kukah, often called “the conscience of the nation,” has been trying to tone down the uproar after President Trump bombed a region in his diocese."
  },
  {
    "title": "Minneapolis May Be Trump’s Gettysburg",
    "link": "https://www.nytimes.com/2026/01/28/opinion/minneapolis-ice-trump-gettysburg.html",
    "summary": "The White House has failed to achieve either its strategic or its tactical goals in Minnesota."
  },
  {
    "title": "Why Is My Son Being Left to Die on the Streets?",
    "link": "https://www.nytimes.com/2026/01/28/opinion/family-mental-health-homeless-schizophrenia.html",
    "summary": "We thought America would keep him safe."
  },
  {
    "title": "Welcome to Spain",
    "link": "https://www.nytimes.com/2026/01/28/briefing/welcome-to-spain.html",
    "summary": "Today we look into a country that’s handling the issue of undocumented migrants in a starkly different way."
  },
  {
    "title": "With AlphaGenome, Researchers Are Using A.I. to Decode the Human Blueprint",
    "link": "https://www.nytimes.com/2026/01/28/science/alphagenome-ai-deepmind-genetics.html",
    "summary": "AlphaGenome is a leap forward in the ability to study the human blueprint. But the fine workings of our DNA are still largely a mystery."
  },
  {
    "title": "Amazon to Cut 16,000 Jobs in Latest Round of Layoffs",
    "link": "https://www.nytimes.com/2026/01/28/technology/amazon-corporate-layoffs.html",
    "summary": "The e-commerce giant has been cutting costs while pouring resources into building data centers to compete in the race to dominate artificial intelligence."
  },
  {
    "title": "Putin, Still Harboring Assad, Welcomes New Syrian Leader to Moscow Again",
    "link": "https://www.nytimes.com/2026/01/28/world/europe/russia-putin-syria-al-sharaa-meeting.html",
    "summary": "This is the second time that President Vladimir V. Putin has hosted President Ahmed al-Sharaa since the fall of the Russia-backed Syrian dictator Bashar al-Assad."
  }
]