[
  {
    "title": "Officials Pressed Schumer to Help Name Penn Station and Dulles Airport for Trump",
    "link": "https://www.nytimes.com/2026/02/06/us/politics/trump-schumer-penn-station-dulles-airport-renaming.html",
    "summary": "Administration officials told the top Senate Democrat the president would release frozen funding for the Gateway project if the transportation hubs were renamed for him."
  },
  {
    "title": "U.S. Judge Says Trump Cannot Halt Funding for Gateway Tunnel Project",
    "link": "https://www.nytimes.com/2026/02/06/nyregion/gateway-tunnel-project-funding-trump.html",
    "summary": "Nearly all of the work had stopped on Friday while negotiations continued in Washington and litigation played out in court."
  },
  {
    "title": "Hegseth Says Defense Department Will Cut Ties With Harvard",
    "link": "https://www.nytimes.com/2026/02/06/us/politics/hegseth-defense-harvard.html",
    "summary": "Mr. Hegseth’s order appeared to target his alma mater, Harvard’s Kennedy School for public policy."
  },
  {
    "title": "Trump Is Hosting Governors at the White House, but Only Republicans",
    "link": "https://www.nytimes.com/2026/02/06/us/politics/trump-republican-governors-white-house.html",
    "summary": "The president’s decision to exclude Democratic governors from an annual meeting later this month breaks a longstanding tradition."
  },
  {
    "title": "Trump Deletes Racist Video Portraying the Obamas as Apes",
    "link": "https://www.nytimes.com/2026/02/06/us/politics/trump-obamas-video-apes-truth-social.html",
    "summary": "The video clip that President Trump posted in a late-night flurry of social media activity caused an unusually strong and public outcry from members of his own party."
  },
  {
    "title": "Olympics Officials Signal Sanctions on Russia in Sports May End",
    "link": "https://www.nytimes.com/2026/02/07/world/europe/russia-olympics-sports-sanctions-ukraine.html",
    "summary": "In Milan this week, Olympics officials signaled a willingness to ease years of restrictions imposed on the country over its state-backed doping program and invasion of Ukraine."
  },
  {
    "title": "How Is Security Different at These Olympic Games?",
    "link": "https://www.nytimes.com/video/world/100000010687900/how-is-security-different-at-these-olympic-games.html",
    "summary": "Our sports correspondent Tariq Panja talks with Katrin Bennhold about the security at the Olympics in Italy, including the presence of Immigration and Customs Enforcement agents, who the U.S. says are there only in an advisory role."
  },
  {
    "title": "JD Vance Is Booed at Winter Olympics Opening Ceremony in Milan",
    "link": "https://www.nytimes.com/2026/02/06/world/europe/jd-vance-olympics-opening-ceremony.html",
    "summary": "Before the event, protesters marched in Milan in opposition to U.S. Immigration and Customs Enforcement, whose personnel are in Italy to advise local officials in securing the Winter Games."
  },
  {
    "title": "Authorities Investigate a New Message in Nancy Guthrie Kidnapping Case",
    "link": "https://www.nytimes.com/2026/02/06/us/savannah-nancy-guthrie-missing-updates.html",
    "summary": "The F.BI. and local law enforcement gave no details about the note, which came on the sixth day of the search for Ms. Guthrie, the mother of the “Today” host Savannah Guthrie."
  },
  {
    "title": "Nancy Guthrie’s Disappearance Rekindles Kidnapping Fears",
    "link": "https://www.nytimes.com/2026/02/06/us/famous-kidnapping-cases-abduction-numbers.html",
    "summary": "High-profile abductions, like those of Patty Hearst and J. Paul Getty III, have captured the nation’s attention, but experts say kidnappings by strangers are exceedingly rare."
  },
  {
    "title": "U.S. Seeks to Expedite Deportation of 5-Year-Old Liam Conejo Ramos",
    "link": "https://www.nytimes.com/2026/02/06/us/us-deportation-liam-conejo-ramos-minnesota.html",
    "summary": "Liam was detained last month near Minneapolis during an immigration enforcement operation in which his father was also taken into custody by federal agents."
  },
  {
    "title": "Cuban Deportees Who Were Transferred to Guantánamo Sent Back to U.S.",
    "link": "https://www.nytimes.com/2026/02/06/us/politics/cuban-deportees-guantanamo.html",
    "summary": "Dozens of men appear to be caught up in a political standoff between the Trump administration and Cuba."
  },
  {
    "title": "Bard College President Leon Botstein Was Close With Jeffrey Epstein",
    "link": "https://www.nytimes.com/2026/02/06/us/leon-botstein-bard-college-epstein.html",
    "summary": "Bard College’s president, Leon Botstein, said his school needed cash. But a rare watch and a Caribbean visit show how his relationship with Jeffrey Epstein sometimes veered into the personal."
  },
  {
    "title": "Paul Weiss Partners Turned on Brad Karp After Learning Extent of His Epstein Ties",
    "link": "https://www.nytimes.com/2026/02/06/business/brad-karp-paul-weiss-epstein.html",
    "summary": "Mr. Karp resigned as chairman of the elite law firm after senior partners met to decide his future."
  },
  {
    "title": "China Reverses Death Sentence for Canadian in a Small Win for Carney",
    "link": "https://www.nytimes.com/2026/02/06/world/asia/china-canada-death-sentence-overturned.html",
    "summary": "The ruling by China’s highest court followed a recent meeting between China and Canada’s top leaders that led to a thaw in the two countries’ relations."
  },
  {
    "title": "Trump Says Talks With Iran Were Good, but There’s More Work to Do",
    "link": "https://www.nytimes.com/2026/02/06/world/europe/us-iran-talks-oman.html",
    "summary": "President Trump said the negotiations would resume next week. Abbas Araghchi, the Iranian foreign minister, said the talks were off to a “good start.”"
  },
  {
    "title": "In Talks, Trump Won’t Allow Iran to Have Any Enriched Uranium",
    "link": "https://www.nytimes.com/2026/02/06/us/politics/trump-iran-nuclear.html",
    "summary": "Can the two sides get past Iran’s claim that it has a “right” to enrich uranium?"
  },
  {
    "title": "In a Close Election, Voters Send a Sharp Anti-Trump Message",
    "link": "https://www.nytimes.com/2026/02/06/nyregion/new-jersey-special-election-malinowski-mejia.html",
    "summary": "The Democratic primary to replace Gov. Mikie Sherrill of New Jersey in Congress is still too close to call. Much of the advertising focused on opposition to the president and his immigration policies."
  },
  {
    "title": "Why Are These Women Being Denied Visits With Loved Ones in NY Prisons?",
    "link": "https://www.nytimes.com/2026/02/06/nyregion/new-york-prison-body-scanners-women.html",
    "summary": "Women hoping to visit their loved ones at New York prisons are being turned away after scanners pick up what they say are menstrual products. Some have had their visitation rights suspended."
  },
  {
    "title": "N.Y.P.D. Sergeant Found Guilty in Death of Bronx Man He Threw Cooler At",
    "link": "https://www.nytimes.com/2026/02/06/nyregion/duran-nypd-bronx-manslaughter-cooler.html",
    "summary": "Erik Duran was convicted of second-degree manslaughter, making him the first New York City police officer to be found guilty of killing a civilian while on duty in a decade."
  },
  {
    "title": "Super Bowl Visitors Find San Francisco Better Than Its Apocalyptic Image",
    "link": "https://www.nytimes.com/2026/02/06/us/san-francisco-super-bowl.html",
    "summary": "Problems with homelessness and open-air drug use have been widely broadcast, but many visitors this week said they found the city surprisingly pleasant."
  },
  {
    "title": "The Finance Industry Is a Grift. Let’s Start Treating It That Way.",
    "link": "https://www.nytimes.com/2026/02/06/opinion/capitalism-industry-financialization.html",
    "summary": "Regulating the industry is useful. Shaming it is crucial."
  },
  {
    "title": "We Didn’t Ask for This Internet",
    "link": "https://www.nytimes.com/2026/02/06/opinion/ezra-klein-podcast-doctorow-wu.html",
    "summary": "Cory Doctorow and Tim Wu explain why the internet failed to live up to its early promise."
  },
  {
    "title": "Stocks Rebound After Volatile Week as Dow Hits Record High",
    "link": "https://www.nytimes.com/2026/02/06/business/stock-market-rebound-dow-50000.html",
    "summary": "The Dow Jones industrial average surpassed 50,000 points for the first time, as old line stocks come back into vogue."
  },
  {
    "title": "Saalumarada Thimmakka Dies; Planted and Nurtured Thousands of Trees",
    "link": "https://www.nytimes.com/2026/02/06/world/asia/saalumarada-thimmakka-dead.html",
    "summary": "Believed to be 113, she spent decades building an environmental legacy in India, inspired by her grief at being unable to conceive children."
  },
  {
    "title": "In the Grip of Gangs, Haiti Faces a Government Leadership Vacuum",
    "link": "https://www.nytimes.com/2026/02/06/world/americas/haiti-crisis-leadership-gangs.html",
    "summary": "The tenure of a presidential council that has been running Haiti expires on Saturday. It’s unclear what will come next."
  },
  {
    "title": "Body of Nathan Smith, Lil Jon’s Son, Found in Georgia Pond, Police Say",
    "link": "https://www.nytimes.com/2026/02/06/arts/music/lil-jon-son-dead.html",
    "summary": "Nathan Smith, whose stage name is DJ Young Slade, was reported missing on Tuesday after running out of his home in a community north of Atlanta."
  }
]