[
  {
    "title": "Trump Lauds M.B.S. During White House Visit and Dismisses Khashoggi’s Killing",
    "link": "https://www.nytimes.com/2025/11/18/us/politics/trump-saudi-crown-prince-visit.html",
    "summary": "President Trump rejected a U.S. intelligence report finding that Crown Prince Mohammed bin Salman had ordered the murder of a journalist."
  },
  {
    "title": "Once a Pariah, Saudi Prince Resets U.S. Relations on His Own Terms",
    "link": "https://www.nytimes.com/2025/11/18/us/politics/prince-mohammed-trump-us-saudi-arabia.html",
    "summary": "Seven years ago, Crown Prince Mohammed bin Salman couldn’t visit Washington. When he arrived at the White House on Tuesday, he got F-35s, the world’s fastest chips and the central role in the remaking of the Middle East."
  },
  {
    "title": "Here’s Who’s Attending Trump’s Dinner for the Saudi Crown Prince: Elon Musk, Cristiano Ronaldo and more.",
    "link": "https://www.nytimes.com/2025/11/18/us/politics/trump-saudi-dinner-guests.html",
    "summary": "The guests at President Trump’s dinner for Crown Prince Mohammed bin Salman of Saudi Arabia included prominent figures in sports and business."
  },
  {
    "title": "Congress Overwhelmingly Approves Releasing Epstein Files",
    "link": "https://www.nytimes.com/2025/11/18/us/politics/house-vote-epstein-files.html",
    "summary": "After a near-unanimous House vote, the Senate agreed to quickly clear the bill for President Trump’s signature."
  },
  {
    "title": "Behind the Vote to Release the Epstein Files",
    "link": "https://www.nytimes.com/video/us/politics/100000010528490/behind-the-house-vote-to-release-the-epstein-files.html",
    "summary": "The House approved a bill directing the Justice Department to release all files related to its investigation into Jeffrey Epstein, in a near-unanimous vote. Hours later, Senator Chuck Schumer won unanimous agreement for the Senate to pass the measure as soon as it arrived in the chamber."
  },
  {
    "title": "For Trump, Epstein Is the Story That Won’t Go Away",
    "link": "https://www.nytimes.com/2025/11/18/us/politics/trump-epstein-files.html",
    "summary": "President Trump is being held captive to a news cycle he can’t avoid or defeat when it comes to the convicted sex offender Jeffrey Epstein."
  },
  {
    "title": "Harvard Says It Is Investigating Ties Between Summers and Epstein",
    "link": "https://www.nytimes.com/2025/11/19/us/harvard-summers-epstein-investigation.html",
    "summary": "The university is reviewing newly released emails between convicted sex offender Jeffrey Epstein and former Harvard President Lawrence H. Summers, among other people at the institution."
  },
  {
    "title": "Trump Administration Announces Steps to Dismantle Education Department",
    "link": "https://www.nytimes.com/2025/11/18/us/politics/trump-education-department.html",
    "summary": "Responsibilities for K-12 and college programs, among others, will be moved to other federal agencies."
  },
  {
    "title": "Trump Said to Authorize C.I.A. Plans for Covert Action in Venezuela",
    "link": "https://www.nytimes.com/2025/11/18/us/politics/trump-covert-action-venezuela.html",
    "summary": "The president has signed off on possible operations inside Venezuela but has also reopened back-channel communications with the government of President Nicolás Maduro."
  },
  {
    "title": "Ecuador Votes ‘No’ to Hosting U.S. Military Base",
    "link": "https://www.nytimes.com/2025/11/18/world/americas/ecuador-us-military-base-vote-trump.html",
    "summary": "A vote on Sunday rejected the expansion of a foreign military presence. It came as the U.S. military’s campaign in waters near Latin America has been roiling the region."
  },
  {
    "title": "Europe’s Chip Dreams Confront Business Realities",
    "link": "https://www.nytimes.com/2025/11/19/technology/europe-tsmc-chips.html",
    "summary": "European chipmakers need TSMC’s help to grow their own semiconductor supply chain, but the chip giant’s Taiwanese suppliers find Europe a tough place to do business."
  },
  {
    "title": "In the A.I. Race, Chinese Talent Still Drives American Research",
    "link": "https://www.nytimes.com/2025/11/19/technology/ai-research-chinese-talent.html",
    "summary": "Although some Silicon Valley executives paint China as the enemy, Chinese brains continue to play a major role in U.S. research."
  },
  {
    "title": "A.I. Video Is Threatening Our Ability to Trust Documentaries",
    "link": "https://www.nytimes.com/2025/11/18/movies/documentary-filmmaking-ai-trust.html",
    "summary": "A combination of technological developments and market forces is undermining the trust between viewer and filmmaker. What’s at stake is history itself."
  },
  {
    "title": "Federal Court Blocks Texas’ Republican-Friendly Congressional Map",
    "link": "https://www.nytimes.com/2025/11/18/us/politics/texas-map-ruling-redistricting.html",
    "summary": "The move dealt a blow to efforts by Texas Republicans and President Trump to flip Democratic seats in the state. Texas quickly filed a notice of appeal to the Supreme Court."
  },
  {
    "title": "Trump Ramps Up Redistricting Pressure on Indiana Republicans",
    "link": "https://www.nytimes.com/2025/11/18/us/indiana-redistricting-trump-republicans.html",
    "summary": "After the State Senate said it would not take up a new map, President Trump said he would support primary challengers against Republicans who bucked him."
  },
  {
    "title": "How TikTok Helped Meta Land an Antitrust Victory",
    "link": "https://www.nytimes.com/2025/11/18/technology/meta-google-antitrust-tech.html",
    "summary": "Silicon Valley has increasingly pointed at rapid digital changes to blunt government efforts to rein in its power."
  },
  {
    "title": "Meta’s Victory Opens the Way for Silicon Valley to Go Deal Shopping",
    "link": "https://www.nytimes.com/2025/11/18/technology/meta-ruling-silicon-valley-start-ups.html",
    "summary": "To avoid regulatory scrutiny, big tech companies had steered clear of buying start-ups outright. Meta’s antitrust win may change that thinking."
  },
  {
    "title": "ICE Frees Blind Migrant Who Was Detained for Days in Isolation",
    "link": "https://www.nytimes.com/2025/11/18/nyregion/blind-immigrant-ice-detention-judge-orders-release.html",
    "summary": "Carlos Anibal Chalco Chango, 40, was released on Monday from an upstate New York jail where he had been held without his cane. It was a surprising move by an agency that rarely frees detainees."
  },
  {
    "title": "How to Make Sense of Law Enforcement in the Streets",
    "link": "https://www.nytimes.com/video/us/politics/100000010484295/how-to-make-sense-of-law-enforcement-in-the-streets.html",
    "summary": "The variety of federal forces deployed to support President Trump’s mass deportation campaign and anticrime efforts continues to expand. Often, it can be difficult for the public to tell them apart, or to understand what powers each agency has."
  },
  {
    "title": "Trump’s Border Czar Threatens More Immigrant Arrests in New York City",
    "link": "https://www.nytimes.com/2025/11/18/nyregion/border-czar-more-immigrant-arrests-nyc.html",
    "summary": "Thomas Homan said that additional federal agents would descend on the city if it did not help with President Trump’s deportation campaign."
  },
  {
    "title": "How Trump Has Used ICE, the National Guard and Other Federal Forces Across the U.S.",
    "link": "https://www.nytimes.com/2025/11/18/us/trump-immigration-raids.html",
    "summary": "Charlotte and Raleigh in North Carolina became the latest cities to see federal forces move in. Here’s a rundown of what’s going on in each place."
  },
  {
    "title": "Federal Judge Orders Some Texas Schools to Remove Ten Commandment Posters",
    "link": "https://www.nytimes.com/2025/11/18/us/politics/texas-ten-commandments.html",
    "summary": "The judge sided with families of students who had argued that the displays infringed on their religious freedom."
  },
  {
    "title": "Elon Musk Puts Trump Feud Behind Him and Tiptoes Back Into Politics",
    "link": "https://www.nytimes.com/2025/11/18/us/politics/elon-musk-politics-trump-doge.html",
    "summary": "Having struck an uneasy truce with the president, Elon Musk is starting to make political appearances again, and his allies are planning a DOGE reunion party."
  },
  {
    "title": "Kamala Harris Hits Campaign Trail in Tennessee Special Election",
    "link": "https://www.nytimes.com/2025/11/18/us/politics/kamala-harris-tennessee-house-election.html",
    "summary": "On Tuesday, the former vice president made her first campaign appearance for another Democrat since leaving office."
  },
  {
    "title": "Eric Adams, Still the Mayor, Is Increasingly Out of Office",
    "link": "https://www.nytimes.com/2025/11/18/nyregion/eric-adams-trips-travel-uzbekistan-israel.html",
    "summary": "In the waning days of his term, Mayor Eric Adams is spending a significant portion of his time far from New York City."
  },
  {
    "title": "Night of Modern Art History, Night of Spectacle at Sotheby’s",
    "link": "https://www.nytimes.com/2025/11/18/arts/design/portrait-auction-record-klimt-sothebys.html",
    "summary": "At $236.4 million, a portrait by Gustav Klimt is the second most expensive painting at auction, while Maurizio Cattelan’s golden toilet drew $12.1 million."
  },
  {
    "title": "Trump’s Trade War Showed That China Can Stand Up to America",
    "link": "https://www.nytimes.com/2025/11/19/opinion/trump-china-xi-trade.html",
    "summary": "His ill-conceived tariff war exposed U.S. vulnerabilities, strengthened China’s leverage and undermined America at a pivotal time."
  },
  {
    "title": "On Republican Neo-Nazism, Hamas and Israel: An Epidemic of Moral Cowardice",
    "link": "https://www.nytimes.com/2025/11/18/opinion/israel-hamas-antisemitism-republicans.html",
    "summary": "People with extreme ideology don’t care anymore about hiding their excesses or their agendas. It’s all out there online or on YouTube."
  },
  {
    "title": "Congress Demands Release of Epstein Files",
    "link": "https://www.nytimes.com/2025/11/18/briefing/congress-demands-release-of-epstein-files.html",
    "summary": "Also, Trump jumped to the defense of Saudi Arabia’s crown prince. Here’s the latest at the end of Tuesday."
  },
  {
    "title": "Israeli Airstrike on Refugee Camp in Lebanon Kills at Least 13, Officials Say",
    "link": "https://www.nytimes.com/2025/11/18/world/middleeast/israel-strike-lebanon-camp.html",
    "summary": "It was one of the deadliest Israeli strikes on Lebanon since a cease-fire with Hezbollah went into effect about a year ago."
  },
  {
    "title": "Smoking Weed Could Lead to Less Drinking, New Study Suggests",
    "link": "https://www.nytimes.com/2025/11/19/well/weed-cannabis-alcohol-drinking.html",
    "summary": "In a makeshift bar on a college campus, researchers studied how smoking cannabis affected alcohol consumption."
  },
  {
    "title": "Scientists Call for Global Shift Away From Ultraprocessed Foods",
    "link": "https://www.nytimes.com/2025/11/18/well/eat/ultraprocessed-foods-health.html",
    "summary": "In a sweeping series of papers, scientists have proposed policy reforms, such as taxes on sugary drinks, to improve the food supply."
  },
  {
    "title": "N.Y. Doctor Accused of Desecration Can Be Sent to Japan, Court Rules",
    "link": "https://www.nytimes.com/2025/11/18/nyregion/new-york-doctor-japan-extradition.html",
    "summary": "A federal appeals court ruled that Masahide Kanayama, a surgeon and practicing Christian, may be extradited to face charges of vandalism."
  }
]