[
  {
    "title": "Shutdown Crisis Tests Trump’s Go-It-Alone Approach to Democrats",
    "link": "https://www.nytimes.com/2025/09/24/us/politics/trump-democrats-government-shutdown.html",
    "summary": "The president has spent his first months in office freezing out Democrats, who have in turn opposed him routinely. Now they need each other to keep the government open."
  },
  {
    "title": "A Federal Shutdown May Be Imminent. How Would It Affect the Economy?",
    "link": "https://www.nytimes.com/2025/09/24/us/politics/government-shutdown-us-economy.html",
    "summary": "Congress and the White House have days to fund the government and avert a disruptive and potentially costly lapse in funding."
  },
  {
    "title": "Trump’s ‘Surreal’ Tylenol Guidance Worries Pregnant Women",
    "link": "https://www.nytimes.com/2025/09/24/us/politics/pregnant-women-tylenol-trump.html",
    "summary": "The administration’s guidance to avoid Tylenol and “tough it out” prompted anxiety, especially for expectant women who face pain."
  },
  {
    "title": "Do Vaccines Cause Autism? And Other Questions, Answered.",
    "link": "https://www.nytimes.com/2025/09/24/well/vaccines-covid-flu-mmrv-autism.html",
    "summary": "It can be hard to sort through the conflicting and evolving information about vaccines. Here’s the latest guidance on Covid boosters, flu shots, childhood immunizations and more."
  },
  {
    "title": "Trump at the U.N.: ‘Your Countries Are Going to Hell’",
    "link": "https://www.nytimes.com/video/us/politics/100000010416192/trump-at-the-un-your-countries-are-going-to-hell.html",
    "summary": "President Trump’s speech at the United Nations took an isolating stance. David Sanger, a White House correspondent for The New York Times, explains what that means for the United States."
  },
  {
    "title": "Ukrainians Are Grateful but Skeptical After Trump’s Turnabout on the War",
    "link": "https://www.nytimes.com/2025/09/24/world/europe/trump-war-ukraine-reaction.html",
    "summary": "Whereas he once pressed Ukraine to take any deal, President Trump said he now believed that the country could win. Some Ukrainians seemed not to take his position seriously."
  },
  {
    "title": "U.K. Endures a Trump Scolding at U.N., Days After Lavish State Visit",
    "link": "https://www.nytimes.com/2025/09/24/world/europe/trump-uk.html",
    "summary": "President Trump said Europe is “going to hell” and implicitly rebuked Britain on immigration, despite making extended visits to the country and enjoying its hospitality."
  },
  {
    "title": "U.N. Health Goals Weakened by Industry Pressure, Experts Say",
    "link": "https://www.nytimes.com/2025/09/24/health/global-health-sugary-drinks-tobacco.html",
    "summary": "Public health advocates complained that the final recommendations on combating chronic illness removed calls for taxes on tobacco, alcohol and sweetened drinks."
  },
  {
    "title": "The Billionaire, the Psychedelics and the Best-Selling Memoir",
    "link": "https://www.nytimes.com/2025/09/24/nyregion/amy-griffin-memoir-psychedelic-drugs.html",
    "summary": "Amy Griffin wrote a book based on recovered memories of childhood sexual abuse. Oprah Winfrey and a slew of celebrities promoted it. Then questions arose."
  },
  {
    "title": "Here’s How Late-Night Became Political Before Trump",
    "link": "https://www.nytimes.com/2025/09/24/arts/television/jimmy-kimmel-late-night-politics-trump.html",
    "summary": "The hosts’ monologues may feel especially pointed right now, but the trend really took off during the George W. Bush administration before the Iraq war."
  },
  {
    "title": "Jimmy Kimmel, Back on Air, Defends Free Speech in Emotional Monologue",
    "link": "https://www.nytimes.com/2025/09/23/business/media/jimmy-kimmel-return-monologue.html",
    "summary": "The late-night star said he had not intended to make light of Charlie Kirk’s murder, but he also said that President Trump’s threat against ABC was “anti-American.”"
  },
  {
    "title": "The F.C.C.’s Brendan Carr Plans to Keep Going After the Media Following Jimmy Kimmel’s Return",
    "link": "https://www.nytimes.com/2025/09/24/technology/brendan-carr-fcc-kimmel.html",
    "summary": "While “Jimmy Kimmel Live!” returned to ABC on Tuesday, the chairman of the Federal Communications Commission has promised to continue his campaign against what he sees as liberal bias in broadcasts."
  },
  {
    "title": "The S.E.C. Dropped a Complaint Against Its Chairman’s Former Client",
    "link": "https://www.nytimes.com/2025/09/24/us/politics/sec-paul-atkins-devon-archer-trump.html",
    "summary": "Before Paul Atkins took his position with the regulatory agency, he testified on behalf of Devon Archer. The chairman recused himself when the commission dismissed the case last week."
  },
  {
    "title": "Trump Aides’ Involvement in Chips and Crypto Deals Draw Senate Calls for Inquiries",
    "link": "https://www.nytimes.com/2025/09/24/us/politics/trump-witkoff-sacks-saudi-chips-crypto.html",
    "summary": "Democrats in Congress and ethics lawyers are calling for an investigation into potential ethics violations related to United Arab Emirates deals."
  },
  {
    "title": "Why Obamacare Bills May Double Next Year",
    "link": "https://www.nytimes.com/2025/09/24/health/obamacare-cost-aca-health-insurance.html",
    "summary": "Extensive subsidies that reduce premium costs for millions are set to expire, unless Congress extends them."
  },
  {
    "title": "This Conquistador Changed History. Neglect Haunts His Tomb in Mexico",
    "link": "https://www.nytimes.com/2025/09/24/world/americas/mexico-city-cortes-legacy.html",
    "summary": "Hernán Cortés toppled the Aztecs, winning Mexico for Spain. His trash-strewn resting place reflects how the conquest is still fueling quarrels and testing ties with Spain."
  },
  {
    "title": "Relief, Grief and Pain as Gaza’s Wounded Are Flown to Safety",
    "link": "https://www.nytimes.com/2025/09/24/world/middleeast/evacuation-flight-gaza-abu-dhabi.html",
    "summary": "Hungry and injured passengers on a medical evacuation flight showed the toll of nearly two years of bombardment."
  },
  {
    "title": "Israeli Strike Kills Gazans Sheltering in Warehouse, Local Reports Say",
    "link": "https://www.nytimes.com/2025/09/24/world/middleeast/israel-strike-gaza-city-civilians.html",
    "summary": "The Israeli attack in Gaza City killed nearly two dozen Palestinians, the reports said. The Israeli military said it had hit two “Hamas terrorists.”"
  },
  {
    "title": "10 (More) Questions With Zohran Mamdani",
    "link": "https://www.nytimes.com/2025/09/24/nyregion/zohran-mamdani-10-questions.html",
    "summary": "Zohran Mamdani, the Democratic nominee for mayor of New York City, visited The New York Times for an interview."
  },
  {
    "title": "How Did Maria Branyas Morera, Who Was the World’s Oldest Person, Live So Long?",
    "link": "https://www.nytimes.com/2025/09/24/health/maria-branyas-longevity-genes-microbiome.html",
    "summary": "Spanish researchers say Maria Branyas Morera won a genetic lottery. But experts caution that healthy genes and microbiomes don’t explain longevity on their own."
  },
  {
    "title": "No President Should Have This Kind of Power",
    "link": "https://www.nytimes.com/2025/09/24/opinion/trump-caribbean-sea-boats-military.html",
    "summary": "Even if the allegations are correct, blowing up the boats is a lawless exercise in the use of deadly force."
  },
  {
    "title": "Rainn Wilson: What I Learned at a Fire Ceremony With King Charles",
    "link": "https://www.nytimes.com/2025/09/24/opinion/rainn-wilson-king-charles-spirituality.html",
    "summary": "To transform our relationship with our planet, we need to value nature as profoundly sacred."
  },
  {
    "title": "Can the Justice Department Stay Independent Under Trump?",
    "link": "https://www.nytimes.com/2025/09/24/us/justice-dept-independence-trump-kimmel.html",
    "summary": "The president wants the department to punish his foes and protect his friends."
  },
  {
    "title": "Typhoon Ragasa Tears Through Guangfu in Taiwan, Killing at Least 17",
    "link": "https://www.nytimes.com/2025/09/24/world/asia/typhoon-ragasa-guangfu-taiwan-photos.html",
    "summary": "Hundreds of firefighters and soldiers dispatched to Guangfu have gone door to door to check for trapped residents."
  },
  {
    "title": "Jessica Chastain Criticizes Apple’s Decision to Postpone ‘The Savant’",
    "link": "https://www.nytimes.com/2025/09/24/business/media/apple-jessica-chastain-the-savant.html",
    "summary": "Jessica Chastain, the show’s star and one of its producers, criticized the decision on social media on Wednesday."
  },
  {
    "title": "Philanthropies Strike a Promising Deal to Turn Back H.I.V.",
    "link": "https://www.nytimes.com/2025/09/24/health/hiv-treatment-shots-lenacapavir.html",
    "summary": "Low- and middle-income countries will be able to purchase an effective preventative at a reduced price. The arrangements may help stem the epidemic 40 years after it began."
  }
]