[
  {
    "title": "The A.I. Boom Is Driving the Economy. What Happens if It Falters?",
    "link": "https://www.nytimes.com/2025/11/22/business/the-ai-boom-economy.html",
    "summary": "A windfall for companies that build data centers and their suppliers is overshadowing weakness in other industries."
  },
  {
    "title": "What to Know About the Nearly 10% Climb in a Key Medicare Expense for 2026",
    "link": "https://www.nytimes.com/2025/11/22/business/what-to-know-about-the-nearly-10-climb-in-a-key-medicare-expense-for-2026.html",
    "summary": "The rapidly rising premium for Part B, which covers retirees’ outpatient services, reflects the fast pace of growth for health care costs nationally."
  },
  {
    "title": "Eli Lilly, Drug Maker of Zepbound and Mounjaro, Reaches $1 Trillion in Value",
    "link": "https://www.nytimes.com/2025/11/21/health/eli-lilly-one-trillion-value-pharmaceuticals.html",
    "summary": "The 150-year-old drugmaker is the first company in health care to hit the milestone."
  },
  {
    "title": "‘Fascist’? ‘Communist’? For an Afternoon, Trump and Mamdani Were Just 2 Guys From Queens.",
    "link": "https://www.nytimes.com/2025/11/21/us/politics/trump-mamdani-scene.html",
    "summary": "Acid insults were set aside as New York’s mayor-elect and the president promoted their shared goals."
  },
  {
    "title": "The Surprise Ending to the Trump-Mamdani Buddy Movie Has Heads Spinning",
    "link": "https://www.nytimes.com/2025/11/21/nyregion/mamdani-trump-reaction-meeting.html",
    "summary": "Zohran Mamdani and President Trump seemed to cast aside their months of traded insults, a development that seemed good for New York City but odd to some followers."
  },
  {
    "title": "Marjorie Taylor Greene Says She Will Resign in January, After Break From Trump",
    "link": "https://www.nytimes.com/2025/11/21/us/politics/marjorie-taylor-greene-resigns.html",
    "summary": "Ms. Greene, who was elected in 2020, had positioned herself as a die-hard Trump supporter until a series of recent ruptures with the president, who recently unendorsed her."
  },
  {
    "title": "The Federalist Society Is Torn Between Its Legal Philosophy and Trump’s Demands",
    "link": "https://www.nytimes.com/2025/11/22/us/trump-federalist-society.html",
    "summary": "Guided by Leonard Leo, the society built a pipeline for traditional conservative judges. But that might not be enough for President Trump in his second term."
  },
  {
    "title": "In the House, Censures Proliferate, Reflecting a Poisonous Climate",
    "link": "https://www.nytimes.com/2025/11/22/us/politics/house-censures.html",
    "summary": "Formal reprimands, once rare, dominated the chamber’s agenda this week, prompting lawmakers in both parties to call for changes to the way the House handles such actions."
  },
  {
    "title": "Supreme Court, For Now, Keeps in Place Texas Republican-Friendly Congressional Map",
    "link": "https://www.nytimes.com/2025/11/21/us/politics/supreme-court-texas-congressional-map.html",
    "summary": "State officials have asked the justices to allow it to use a newly redrawn map for the 2026 midterms, part of a nationwide redistricting push by President Trump."
  },
  {
    "title": "Trump Offers a Ukraine Peace Plan the Kremlin Can Love",
    "link": "https://www.nytimes.com/2025/11/22/us/politics/trump-ukraine-russia-peace-plan-kremlin.html",
    "summary": "While President Trump at times suggested he was willing to bolster support for Ukraine, he has repeatedly accommodated Russia’s demands."
  },
  {
    "title": "Ukrainians Wait in Pain as Hope to Find Strike Survivors Fades",
    "link": "https://www.nytimes.com/2025/11/22/world/europe/russia-ukraine.html",
    "summary": "Russian missiles hit apartment buildings in Ternopil this week, far from the war’s front line. Dozens of civilians, including children, were killed."
  },
  {
    "title": "The Aftermath of a Deadly Strike in Western Ukraine",
    "link": "https://www.nytimes.com/video/world/europe/100000010538311/the-aftermath-of-a-deadly-strike-in-western-ukraine.html",
    "summary": "At the site of an apartment building in western Ukraine where a Russian strike killed dozens of people, the New York Times reporter Kim Barker heard reactions to a 28-point U.S. proposal to end the war."
  },
  {
    "title": "G20 Leaders Push Back on Trump’s Ukraine Peace Plan",
    "link": "https://www.nytimes.com/2025/11/22/world/africa/g20-south-africa-ukraine-russia-united-states.html",
    "summary": "In a joint statement, the leaders reaffirmed their commitment to Ukraine, which faces the prospect of losing American support if it rejects the latest proposal."
  },
  {
    "title": "U.S. and Ukrainian Officials to Meet Again on U.S. Peace Plan",
    "link": "https://www.nytimes.com/2025/11/22/us/politics/us-ukraine-peace-plan.html",
    "summary": "In the Trump administration’s latest effort to pressure Ukraine into accepting a 28-point peace plan, officials from the two countries will hold talks in Geneva."
  },
  {
    "title": "Trump Claims a White ‘Genocide’ in South Africa. Here’s What’s Really Happening.",
    "link": "https://www.nytimes.com/2025/11/22/world/africa/south-africa-crime.html",
    "summary": "An audacious effort joined two disparate communities, who say they all suffer from the staggering violence and crime affecting the country."
  },
  {
    "title": "How Olivia Nuzzi and Ryan Lizza Became Main Characters on Social Media",
    "link": "https://www.nytimes.com/2025/11/21/style/olivia-nuzzi-ryan-lizza-rfk-jr-affair.html",
    "summary": "Love, politics and ethics collided as Olivia Nuzzi and Ryan Lizza went at it in a media sphere that rewards private revelations."
  },
  {
    "title": "Vanity Fair Is Reviewing Its Ties to Olivia Nuzzi",
    "link": "https://www.nytimes.com/2025/11/21/style/vanity-fair-olivia-nuzzi.html",
    "summary": "The magazine, which recently hired the journalist, said it had been “taken by surprise” by new claims in an essay by her former fiancé, Ryan Lizza."
  },
  {
    "title": "Make-Ahead Thanksgiving Recipes That Will Save You Time",
    "link": "https://cooking.nytimes.com/article/make-ahead-thanksgiving-recipes",
    "summary": "A little planning goes a long way to help a holiday meal come together easily."
  },
  {
    "title": "Don’t Miss This: Epstein Edition",
    "link": "https://www.nytimes.com/video/opinion/100000010539876/dont-miss-this-epstein-edition.html",
    "summary": "The Epstein files are coming. But will Americans be able to fully trust them?"
  },
  {
    "title": "Piggy Gets Polite",
    "link": "https://www.nytimes.com/2025/11/22/opinion/trump-piggy-mamdani.html",
    "summary": "Trump, remarkably, finds a new low."
  },
  {
    "title": "Pushing Off",
    "link": "https://www.nytimes.com/2025/11/22/briefing/pushing-off.html",
    "summary": "Thanksgiving’s this coming week. How can we keep a busy holiday season from overwhelming us?"
  },
  {
    "title": "The Battle Between Pasadena and U.C.L.A Over the Rose Bowl",
    "link": "https://www.nytimes.com/2025/11/22/us/rose-bowl-pasadena-ucla.html",
    "summary": "The storied stadium is at the center of a battle between Pasadena and U.C.L.A. that’s about money, nostalgia, geography and so much more."
  },
  {
    "title": "COP30 Climate Summit Ends With Dire Warnings and Scant Plans for Action",
    "link": "https://www.nytimes.com/2025/11/22/climate/cop30-climate-summit-ends-belem.html",
    "summary": "The first U.S. absence in the history of the talks created an opening, diplomats said, for oil-producing nations to push their agenda."
  },
  {
    "title": "Jair Bolsonaro Arrested in Brazil Amid Fears He Might Flee to Avoid Prison",
    "link": "https://www.nytimes.com/2025/11/22/world/americas/jair-bolsonaro-brazil-arrest.html",
    "summary": "The arrest came days before the former president was expected to be ordered to begin a 27-year prison sentence for staging a failed coup."
  },
  {
    "title": "This Washington Museum Sold Some of Its Art. But at What Cost?",
    "link": "https://www.nytimes.com/2025/11/22/arts/design/phillips-collection-art-sold.html",
    "summary": "The Phillips Collection sold three works and raised $13 million to buy contemporary art, but the decision has led to rancor within the 104-year-old institution."
  }
]