[
  {
    "title": "CPI Shows Pace of US Inflation Likely to Keep Fed Cautious on Rate Cuts",
    "link": "https://www.nytimes.com/2025/09/11/business/cpi-inflation-fed-rate-cuts.html",
    "summary": "The central bank is likely to lower borrowing costs at its meeting next week amid budding concerns about the labor market."
  },
  {
    "title": "In Public and in Private, New York Marks 9/11 Anniversary",
    "link": "https://www.nytimes.com/2025/09/11/us/9-11-anniversary-nyc.html",
    "summary": "The names of those killed in the Sept. 11, 2001, terrorist attacks are being read at a memorial plaza in Lower Manhattan. Other remembrances are taking place across the region."
  },
  {
    "title": "What to Know About the 9/11 Case at Guantánamo Bay",
    "link": "https://www.nytimes.com/2025/09/11/us/politics/september11-what-to-know.html",
    "summary": "A guide to the military prison, the prisoners, the costs and what else goes on at the U.S. naval base."
  },
  {
    "title": "On Ukraine and Gaza, Trump Casts Himself as a Bystander, if He Can’t Be a Peacemaker",
    "link": "https://www.nytimes.com/2025/09/11/us/politics/trump-gaza-ukraine-peace.html",
    "summary": "President Trump often insists he can bring peace to global conflicts. But when allies and adversaries alike appear to be ignoring him or testing American will, he adopts a what-can-you-do shrug."
  },
  {
    "title": "Russia’s Strategy Against the West: Escalate Slowly and See if It Responds",
    "link": "https://www.nytimes.com/2025/09/11/world/europe/russia-ukraine-europe-poland-drones.html",
    "summary": "Ukrainian and European officials say President Vladimir V. Putin has become emboldened by a lack of Western pushback."
  },
  {
    "title": "How the Emmys Face-Off Between ‘Severance’ and ‘The Pitt’ Sums Up the TV Business",
    "link": "https://www.nytimes.com/2025/09/11/business/media/severance-the-pitt-emmys.html",
    "summary": "The industry is in a state of transition. The front-runners for best drama at the Emmys this Sunday explain the competing tensions."
  },
  {
    "title": "Did a Brooklyn Couple Kill a Neighbor’s Trees for a Better View in Maine?",
    "link": "https://www.nytimes.com/2025/09/11/us/trees-poison.html",
    "summary": "Maine’s Board of Pesticides Control says two summer residents poisoned a neighbor’s trees so the couple, both Martha Stewart associates, could have a harbor view. They deny it."
  },
  {
    "title": "The Jarring Contradiction at the Heart of Kennedy’s Agenda",
    "link": "https://www.nytimes.com/2025/09/11/health/kennedy-maha-vaccines-food.html",
    "summary": "The health secretary has begun a full-on assault against vaccines but has taken a more restrained approach to pesticides and unhealthy foods, also MAHA priorities."
  },
  {
    "title": "For National Guard Troops in D.C., It’s Trash Pickup and Metro Patrols",
    "link": "https://www.nytimes.com/2025/09/11/us/politics/trump-national-guard-troops-dc.html",
    "summary": "Thousands of armed troops are deployed as part of President Trump’s crime crackdown. So far, it has been a lot of beautification projects and assisting the local police."
  },
  {
    "title": "In South Korea and Japan, Fury at U.S. Fuels Backlash Over Trade Deals",
    "link": "https://www.nytimes.com/2025/09/11/business/south-korea-japan-trump-trade.html",
    "summary": "Officials and business leaders in both countries are questioning commitments their governments made to invest hundreds of billions in American manufacturing."
  },
  {
    "title": "South Korean Leader Warns of U.S. Investments After Hyundai-LG Plant Raid",
    "link": "https://www.nytimes.com/2025/09/11/world/asia/south-korea-us-investments-hyundai-raid.html",
    "summary": "President Lee Jae Myung made the comments as hundreds of South Korean workers swept in an immigration raid were expected to fly home on Thursday."
  },
  {
    "title": "Trump’s Tariffs on Brazil and Vietnam Are Making Coffee More Expensive",
    "link": "https://www.nytimes.com/2025/09/11/business/coffee-prices-tariffs.html",
    "summary": "Coffee prices are up nearly 21 percent over the past year, partly because of President Trump’s punishing tariffs on Brazil and Vietnam."
  },
  {
    "title": "Mamdani Gets Backing From National Democrats as Trump Enters Fray",
    "link": "https://www.nytimes.com/2025/09/11/us/politics/zohran-mamdani-democrats-endorsements.html",
    "summary": "Democrats have been slow to embrace Zohran Mamdani, the democratic socialist who won New York City’s mayoral primary. Many, especially in New York, still are."
  },
  {
    "title": "Eric Adams Hints to Business Leaders He Is Open to Quitting Mayor’s Race",
    "link": "https://www.nytimes.com/2025/09/11/nyregion/adams-mayor-campaign-nyc.html",
    "summary": "Mayor Eric Adams told a prominent New York City business group that if a private poll showed he had no path to re-election, he would reconsider bowing out."
  },
  {
    "title": "U.K. Ambassador to U.S., Peter Mandelson, Fired Over Epstein Links",
    "link": "https://www.nytimes.com/2025/09/11/world/europe/uk-ambassador-us-peter-mandelson-epstein-starmer.html",
    "summary": "The British government said it withdrew the envoy after newly revealed emails showed the depth of his relationship with Jeffrey Epstein."
  },
  {
    "title": "Democrats Want JPMorgan and Other Banks to Testify Over Epstein Ties",
    "link": "https://www.nytimes.com/2025/09/11/us/politics/epstein-jpmorgan-banks-senate-letter.html",
    "summary": "Ten Democratic senators called on the Senate Banking Committee to hold hearings into the role that financial institutions may have played in enabling Jeffrey Epstein’s sex crimes."
  },
  {
    "title": "What Drove Israel’s Brazen Attack on Hamas in Qatar?",
    "link": "https://www.nytimes.com/2025/09/11/world/middleeast/israel-attack-qatar-hamas.html",
    "summary": "Israeli officials and analysts say that revenge for the Hamas-led 2023 attack on Israel, and frustration over moribund Gaza truce negotiations, informed the decision to strike in Doha."
  },
  {
    "title": "California Passes Bill Allowing Omission of Patients’ Names From Abortion Pill Bottles",
    "link": "https://www.nytimes.com/2025/09/11/health/california-abortion-pill-protections.html",
    "summary": "The intent is to protect health care providers who send the pills to patients in states with abortion bans, and to reassure patients who fear they could be identified."
  },
  {
    "title": "Nadine Menendez, Wife of a Senator, Sentenced to 4 1/2 Years for Bribery Scheme",
    "link": "https://www.nytimes.com/2025/09/11/nyregion/nadine-menendez-bribery-sentencing.html",
    "summary": "Ms. Menendez, the wife of former Senator Robert Menendez, a New Jersey Democrat, said her husband had led her astray."
  },
  {
    "title": "Charlie Kirk and the Future of Political Violence",
    "link": "https://www.nytimes.com/2025/09/11/opinion/charlie-kirk-assassination-debate.html",
    "summary": "An assassin took aim at the American experiment itself."
  },
  {
    "title": "Charlie Kirk Was Practicing Politics the Right Way",
    "link": "https://www.nytimes.com/2025/09/11/opinion/charlie-kirk-assassination-fear-politics.html",
    "summary": "The foundation of a free society is the ability to participate in politics without fear of violence. To lose that is to risk losing everything."
  },
  {
    "title": "What You Need to Know About Charlie Kirk’s Assassination",
    "link": "https://www.nytimes.com/2025/09/11/briefing/what-you-need-to-know-about-charlie-kirks-assassination.html",
    "summary": "The search for the shooter is still underway."
  },
  {
    "title": "Belarus Frees 52 Political Prisoners and Gets a Warm Thank-You From Trump",
    "link": "https://www.nytimes.com/2025/09/11/world/europe/belarus-political-prisoners-release.html",
    "summary": "The release came as Aleksandr Lukashenko, the country’s authoritarian leader and an ally of President Vladimir Putin of Russia, seeks to normalize ties with the Trump administration."
  },
  {
    "title": "Nepal’s Young Protesters Find an Unlikely Partner: The Army",
    "link": "https://www.nytimes.com/2025/09/11/world/asia/nepal-army-gen-z-protesters.html",
    "summary": "After an explosion of popular rage tore through the country, its respected army was the only institution left standing. It’s now in talks with the protesters."
  },
  {
    "title": "Their Schools Banned Phones. Out Came the iPods and Cassette Players.",
    "link": "https://www.nytimes.com/2025/09/11/style/phone-ban-ipod-mp3-school.html",
    "summary": "Enterprising students have been bringing the contraband of yesteryear to school in what they see as a “loophole” in cellphone bans."
  },
  {
    "title": "Small Businesses Face a New Threat: Pay Up or Be Flooded With Bad Reviews",
    "link": "https://www.nytimes.com/2025/09/11/technology/fake-reviews-small-businesses.html",
    "summary": "Movers, roofing companies and others are being bombarded with phony one-star reviews on Google Maps. Then they’re asked to pay up."
  }
]