[
  {
    "title": "Demanding Support for Trump, Justice Dept. Struggles to Recruit Prosecutors",
    "link": "https://www.nytimes.com/2026/02/07/us/politics/doj-prosecutors-recruiting-trump.html",
    "summary": "Some offices are so decimated that the Justice Department has sent in military lawyers. More recently, officials asked for volunteers from other offices who can quickly deploy to places in desperate need."
  },
  {
    "title": "For $1 Million, Donors to U.S.A. Birthday Group Offered Access to Trump",
    "link": "https://www.nytimes.com/2026/02/08/us/politics/freedom-250-trump-donors.html",
    "summary": "A new organization blessed by the president is raising money for events and projects that will put a Trumpian spin on the nation’s semiquincentennial."
  },
  {
    "title": "Why the N.F.L. Booked Bad Bunny for the Super Bowl Halftime Show",
    "link": "https://www.nytimes.com/2026/02/08/business/bad-bunny-super-bowl-nfl.html",
    "summary": "League executives may be nervous about the Latin superstar’s outspoken stance on immigration, but their priority is attracting popular halftime performers."
  },
  {
    "title": "The 2026 Super Bowl Ads (So Far), Ranked",
    "link": "https://www.nytimes.com/2026/02/06/arts/television/super-bowl-ads-ranked-2026.html",
    "summary": "Here is our critic’s survey of this year’s Super Bowl commercials, from best to worst to A.I."
  },
  {
    "title": "Epstein Files Reveal Scope of Ghislaine Maxwell’s Role in Clinton Circle",
    "link": "https://www.nytimes.com/2026/02/08/us/politics/epstein-clintons-maxwell.html",
    "summary": "Jeffrey Epstein’s longtime companion helped advise on the kickoff of the Clinton Global Initiative and arranged for $1 million in funding for it, emails show."
  },
  {
    "title": "Starmer’s Chief of Staff Resigns, Citing Role in Hiring Friend of Epstein",
    "link": "https://www.nytimes.com/2026/02/08/world/europe/keir-starmer-chief-of-staff-resigns.html",
    "summary": "The Labour official was ensnared in a scandal after helping appoint Peter Mandelson as Britain’s ambassador to the U.S."
  },
  {
    "title": "7 Days, No Suspects: The Disappearance of Nancy Guthrie",
    "link": "https://www.nytimes.com/2026/02/08/us/nancy-guthrie-savannah-guthrie-family.html",
    "summary": "The mother of the “Today” show host Savannah Guthrie has not been heard from since an evening of dinner and games with family members."
  },
  {
    "title": "Extreme Cold Persists in the Northeast With Record-Setting Temperatures",
    "link": "https://www.nytimes.com/2026/02/08/weather/extreme-cold-wind-chills.html",
    "summary": "Punishing winds have combined with low temperatures to produce dangerously cold conditions across the Northeast. Forecasters say, though, that relief is on the horizon."
  },
  {
    "title": "What’s Behind the Weird Weather That’s Dominated 2026",
    "link": "https://www.nytimes.com/2026/02/07/weather/cold-snow-forecast-us.html",
    "summary": "While iguanas were stunned by freezing cold in Florida, would-be skiers were looking at dirt on Utah’s slopes. Here’s what’s going on, and when it will finally end."
  },
  {
    "title": "Is Wallace Shawn the Only Avant-Garde Artist Who Gets Stopped in Times Square?",
    "link": "https://www.nytimes.com/2026/02/08/t-magazine/wallace-shawn.html",
    "summary": "He’s most commonly recognized for his screen roles as a plotting hit man and an unlikely Lothario, but it’s his work as a playwright that shows more of his true self."
  },
  {
    "title": "These A.I. Dreamers Don’t Fit the Stereotype",
    "link": "https://www.nytimes.com/2026/02/08/style/ai-tech-san-francisco.html",
    "summary": "Young tech entrepreneurs in San Francisco are hoping to cash in, even as they wonder how artificial intelligence will affect society."
  },
  {
    "title": "Feeling ‘Amateur’ at Retirement Planning, They Asked A.I. for Help",
    "link": "https://www.nytimes.com/2026/02/08/business/retirement-planning-ai-chatbots.html",
    "summary": "More people are turning to chatbots for advice, inquiring about high-stakes decisions such as saving for retirement — even if they eventually turn to a human."
  },
  {
    "title": "MAGA’s Split Over Israel Extends to a Ship Attacked 58 Years Ago",
    "link": "https://www.nytimes.com/2026/02/08/business/media/liberty-ship-attack-israel-conservatives.html",
    "summary": "The Israeli military killed 34 people on the U.S.S. Liberty in 1967. Whether it was an accident, as many historians believe, has become a litmus test within President Trump’s movement."
  },
  {
    "title": "Portugal Elects a President, With Leftist Beating a Surging Far Right",
    "link": "https://www.nytimes.com/2026/02/08/world/europe/portugal-president-elections-chega-seguro-ventura.html",
    "summary": "Despite a decisive victory for António José Seguro, a nationalist’s presence in the runoff showed that Portugal is not immune to Europe’s rising far-right tide."
  },
  {
    "title": "Haruki Murakami Isn’t Afraid of the Dark",
    "link": "https://www.nytimes.com/2026/02/08/books/haruki-murakami-profile.html",
    "summary": "The author, who brought Japanese literature into the global mainstream, grapples with aging and his place in the world of letters."
  },
  {
    "title": "The Culture War Is Over. Bad Bunny Won.",
    "link": "https://www.nytimes.com/2026/02/06/opinion/bad-bunny-super-bowl.html",
    "summary": "American pop culture is global pop culture, and vice versa."
  },
  {
    "title": "Seven Pages of a Sealed Watergate File Sat Undiscovered. Until Now.",
    "link": "https://www.nytimes.com/2026/02/08/opinion/trump-nixon-watergate-radford.html",
    "summary": "Seven pages of grand jury testimony from Richard Nixon were deemed so incendiary that they were hidden from the public for years."
  },
  {
    "title": "Are You ‘Biohacking’ to Perform Better at Work? We Want to Hear From You.",
    "link": "https://www.nytimes.com/2026/02/04/business/biohacking-work-performance.html",
    "summary": "Please tell us what changes you’ve made to your health and wellness practices to improve your brain function and job performance. We may include your experiences in an article."
  },
  {
    "title": "Japan’s Sanae Takaichi Wins Snap Election in a Landslide",
    "link": "https://www.nytimes.com/2026/02/08/world/asia/japan-takaichi-election-landslide.html",
    "summary": "Prime Minister Sanae Takaichi won a sweeping mandate from voters for her economic agenda and tough stances on immigration and China."
  },
  {
    "title": "4 Dead in Mushroom Poisoning Outbreak in California",
    "link": "https://www.nytimes.com/2026/02/08/us/california-mushrooms-deaths.html",
    "summary": "State health officials discouraged foraging this year, saying that toxic mushrooms can easily be confused with safe ones to eat."
  },
  {
    "title": "Thailand’s Conservative Party Claims Surprise Election Victory",
    "link": "https://www.nytimes.com/2026/02/08/world/asia/thailand-election-opposition-conservatives.html",
    "summary": "It was the first time in years that a conservative party preaching nationalism, patriotism and respect for the monarchy came out on top."
  },
  {
    "title": "Iranian Nobel Laureate Gets Second Prison Sentence and Ends Hunger Strike",
    "link": "https://www.nytimes.com/2026/02/08/world/middleeast/iran-narges-mohammadi-second-sentence.html",
    "summary": "The activist Narges Mohammadi was sentenced to another seven years, bringing the total she must serve to 17 years, her foundation said."
  }
]