[
  {
    "title": "Trump Uses Shutdown to Maximize Pain for Democrats and Move Forward With Layoffs",
    "link": "https://www.nytimes.com/2025/10/01/us/politics/white-house-shutdown-punishment.html",
    "summary": "The Trump administration forged ahead with plans to conduct mass layoffs, as the fiscal standoff appeared to intensify."
  },
  {
    "title": "Trump to Withhold $18 Billion for New York-Area Transit Projects",
    "link": "https://www.nytimes.com/2025/10/01/nyregion/trump-nyc-subway-gateway-infrastructure-funding.html",
    "summary": "Funds for two of the nation’s largest infrastructure projects, the Second Avenue subway and Hudson River tunnels, are being held up in apparent attempts to pressure Democrats amid a government shutdown."
  },
  {
    "title": "‘Dangerous Cities,’ the Military, Trump and the Founding Fathers",
    "link": "https://www.nytimes.com/2025/10/01/us/politics/trump-military-founding-fathers.html",
    "summary": "The U.S. armed services have long sought to preserve the tradition of a nonpartisan military."
  },
  {
    "title": "Drones, Helicopters, Hundreds of Arrests: Trump’s Immigration Crackdown in Chicago So Far",
    "link": "https://www.nytimes.com/2025/10/01/us/trump-chicago-immigration-national-guard.html",
    "summary": "The administration announced a federal operation in the Chicago area more than three weeks ago. Agents have appeared along downtown streets, and National Guard troops are expected."
  },
  {
    "title": "How Washington Became a Testing Ground for ICE",
    "link": "https://www.nytimes.com/2025/10/01/us/politics/washington-dc-ice.html",
    "summary": "A series of arrests captured on video reveal how immigration officers have worked with other law enforcement agencies to identify migrants during stops for minor infractions."
  },
  {
    "title": "The Dodgers United Los Angeles. Then the ICE Raids Began.",
    "link": "https://www.nytimes.com/2025/10/01/magazine/los-angeles-dodgers-trump-latinos.html",
    "summary": "For decades, the Dodgers have been the pride of L.A.’s Latino community. Trump’s immigration raids are testing that."
  },
  {
    "title": "Jane Goodall, Revered Chimpanzee Expert and Conservationist, Dies at 91",
    "link": "https://www.nytimes.com/2025/10/01/obituaries/jane-goodall-dead.html",
    "summary": "Her discoveries as a primatologist in the 1960s about how chimpanzees behave in the wild broke new ground and were hailed as “one of the Western world’s great scientific achievements.”"
  },
  {
    "title": "Jane Goodall: A Life in Pictures",
    "link": "https://www.nytimes.com/2025/10/01/science/jane-goodall-photos.html",
    "summary": "The primatologist gained scientific acclaim for her work with chimpanzees and then later used her fame to champion conservation."
  },
  {
    "title": "Trump Fires Members of Humanities Council",
    "link": "https://www.nytimes.com/2025/10/01/arts/trump-neh-firings.html",
    "summary": "The White House told members of a group of scholars who advise the National Endowment for the Humanities that their positions had been terminated."
  },
  {
    "title": "Supreme Court Allows Lisa Cook to Remain at Fed, for Now",
    "link": "https://www.nytimes.com/2025/10/01/us/politics/supreme-court-lisa-cook-fed.html",
    "summary": "The justices deferred a decision on the president’s efforts to oust Ms. Cook and instead set oral arguments in the case for January."
  },
  {
    "title": "How TrumpRx Website May Affect Your Drug Costs After Pfizer Deal",
    "link": "https://www.nytimes.com/2025/10/01/health/trump-pfizer-prescription-drug-prices.html",
    "summary": "President Trump and top health officials announced a deal with Pfizer to try to lower Medicaid prices, and a website to help consumers buy drugs directly from manufacturers."
  },
  {
    "title": "Spencer Pratt Lost His House in the Palisades Fire and Thinks Gavin Newsom Should Take the Blame",
    "link": "https://www.nytimes.com/2025/10/01/business/economy/spencer-pratt-palisades-fire-gavin-newsom.html",
    "summary": "After losing his house in the Palisades fire, Spencer Pratt has gone from the archetype of celebrity emptiness to community activist — and become a magnet for Republican politicians."
  },
  {
    "title": "Israel Intercepts Boats Headed to Gaza With Humanitarian Aid",
    "link": "https://www.nytimes.com/2025/10/01/world/middleeast/gaza-flotilla-israel.html",
    "summary": "The boats were part of a flotilla, carrying Greta Thunberg and other activists, that was organized to break Israel’s blockade of Gaza and protest the war."
  },
  {
    "title": "Israel Escalates Gaza Offensive as Hamas Mulls Trump Plan",
    "link": "https://www.nytimes.com/2025/10/01/world/middleeast/israel-gaza-trump-hamas.html",
    "summary": "Hundreds of thousands of Palestinians have fled Israel’s assault on Gaza City, but many are believed to remain, having nowhere to go or no means to leave."
  },
  {
    "title": "Moscow Indicates Retaliation if Europe Uses Russian Assets for Ukraine",
    "link": "https://www.nytimes.com/2025/10/01/world/europe/russia-frozen-assets-ukraine-loan.html",
    "summary": "Amid a plan to lend $165 billion to Kyiv using Russian state assets, European officials are mindful of the possibility of blowback as they gather to discuss the idea."
  },
  {
    "title": "What Is Europe’s ‘Drone Wall’?",
    "link": "https://www.nytimes.com/2025/10/01/world/europe/drone-wall-european-union-russia.html",
    "summary": "The European Union is talking about shoring up defenses in its eastern airspace. Recent Russian drone incursions have lent urgency to the project."
  },
  {
    "title": "Should the Autism Spectrum Be Split Apart?",
    "link": "https://www.nytimes.com/2025/10/01/health/autism-spectrum-neurodiversity-kennedy.html",
    "summary": "Families of people with severe autism say the repeated expansion of the diagnosis pushed them to the sidelines. A new focus on the disorder has opened the way for them to argue their cause."
  },
  {
    "title": "Did the Yankees Try to Keep Red Sox Fans Out of the Bronx?",
    "link": "https://www.nytimes.com/2025/10/01/nyregion/yankees-red-sox-wild-card-bronx.html",
    "summary": "Not exactly, but to the thousands of Boston fans who attended the first game of the Wild Card series at Yankee Stadium, it was a welcome reason to root against the home team."
  },
  {
    "title": "When Taylor Swift Met Her ‘Life of a Showgirl’ Partner Max Martin",
    "link": "https://www.nytimes.com/2025/10/01/arts/music/taylor-swift-max-martin-shellback-showgirl.html",
    "summary": "The pop star and the Swedish producer connected on her 2012 LP, “Red.” They’ve reunited (with his collaborator Shellback) for “The Life of a Showgirl.”"
  },
  {
    "title": "Is James Talarico the Answer to Democratic Prayers?",
    "link": "https://www.nytimes.com/2025/10/01/opinion/james-talarico-religious-left.html",
    "summary": "James Talarico sees a spiritual void at the center of our society."
  },
  {
    "title": "The Refugee’s Gift to Us",
    "link": "https://www.nytimes.com/2025/10/01/opinion/congo-refugee-us-albinism.html",
    "summary": "Orphaned in a massacre in Congo, a onetime elementary school dropout is now an American and can teach us something about resilience."
  },
  {
    "title": "Congress Is Deadlocked on the Shutdown",
    "link": "https://www.nytimes.com/2025/10/01/briefing/congress-shutdown-jane-goodall.html",
    "summary": "Also, Jane Goodall died at 91. Here’s the latest at the end of Wednesday."
  },
  {
    "title": "How Broken Politics Breaks Courts",
    "link": "https://www.nytimes.com/2025/10/01/world/courts-polarized-gaza-flotilla-israel-blockade-jane-goodall.html",
    "summary": "We look at the difficult position of independent courts and judges at a time when countries around the world are deeply divided."
  },
  {
    "title": "Bronx Building Partially Collapses in Public Housing Complex",
    "link": "https://www.nytimes.com/2025/10/01/nyregion/bronx-explosion-building-collapse.html",
    "summary": "Fire officials said a ventilation shaft in a building on Alexander Avenue had fallen in after reports of an explosion. There were no reports of injuries."
  },
  {
    "title": "She Loved Eric Adams. She Kept It a Secret. Now She’s Talking.",
    "link": "https://www.nytimes.com/2025/10/01/nyregion/jasmine-ray-memoir-eric-adams.html",
    "summary": "Jasmine Ray, who served at City Hall in a $160,000-a-year job, had an undisclosed romance with Eric Adams years before he became mayor. In her memoir, she describes their relationship."
  },
  {
    "title": "Judge Dismisses Lawsuit Over Naked Baby on Nirvana’s ‘Nevermind’",
    "link": "https://www.nytimes.com/2025/10/01/arts/music/nirvana-nevermind-baby-lawsuit.html",
    "summary": "The man pictured as a naked baby on the cover of Nirvana’s seminal second album argued that the band had engaged in child sex abuse imagery."
  },
  {
    "title": "‘She Could Have Killed Me’: Scientist Survives Shark Bite to His Head",
    "link": "https://www.nytimes.com/2025/10/01/world/americas/marine-biologist-shark-bite-costa-rica.html",
    "summary": "“My whole head was inside of her mouth,” Mauricio Hoyos, a marine scientist from Mexico, said from a hospital in Costa Rica."
  }
]