[
  {
    "title": "Trump Administration Appeals to Supreme Court to Block Order to Pay Full SNAP Benefits",
    "link": "https://www.nytimes.com/2025/11/07/us/politics/trump-court-food-stamps.html",
    "summary": "The temporary ruling by Justice Ketanji Brown Jackson, blocking a lower court order to fully fund the aid, added to the uncertainty around the nation’s largest anti-hunger program."
  },
  {
    "title": "Judge Blocks National Guard From Portland and Says Trump Overstepped His Authority",
    "link": "https://www.nytimes.com/2025/11/07/us/politics/portland-oregon-national-guard.html",
    "summary": "With her temporary block expiring, Judge Karin Immergut said the Trump administration had failed to prove that protesters were hampering President Trump’s policies."
  },
  {
    "title": "A Light in Very Dark Days: Nancy Pelosi and AIDS",
    "link": "https://www.nytimes.com/2025/11/07/us/politics/nancy-pelosi-aids-lgbtq.html",
    "summary": "As Ms. Pelosi announced her retirement, she was celebrated for her long tenure in Washington. But back home, she was remembered for showing up at a terrifying moment when others turned away."
  },
  {
    "title": "Among Mamdani’s Many Upcoming Challenges: Fixing New York City’s Schools",
    "link": "https://www.nytimes.com/2025/11/08/nyregion/mamdani-public-schools-challenges.html",
    "summary": "Zohran Mamdani, the mayor-elect, will encounter dwindling enrollment, lackluster reading scores and federal officials spoiling for a fight."
  },
  {
    "title": "‘You Are All Terrorists’: Four Months in a Salvadoran Prison",
    "link": "https://www.nytimes.com/2025/11/08/world/americas/el-salvador-prison-migrants.html",
    "summary": "The Times interviewed dozens of migrant men sent to a prison in El Salvador by the Trump administration. Independent forensic analysts called the testimony credible and consistent and said the treatment met the U.N.’s definition of torture."
  },
  {
    "title": "What I Learned From the ‘New Globalists’ of an Optimistic Nation",
    "link": "https://www.nytimes.com/2025/11/08/world/asia/what-i-learned-from-the-new-globalists-of-an-optimistic-nation.html",
    "summary": "Few countries are excited about globalization anymore, but Vietnam is still into it — wholeheartedly. Do the reasons go beyond economic growth?"
  },
  {
    "title": "Trump Aid Cuts Kill More Christians Than Jihadists Do",
    "link": "https://www.nytimes.com/2025/11/08/opinion/trump-christians-nigeria.html",
    "summary": "Murderous attacks on Christians and Muslims alike are a real problem in Nigeria. Cutting humanitarian assistance there is even more lethal."
  },
  {
    "title": "Are Post-Trump Politics Emerging?",
    "link": "https://www.nytimes.com/2025/11/08/opinion/election-results-democrats-republicans.html",
    "summary": "The round table convenes to discuss what comes after the Democrats’ big wins — and whether the “red hat” coalition can recover."
  },
  {
    "title": "Sound System",
    "link": "https://www.nytimes.com/2025/11/08/briefing/sound-system.html",
    "summary": "It can be challenging to discover new music on streaming platforms. Today, some ideas to help you out of a listening rut."
  },
  {
    "title": "Saudi Ex-Intelligence Official Seeks American Help Spilling U.S. Secrets",
    "link": "https://www.nytimes.com/2025/11/08/world/middleeast/saudi-arabia-canada.html",
    "summary": "Saad Aljabri, feuding with the de facto Saudi ruler, wants former U.S. officials to help him fend off Saudi corruption claims."
  },
  {
    "title": "Biden Warns of a ‘Very, Very Dark Moment’ as He Hits Out at Trump",
    "link": "https://www.nytimes.com/2025/11/07/us/politics/biden-trump-omaha-nebraska.html",
    "summary": "The former president, now a far less popular figure in his party, appeared in Nebraska for an overtly political speech that slammed his successor."
  },
  {
    "title": "UPS and FedEx Ground MD-11 Cargo Planes After Louisville Crash",
    "link": "https://www.nytimes.com/2025/11/08/us/ups-fedex-cargo-planes-grounded.html",
    "summary": "Boeing, the plane’s manufacturer, said it had recommended the grounding as a precaution while it conducts further analysis."
  },
  {
    "title": "The DNA Helix Changed How We Thought About Ourselves",
    "link": "https://www.nytimes.com/2025/11/07/science/watson-dna-humanity.html",
    "summary": "“The laws of inheritance are quite unknown,” Charles Darwin acknowledged in 1859. The discovery of DNA’s shape altered how we conceived of life itself."
  }
]