[
  {
    "title": "Abigail Spanberger, in Democratic Response, Asks if Trump Is Working for Americans",
    "link": "https://www.nytimes.com/2026/02/25/us/politics/spanberger-democratic-response-trump-sotu.html",
    "summary": "“We all know the answer is no,” the Virginia governor argued in her rebuttal to President Trump’s State of the Union address."
  },
  {
    "title": "Pentagon Gives Anthropic an Ultimatum Over the Company’s A.I. Model",
    "link": "https://www.nytimes.com/2026/02/24/us/politics/pentagon-anthropic.html",
    "summary": "Anthropic insists on limits on how its technology is used and could be labeled a supply chain risk if it fails to accept the military’s demands."
  },
  {
    "title": "House Narrowly Rejects Air Safety Bill After Pentagon Opposition",
    "link": "https://www.nytimes.com/2026/02/24/us/politics/house-rotor-act-dc-plane-crash.html",
    "summary": "A move to swiftly pass the bill failed by a single vote. It would have required aircraft to carry technology that officials said might have prevented a midair collision near Washington last year."
  },
  {
    "title": "Mexico Is Caught Between Trump and the Cartels",
    "link": "https://www.nytimes.com/2026/02/24/world/americas/trump-sheinbaum-us-mexico-cartel.html",
    "summary": "President Trump has demanded President Claudia Sheinbaum confront the cartels. The killing of El Mencho suggests it might be working — but could come at a cost."
  },
  {
    "title": "What to Know About the Cartels Operating in Mexico",
    "link": "https://www.nytimes.com/2026/02/24/world/americas/mexico-cartels-leaders-el-mencho.html",
    "summary": "Other criminal groups in Mexico may try to take advantage of the death of Nemesio Oseguera Cervantes, also known as El Mencho, who ran the Jalisco New Generation Cartel."
  },
  {
    "title": "Is It Safe to Travel to Mexico Right Now, Given the Cartel Violence?",
    "link": "https://www.nytimes.com/2026/02/24/travel/mexico-tourism-safety-spring-break.html",
    "summary": "A wave of unrest after the killing of a cartel leader has rattled tourists in Mexico, prompting travelers to reconsider their plans. Here’s what to know."
  },
  {
    "title": "Huge Snowball Fight in New York Escalates After Police Arrive",
    "link": "https://www.nytimes.com/2026/02/24/nyregion/nypd-snowball-fight-washington-square-park.html",
    "summary": "Police Commissioner Jessica Tisch said officers had been attacked at Washington Square Park. Mayor Zohran Mamdani said the episode looked like a snowball fight, not a crime."
  },
  {
    "title": "Providence, R.I. Digs Out From Three Feet of Snow",
    "link": "https://www.nytimes.com/2026/02/24/us/providence-rhode-island-snow-totals.html",
    "summary": "A day after the city got a record-breaking amount of snow, some residents clung to the magic. Others were gearing up for endless shoveling."
  },
  {
    "title": "Blizzard Causes Major Airport Delays and Cancellations: What Travelers Should Know",
    "link": "https://www.nytimes.com/2026/02/24/travel/blizzard-snow-storm-airport-delays-cancellations.html",
    "summary": "As major hubs in the Northeast dig out from up to three feet of snow, it could be days before some travelers get moving. Here’s where things stand."
  },
  {
    "title": "Leader of Columbia Brain Institute Quits Over Friendship With Epstein",
    "link": "https://www.nytimes.com/2026/02/25/nyregion/columbia-nobel-winner-epstein-resigns.html",
    "summary": "The Nobel laureate Richard Axel is not accused of wrongdoing but called his association with Jeffrey Epstein a “serious error in judgment.”"
  },
  {
    "title": "In Windsor, Some See Family Drama in the Andrew Accusations",
    "link": "https://www.nytimes.com/2026/02/25/world/europe/windsor-reaction-prince-andrew.html",
    "summary": "“Her children have let her down,” said one woman, referring to Queen Elizabeth II. Andrew Mountbatten-Windsor’s fall from grace drew strong reactions from some. Others said they just did not care."
  },
  {
    "title": "How Jeffrey Epstein Ingratiated Himself With Top Microsoft Executives",
    "link": "https://www.nytimes.com/2026/02/24/technology/jeffrey-epstein-microsoft-executives.html",
    "summary": "For more than two decades, the convicted sex offender developed a network at the tech giant, making him privy to succession discussions and other business."
  },
  {
    "title": "Court Rules Against Justice Dept. Search of Reporter’s Computers",
    "link": "https://www.nytimes.com/2026/02/24/business/media/washington-post-reporter-search-ruling.html",
    "summary": "The judge said the court itself would search the devices, which were seized from a Washington Post reporter’s home last month."
  },
  {
    "title": "Kash Patel’s Olympics Trip Left Plenty of Time for Leisure, Schedule Shows",
    "link": "https://www.nytimes.com/2026/02/24/us/politics/kash-patel-fbi-olympics-milan.html",
    "summary": "An itinerary for Mr. Patel’s trip provides more granular detail, including long segments of personal time that suggest he was not immensely oversubscribed by official duties."
  },
  {
    "title": "D.O.J. Sues U.C.L.A. After It Refused to Pay $1 Billion Fine",
    "link": "https://www.nytimes.com/2026/02/24/us/justice-department-ucla-lawsuit.html",
    "summary": "The Trump administration accused the university’s Los Angeles campus of not doing enough to curb antisemitism, months after the government tried to cut research money and demanded more than $1 billion."
  },
  {
    "title": "Federal Judiciary Asks Congress to Give Over Control of Courthouses",
    "link": "https://www.nytimes.com/2026/02/24/us/politics/federal-judiciary-gsa-courthouses.html",
    "summary": "In a letter to lawmakers, the courts’ policymaking body claimed that the General Services Administration, part of the executive branch, had been slow to make crucial repairs."
  },
  {
    "title": "Abu Dhabi’s State Oil Company Looks Beyond Oil",
    "link": "https://www.nytimes.com/2026/02/25/business/abu-dhabi-oil-energy.html",
    "summary": "Having reshaped the company, Sultan Ahmed Al Jaber wants to expand internationally, particularly in natural gas, chemicals and renewables."
  },
  {
    "title": "After Being Shoved in Front of a Train, He Has Returned to the Subway",
    "link": "https://www.nytimes.com/2026/02/24/nyregion/joseph-lynskey-nyc-subway-shove-lawsuit.html",
    "summary": "Joseph Lynskey was determined to overcome his fear and reclaim his life as a New Yorker who enjoys the city in full. On Tuesday, he filed a lawsuit against the city and the M.T.A."
  },
  {
    "title": "Savannah Guthrie Offers $1 Million for Tip Leading to Mother’s Return",
    "link": "https://www.nytimes.com/2026/02/24/us/savannah-guthrie-one-million-reward-video-mother.html",
    "summary": "In a new video, the “Today” host acknowledged that her 84-year-old mother may already be dead, but said the family was holding out hope for a miracle."
  },
  {
    "title": "Futsal Phenom in Afghanistan Is a Hero the Taliban Didn’t Expect",
    "link": "https://www.nytimes.com/2026/02/25/world/asia/afghanistan-futsal-alizera-ahmadi.html",
    "summary": "A triumph in indoor soccer has turned Alireza Ahmadi, 17, and other players from the Hazara minority, long marginalized in Afghanistan, into national heroes."
  },
  {
    "title": "BAFTAs 2026 Outburst: What Tourette’s Tics Feel Like",
    "link": "https://www.nytimes.com/2026/02/24/well/mind/tourettes-bafta-john-davidson.html",
    "summary": "Verbal or physical tics can be a daily struggle. So can dealing with the hurt they may cause."
  },
  {
    "title": "John Roberts Is Losing Patience With Trump",
    "link": "https://www.nytimes.com/2026/02/24/opinion/tariffs-trump-john-roberts.html",
    "summary": "How to read the gratuitous paragraph in the chief justice’s tariff opinion."
  },
  {
    "title": "No, the Dollar Is Not Dying",
    "link": "https://www.nytimes.com/2026/02/25/opinion/us-dollar-china-currency-eu.html",
    "summary": "The currency is stumbling, by many accounts. But the narrative is false."
  },
  {
    "title": "Paramount Raises Its Bid for Warner Bros. Discovery",
    "link": "https://www.nytimes.com/2026/02/24/business/paramount-netflix-warner-bros-discovery.html",
    "summary": "Warner Bros. Discovery said Paramount’s new offer of $31 a share could lead to a “superior proposal” to the deal it signed with Netflix."
  },
  {
    "title": "Judge Dismisses Minnesota Gun Case as Prosecutors Struggle With Resignations",
    "link": "https://www.nytimes.com/2026/02/24/us/minnesota-gun-case-dismissed.html",
    "summary": "A judge took the unusual step of dropping the case over a speedy trial violation by the U.S. attorney’s office in Minnesota, which has been flooded with immigration-related cases."
  },
  {
    "title": "Éliane Radigue, Composer of Time, Silence and Space, Dies at 94",
    "link": "https://www.nytimes.com/2026/02/24/arts/music/eliane-radigue-dead.html",
    "summary": "Her Tibetan Buddhist spiritual practice and her experiments with synthesizers came together in vast, slow-moving works that drew wide acclaim."
  },
  {
    "title": "Mr. Clean, the Bald, Broad-Shouldered Cleaning Mascot, Retires",
    "link": "https://www.nytimes.com/2026/02/24/us/mr-clean-retires-magic-eraser.html",
    "summary": "The character became the face of a household cleaner in 1958. It’s not clear what the brand plans for its next mascot."
  }
]