[
  {
    "title": "Eric Adams Abandons Re-election Bid for Mayor of New York City",
    "link": "https://www.nytimes.com/2025/09/28/nyregion/adams-mayor-drops-out.html",
    "summary": "Mayor Adams’s campaign was left foundering after repeated scandals, a federal indictment and his courtship of President Trump."
  },
  {
    "title": "With Scant Information, Federal Workers Brace for Possible Shutdown",
    "link": "https://www.nytimes.com/2025/09/28/us/politics/federal-government-shutdown-trump.html",
    "summary": "After a tumultuous year of staffing cuts, government employees now face the prospect of going without pay — or facing even more layoffs."
  },
  {
    "title": "What Travelers Need to Know About the Possible Government Shutdown",
    "link": "https://www.nytimes.com/2025/09/28/travel/government-shutdown-airports-national-parks.html",
    "summary": "A federal work stoppage could bring longer lines at the airport, national park closures, and significant losses in tourism revenue."
  },
  {
    "title": "Greene, Straying From Trump, Reflects an Emerging MAGA Split",
    "link": "https://www.nytimes.com/2025/09/28/us/politics/marjorie-taylor-greene-maga-split.html",
    "summary": "The right-wing Republican congresswoman from Georgia has grown disillusioned with her own party and with President Trump, and increasingly willing to say so."
  },
  {
    "title": "Inside the Trump Administration’s Push to Prosecute James Comey",
    "link": "https://www.nytimes.com/2025/09/27/us/politics/trump-comey-justice-department.html",
    "summary": "President Trump’s campaign of retribution began to intensify in mid-July and hit a fever pitch over the last week, culminating in the indictment of one of his foremost enemies."
  },
  {
    "title": "Trump Plans to Attend Gathering of U.S. Military Officers",
    "link": "https://www.nytimes.com/2025/09/28/us/politics/trump-hegseth-military.html",
    "summary": "Defense Secretary Pete Hegseth summoned hundreds of generals and admirals from around the world for an unusual gathering."
  },
  {
    "title": "Trump Says He Has Ordered Troops to Portland, Oregon, to Protect ICE Facilities",
    "link": "https://www.nytimes.com/2025/09/27/us/politics/trump-portland-troops.html",
    "summary": "The president characterized Immigration and Customs Enforcement facilities as being under siege from domestic terrorists."
  },
  {
    "title": "Forget Labubus: We’re Collecting Semi-Cured Gel Nail Strips",
    "link": "https://www.nytimes.com/2025/09/28/business/semi-cured-gel-nails-manicures.html",
    "summary": "The strips feature intricate designs and can be applied at a fraction of the cost of a salon visit. People are collecting them by the hundreds."
  },
  {
    "title": "Fear and Hope in Venezuela as U.S. Warships Lurk",
    "link": "https://www.nytimes.com/2025/09/28/world/americas/venezuela-mood.html",
    "summary": "On a visit to Venezuela, The Times found a nation bracing for potential U.S. military action."
  },
  {
    "title": "What the Public Memory of Charlie Kirk Revealed",
    "link": "https://www.nytimes.com/2025/09/28/magazine/charlie-kirk-rhetoric.html",
    "summary": "For those who felt denigrated by his rhetoric, the bipartisan tributes to him as a champion of free speech augured something dangerous: the mainstreaming of formerly extremist views."
  },
  {
    "title": "A Stranger Shattered Their Lives. At First, They Didn’t Know Why.",
    "link": "https://www.nytimes.com/2025/09/28/us/phillip-adams-cte.html",
    "summary": "A family reckons with the devastation left behind after a former N.F.L. player showed up on their property."
  },
  {
    "title": "What Salt Typhoon Shows About the Cyber Power of China’s Spy Agency",
    "link": "https://www.nytimes.com/2025/09/28/world/asia/how-chinas-secretive-spy-agency-became-a-cyber-powerhouse.html",
    "summary": "Fears of U.S. surveillance drove Xi Jinping, China’s leader, to elevate the agency and put it at the center of his cyber ambitions."
  },
  {
    "title": "Russia Hammers Kyiv in 12-Hour Drone and Missile Assault",
    "link": "https://www.nytimes.com/2025/09/28/world/europe/ukraine-kyiv-russia-strikes.html",
    "summary": "At least four people were killed in the attack, which also wounded dozens of civilians in the capital and around the country."
  },
  {
    "title": "For Many Moldovans, Their Election Is a Choice Between Russia and the E.U.",
    "link": "https://www.nytimes.com/2025/09/28/world/europe/moldova-election-russia-eu.html",
    "summary": "Parliamentary elections in this nation bordering Ukraine come at a critical moment in Moldova’s push for European Union membership."
  },
  {
    "title": "Forget ‘Love Island.’ Tennessee Has an Isle of Goats.",
    "link": "https://www.nytimes.com/2025/09/22/climate/climate-tennessee-goats-invasives.html",
    "summary": "Eco-grazing goats help clear overgrowth worldwide. But rare is the herd that has to get to work by boat."
  },
  {
    "title": "For His Enemies, the Law",
    "link": "https://www.nytimes.com/2025/09/28/opinion/comey-indictment-trump.html",
    "summary": "The political prosecution of James Comey."
  },
  {
    "title": "Ta-Nehisi Coates on Bridging Gaps vs. Drawing Lines",
    "link": "https://www.nytimes.com/2025/09/28/opinion/ezra-klein-podcast-ta-nehisi-coates.html",
    "summary": "The writer Ta-Nehisi Coates joins Ezra Klein on the show to discuss how the left should think about the work of politics and persuasion in this moment."
  },
  {
    "title": "A New Approach to Awe",
    "link": "https://www.nytimes.com/2025/09/28/briefing/a-new-approach-to-awe.html",
    "summary": "A psychologist argues that the sensation is not mysterious, but rather an emotion that scientists can detect."
  },
  {
    "title": "Were You Assigned Full Books to Read in High School English? Tell Us.",
    "link": "https://www.nytimes.com/2025/09/24/us/education-books-callout.html",
    "summary": "We’re asking because the reading scores of American 12th graders are at record lows."
  },
  {
    "title": "Des Moines Schools Superintendent Arrested By ICE Is Placed on Leave",
    "link": "https://www.nytimes.com/2025/09/27/us/des-moines-schools-superintendent-ice-leave.html",
    "summary": "School Board members in Iowa’s capital made the decision one day after immigration officials accused the superintendent, Ian Roberts, of being in the country illegally."
  },
  {
    "title": "Russell Nelson, Who Led Major Changes to the Mormon Church, Dies at 101",
    "link": "https://www.nytimes.com/2025/09/28/obituaries/russell-m-nelson-dead.html",
    "summary": "He left a career as a pioneering surgeon to become a church leader, diversifying its policies and its senior ranks. He became its president at 93."
  },
  {
    "title": "Bar Shooting in Southport, N.C., Leaves 3 Dead and 8 Injured",
    "link": "https://www.nytimes.com/2025/09/28/us/north-carolina-boat-shooting.html",
    "summary": "At least five others were wounded in the shooting, which the police described as a “highly premeditated” attack on an outdoor bar popular with tourists. A suspect was in custody."
  }
]