[
  {
    "title": "Trump’s Foreign Policy: Resurrecting Empire",
    "link": "https://www.nytimes.com/2026/02/27/us/politics/trump-rubio-foreign-policy-empire.html",
    "summary": "President Trump’s approach is a revival of the mission of empire — acquiring the territories and resources of sovereign peoples."
  },
  {
    "title": "Fact-check: In Trump’s Case for an Attack on Iran, False or Unproven Claims",
    "link": "https://www.nytimes.com/2026/02/26/us/politics/trump-iran-claims-nuclear-weapons.html",
    "summary": "Key elements of the Trump administration’s arguments this week for another military campaign against Iran do not hold up."
  },
  {
    "title": "With Possible Iran Strike Looming, U.S. Says Staff Can Leave Israel, and Urges Speed",
    "link": "https://www.nytimes.com/2026/02/27/world/middleeast/us-embassy-jerusalem-authorized-departure.html",
    "summary": "In an email to embassy workers Friday morning, Ambassador Mike Huckabee warned them that if they wanted to leave Israel, they “should do so TODAY.”"
  },
  {
    "title": "In a New War, Would Israel Run Out of Missile Interceptors?",
    "link": "https://www.nytimes.com/2026/02/27/world/middleeast/israel-stockpile-missile-interceptors.html",
    "summary": "The June 2025 conflict with Iran depleted Israeli and U.S. stocks of antiballistic missiles. If there is another war, the pressure will be on to destroy Iranian missiles before they can be launched."
  },
  {
    "title": "The Clintons’ Epstein Testimony, and the Pentagon’s New Laser Strike",
    "link": "https://www.nytimes.com/2026/02/27/podcasts/the-headlines/clinton-epstein-testimony-laser-strike-pentagon.html",
    "summary": "Plus, the company that just cut 4,000 jobs because of A.I."
  },
  {
    "title": "Elon Musk’s Secret Web of Companies in Texas",
    "link": "https://www.nytimes.com/2026/02/27/technology/elon-musk-companies-texas.html",
    "summary": "The megabillionaire was tied to about 90 companies in the state, which he uses for everything from paying nannies to buying land to supporting Donald Trump’s re-election, according to a Times examination."
  },
  {
    "title": "A World Where All Is Free? That’s Elon Musk’s Theory of ‘Sustainable Abundance.’",
    "link": "https://www.nytimes.com/2026/02/27/business/a-world-where-all-is-free-thats-elon-musks-theory-of-sustainable-abundance.html",
    "summary": "The Tesla and SpaceX chief has told his followers that they will live in a world where robots will take care of every need and people do not have to work, in what has become his latest slogan."
  },
  {
    "title": "Pakistan Strikes Afghanistan in ‘Open War’ Against Taliban Regime",
    "link": "https://www.nytimes.com/2026/02/26/world/asia/pakistan-afghanistan-taliban.html",
    "summary": "The airstrikes came hours after Afghan troops had attacked Pakistani border positions and follow months of worsening relations between the neighboring countries."
  },
  {
    "title": "Why Are Pakistan and Afghanistan Fighting?",
    "link": "https://www.nytimes.com/2026/02/27/world/asia/afghanistan-pakistan-taliban-airstrikes.html",
    "summary": "The renewed violence between the neighboring countries stems from Pakistan’s accusations that Afghanistan’s Taliban government has harbored a militant group."
  },
  {
    "title": "Netflix Backs Out of Bid for Warner Bros., Paving Way for Paramount Takeover",
    "link": "https://www.nytimes.com/2026/02/26/business/warner-bros-discovery-paramount-deal-netflix.html",
    "summary": "The move was a stunning development in the long-running corporate battle for the storied media giant."
  },
  {
    "title": "What Larry and David Ellison Would Own After Warner Bros. Takeover",
    "link": "https://www.nytimes.com/2026/02/27/business/media/tech-tv-movies-and-news-ellisons-on-brink-of-colossal-empire.html",
    "summary": "If Paramount can close its deal to buy Warner Bros. Discovery, Larry and David Ellison will influence nearly every corner of news, entertainment and tech."
  },
  {
    "title": "For CNN, a Takeover by Paramount Means a Suddenly Uncertain Future",
    "link": "https://www.nytimes.com/2026/02/27/business/media/cnn-paramount-david-ellison.html",
    "summary": "Paramount’s apparent victory over Netflix in securing Warner Bros. Discovery has led to concerns within the CNN newsroom."
  },
  {
    "title": "‘Fast Car’ Changed Luke Combs’s Life. He’s Back for More Hits.",
    "link": "https://www.nytimes.com/2026/02/26/arts/music/luke-combs-interview.html",
    "summary": "The country singer helped to usher the genre into the streaming era before taking a step back. On his new album, he wants to go for broke."
  },
  {
    "title": "Pentagon Fires Another Laser at Drone, Prompting New Air Closure",
    "link": "https://www.nytimes.com/2026/02/26/us/drone-faa-dhs-el-paso-airspace.html",
    "summary": "After the downing of a Customs and Border Protection drone, the F.A.A. closed the airspace above Fort Hancock, Texas."
  },
  {
    "title": "Trump Declared Victory in Minneapolis. But What Did He Accomplish?",
    "link": "https://www.nytimes.com/2026/02/26/us/politics/trump-minneapolis-ice-immigration.html",
    "summary": "The Trump administration came under fire for an operation that turned lethal and politically toxic. But the show of force may also have had a bigger purpose: to serve as a warning."
  },
  {
    "title": "Federal Judge Accuses Trump Administration of Repeatedly Disobeying Orders",
    "link": "https://www.nytimes.com/2026/02/26/us/minnesota-judge-ice-immigration.html",
    "summary": "The federal judge identified 210 orders issued in 143 cases in Minnesota in which he said Immigration and Customs Enforcement officials had not complied with court orders."
  },
  {
    "title": "Trump Ally Expands Inquiry of Former Officials Who Investigated the President",
    "link": "https://www.nytimes.com/2026/02/26/us/trump-investigations-miami-prosecutor.html",
    "summary": "The office of a prosecutor based in Miami has issued new subpoenas in a wide-ranging inquiry aimed at President Trump’s perceived foes."
  },
  {
    "title": "Regime Change in Cuba Appeals to Trump but Carries Risks",
    "link": "https://www.nytimes.com/2026/02/26/us/politics/trump-cuba-regime-change.html",
    "summary": "The Trump administration is signaling a different approach, after demanding an end to Cuba’s communist leadership."
  },
  {
    "title": "After a Speedboat Shootout in Cuba, There are More Questions Than Answers",
    "link": "https://www.nytimes.com/2026/02/26/world/americas/cuba-gunfight-boat-miami.html",
    "summary": "The Cuban government’s account of a supposed armed raid into its territory was called into question after one of the men identified as being on the boat turned up in Miami."
  },
  {
    "title": "Anthropic Says It Cannot ‘Accede’ to Pentagon in Talks Over A.I.",
    "link": "https://www.nytimes.com/2026/02/26/technology/anthropic-pentagon-talks-ai.html",
    "summary": "Anthropic said it was standing firm on not having its A.I. used in certain scenarios by the Pentagon, which has imposed a Friday deadline on the company to give unfettered access to its technology."
  },
  {
    "title": "Hillary Clinton Denies Knowing Epstein or His Crimes in a Tense Deposition",
    "link": "https://www.nytimes.com/2026/02/26/us/politics/hillary-clinton-epstein-deposition-lauren-boebert.html",
    "summary": "After resisting testifying for months, the former secretary of state entered the session defiant, and grew irate after a Republican leaked a photo from inside the room."
  },
  {
    "title": "Justice Department Exposed Cooperating Witnesses in Epstein Files",
    "link": "https://www.nytimes.com/2026/02/26/nyregion/epstein-cooperating-witnesses-redaction-error.html",
    "summary": "The disclosure is the latest example of how the urgent push to release the files led to the government publicizing information it would normally keep under wraps."
  },
  {
    "title": "What Does ‘Complicity’ Mean for Epstein’s Friends, and Mere Acquaintances?",
    "link": "https://www.nytimes.com/2026/02/27/style/epstein-friends-associates-complicity.html",
    "summary": "Philosophers have long wrestled with what to do about the onlookers and profiteers surrounding those who have done terrible things."
  },
  {
    "title": "U.S. Birthrate Declines to an All-Time Low, but There’s a Story of Success",
    "link": "https://www.nytimes.com/2026/02/27/us/politics/us-birthrate-decline-women.html",
    "summary": "The political class is worried about the historic drop. But the biggest change is among the youngest women, who are the least ready to have children."
  },
  {
    "title": "Will World Cup Games in Mexico Be Affected by Cartel Boss Killing?",
    "link": "https://www.nytimes.com/2026/02/26/world/americas/mexico-world-cup-safety.html",
    "summary": "Safety questions linger since the country is set to host matches in the world’s largest sporting event, the FIFA World Cup."
  },
  {
    "title": "Chris Fleming Uses Dance to Make Us Laugh in His HBO Special",
    "link": "https://www.nytimes.com/2026/02/27/arts/television/chris-fleming.html",
    "summary": "The kind of performer other stand-ups rave about, Chris Fleming turns to choreography to land jokes in his new HBO special."
  },
  {
    "title": "What Both Anthropic and the Pentagon Get Wrong",
    "link": "https://www.nytimes.com/2026/02/27/opinion/anthropic-pentagon-ai-defense.html",
    "summary": "Neither Anthropic nor the Pentagon are thinking about this issue in a meaningful way."
  },
  {
    "title": "Trump’s Shields Are Down",
    "link": "https://www.nytimes.com/2026/02/27/opinion/trump-cabinet-noem-bondi-hegseth-lutnick.html",
    "summary": "Personnel once meant policy; now it means flattery."
  },
  {
    "title": "The Plunging Birthrate",
    "link": "https://www.nytimes.com/2026/02/27/briefing/the-plunging-birthrate.html",
    "summary": "We asked women about their views on having kids."
  },
  {
    "title": "Late Night Lampoons Trump’s State of the Union Ratings",
    "link": "https://www.nytimes.com/2026/02/27/arts/television/late-night-trump-state-of-the-union-ratings.html",
    "summary": "Stephen Colbert joked that the president “is really dragging down broadcast television” with lower ratings for Tuesday’s State of the Union than last year’s address."
  },
  {
    "title": "Green Party Defeats Labour in U.K. Special Election, in Blow to Starmer",
    "link": "https://www.nytimes.com/2026/02/26/world/europe/gorton-denton-result-green-party-labour.html",
    "summary": "The result marks the first time the Greens have won a British parliamentary by-election and signals the frustration of left-leaning voters with Prime Minister Keir Starmer."
  },
  {
    "title": "Why Estrogen Patches For Menopause Are So Hard to Find",
    "link": "https://www.nytimes.com/2026/02/26/well/estrogen-patches-menopause-treatment.html",
    "summary": "Changing attitudes around menopause treatment have driven up demand for hormone therapy."
  },
  {
    "title": "Hungary Plays the Spoiler in Europe, as Orban Seeks Votes at Home",
    "link": "https://www.nytimes.com/2026/02/27/world/europe/hungary-orban-europe.html",
    "summary": "Facing a serious election challenge, Prime Minister Viktor Orban is holding up a big E.U. loan for Ukraine. Analysts say the timing is no coincidence."
  },
  {
    "title": "Germany’s Oil and Gas Output Is Dwindling as Prices Rise",
    "link": "https://www.nytimes.com/2026/02/27/business/germanys-oil-and-gas-output-is-dwindling-as-prices-rise.html",
    "summary": "Natural gas production in Germany has fallen about 80 percent in the past two decades even as the country seeks to replace flows from Russia."
  }
]