[
  {
    "title": "U.S. Military Moves Into Place for Possible Strikes in Iran",
    "link": "https://www.nytimes.com/2026/02/18/us/politics/us-military-iran.html",
    "summary": "President Trump has given no indication that he has made a decision about how to proceed, as diplomatic talks continue."
  },
  {
    "title": "Satellite Feature on iPhone Allowed Skiers to Seek Help After Avalanche",
    "link": "https://www.nytimes.com/2026/02/18/us/apple-iphone-sos-satellite-rescue.html",
    "summary": "The Emergency SOS feature on iPhones can send texts to emergency responders via satellite when there is no cell tower nearby."
  },
  {
    "title": "As ICE Buys Up Warehouses, Even Some Trump Voters Say No",
    "link": "https://www.nytimes.com/2026/02/18/us/politics/ice-warehouses-trump-voters.html",
    "summary": "The agency is ramping up arrests, but local pushback is complicating efforts to expand detention capacity and prevent overcrowding."
  },
  {
    "title": "A Case Against 6 Democrats Lacked Urgency. Then Came a Swift Bid for an Indictment.",
    "link": "https://www.nytimes.com/2026/02/18/us/politics/pirro-inquiry-video-democratic-lawmakers.html",
    "summary": "Prosecutors have been repeatedly caught between the president’s insistence that they undertake weak or baseless cases and the necessity of having to go to court."
  },
  {
    "title": "Administration Targets Noncitizen Voting, Despite Finding It Rare",
    "link": "https://www.nytimes.com/2026/02/18/us/politics/voting-trump-immigrants-midterms.html",
    "summary": "The intensified push is part of an extraordinary all-fronts effort to insert federal law enforcement into the machinery of American elections ahead of the midterms."
  },
  {
    "title": "Colorado Democrats Push to Rip Up 2028 House Map for an Extra Edge",
    "link": "https://www.nytimes.com/2026/02/18/us/politics/colorado-redistricting-house-map-2028.html",
    "summary": "A proposed ballot measure to give Democrats more seats for the 2028 and 2030 elections signals that the nation’s gerrymandering fight is likely to persist for years."
  },
  {
    "title": "Texas Election Season Heats Up as Early Voting in Senate Primaries Begins",
    "link": "https://www.nytimes.com/2026/02/18/us/politics/texas-elections-senate-primary.html",
    "summary": "Both parties’ Senate primary races are kicking into high gear."
  },
  {
    "title": "Kansas, Idaho, Utah, Oklahoma in New Push to Restrict Transgender Rights",
    "link": "https://www.nytimes.com/2026/02/18/us/republican-states-transgender-rights-restrictions.html",
    "summary": "In states that once focused mainly on health care and sports for transgender minors, debates now revolve around the validity of transgender identity."
  },
  {
    "title": "After Activist’s Killing, Tensions Erupt Between France’s Far-Right and Far-Left",
    "link": "https://www.nytimes.com/2026/02/18/world/europe/france-beating-activist-far-left-right.html",
    "summary": "The beating death of Quentin Deranque has quickly become a flashpoint between the far right and far left as France prepares for local elections next month and presidential elections next year."
  },
  {
    "title": "Donald J. Trump International Airport? The President’s Company Trademarked It.",
    "link": "https://www.nytimes.com/2026/02/18/us/politics/trump-trademark-airport-name.html",
    "summary": "The Trump organization said the move was necessary to protect the brand as Florida prepares to rename an airport after the president."
  },
  {
    "title": "Mark Zuckerberg Takes the Stand in Social Media Addiction Trial",
    "link": "https://www.nytimes.com/2026/02/18/technology/mark-zuckerberg-tech-addiction-trial.html",
    "summary": "Meta’s chief executive said users spent a lot of time on Instagram because of its value, as he was grilled about child safety issues in front of a jury."
  },
  {
    "title": "In Guthrie Mystery, Rampant Speculation Is Like ‘Salt on the Open Wound’",
    "link": "https://www.nytimes.com/2026/02/18/us/nancy-guthrie-kidnapping-theories-true-crime.html",
    "summary": "True crime obsessives, internet theorizers and livestreamers are complicating the investigation of the kidnapping of Nancy Guthrie, the mother of the “Today” show host Savannah Guthrie."
  },
  {
    "title": "Defense Department and Anthropic Square Off in Dispute Over A.I. Safety",
    "link": "https://www.nytimes.com/2026/02/18/technology/defense-department-anthropic-ai-safety.html",
    "summary": "How artificial intelligence will be used in future battlefields is an issue that has turned increasingly political and may put Anthropic in a bind."
  },
  {
    "title": "Decoding the A.I. Beliefs of Anthropic and Its C.E.O., Dario Amodei",
    "link": "https://www.nytimes.com/2026/02/18/technology/anthropic-dario-amodei-effective-altruism.html",
    "summary": "The company is at odds with the Pentagon over how its A.I. will be used. The conflict has its roots in the foundational plan for Anthropic."
  },
  {
    "title": "What Do A.I. Chatbots Discuss Among Themselves? We Sent One to Find Out.",
    "link": "https://www.nytimes.com/2026/02/18/upshot/moltbook-artificial-intelligence-ai.html",
    "summary": "We interviewed our bot about what it learned on Moltbook, the A.I.-only social network."
  },
  {
    "title": "Can Love Be Addictive? Many Say Yes — and It’s Changing Our Idea of Romance.",
    "link": "https://www.nytimes.com/2026/02/18/magazine/love-addiction-disorder-explained.html",
    "summary": "Poems and songs say love should be world-shattering. The logic of love addiction suggests that it shouldn’t."
  },
  {
    "title": "Ethan Hawke on ‘Blue Moon,’ ‘Reality Bites’ and the Lessons He’s Learned",
    "link": "https://www.nytimes.com/2026/02/18/movies/ethan-hawke-blue-moon-interview.html",
    "summary": "A best actor Oscar contender for “Blue Moon,” the star reflects on turbulent times in Hollywood and the notion of selling out: “I think about it constantly.”"
  },
  {
    "title": "With a New Oscar on the Line, How Do You Judge Casting?",
    "link": "https://www.nytimes.com/2026/02/18/movies/casting-oscar-marty-supreme.html",
    "summary": "Contenders say the criteria for judging the category can vary from, say, the number of newcomers to the seamlessness of the ensemble."
  },
  {
    "title": "Kennedy’s MAHA Coalition Is a Mess",
    "link": "https://www.nytimes.com/2026/02/18/opinion/kennedy-maha-moderna.html",
    "summary": "A political movement cannot survive on spite alone."
  },
  {
    "title": "One Man Stole $660 Million. He’ll Never Pay It Back.",
    "link": "https://www.nytimes.com/2026/02/18/opinion/corruption-trump-accountability.html",
    "summary": "Ordinary citizens have a range of legal tools to hold the rich and politically connected accountable."
  },
  {
    "title": "An Avalanche Near Lake Tahoe Kills at Least 8",
    "link": "https://www.nytimes.com/2026/02/18/briefing/an-avalanche-near-lake-tahoe-kills-at-least-8.html",
    "summary": "Also, Mark Zuckerberg takes the stand. Here's the latest at the end of Wednesday."
  },
  {
    "title": "How Intense Should Love Really Be? We Want to Hear Your Thoughts.",
    "link": "https://www.nytimes.com/2026/02/18/magazine/love-addiction-thoughts.html",
    "summary": "Have you ever been called a “love addict?” Ever suspected somebody else was?"
  },
  {
    "title": "Leslie Wexner Says Epstein ‘Conned’ Him, but Democrats Are Skeptical",
    "link": "https://www.nytimes.com/2026/02/18/us/politics/wexner-epstein-deposition.html",
    "summary": "House Republicans skipped a deposition with Leslie Wexner, the retail billionaire, and Democrats said his answers were not credible."
  },
  {
    "title": "Shipwreck Found at the Bottom of Lake Michigan After Nearly 150 Years",
    "link": "https://www.nytimes.com/2026/02/18/us/shipwreck-lac-la-belle-discovered-lake-michigan.html",
    "summary": "The steamer Lac La Belle, which was carrying passengers and cargo, sank in a storm in 1872. Eight people died when one of its lifeboats capsized."
  },
  {
    "title": "Mamdani to Reinstitute Homeless Encampment Sweeps",
    "link": "https://www.nytimes.com/2026/02/18/nyregion/homeless-encampment-mamdani-nyc.html",
    "summary": "Mayor Zohran Mamdani will place the Department of Homeless Services in charge of the sweeps, replacing the Police Department as leader of the interagency efforts."
  },
  {
    "title": "Journalists Arrested in Cameroon While Covering Secretive U.S. Deportations",
    "link": "https://www.nytimes.com/2026/02/18/world/africa/cameroon-journalists-arrested-deportees.html",
    "summary": "An Associated Press reporter was hit and held with three other journalists and a lawyer, two detainees said, while at a center for migrants secretively deported from the United States."
  }
]