[
  {
    "title": "Lashing Out Over Russia and Jobs Data, Trump Displays His Volatile Side",
    "link": "https://www.nytimes.com/2025/08/02/us/politics/trump-russia-jobs.html",
    "summary": "The president had been on something of a winning streak. But when faced with facts and foes that wouldn’t bend to his will, he responded with impatience and disproportionate intensity."
  },
  {
    "title": "Trump Fires BLS Commissioner, Claiming Weak Jobs Numbers Were ‘Rigged’",
    "link": "https://www.nytimes.com/2025/08/01/business/economy/trump-bls-firing-jobs-report.html",
    "summary": "Economists said ousting the head of the Bureau of Labor Statistics could undermine confidence in government economic data."
  },
  {
    "title": "Donor List Suggests Scale of Trump’s Pay-for-Access Operation",
    "link": "https://www.nytimes.com/2025/08/02/us/politics/donor-list-suggests-scale-of-trumps-pay-for-access-operation.html",
    "summary": "A new disclosure shows how corporations and individuals, including many in the crypto business, wrote big checks while seeking favor from the president."
  },
  {
    "title": "States Have More Data About You Than the Feds Do. Trump Wants to See It.",
    "link": "https://www.nytimes.com/2025/08/01/upshot/trump-states-data-privacy.html",
    "summary": "Critics fear that personal data might be used to monitor immigrants and political foes, and to spread false tales of fraud."
  },
  {
    "title": "After a Lag, Consumers Begin to Feel the Pinch of Tariffs",
    "link": "https://www.nytimes.com/2025/08/02/business/trump-tariffs-consumer-prices.html",
    "summary": "There are growing signs that President Trump’s levies are filtering through to consumer prices, as companies exhaust options for keeping them stable."
  },
  {
    "title": "Trade Fueled Inequality. Can Trump’s Tariffs Reduce It?",
    "link": "https://www.nytimes.com/2025/08/02/business/economy/trump-tariffs-income-inequality.html",
    "summary": "The president has pitched his trade policies at workers who feel left behind by globalization. But that doesn’t mean trade barriers will revive factories and close income gaps."
  },
  {
    "title": "Mike Huckabee, Israel’s Passionate Defender as Gaza War Drives Allies Away",
    "link": "https://www.nytimes.com/2025/08/02/world/middleeast/israel-huckabee.html",
    "summary": "Mr. Huckabee, a Baptist minister, is the first evangelical to serve as American ambassador to Israel. Christian conservatives and the Netanyahu government are pleased."
  },
  {
    "title": "U.S. Victims of Hamas and Hezbollah Attacks Sue UNRWA",
    "link": "https://www.nytimes.com/2025/08/02/world/middleeast/unrwa-hamas-hezbollah-lawsuit.html",
    "summary": "Relatives of people killed in terrorist attacks accuse the agency that aids Palestinians of providing support to the armed groups."
  },
  {
    "title": "Texas Pushes Redistricting Into an Era of ‘Maximum Warfare’",
    "link": "https://www.nytimes.com/2025/08/02/us/politics/texas-redistricting-democrats-republicans-midterms.html",
    "summary": "Republicans are pursuing every possible advantage, essentially trying to win elections long before people vote. In response, even some once-squeamish Democrats are talking about fighting ‘fire with fire.’"
  },
  {
    "title": "How the New Texas Map Changes the Outlook for Control of the House",
    "link": "https://www.nytimes.com/2025/08/02/upshot/texas-map-redistricting-republicans-house.html",
    "summary": "Democrats’ chances would be hurt if the map were approved, but they would still be favored."
  },
  {
    "title": "What J.M.W. Turner Saw, and What We Still Can See",
    "link": "https://www.nytimes.com/2025/08/01/arts/design/jmw-turner-anniversary-uk.html",
    "summary": "In the 250 years since the artist was born, the natural world he loved so much has changed. But he still reminds us to look with truth, clarity, and feeling."
  },
  {
    "title": "Judges Keep Restrictions on Los Angeles Immigration Arrests",
    "link": "https://www.nytimes.com/2025/08/02/us/los-angeles-immigration-raids-ruling.html",
    "summary": "An appellate panel upheld a finding that federal agents appeared to rely exclusively on race and other factors, such as speaking Spanish, in making arrests."
  },
  {
    "title": "An American Team Went to Combat Haiti’s Gangs, Then Lost Two of Its Own",
    "link": "https://www.nytimes.com/2025/08/02/us/americans-kidnapped-haiti-gangs-studebaker.html",
    "summary": "A Haitian American Navy veteran and his police officer cousin who were working in Haiti with Studebaker, an American military contractor, are missing and presumed dead."
  },
  {
    "title": "No Pets Left Behind: How a Dog’s Hurricane Rescue Changed Florida Law",
    "link": "https://www.nytimes.com/2025/08/02/us/trooper-dog-florida-law-hurricane-milton.html",
    "summary": "A state trooper went to the aid of a bull terrier who had been abandoned as Hurricane Milton approached. Now the dog, named Trooper, is thriving, and his story inspired stricter animal protections."
  },
  {
    "title": "Before D.C. Crash, Fates of 2 Pilots and Air Traffic Controller Entwined",
    "link": "https://www.nytimes.com/2025/08/01/us/politics/dc-plane-helicopter-crash.html",
    "summary": "Documents released in the inquiry into the deadly midair collision over the Potomac River on Jan. 29 reveal new details about three people whose decisions shaped the outcome of the disaster."
  },
  {
    "title": "Army Pilots Might Have Struggled to See Passenger Jet Before D.C. Crash",
    "link": "https://www.nytimes.com/2025/08/01/us/politics/army-pilots-jet-crash.html",
    "summary": "Light pollution from Washington and the passenger jet’s dim lights might have contributed to difficulties spotting American Airlines Flight 5342 before the collision on Jan. 29, Army experts said."
  },
  {
    "title": "A Bid to Undo a Colonial-Era Wrong Touches a People’s Old Wounds",
    "link": "https://www.nytimes.com/2025/08/02/world/asia/india-naga-repatriation-remains-museum.html",
    "summary": "An Oxford museum’s collection of objects taken from the Naga people includes human remains. What to do with them now is not a simple matter."
  },
  {
    "title": "Triangles, Crescents, Slivers: Can Odd-Shaped Lots Help Ease the Housing Crisis?",
    "link": "https://www.nytimes.com/2025/08/02/business/housing-crisis-odd-lots.html",
    "summary": "As needs escalate, more U.S. cities and states are making it easier to build on irregular and long-overlooked lots."
  },
  {
    "title": "Leaving the City for the Farm Is a Hard Row to Hoe. But They Did It.",
    "link": "https://www.nytimes.com/2025/08/02/realestate/how-to-become-a-farmer.html",
    "summary": "We spoke with several Sullivan County farmers about the urban lives they left behind, and what it means to tend the land in the 21st century."
  },
  {
    "title": "Attention, Men: Books Are Sexy!",
    "link": "https://www.nytimes.com/2025/08/02/opinion/reading-men-fiction-sexy.html",
    "summary": "Nobody likes a dumb guy."
  },
  {
    "title": "Why Starvation in Gaza Has Reached a Tipping Point",
    "link": "https://www.nytimes.com/2025/08/02/opinion/gaza-famine-trump-maga-israel.html",
    "summary": "And what it could mean for the future of the conflict in the Middle East."
  },
  {
    "title": "A Letter to the Future",
    "link": "https://www.nytimes.com/2025/08/02/briefing/a-letter-to-the-future.html",
    "summary": "Writing yourself a letter is a good way to identify the things in your life that matter — as well as those things that you can let go."
  },
  {
    "title": "4 Dead in Anaconda, Montana, Bar Shooting; Police Search for Gunman",
    "link": "https://www.nytimes.com/2025/08/01/us/montana-anaconda-shooting.html",
    "summary": "Law enforcement officials were looking for the suspect, who lived close to the bar in the town of Anaconda, the day after the shooting."
  },
  {
    "title": "Why Even Basic Airline Seats Keep Getting More ‘Premium’",
    "link": "https://www.nytimes.com/2025/08/02/business/dealbook/premium-airfare.html",
    "summary": "As travel demand sinks, both legacy airlines and budget brands have turned to a strategy of ever-expanding upgrades."
  },
  {
    "title": "Her Dispensary Was Set to Open. Then New York Got in the Way.",
    "link": "https://www.nytimes.com/2025/08/02/nyregion/weed-cannabis-dispensary-nyc.html",
    "summary": "State cannabis regulators suddenly changed a rule governing how close dispensaries can be to schools, upending dozens of owners’ plans."
  },
  {
    "title": "Jeannie Seely, Who Pushed Boundaries and Broke Hearts at the Grand Ole Opry, Dies at 85",
    "link": "https://www.nytimes.com/2025/08/01/arts/music/jeannie-seely-dead.html",
    "summary": "She blazed a trail for women in country music with the candor of her songs and her bold fashion sense. She was the first woman to host a segment on the Opry."
  }
]