[
  {
    "title": "Shutdown Politics Has Republicans Singing Government’s Praises",
    "link": "https://www.nytimes.com/2025/10/06/us/politics/shutdown-republicans-trump-government.html",
    "summary": "As Republicans try to pin blame for shutdown damage on Democrats, they are hailing a federal bureaucracy they normally bash as wasteful and overreaching."
  },
  {
    "title": "U.S. Air Travel May Soon Feel Shutdown’s Impact, Official Warns",
    "link": "https://www.nytimes.com/2025/10/06/us/politics/faa-essential-air-service-controllers.html",
    "summary": "The Essential Air Service, which subsidizes flights to small airports, will run out of money on Sunday, and air traffic controllers who have been working without pay have begun calling in sick."
  },
  {
    "title": "Trump Aimed Shutdown Cuts at Democrats, but G.O.P. Districts Are Hit, Too",
    "link": "https://www.nytimes.com/2025/10/06/us/politics/republican-districts-political-pain-program-cancellations.html",
    "summary": "As the president cancels projects in Democratic-run states, he is cutting money that benefits his own party’s lawmakers in some of the most competitive House districts."
  },
  {
    "title": "How Trump’s National Guard Deployments Break With Military Tradition",
    "link": "https://www.nytimes.com/video/us/politics/100000010433782/how-trumps-national-guard-deployments-break-with-military-tradition.html",
    "summary": "By sending troops to U.S. cities that are not in active crisis, President Trump is breaking with military tradition. Helene Cooper, who covers national security issues for The New York Times, compares his recent actions with earlier domestic military deployments."
  },
  {
    "title": "Trump Gave Partisan Speech to Navy Troops, as He Deployed Troops to U.S. Cities",
    "link": "https://www.nytimes.com/2025/10/06/us/politics/trump-navy-portland-troops.html",
    "summary": "President Trump’s attempts to politicize the military have become more overt as he makes the case for having troops at his disposal in American cities."
  },
  {
    "title": "Neighbors Warn Neighbors as Fear of ICE Ripples Across Chicago",
    "link": "https://www.nytimes.com/2025/10/06/us/fear-ice-chicago.html",
    "summary": "Parents are standing guard at schools. Some restaurants have stopped delivering food or simply closed. “Every single person who looks brown is scared,” a lawyer said."
  },
  {
    "title": "Who is Judge Immergut? Trump Appointee in Oregon Blocks Troop Deployment.",
    "link": "https://www.nytimes.com/2025/10/06/us/politics/trump-judge-oregon-immergut.html",
    "summary": "Judge Karin Immergut worked on Ken Starr’s investigation of Bill Clinton. Now she’s ruled against Trump’s attempt to send troops to Portland."
  },
  {
    "title": "Harvard Has Identified Another Problem: Its Own Students",
    "link": "https://www.nytimes.com/2025/10/06/us/harvard-students-absenteeism.html",
    "summary": "Many students don’t do the reading and don’t speak up in class, according to a report. Now, professors are trying to change a campus culture they say hurts achievement and stifles speech."
  },
  {
    "title": "A Harvard Professor Is Placed on Leave After Firing a Pellet Gun",
    "link": "https://www.nytimes.com/2025/10/06/us/harvard-professor-pellet-gun-synagogue.html",
    "summary": "The episode initially raised concerns because it happened near a synagogue, but the police say it was unrelated to antisemitism."
  },
  {
    "title": "How Bari Weiss of The Free Press Won the Top Job at CBS News",
    "link": "https://www.nytimes.com/2025/10/06/business/media/bari-weiss-free-press-cbs-news.html",
    "summary": "At The Free Press, she battled “wokeness” and buddied up with billionaires. Now she’s the editor in chief of CBS News."
  },
  {
    "title": "Lee Lozano Didn’t Speak to Other Women for 28 Years. What Did It Cost Her?",
    "link": "https://www.nytimes.com/2025/10/06/t-magazine/lee-lozano-hauser-wirth-art.html",
    "summary": "When it came to using her life in her work, the artist Lee Lozano went about as far as a person can go."
  },
  {
    "title": "C.I.A. Deputy Director Has Replaced Agency’s Top Legal Official With Himself",
    "link": "https://www.nytimes.com/2025/10/06/us/politics/michael-ellis-cia-trump.html",
    "summary": "It is not clear what is behind the move by Michael Ellis, a Trump loyalist. A legal ethics specialist said it could raise conflict-of-interest issues."
  },
  {
    "title": "Trump Calls Off Diplomatic Outreach to Venezuela",
    "link": "https://www.nytimes.com/2025/10/06/us/politics/trump-venezuela-maduro.html",
    "summary": "The move paves the way for a possible military escalation against drug traffickers or the government of Nicolás Maduro."
  },
  {
    "title": "Israel and Hamas Meet in Egypt to Discuss Gaza Peace Plan",
    "link": "https://www.nytimes.com/2025/10/06/world/middleeast/israel-gaza-hamas-peace-talks.html",
    "summary": "As Israelis brace for a day of mourning and commemoration, negotiators for Israel and Hamas met with mediators in Egypt to hash out an end to the war."
  },
  {
    "title": "Elected but Not Seated, Grijalva Waits to Sign Epstein Petition",
    "link": "https://www.nytimes.com/2025/10/06/us/politics/adelita-grijalva-house-epstein.html",
    "summary": "The Democratic representative-elect won her Arizona seat overwhelmingly. But so far, the Republican speaker will not swear her in."
  },
  {
    "title": "Wesley Hunt Enters Texas G.O.P. Senate Race, Complicating Path for Cornyn",
    "link": "https://www.nytimes.com/2025/10/06/us/politics/wesley-hunt-senate-texas-cornyn-paxton.html",
    "summary": "Mr. Hunt, a U.S. House member, and Senator John Cornyn will be competing for voters who dislike the state’s attorney general, Ken Paxton, who has led in many polls."
  },
  {
    "title": "Elon Musk Gambles on Sexy A.I. Companions",
    "link": "https://www.nytimes.com/2025/10/06/technology/elon-musk-grok-sexy-chatbot.html",
    "summary": "In July, the billionaire’s A.I. company introduced two sexually explicit chatbots, pushing a new version of intimacy."
  },
  {
    "title": "Undersea Bacteria Feast on Methane. Can They Help Cool the Planet?",
    "link": "https://www.nytimes.com/2025/10/06/climate/methane-eating-microbes-bacteria.html",
    "summary": "They feast on bubbles of methane seeping out of the ocean floor. Could their appetites be harnessed to slow climate change?"
  },
  {
    "title": "Can Sweet Songs Prevail Over Bloody Ones? Mexico Is Giving It a Try.",
    "link": "https://www.nytimes.com/2025/10/06/world/americas/mexico-canta-cartel-violence-music.html",
    "summary": "On Sunday, three contestants were crowned winners of the inaugural, government-run “Mexico Sings” competition, meant to promote songs that aren’t about drug cartels or violence."
  },
  {
    "title": "Marine Park in Ontario Warns It May Euthanize Beluga Whales Without Cash Infusion",
    "link": "https://www.nytimes.com/2025/10/06/world/canada/marineland-canada-beluga-whales.html",
    "summary": "The government has barred Marineland from shipping its whales to an aquarium in China so the park is threatening to put the whales down."
  },
  {
    "title": "The Right’s Civil War Over Who Really Killed Charlie Kirk",
    "link": "https://www.nytimes.com/2025/10/06/opinion/republicans-conspiracies-charlie-kirk.html",
    "summary": "Megyn Kelly knows which way the winds are blowing."
  },
  {
    "title": "Political Violence. Threats to Free Speech. A Disinformation Crisis. We’ve Been Here Before.",
    "link": "https://www.nytimes.com/2025/10/06/opinion/politics/how-to-save-the-american-experiment.html",
    "summary": "To see a way out of our destructive spiral we should look to the innovation of the 1920s."
  },
  {
    "title": "Troops Head to Chicago, Despite Efforts to Block Them",
    "link": "https://www.nytimes.com/2025/10/06/briefing/trump-national-guard-chicago-international-students.html",
    "summary": "Also, Gaza peace talks took place in Egypt. Here’s the latest at the end of Monday."
  },
  {
    "title": "Supreme Court, for Now, Rejects Google Bid to Block Changes to App Store",
    "link": "https://www.nytimes.com/2025/10/06/us/politics/supreme-court-google-fortnite.html",
    "summary": "The emergency order is the latest turn in a longstanding legal dispute between the tech giant and the creator of the popular game Fortnite."
  },
  {
    "title": "Where in the World Is Eric Adams? Try Albania.",
    "link": "https://www.nytimes.com/2025/10/06/nyregion/eric-adams-albania.html",
    "summary": "The decision by Mr. Adams, a lame-duck mayor, to spend nearly a week of his remaining time in office visiting the Balkan nation raised eyebrows back in New York."
  },
  {
    "title": "Why Did Walmart Just Buy a Shopping Mall?",
    "link": "https://www.nytimes.com/2025/10/06/business/walmart-shopping-malls.html",
    "summary": "Walmart hasn’t said much about its plans for Monroeville Mall in Pennsylvania. But its partner has told some store owners that the mall will be demolished for a mixed-use development."
  }
]