[
  {
    "title": "Bluffs and Bluster Aside, Trump’s Tariffs Are Here to Stay",
    "link": "https://www.nytimes.com/2025/07/14/us/politics/trump-tariffs.html",
    "summary": "The president has earned a reputation for bluffing on tariffs. But he has steadily and dramatically raised U.S. tariffs, transforming global trade."
  },
  {
    "title": "Stocks Wobble on Trump’s Latest Tariff Threats",
    "link": "https://www.nytimes.com/2025/07/14/business/stocks-tariffs-eu-mexico.html",
    "summary": "Analysts said the muted market response was because many investors expected the levies to settle at lower levels after negotiations."
  },
  {
    "title": "China Is Buying Appliances and iPhones. What Happens When the Subsidies Stop?",
    "link": "https://www.nytimes.com/2025/07/14/business/china-economy-consumer-subsidies.html",
    "summary": "Shoppers are taking advantage of a $42 billion government trade-in program aimed at boosting spending. But in recent weeks, some cities have started to cut back on the subsidies."
  },
  {
    "title": "Biden Hits Back on Autopen Claims, and Public Media Braces for Cuts",
    "link": "https://www.nytimes.com/2025/07/14/podcasts/the-headlines/biden-hits-back-on-autopen-claims-and-public-media-braces-for-cuts.html",
    "summary": "Plus, a very Wimbledon disruption."
  },
  {
    "title": "In His Own Words: How Trump Changed His Tone on Putin and the War in Ukraine",
    "link": "https://www.nytimes.com/2025/07/14/us/politics/trump-putin-ukraine.html",
    "summary": "After years of lavishing praise on the Russian leader, President Trump abruptly changed his posture amid mounting frustration with the lack of progress on a cease-fire."
  },
  {
    "title": "Trump’s Willingness to Arm Ukraine Puts Him Closer to Biden Approach",
    "link": "https://www.nytimes.com/2025/07/14/us/politics/trump-ukraine-biden.html",
    "summary": "President Trump is expected this week to formalize a new plan to sell American weapons to European allies, who would pass them onto Kyiv."
  },
  {
    "title": "Macron Increases Military Spending, Saying Freedom Is Threatened",
    "link": "https://www.nytimes.com/2025/07/13/world/europe/macron-france-military-spending.html",
    "summary": "“You have to be feared in this world,” President Emmanuel Macron said, preparing France for an era in which it may no longer be able to count on the U.S."
  },
  {
    "title": "Inside the Conservative Campaign That Took Down the U.Va. President",
    "link": "https://www.nytimes.com/2025/07/14/us/politics/university-virginia-president-trump-dei-jefferson-council.html",
    "summary": "The Jefferson Council had called for eliminating D.E.I., without much success. But a new lawyer with ties to the group took on the cause for the Trump administration."
  },
  {
    "title": "Facing Painful Cuts, the V.A. Reported Dubious Savings to DOGE",
    "link": "https://www.nytimes.com/2025/07/14/us/politics/va-savings-cuts-doge.html",
    "summary": "The Department of Veterans Affairs claimed credit for canceling contracts that had not been canceled, and tallied savings unrelated to the cost-cutting efforts."
  },
  {
    "title": "Public Broadcasters Brace for Vote on Sharp Funding Cut",
    "link": "https://www.nytimes.com/2025/07/14/business/media/public-broadcasters-federal-funding.html",
    "summary": "At the urging of President Trump, Congress is expected to vote this week on whether to cut $500 million per year for public radio and TV stations."
  },
  {
    "title": "NPR and PBS Face Federal Funding Cuts: What to Know",
    "link": "https://www.nytimes.com/2025/07/14/business/media/npr-pbs-funding-cuts.html",
    "summary": "A proposal before the Senate to strip funding from the Corporation for Public Broadcasting could be catastrophic for local stations, particularly those in rural areas."
  },
  {
    "title": "Biden Says He Made the Clemency Decisions Recorded With Autopen",
    "link": "https://www.nytimes.com/2025/07/13/us/politics/biden-pardon-autopen-trump.html",
    "summary": "Donald J. Trump and his allies have begun investigations to support their claims that Joseph R. Biden Jr. was incapacitated and his staff conspired to take presidential actions in his name."
  },
  {
    "title": "Excerpts From The Times’s Interview With Biden on Clemency Decisions",
    "link": "https://www.nytimes.com/2025/07/13/us/politics/biden-clemency-interview.html",
    "summary": "The former president said he “made every single one of those” decisions and that Republicans were questioning them because “they’ve done so badly” and wanted to shift the focus."
  },
  {
    "title": "Texan Stoicism Provides Comfort, and Excuses, After the Flood",
    "link": "https://www.nytimes.com/2025/07/14/us/politics/texas-floods-greg-abbott-stoicism.html",
    "summary": "Texans often draw on the idea of their own self-reliance during times of adversity. Gov. Greg Abbott has used it to deflect tough questions."
  },
  {
    "title": "Texas Floods Bring Grief and Prayer to Local Churches",
    "link": "https://www.nytimes.com/2025/07/13/us/texas-floods-churches-grief.html",
    "summary": "At services in the stricken Hill Country and elsewhere, ministers spoke Sunday morning about sorrow and solace, community and hope, as more rain beat down."
  },
  {
    "title": "Noem Defends FEMA Response to Texas Flooding and Says Trump Wants Agency ‘Remade,’ Not Cut",
    "link": "https://www.nytimes.com/2025/07/13/us/politics/kristi-noem-trump-texas-floods-fema.html",
    "summary": "The homeland security secretary said a report that thousands of calls to a disaster hotline went unanswered because of staffing cuts was “false.”"
  },
  {
    "title": "Footage of Inmate Suicide Captures Dysfunction on Rikers Island",
    "link": "https://www.nytimes.com/2025/07/14/nyregion/rikers-island-inmate-suicide-deaths-federal-takeover.html",
    "summary": "The New York Times has obtained video of the 2022 death of Michael Nieves, a mentally ill detainee who mortally wounded himself on Rikers Island."
  },
  {
    "title": "Plan to Permanently Displace Palestinians Threatens to Derail Gaza Truce",
    "link": "https://www.nytimes.com/2025/07/14/world/middleeast/israel-hamas-gaza-cease-fire.html",
    "summary": "An Israeli proposal to force much of Gaza’s population into a small enclave is now overshadowing negotiations over a truce."
  },
  {
    "title": "America Is Unraveling Its Safety Net",
    "link": "https://www.nytimes.com/2025/07/14/opinion/america-safety-net.html",
    "summary": "America is unraveling its safety net."
  },
  {
    "title": "Governors Should Be the Face of the Democratic Party",
    "link": "https://www.nytimes.com/2025/07/14/opinion/kansas-governor-democrats.html",
    "summary": "The state leaders may be the party’s best shot at reconnecting with the American people."
  },
  {
    "title": "Protests in Kenya",
    "link": "https://www.nytimes.com/2025/07/14/briefing/kenya-protests-ruto.html",
    "summary": "How the unrest began — and what may happen next."
  },
  {
    "title": "What Do You Want to Know About Vaccines?",
    "link": "https://www.nytimes.com/2025/07/14/well/vaccines-health-questions.html",
    "summary": "The Times wants to hear from you."
  },
  {
    "title": "Nine People Killed in Fire at Massachusetts Assisted Living Facility",
    "link": "https://www.nytimes.com/2025/07/14/us/fire-gabriel-house-fall-river-massachusetts.html",
    "summary": "The fire broke out on Sunday in the city of Fall River, a state official said. More than 30 residents were taken to the hospital."
  },
  {
    "title": "It’s Paradise Lost as Climate Change Remakes Europe’s Summers",
    "link": "https://www.nytimes.com/2025/07/14/world/europe/spain-italy-greece-heat.html",
    "summary": "In peak vacation season, many of the continent’s most desirable getaways are becoming places to get away from."
  },
  {
    "title": "Tesla Faces First Jury Trial Tied to Its Autopilot System",
    "link": "https://www.nytimes.com/2025/07/14/business/tesla-trial-autopilot.html",
    "summary": "The case stems from a fatal accident in 2019 involving a Tesla Model S sedan. Previous cases involving Autopilot had been settled or dismissed."
  }
]