[
  {
    "title": "Trump Approves the Epstein Files Release, but Some May Be Withheld",
    "link": "https://www.nytimes.com/2025/11/19/us/politics/trump-epstein-files-loopholes.html",
    "summary": "The president sought to take credit for the legislation, despite months of pressure to kill it. The bill has significant exceptions that could mean many documents would stay confidential."
  },
  {
    "title": "Larry Summers to Stop Teaching at Harvard While It Investigates His Epstein Ties",
    "link": "https://www.nytimes.com/2025/11/19/us/larry-summers-harvard-epstein.html",
    "summary": "The former Harvard president had previously stepped down from other positions following revelations about his longtime connections to Jeffrey Epstein."
  },
  {
    "title": "Nvidia Earnings Show Profit Jumped 65% to $31.9 Billion",
    "link": "https://www.nytimes.com/2025/11/19/technology/nvidia-earnings.html",
    "summary": "The company, which makes the computer chips essential to the artificial intelligence boom, also said revenue in its recent quarter rose to $57 billion."
  },
  {
    "title": "Nvidia Earnings Fuel Rally in Global Technology Stocks",
    "link": "https://www.nytimes.com/2025/11/19/business/stocks-nvidia-earnings.html",
    "summary": "The chipmaker’s profit surge and strong revenue forecast helped to ease fears that spending on A.I. infrastructure might be outpacing demand."
  },
  {
    "title": "Trump and Mamdani Will Meet at White House on Friday",
    "link": "https://www.nytimes.com/2025/11/19/nyregion/trump-mamdani-white-house-meeting.html",
    "summary": "The meeting between Zohran Mamdani, the mayor-elect of New York City, and President Trump will come after the two men have fiercely attacked one another."
  },
  {
    "title": "Lindsey Halligan Admits Grand Jury Never Saw Final Comey Indictment",
    "link": "https://www.nytimes.com/2025/11/19/us/politics/comey-vindictive-prosecution-trump.html",
    "summary": "Grand jurors have to vote on indictments to approve them, but a prosecutor told the judge in the case that only the foreperson formally approved the second charging document, a move that could cripple the case."
  },
  {
    "title": "Stalled Contempt Inquiry Into Deportation Flights Springs Back to Life",
    "link": "https://www.nytimes.com/2025/11/19/us/politics/contempt-inquiry-deportation-flights.html",
    "summary": "The resurrected inquiry could finally get to the bottom of lingering questions such as: Did top Trump administration officials purposely ignore a court order?"
  },
  {
    "title": "Saudi Arabia’s Prince Has Big Plans, but His Giant Fund Is Low on Cash",
    "link": "https://www.nytimes.com/2025/11/19/business/pif-saudi-arabia-fund-problems.html",
    "summary": "After nearly a decade of expensive, hit-and-miss investments, Mohammed bin Salman is overseeing a behind-the-scenes restructuring of the kingdom’s all-important wealth fund."
  },
  {
    "title": "Saudi Arabia, Once Shunned, Has Corporate Titans Swooning for Deals",
    "link": "https://www.nytimes.com/2025/11/19/business/saudi-investment-forum-kennedy-center.html",
    "summary": "Some of the most prominent U.S. executives gathered at the Kennedy Center for an event promoting deal-making with the oil-rich kingdom."
  },
  {
    "title": "Climate Change Is Stressing Italy’s Cows, and Coming for Your Burrata",
    "link": "https://www.nytimes.com/2025/11/19/world/europe/italy-cows-cheese-heat-climate-change.html",
    "summary": "Extreme heat causes cows to produce less milk. This poses problems in cheese-obsessed Italy, especially as it tries to meet growing demand for favorites like burrata."
  },
  {
    "title": "George Clooney, Adam Sandler and Noah Baumbach on Fame and ‘Jay Kelly’",
    "link": "https://www.nytimes.com/2025/11/19/movies/george-clooney-adam-sandler-noah-baumbach-jay-kelly.html",
    "summary": "The stars and the director look back on their days trying to break into the industry and how failure was part of the equation."
  },
  {
    "title": "U.S.-Russian Peace Plan Would Force Ukraine to Cede Land and Cut Army",
    "link": "https://www.nytimes.com/2025/11/19/world/europe/us-russia-ukraine-peace-plan.html",
    "summary": "The 28-point proposal, which comes as the Trump administration tries to restart settlement talks, includes demands long rejected by Kyiv as  nonstarters."
  },
  {
    "title": "After the Death of Two Titans, Where Are the Next Giant Art Patrons?",
    "link": "https://www.nytimes.com/2025/11/19/arts/design/lauder-gund-deaths-giant-art-patrons.html",
    "summary": "With the passing of Leonard A. Lauder and Agnes Gund amid financial headwinds, arts organizations worry that the cultural megadonor may be a thing of the past."
  },
  {
    "title": "Robert L. Stirm, Returning P.O.W. in Pulitzer-Winning Photo, Dies at 92",
    "link": "https://www.nytimes.com/2025/11/19/obituaries/robert-stirm-dead.html",
    "summary": "The image immortalized a Vietnam veteran’s joyous homecoming to his beaming family, but it hid the truth about an unraveling marriage."
  },
  {
    "title": "Franco Died 50 Years Ago, but He’s Still Winning New Fans in Spain",
    "link": "https://www.nytimes.com/2025/11/20/world/europe/spain-franco-dictator-memory-video-game.html",
    "summary": "Young Spaniards are increasingly drawn to the dictator Francisco Franco. So the government is designing apps, games and T-shirts to promote democracy."
  },
  {
    "title": "NASA Releases Images of Comet 3I/ATLAS Passing by Mars",
    "link": "https://www.nytimes.com/2025/11/19/science/comet-3i-atlas-nasa-mars.html",
    "summary": "With the government reopened, the space agency at last released pictures captured by a fleet of government spacecraft of an object that came from beyond our solar system."
  },
  {
    "title": "Thanksgiving Pies So Good, You’ll Want to Skip Dinner",
    "link": "https://cooking.nytimes.com/article/pies-thanksgiving-desserts",
    "summary": "Go straight to the good stuff this Thanksgiving: apple and cream, chocolate espresso, honeyed cranberry and more."
  },
  {
    "title": "No, Mr. President, We Cannot ‘Leave It at That’",
    "link": "https://www.nytimes.com/2025/11/19/opinion/saudi-mbs-trump-khashoggi.html",
    "summary": "Working with imperfect partners does not mean that the United States should cover up and lie about their misdeeds."
  },
  {
    "title": "The White House Gold Rush Is On",
    "link": "https://www.nytimes.com/2025/11/19/opinion/rolex-gold-trump-corruption.html",
    "summary": "They came bearing gifts. They left with what they wanted."
  },
  {
    "title": "Is Your Community Becoming More Divided?",
    "link": "https://www.nytimes.com/2025/11/17/us/political-division-community.html",
    "summary": "We want to hear about the ways in which the country’s politics are affecting your neighborhood, in ways big or small."
  },
  {
    "title": "Florida Lawmaker Stole FEMA Funds for House Campaign, Prosecutors Say",
    "link": "https://www.nytimes.com/2025/11/19/us/cherfilus-mccormick-fema-florida-indictment.html",
    "summary": "Representative Sheila Cherfilus-McCormick misused $5 million in Covid-related funds during the pandemic in part to finance her campaign, according to the Justice Department."
  },
  {
    "title": "Top National Book Awards Go to Writing About the Middle East",
    "link": "https://www.nytimes.com/2025/11/19/books/review/omar-el-akkad-rabih-alameddine-national-book-awards.html",
    "summary": "Rabih Alameddine’s “The True True Story of Raja the Gullible (and His Mother)” won in fiction, while Omar El Akkad’s reckoning with Gaza took the nonfiction prize."
  },
  {
    "title": "Alice and Ellen Kessler, ’60s Singing Sensations, Die at 89",
    "link": "https://www.nytimes.com/2025/11/19/arts/alice-ellen-kessler-dead.html",
    "summary": "The twin sisters from Germany, who were nightclub stars and regular guests on international variety shows, chose to end their lives together."
  },
  {
    "title": "F.B.I. Hunt Intensifies for Ryan Wedding, Snowboarder Accused of Being a Drug Kingpin",
    "link": "https://www.nytimes.com/2025/11/19/world/canada/fbi-ryan-wedding-drug-charges.html",
    "summary": "Ryan Wedding, a former Olympic athlete said to be a major cocaine trafficker, is accused of ordering the murder of a witness who was set to testify against him."
  }
]