[
  {
    "title": "Judge Berates Justice Dept. in Its Prosecution of Comey",
    "link": "https://www.nytimes.com/2025/11/05/us/politics/judge-trump-prosecutor-comey.html",
    "summary": "The flashpoint was the Justice Department’s failure to turn over seized communications from a confidant of Mr. Comey’s, Daniel C. Richman, a law professor at Columbia University."
  },
  {
    "title": "Trump Administration Ends Deportation Protections for South Sudanese",
    "link": "https://www.nytimes.com/2025/11/05/us/politics/trump-south-sudan-migrants.html",
    "summary": "The program was first authorized for South Sudanese nationals in 2011. The Department of Homeland Security said that “renewed peace in South Sudan” and “improved diplomatic relations” justified the move."
  },
  {
    "title": "Elections Show Trump’s Edge on the Economy Slipping",
    "link": "https://www.nytimes.com/2025/11/05/us/politics/trump-elections-economy-inflation.html",
    "summary": "Democrats harnessed worries about the cost of living, with polls showing that Republicans’ longtime advantage on the economy has evaporated."
  },
  {
    "title": "Trump Blames Shutdown for Republican Losses on Election Day",
    "link": "https://www.nytimes.com/2025/11/05/us/trump-shutdown-republicans-election-day.html",
    "summary": "Speaking to senators at a breakfast, President Trump acknowledged that the results of Tuesday’s races were not a positive outcome for his party."
  },
  {
    "title": "Democrats Dig In on Shutdown After Election Wins",
    "link": "https://www.nytimes.com/2025/11/05/us/politics/democrats-trump-shutdown-filibuster.html",
    "summary": "President Trump’s declaration that the closure had hurt his party  on Tuesday appeared to have stiffened Democrats’ resolve and put at least a temporary damper on talks to end the crisis."
  },
  {
    "title": "6 Takeaways From Elections in Virginia, New Jersey, New York and Beyond",
    "link": "https://www.nytimes.com/2025/11/05/us/politics/election-takeaways-democrats.html",
    "summary": "In Virginia, New Jersey and beyond, Democratic voters powered their candidates to victory and sent a warning sign to President Trump and his Republican Party."
  },
  {
    "title": "For Zohran Mamdani, Winning Is One Thing. Governing Will Be Quite Another.",
    "link": "https://www.nytimes.com/2025/11/05/nyregion/mamdani-nyc-mayor-what-next.html",
    "summary": "Being mayor of New York City is often referred to as the second hardest job in the country, but the task may be even more complicated for Zohran Mamdani."
  },
  {
    "title": "He’s Been Charged With Dozens of Crimes. Nobody Knows His Name.",
    "link": "https://www.nytimes.com/2025/11/05/nyregion/nyc-criminal-identity-names.html",
    "summary": "He called himself by many names as he cycled in and out of prison. He is to be sentenced in Queens for deed fraud, but investigators still do not know his true identity."
  },
  {
    "title": "One of UPS Jet’s Engines Detached From Plane in Louisville, Official Says",
    "link": "https://www.nytimes.com/2025/11/05/us/ups-plane-crash-louisville.html",
    "summary": "The aircraft’s left engine fell off as the plane rolled toward takeoff, according to safety investigators. At least 11 people died after the plane plunged to the ground."
  },
  {
    "title": "Key Justices on Supreme Court Cast a Skeptical Eye on Trump’s Tariffs",
    "link": "https://www.nytimes.com/2025/11/05/us/politics/supreme-court-trump-tariffs.html",
    "summary": "The Supreme Court is considering whether the president acted legally when he used a 1977 emergency statute to impose tariffs on scores of countries."
  },
  {
    "title": "Five Key Takeaways From the Supreme Court Tariff Argument",
    "link": "https://www.nytimes.com/2025/11/05/us/politics/supreme-court-tariff-takeaways.html",
    "summary": "The Supreme Court justices grappled with the legality of President Trump’s tariffs in an oral argument that stretched for almost three hours."
  },
  {
    "title": "Republicans Swiftly File Lawsuit in Bid to Block California’s New House Maps",
    "link": "https://www.nytimes.com/2025/11/05/us/republicans-lawsuit-california-redistricting-maps.html",
    "summary": "Republicans asked a federal court to block newly approved maps in California that were designed to flip as many as five House seats for Democrats."
  },
  {
    "title": "Redistricting Battles, Set Off by Trump, Have Few Parallels in U.S. History",
    "link": "https://www.nytimes.com/2025/11/05/us/elections/gerrymandering-redistricting-democrats-republicans.html",
    "summary": "First, Texas redistricted. Other states followed, and now California. Some legal experts say it’s a crisis: “The wheels are coming off the car right now.”"
  },
  {
    "title": "How Venezuela’s Military Might Respond to U.S. Attacks",
    "link": "https://www.nytimes.com/2025/11/05/us/venezuela-military-maduro-coup.html",
    "summary": "Venezuela has an arsenal of Russian weapons and armed civilian cells that could mount a guerrilla war. But a coup against President Nicolás Maduro? Don’t count on it."
  },
  {
    "title": "In the Trump Era, Cheney’s Brand of Conservatism Became Obsolete",
    "link": "https://www.nytimes.com/2025/11/05/us/politics/cheney-trump-brand-conservatism.html",
    "summary": "Dick Cheney was once the face of hard-line conservatism. Then hard-line conservatism changed."
  },
  {
    "title": "How Cheney’s Presidential Power Push Paved the Way for Trump to Go Further",
    "link": "https://www.nytimes.com/2025/11/04/us/politics/trump-dick-cheney.html",
    "summary": "Donald J. Trump and Dick Cheney became adversaries, but the former vice president set the stage for Mr. Trump’s bid to expand his executive authority."
  },
  {
    "title": "Can Melatonin Cause Heart Failure? What to Know About Claims of Health Risks.",
    "link": "https://www.nytimes.com/2025/11/05/well/melatonin-heart-health-study.html",
    "summary": "Headlines this week have raised alarms about the popular sleep supplement."
  },
  {
    "title": "Mexico’s President Presses Charges Against Man Who Groped Her on the Street",
    "link": "https://www.nytimes.com/2025/11/05/world/americas/sheinbaum-man-video-charges.html",
    "summary": "A video of a man touching the country’s first female president, Claudia Sheinbaum, shocked many Mexicans and led her to file a report with the police."
  },
  {
    "title": "The Greatest Breakfast Sandwich May Be the One With Pastrami",
    "link": "https://www.nytimes.com/2025/11/05/dining/pastrami-breakfast-sandwich.html",
    "summary": "New York City has been overlooking the obvious all along."
  },
  {
    "title": "Why It Will Be Hard for Five Justices to Bless Trump’s Tariffs",
    "link": "https://www.nytimes.com/2025/11/05/opinion/supreme-court-tariffs-trump.html",
    "summary": "The problem with giving any president basically unconstrained authority to raise revenue via tariffs."
  },
  {
    "title": "Trump Is an Albatross",
    "link": "https://www.nytimes.com/2025/11/05/opinion/trump-mamdani-spanberger-sherrill-democrats.html",
    "summary": "Just Ask Mikie Sherrill, Abigail Spanberger and Zohran Mamdani."
  },
  {
    "title": "The Supreme Court Casts a Skeptical Eye on Trump’s Tariffs",
    "link": "https://www.nytimes.com/2025/11/05/briefing/supreme-court-trump-tariffs-family-spice.html",
    "summary": "Also, Democrats seized on economic worries. Here’s the latest at the end of Wednesday."
  },
  {
    "title": "What Are Your Holiday Entertaining Questions?",
    "link": "https://www.nytimes.com/2025/11/05/dining/what-are-your-holiday-entertaining-questions.html",
    "summary": "From cookies to parties, let us help you be merry."
  },
  {
    "title": "Remains of the Last American Hostage Held in Gaza Returned to Israel",
    "link": "https://www.nytimes.com/2025/11/05/world/middleeast/american-hostage-body-gaza.html",
    "summary": "Israeli officials told Itay Chen’s family last year that he was probably killed on Oct. 7, 2023, but relatives put off mourning until his body had come home."
  },
  {
    "title": "Lawmaker Demands Accountability in Bloody Prison Beating Caught on Video",
    "link": "https://www.nytimes.com/2025/11/05/nyregion/ny-prison-beating-lawmaker.html",
    "summary": "State Senator Julia Salazar of New York said the officers accused of assault and sexual abuse in a 2023 case should face consequences."
  },
  {
    "title": "Heavy Drinkers Develop Strokes Earlier, Study Shows",
    "link": "https://www.nytimes.com/2025/11/05/well/alcohol-drinking-strokes-brain-bleeds.html",
    "summary": "New research examined the link between alcohol and brain bleeds."
  },
  {
    "title": "FIFA Will Award Its Own Peace Prize Next Month in Washington",
    "link": "https://www.nytimes.com/2025/11/05/world/europe/fifa-peace-prize-award.html",
    "summary": "Gianni Infantino, the president of FIFA, has built a close relationship with President Trump, who has groused about not winning the Nobel Peace Prize."
  }
]