[
  {
    "title": "Zohran Mamdani Is Sworn In as Mayor of New York City",
    "link": "https://www.nytimes.com/2025/12/31/nyregion/mamdani-mayor-swearing-in.html",
    "summary": "Zohran Mamdani officially took office as mayor after the New Year’s Eve ball drop, in a private ceremony held at a shuttered relic of the city’s subway."
  },
  {
    "title": "Mamdani Names Transportation Chief With Job of Making Buses Fast and Free",
    "link": "https://www.nytimes.com/2026/01/01/nyregion/mamdani-transportation-commissioner-mike-flynn.html",
    "summary": "As commissioner of New York City’s Department of Transportation, Michael Flynn will seek to implement one of the new mayor’s central campaign planks."
  },
  {
    "title": "Mamdani Reverses Call to End Mayoral Control of NYC Public Schools",
    "link": "https://www.nytimes.com/2025/12/31/nyregion/mamdani-nyc-public-schools-mayoral-control.html",
    "summary": "The mayor-elect’s turnaround came as he selected Kamar Samuels to lead New York City’s school system at a precarious moment."
  },
  {
    "title": "Mamdani Is First New York Mayor to Use the Quran at His Swearing-In",
    "link": "https://www.nytimes.com/2025/12/31/nyregion/mamdani-quran-inauguration-muslim.html",
    "summary": "Zohran Mamdani, New York City’s first Muslim mayor, put his hand on Islam’s holiest book at his swearing-in ceremony."
  },
  {
    "title": "Another New Year at War: Ukraine’s Troops Doubt It Will Be the Last",
    "link": "https://www.nytimes.com/2026/01/01/world/europe/ukraine-russia-new-years-day-donetsk.html",
    "summary": "After a year of Russian advances, the goal for 2026 is simply to survive, said one officer in eastern Ukraine. “It’s hard to make any plans,” he said."
  },
  {
    "title": "Ukraine Did Not Target Putin’s Home, C.I.A. Finds",
    "link": "https://www.nytimes.com/2025/12/31/us/politics/ukraine-putin-home-drone-strike-cia.html",
    "summary": "The assessment rebutted a claim that the Russian leader made to President Trump in a phone call this week."
  },
  {
    "title": "Trump Abandons Efforts to Deploy National Guard to 3 Major Cities",
    "link": "https://www.nytimes.com/2025/12/31/us/politics/trump-national-guard.html",
    "summary": "The troops had nearly no presence in two of the cities, Portland and Chicago. But the decision signaled a retreat, at least for now, in one of the president’s most audacious attempts to test his power."
  },
  {
    "title": "Trump Must Return Command of California National Guard to Newsom, Court Rules",
    "link": "https://www.nytimes.com/2025/12/31/us/trump-national-guard-california-newsom.html",
    "summary": "The ruling is a win for Gov. Gavin Newsom, who has vigorously opposed President Trump’s moves to control California’s National Guard since the summer."
  },
  {
    "title": "In Hearing Transcript, Jack Smith Defends Decision to Indict Trump",
    "link": "https://www.nytimes.com/2025/12/31/us/politics/jack-smith-deposition-house-trump.html",
    "summary": "The former special counsel accused President Trump of “exploiting” violence on Jan. 6, 2021, according to an interview released by House Republicans."
  },
  {
    "title": "He’s Chevy Chase, and He’s Still Like That",
    "link": "https://www.nytimes.com/2026/01/01/arts/television/hes-chevy-chase-and-hes-still-like-that.html",
    "summary": "The famously prickly comedian found a sympathetic adversary in the director of a CNN documentary about him. Their conversation with a reporter was … spirited."
  },
  {
    "title": "Oil Tanker Fleeing the Coast Guard Now Listed in Russian Ship Database",
    "link": "https://www.nytimes.com/2025/12/31/us/politics/russia-oil-tanker-venezuela.html",
    "summary": "The listing could make it more challenging for U.S. forces to board the ship, which an arm of the Kremlin’s maritime authority says is now flying the Russian flag."
  },
  {
    "title": "Coast Guard Searches for Survivors After More Boat Strikes",
    "link": "https://www.nytimes.com/2025/12/31/us/politics/coast-guard-survivors-boat-strikes.html",
    "summary": "The U.S. military attacked a convoy of three boats in the eastern Pacific on Tuesday, and two more on Wednesday, as part of the Trump administration’s campaign against people suspected of drug trafficking."
  },
  {
    "title": "Space Events 2026: NASA’s Artemis II Moon Mission, Summer Eclipse and More",
    "link": "https://www.nytimes.com/2025/12/30/science/space-nasa-spacex-blue-origin-astronomy.html",
    "summary": "In 2026, there will be journeys to the moon and Mars, new visions of the cosmos and a solar eclipse that might be worth traveling for."
  },
  {
    "title": "Even the Sky May Not Be the Limit for A.I. Data Centers",
    "link": "https://www.nytimes.com/2026/01/01/technology/space-data-centers-ai.html",
    "summary": "Some tech leaders are concerned that the artificial intelligence race will exhaust available land and energy. The solution might lie in orbit."
  },
  {
    "title": "Trump’s Veto of Water Project Is His Latest Targeted Hit on Colorado",
    "link": "https://www.nytimes.com/2025/12/31/us/politics/trump-veto-water-project-colorado.html",
    "summary": "The president seems to be at war with the Democratic-led state as he raises the pressure on Colorado leaders to release a convicted election denier, Tina Peters, from state prison."
  },
  {
    "title": "Trump Vetoes 2 Bills, Drawing Accusations of Retaliation",
    "link": "https://www.nytimes.com/2025/12/31/us/politics/trump-vetoes-retribution.html",
    "summary": "The president said he blocked the bills to save taxpayers’ money. But he has grievances against a tribe in Florida and officials in Colorado."
  },
  {
    "title": "3 Years After a Toddler’s Parents Fled Kabul, a Reunion Is Still on Hold",
    "link": "https://www.nytimes.com/2025/12/31/us/politics/afghanistan-visas.html",
    "summary": "The twisting saga that separated the Hashemis in Oregon from their infant son has reached a new dead end: President Trump’s hold on all visas to the United States."
  },
  {
    "title": "Repeat Moviegoers Help Hollywood Eke Out a Slightly Better 2025",
    "link": "https://www.nytimes.com/2026/01/01/business/cinema-hollywood-2025-ticket-sales.html",
    "summary": "Ticket sales in North America totaled $8.9 billion for the year, up 2 percent from 2024. But the box office remains far below prepandemic levels."
  },
  {
    "title": "A Year of Fires and Floods in Southern California",
    "link": "https://www.nytimes.com/2026/01/01/us/los-angeles-fires-floods.html",
    "summary": "The floods that struck last week just before the first anniversary of the January wildfires show how extreme weather is defining life in the L.A. region."
  },
  {
    "title": "Behind Oklahoma Cannabis Farms, New Yorkers With Ties to Beijing",
    "link": "https://www.nytimes.com/2025/12/31/us/ny-china-hometown-association-oklahoma-marjiuana.html",
    "summary": "In China, trafficking marijuana is punishable by death. But in the United States, it has become a lucrative sideline for some favored sons of the motherland."
  },
  {
    "title": "‘Stranger Things’ Has Ended. What Happened in the Series Finale?",
    "link": "https://www.nytimes.com/2026/01/01/arts/television/stranger-things-finale-ending.html",
    "summary": "There was a lot to tie up after five seasons and nearly 10 years, and the show gave itself another two hours to do it. Here are the major events."
  },
  {
    "title": "The Two Questions I Wish We’d Stop Asking in 2026",
    "link": "https://www.nytimes.com/2026/01/01/opinion/podcasts-interviews-questions.html",
    "summary": "How did we get here? I don’t want to know."
  },
  {
    "title": "The Economy Made It Through 2025. The New Year Will Be Harder.",
    "link": "https://www.nytimes.com/2026/01/01/opinion/global-economy-public-private-sectors.html",
    "summary": "The new year will pose numerous problems that won’t be so easily overcome."
  },
  {
    "title": "Hope in a Time of Cynicism",
    "link": "https://www.nytimes.com/2026/01/01/briefing/hope-in-a-time-of-cynicism.html",
    "summary": "At a moment when Americans are distrusting and fearful, we examine the psychology of hope."
  },
  {
    "title": "Most of Iran Shuts Down as Government Grapples With Protests and Economy",
    "link": "https://www.nytimes.com/2025/12/31/world/middleeast/iran-shutdown-protests.html",
    "summary": "Amid mounting street protests, businesses, universities and government offices stayed closed Wednesday under government orders, in 21 of 31 provinces, including Tehran."
  },
  {
    "title": "Historic Snowstorm Blankets Syracuse Just in Time for the New Year",
    "link": "https://www.nytimes.com/2025/12/31/nyregion/syracuse-record-snow.html",
    "summary": "Syracuse, N.Y., has received nearly twice its usual monthly amount of snow in December."
  },
  {
    "title": "Tatiana Schlossberg Submitted a Heartbreaking Essay to The New Yorker on Her Cancer Diagnosis, Fully Formed",
    "link": "https://www.nytimes.com/2025/12/31/style/tatiana-schlossberg-new-yorker-essay-david-remnick.html",
    "summary": "When Tatiana Schlossberg submitted an essay to The New Yorker, it had not been assigned or even expected. It was accepted immediately and barely edited."
  },
  {
    "title": "Brigitte Bardot’s Legacy of Racist Rhetoric",
    "link": "https://www.nytimes.com/2025/12/31/world/europe/brigitte-bardot-racism-far-right.html",
    "summary": "The actress, who died this week at 91, was an icon of 1960s cinema. She was also a hero to the French far right."
  }
]