[
  {
    "title": "Don Lemon Arrested by Federal Agents Over Minnesota Church Protest",
    "link": "https://www.nytimes.com/2026/01/30/us/don-lemon-arrest-minnesota-church-protest.html",
    "summary": "Three others were also arrested on charges that they had violated federal law during the church protest this month, reviving a case that was rejected last week by a magistrate judge."
  },
  {
    "title": "Police Chiefs Fume at ICE Tactics Across Cities",
    "link": "https://www.nytimes.com/2026/01/30/us/its-all-just-going-down-the-toilet-police-chiefs-fume-at-ice-tactics.html",
    "summary": "Many police departments adopted major changes after civilian killings. Now, police chiefs worry ICE is ignoring those lessons and setting back efforts to improve public trust."
  },
  {
    "title": "Kevin Warsh, Trump’s Choice for Fed Chair, Could Find It Difficult to Deliver",
    "link": "https://www.nytimes.com/2026/01/30/business/trump-kevin-warsh-fed-rates.html",
    "summary": "Kevin M. Warsh, whom Mr. Trump tapped to become the next chair of the Federal Reserve, could face fierce resistance if he tries to pursue substantially lower borrowing costs."
  },
  {
    "title": "Stock Market Takes Kevin Warsh’s Fed Nomination in Stride",
    "link": "https://www.nytimes.com/2026/01/30/us/politics/stock-market-kevin-warsh-fed.html",
    "summary": "Stock and bond markets were unfazed by Kevin Warsh’s nomination as the next Fed chair, with the S&amp;P 500 nudging slightly lower in early trading on Friday."
  },
  {
    "title": "Federal Judge Drops Death Penalty Charge Against Luigi Mangione",
    "link": "https://www.nytimes.com/2026/01/30/nyregion/death-penalty-luigi-mangione.html",
    "summary": "The judge, Margaret Garnett of Federal District Court, said the case against Luigi Mangione would still proceed to trial on other counts."
  },
  {
    "title": "Pizza Cutter and a Fork: A Bizarre Bid to Break Mangione Out of Jail",
    "link": "https://www.nytimes.com/2026/01/29/nyregion/luigi-mangione-break-out-blade.html",
    "summary": "Federal prosecutors said a man was arrested after he impersonated an F.B.I. agent during a visit to the federal jail in Brooklyn where Luigi Mangione is being held."
  },
  {
    "title": "How DoorDash and Other Food Delivery Apps Are Reshaping Mealtime in the U.S.",
    "link": "https://www.nytimes.com/2026/01/30/dining/food-delivery-apps-doordash-uber.html",
    "summary": "Almost three of every four restaurant orders in the U.S. weren’t eaten in a restaurant, according to recent data. We spoke to readers who are devoted to delivery but question the costs."
  },
  {
    "title": "What It’s Like to Live With One of Psychiatry’s Most Misunderstood Diagnoses",
    "link": "https://www.nytimes.com/2026/01/30/magazine/dissociative-identity-disorder-mental-health.html",
    "summary": "Spurred by her past struggles with dissociative identity disorder, she has devoted her professional life to studying it."
  },
  {
    "title": "Texas A&M Ends Women’s Studies and Overhauls Hundreds of Classes on Race and Gender",
    "link": "https://www.nytimes.com/2026/01/30/us/texas-am-gender-ethnic-womens-studies-academic-freedom.html",
    "summary": "New policies limiting the teaching of race and gender issues led administrators and professors to change hundreds of courses. School leaders say the rules could hurt A&amp;M’s reputation."
  },
  {
    "title": "Carolinas Forecast to See Rare Blizzard Conditions From Winter Storm",
    "link": "https://www.nytimes.com/2026/01/30/weather/carolina-snow-storm-forecast-virginia.html",
    "summary": "A storm on Saturday is shaping up to be one of the strongest that parts of the South have seen in years. The storm will move through the Northeast on Sunday, but probably with far less snow."
  },
  {
    "title": "Iran Rules Out Talks With U.S. Until Trump’s Threats Stop",
    "link": "https://www.nytimes.com/2026/01/30/world/europe/iran-trump-us-threats-turkey.html",
    "summary": "Iran’s foreign minister ruled out direct talks unless President Trump stops threatening to attack it. He also said Iran would not discuss its ballistic missiles."
  },
  {
    "title": "Tesla’s Model S, Soon to Be History, Changed the Auto Industry",
    "link": "https://www.nytimes.com/2026/01/30/business/tesla-model-s-history.html",
    "summary": "The company’s chief executive, Elon Musk, said this week that it would stop making the car, an electric pioneer in 2012, as well as the Model X."
  },
  {
    "title": "Russia Is Finding the Gaps in Ukraine’s Front Line",
    "link": "https://www.nytimes.com/2026/01/30/world/europe/ukraine-war-zaporizhzhia-huliaipole.html",
    "summary": "The swift advance of Moscow’s forces into the town of Huliaipole showcases a central challenge for Kyiv: how to defend 700 miles with too few troops."
  },
  {
    "title": "Why Boys Are Behind in Reading at Every Age",
    "link": "https://www.nytimes.com/2026/01/30/upshot/boys-reading-falling-behind.html",
    "summary": "Boys’ reading struggles are not inevitable, research suggests, and addressing the deficit could improve outcomes in school and beyond."
  },
  {
    "title": "The Secret Sauce in ‘Heated Rivalry’? Canada.",
    "link": "https://www.nytimes.com/2026/01/30/world/canada/heated-rivalry-carney-canada.html",
    "summary": "The global television phenomenon is full of Canadian iconography and subsidized by Canadian taxpayers. On Thursday, it came home to celebrate."
  },
  {
    "title": "Trump and First Lady Attend Premiere of ‘Melania’ at Kennedy Center",
    "link": "https://www.nytimes.com/2026/01/29/arts/melania-movie-trump-kennedy-center.html",
    "summary": "Amazon paid Melania Trump’s production company $40 million for the movie and then paid another $35 million to promote it."
  },
  {
    "title": "Brett Ratner Makes Directing Comeback With ‘Melania’",
    "link": "https://www.nytimes.com/2026/01/30/movies/brett-ratner-melania-trump-documentary.html",
    "summary": "Once a reliable Hollywood hitmaker, Mr. Ratner hasn’t directed a film since accusations of sexual misconduct in 2017 that he denied."
  },
  {
    "title": "Free Buses? How About Expanding the Subway by 41 Miles Instead?",
    "link": "https://www.nytimes.com/2026/01/30/nyregion/mamdani-free-buses-subway.html",
    "summary": "Some transit advocates are wary of Mayor Zohran Mamdani’s plan to subsidize bus fares and argue the money would be better spent on a major subway expansion."
  },
  {
    "title": "Inside the Huge New Terminal That Will Transform J.F.K.",
    "link": "https://www.nytimes.com/2026/01/30/nyregion/jfk-airport-terminal-one.html",
    "summary": "The 2.6-million-square-foot Terminal One, part of a multibillion-dollar redevelopment of Kennedy Airport, will be nearly as large as the Empire State Building."
  },
  {
    "title": "Tucker Carlson’s Corrosive Bad Faith",
    "link": "https://www.nytimes.com/2026/01/30/opinion/tucker-carlson-bad-faith.html",
    "summary": "To triumph in the modern Republican Party, you need to be able to wrench your soul into alignment with your ambition."
  },
  {
    "title": "A Farewell Column From David Brooks",
    "link": "https://www.nytimes.com/2026/01/30/opinion/david-brooks-leaving-columnist.html",
    "summary": "After 22 wonderful years, I’ve decided to take the exciting and terrifying step of leaving in order to try to build something new."
  },
  {
    "title": "The New F.B.I.",
    "link": "https://www.nytimes.com/2026/01/30/briefing/the-new-fbi.html",
    "summary": "We look at changes inside the agency."
  },
  {
    "title": "Governors Dive Into an Impasse Over Colorado River Water Use",
    "link": "https://www.nytimes.com/2026/01/30/climate/governors-dive-into-an-impasse-over-colorado-river-water-use.html",
    "summary": "Leaders are set to gather in Washington as an unusual winter drought looms, raising the threat of lawsuits over a diminishing water supply."
  },
  {
    "title": "The Netherlands Is Getting a New Government. Will It Last?",
    "link": "https://www.nytimes.com/2026/01/30/world/europe/netherlands-government-rob-jetten.html",
    "summary": "Rob Jetten, a 38-year-old centrist, is poised to be the youngest prime minister in Dutch history. But his government will be in a daunting position."
  },
  {
    "title": "Can Food Be Art? Denmark Is Finding Out.",
    "link": "https://www.nytimes.com/2026/01/30/arts/denmark-food-fine-art-chefs.html",
    "summary": "High-level chefs in the country could become eligible for arts funding under a new initiative. Not all in the art and culinary worlds are raising a glass to the idea, though."
  }
]