[
  {
    "title": "Trump’s Trade Gamble Will Continue, Despite Supreme Court Rebuke",
    "link": "https://www.nytimes.com/2026/02/21/business/economy/trump-tariffs-trade-war.html",
    "summary": "The president seems as intent on tariffs as ever and argues that his trade agenda is succeeding, despite little evidence to support it"
  },
  {
    "title": "Trump Looks Ahead to Summit With China’s Xi, but Tariffs and Taiwan Loom",
    "link": "https://www.nytimes.com/2026/02/22/world/asia/trump-xi-jinping-meeting-china.html",
    "summary": "President Trump said his planned meeting with President Xi Jinping would be a grand display, but tensions over trade and defense could dampen the mood."
  },
  {
    "title": "They Did Deals With Trump to Get Lower Tariffs. Now They Are Stuck.",
    "link": "https://www.nytimes.com/2026/02/22/business/trump-tariffs-japan-indonesia.html",
    "summary": "Countries that under the threat of tariffs made commitments like enormous investment pledges face the reality that they may have been better off waiting."
  },
  {
    "title": "Shutdown at D.H.S. Extends to Cyber Agency, Adding to Setbacks",
    "link": "https://www.nytimes.com/2026/02/22/us/politics/cyber-agency-dhs-security-setbacks.html",
    "summary": "The Cybersecurity and Infrastructure Security Agency has navigated staffing cuts without a Senate-confirmed leader. Employees have become demoralized and concerned about the agency’s ability to ward off threats."
  },
  {
    "title": "Inside Iran’s Preparations for War and Plans for Survival",
    "link": "https://www.nytimes.com/2026/02/22/world/middleeast/iran-larijani-khamenei-pezeshkian.html",
    "summary": "Ayatollah Ali Khamenei has entrusted Ali Larijani, the top national security official, to ensure the Islamic Republic endures any military attacks and targeted killings."
  },
  {
    "title": "How the Times Weather Team Tracks Big Storms: More Data, Less Hype",
    "link": "https://www.nytimes.com/2026/02/22/insider/weather-team-forecast-blizzard.html",
    "summary": "When making forecasts, our reporters aim to visualize severe weather possibilities rather than focus on the most dire predictions. A possible blizzard this weekend is the latest test."
  },
  {
    "title": "How The Times Made Its Tiny, Animated Olympic Athletes",
    "link": "https://www.nytimes.com/2026/02/20/insider/winter-olympics-little-athletes.html",
    "summary": "The Times’s tiny animated athletes flip, spin and soar through the air just like their real-life counterparts."
  },
  {
    "title": "The Ex-Taxi Driver at the Center of Russia’s Shadow War",
    "link": "https://www.nytimes.com/2026/02/22/world/europe/russia-sabotage-europe.html",
    "summary": "The Kremlin’s sabotage campaign against European allies of Ukraine has been escalating. It needs people like Aleksei Kolosovsky, 42, to carry it out."
  },
  {
    "title": "They Killed Their Abusers. Should They Spend Their Lives in Prison?",
    "link": "https://www.nytimes.com/2026/02/22/magazine/oklahoma-domestic-violence-survivors-act.html",
    "summary": "A new law was supposed to help reduce the sentences of survivors of domestic violence. Most are still behind bars."
  },
  {
    "title": "Historians Confirm: Tomorrow Won’t Be Better Than Today",
    "link": "https://www.nytimes.com/2026/02/22/opinion/history-hope-delusion.html",
    "summary": "The human capacity for hope is an essential quality. But hope can also turn into delusion."
  },
  {
    "title": "Ukraine Has Passed a Point of No Return",
    "link": "https://www.nytimes.com/2026/02/22/opinion/ukraine-russia-war-four-years.html",
    "summary": "Four years that changed everything."
  },
  {
    "title": "On an Ambitious Antarctic Quest, One Nation Is on the Sidelines",
    "link": "https://www.nytimes.com/2026/02/19/climate/antarctica-science-funding.html",
    "summary": "None of the main research on the voyage of the Araon was funded by the U.S. National Science Foundation, a sign of the difficult times for American science."
  },
  {
    "title": "Who Is Not Funding This Antarctic Expedition?",
    "link": "https://www.nytimes.com/video/climate/100000010696442/antarctica-expedition-funding-us.html",
    "summary": "Our climate reporter Raymond Zhong describes America’s shifting relationship with polar research amid the threat of rising sea levels."
  },
  {
    "title": "At Least 15 Have Died on Tahoe-Area Slopes This Year",
    "link": "https://www.nytimes.com/2026/02/22/us/tahoe-ski-deaths.html",
    "summary": "Three more skiers have died in the Lake Tahoe area since the deadliest avalanche in California history on Tuesday killed nine."
  },
  {
    "title": "Newsom, Targeting Red States, Kicks Off Book Tour in Nashville",
    "link": "https://www.nytimes.com/2026/02/22/us/newsom-book-tour-nashville-conservatives.html",
    "summary": "Scores of Californians have moved to Tennessee for its friendlier business environment and conservative politics. On Saturday, the Democratic governor accused of driving them away paid a visit."
  },
  {
    "title": "New York Nurses’ Strike Ends After 6 Weeks as Last Holdouts Approve Deal",
    "link": "https://www.nytimes.com/2026/02/21/nyregion/nyc-nurses-strike-ends.html",
    "summary": "Workers at NewYork-Presbyterian/Columbia hospital voted for a contract with raises and layoff protections, meaning more than 4,000 nurses will return."
  },
  {
    "title": "The Queen Stuck by Prince Andrew. King Charles Is Pulling Away",
    "link": "https://www.nytimes.com/2026/02/21/world/europe/andrew-epstein-queen-elizabeth-charles.html",
    "summary": "Andrew Mountbatten-Windsor, the former prince, is getting no help from the throne as the crisis over his ties to Jeffrey Epstein intensifies."
  }
]