[
  {
    "title": "War Powers Law Does Not Apply to Trump’s Boat Strikes, Administration Says",
    "link": "https://www.nytimes.com/2025/11/01/us/politics/trump-boat-attacks-war-powers.html",
    "summary": "The move deepened the idea that a Vietnam-era law, which says congressionally unauthorized deployments into “hostilities” must end after 60 days, does not apply to airstrike campaigns."
  },
  {
    "title": "Trump’s Team Offers to Keep Some Ballroom Donors Incognito",
    "link": "https://www.nytimes.com/2025/11/01/us/politics/trumps-team-offers-to-keep-some-ballroom-donors-incognito.html",
    "summary": "Many corporate interests that have donated to the president’s pet project have business before his administration."
  },
  {
    "title": "Trump Threatens Military Action in Nigeria Over Protections for Christians",
    "link": "https://www.nytimes.com/2025/11/01/world/africa/trump-nigeria-military.html",
    "summary": "Accusing Nigeria of not doing enough to protect Christians from violence, President Trump said he had ordered the Pentagon to prepare for action."
  },
  {
    "title": "Trump Administration Must Make Food Stamp Payments Within Days, Judge Says",
    "link": "https://www.nytimes.com/2025/11/01/us/politics/trump-food-stamp-payments.html",
    "summary": "The written order came one day after a court told the Trump administration it must pay benefits in the program known as SNAP during the shutdown."
  },
  {
    "title": "NYC, Long a City of Contradictions, Is Still Turning Up New Ones",
    "link": "https://www.nytimes.com/2025/11/01/nyregion/nyc-mayoral-election-future.html",
    "summary": "New York City has often set the political, cultural and financial course of the country. Tuesday’s mayoral election — and a New Yorker watching from Washington — could scramble it all."
  },
  {
    "title": "In Chinese American Families, There’s a Generational Split on Mamdani",
    "link": "https://www.nytimes.com/2025/11/02/business/zohran-mamdani-chinese.html",
    "summary": "Many older Chinese immigrants are shifting to the political right, dividing from their children, a trend playing out in the New York City mayor’s race."
  },
  {
    "title": "NJ Governor’s Race Draws Obama and Hannity but Not Trump in Final Days",
    "link": "https://www.nytimes.com/2025/11/01/nyregion/mikie-sherrill-jack-ciattarelli-obama-hannity.html",
    "summary": "The former president held a rally for Mikie Sherrill, the Democrat running for governor of New Jersey. Prominent leaders have also campaigned with her Republican opponent, Jack Ciattarelli."
  },
  {
    "title": "California Promised Insurance Relief, But Delivered Loopholes",
    "link": "https://www.nytimes.com/2025/11/01/us/los-angeles-california-fire-insurance-regulations.html",
    "summary": "New regulations were supposed to ensure that homeowners in fire zones would have coverage available. But companies can still avoid serving many high-risk areas, a Times investigation found."
  },
  {
    "title": "Women Need Workplace Boundaries — Not Remote Work or Flexibility",
    "link": "https://www.nytimes.com/2025/11/02/opinion/women-work-force-flexibility-shifts.html",
    "summary": "Discussion of women in the workplace often focuses on flexible hours, but what’s actually needed is shift work — pioneered by the medical profession."
  },
  {
    "title": "How Liberalism Wins",
    "link": "https://www.nytimes.com/2025/11/02/opinion/democrats-liberalism-elections-crick.html",
    "summary": "Democrats do not just need to win more people. They also need to win more places."
  },
  {
    "title": "2 Arrested After Stabbing on Train Near Cambridge, England",
    "link": "https://www.nytimes.com/2025/11/01/world/europe/britain-stabbing-train.html",
    "summary": "Prime Minister Keir Starmer of Britain denounced the attack, which the police said left nine victims with “life-threatening injuries.”"
  },
  {
    "title": "Death Toll Rises From Hurricane Melissa as Many Communities Remain Cut off",
    "link": "https://www.nytimes.com/2025/11/02/world/americas/jamaica-hurricane-melissa-death-toll.html",
    "summary": "Authorities have yet to reach dozens of communities in Jamaica, raising the question of how many people really died in last week’s storm."
  },
  {
    "title": "An Outlier in Irish Politics Has Become the Country’s President",
    "link": "https://www.nytimes.com/2025/11/02/world/europe/ireland-president-catherine-connolly.html",
    "summary": "Propelled by anti-establishment fervor, Catherine Connolly was elected last week with a landmark popular mandate."
  },
  {
    "title": "Explosion at Harvard Medical School Was ‘Intentional,’ Officials Say",
    "link": "https://www.nytimes.com/2025/11/01/us/harvard-medical-school-explosion.html",
    "summary": "Two people were seen running from the building afterward, the school said. No injuries were reported, the school police said."
  }
]