[
  {
    "title": "Trump Is Briefed on Options for Striking Iran as Protests Continue",
    "link": "https://www.nytimes.com/2026/01/10/us/politics/trump-iran-strikes.html",
    "summary": "The president has said he will be “hitting them very hard” if Iranian leaders kill protesters amid widespread demonstrations calling for wholesale changes in the country."
  },
  {
    "title": "Death Toll Grows as Nationwide Protests Rock Iran for a Third Night",
    "link": "https://www.nytimes.com/2026/01/10/world/middleeast/iran-protests-death-toll.html",
    "summary": "Antigovernment unrest that began two weeks ago has intensified in recent days, as has violence."
  },
  {
    "title": "Why Are Iranians Protesting? What to Know About the Unrest.",
    "link": "https://www.nytimes.com/article/iran-protests-inflation-currency.html",
    "summary": "Demonstrations that began as outrage at the state of the economy have spread to cities across the country, amid an escalating crackdown by the authorities."
  },
  {
    "title": "FBI’s Inquiry Into Minneapolis ICE Shooting Faces Doubts After White House’s Remarks",
    "link": "https://www.nytimes.com/2026/01/10/us/politics/trump-ice-shooting-response-minneapolis.html",
    "summary": "Ex-law enforcement officials said the administration’s declarations that the killing was justified elicited questions about the F.B.I.’s willingness to scrutinize the agent who fatally shot an unarmed activist."
  },
  {
    "title": "Anti-ICE Protests Spread Nationwide After Minneapolis Shooting",
    "link": "https://www.nytimes.com/2026/01/10/us/ice-shooting-protests-minnesota.html",
    "summary": "Demonstrators across the country expressed anger at the killing of a woman in Minneapolis by federal immigration agents."
  },
  {
    "title": "Disinformation in Minneapolis Shooting Points at People Who Were Not Involved",
    "link": "https://www.nytimes.com/2026/01/10/us/disinformation-minneapolis-shooting-ice.html",
    "summary": "Within hours of an ICE officer shooting and killing a woman, social media users misidentified the agent who fired as Steve Grove."
  },
  {
    "title": "Who Was Renee Good, the Woman Killed by an ICE Agent in Minneapolis?",
    "link": "https://www.nytimes.com/2026/01/10/us/rennee-good-ice-shooting-minnesota.html",
    "summary": "Ms. Good, 37, was a poet and a mother who grew up in Colorado. Her wife said the couple had “stopped to support our neighbors” when Ms. Good was shot."
  },
  {
    "title": "U.S. Launches Major Strikes on Islamic State Targets in Syria",
    "link": "https://www.nytimes.com/2026/01/10/us/politics/us-strikes-islamic-state-syria.html",
    "summary": "The airstrikes followed an even larger attack in December to avenge the killing of three Americans last year."
  },
  {
    "title": "Smithsonian Removes Label Noting Trump Impeachments",
    "link": "https://www.nytimes.com/2026/01/10/arts/smithsonian-trump-impeachment-portrait-gallery.html",
    "summary": "When the National Portrait Gallery replaced a portrait of President Trump this week, it took down a biography of his first term."
  },
  {
    "title": "Judge Pauses Trump Policy Ending Family Reunification for Some Migrants",
    "link": "https://www.nytimes.com/2026/01/10/us/family-reunification-judge.html",
    "summary": "The policy applied to migrants from some Central and South American countries who were awaiting visas."
  },
  {
    "title": "Venezuela’s New Leader Enlists U.S. Troops to Bring a Rogue Ship Back",
    "link": "https://www.nytimes.com/2026/01/10/world/americas/venezuela-oil-tanker-us.html",
    "summary": "Delcy Rodríguez got American help with the return of an oil tanker linked to one of her political rivals that had left the country without authorization."
  },
  {
    "title": "How Delcy Rodríguez, Venezuela’s Leader, Became Vital to Trump’s Plans for the Country",
    "link": "https://www.nytimes.com/2026/01/10/world/americas/delcy-rodriguez-venezuela-economy-trump.html",
    "summary": "Delcy Rodríguez, a guerrilla’s daughter, started out as a provocateur. She pivoted to revive a ravaged economy, making her vital to U.S. plans to run Venezuela."
  },
  {
    "title": "Machado Offered Trump Her Nobel, but Prize Institute Says It’s Not Allowed",
    "link": "https://www.nytimes.com/2026/01/10/world/americas/trump-nobel-peace-prize-maria-machado.html",
    "summary": "After María Corina Machado, Venezuela’s opposition leader, offered her Nobel Peace Prize to President Trump, the Norwegian Nobel Institute said it cannot be “transferred to others.”"
  },
  {
    "title": "Bob Weir, Guitarist and Founding Member of The Grateful Dead, Dies at 78",
    "link": "https://www.nytimes.com/2026/01/10/obituaries/bob-weir-dead-grateful-dead.html",
    "summary": "His songwriting and rhythm guitar playing helped shape the San Francisco band’s sound as it became an American institution."
  },
  {
    "title": "Bob Weir: 10 Essential Songs",
    "link": "https://www.nytimes.com/2026/01/10/arts/music/bob-weir-grateful-dead-songs.html",
    "summary": "The guitarist, singer and songwriter, who died at 78, cut his own path among his elders in the Grateful Dead, and beyond."
  },
  {
    "title": "Golden Globes 2026: What to Expect From Sunday’s Awards Ceremony",
    "link": "https://www.nytimes.com/2026/01/10/movies/golden-globes-what-to-expect.html",
    "summary": "Keep an eye on “One Battle After Another,” which is likely to dominate, and on the speeches. A particularly memorable one could be an Oscar lifeline."
  },
  {
    "title": "Neon, an Indie Studio With an International Bent, Tops Globes Nominations",
    "link": "https://www.nytimes.com/2026/01/10/business/media/neon-golden-globes.html",
    "summary": "Neon scored more film nominations at the Golden Globes than any other studio this year with a slate of six non-English language films."
  },
  {
    "title": "Trump’s Amoral World Meets Its Match in Pope Leo",
    "link": "https://www.nytimes.com/2026/01/11/opinion/pope-leo-trump-world-order-peace.html",
    "summary": "The pontiff has increasingly asserted himself in the face of Trump’s aggressive words and deeds."
  },
  {
    "title": "What to Know About the Vote in Myanmar",
    "link": "https://www.nytimes.com/2025/12/27/world/asia/what-to-know-myanmar-vote.html",
    "summary": "Amid a ruinous civil war, the military government is holding elections that are widely seen as a sham, as the main opposition remains barred or jailed."
  },
  {
    "title": "At the Rikers Jail, the Women Have No Library. But They Have a Book Club.",
    "link": "https://www.nytimes.com/2026/01/10/nyregion/rikers-womens-book-club.html",
    "summary": "Some members of the group are awaiting trial; some are serving short sentences. In the meantime, with little else to do, they have intense discussions about literature."
  },
  {
    "title": "India’s Ties With Bangladesh Fray as Elections Loom",
    "link": "https://www.nytimes.com/2026/01/11/world/asia/india-bangladesh-tensions.html",
    "summary": "A simmering dispute between the neighbors, who share one of the largest land borders in the world, has escalated with diplomatic protests and a sports boycott."
  },
  {
    "title": "Will Stock Markets Sizzle Into 2026?",
    "link": "https://www.nytimes.com/2026/01/09/business/stock-market-investing-returns.html",
    "summary": "Returns have been fabulous but consider the potential for setbacks in this already hazardous year, our columnist says."
  }
]