[
  {
    "title": "Second Strike Scrutiny Obscures Larger Question About Trump’s Boat Attacks",
    "link": "https://www.nytimes.com/2025/12/04/us/politics/trump-boat-attacks-killings.html",
    "summary": "Congress is focusing on two deaths in one strike. But nine other people died in that same attack, and the United States has killed 87 in all. Were any of those killings legal?"
  },
  {
    "title": "Boat Strike Video Shown to Lawmakers",
    "link": "https://www.nytimes.com/2025/12/04/us/politics/drug-boat-strikes-sept-2-video-congress.html",
    "summary": "Two survivors of the attack were said to struggle to cling to the boat before a second strike. After the briefing with lawmakers, the military disclosed a boat strike on Thursday that killed four people."
  },
  {
    "title": "Takeaways From the Pentagon Investigation on Hegseth’s Use of Signal",
    "link": "https://www.nytimes.com/2025/12/04/us/politics/pentagon-investigation-hegseth-signal.html",
    "summary": "The inspector general concluded that the defense secretary violated the Pentagon’s instructions on using a private electronic device to share sensitive information."
  },
  {
    "title": "Supreme Court Clears Way for Texas Redistricting Maps Pushed by Trump",
    "link": "https://www.nytimes.com/2025/12/04/us/politics/supreme-court-texas-congressional-maps.html",
    "summary": "Texas officials had asked the court to allow the state to use the new maps in the midterm elections, part of a push by President Trump to gain a partisan advantage."
  },
  {
    "title": "Florida Republicans Start Redistricting Talks, but Some Aren’t in a Rush",
    "link": "https://www.nytimes.com/2025/12/04/us/florida-redistricting-republicans.html",
    "summary": "Redistricting talks in Florida got off to a slow start on Thursday, as state lawmakers grapple with political and legal questions amid internal power struggles."
  },
  {
    "title": "Grand Jury Said to Decline to Re-Indict Letitia James",
    "link": "https://www.nytimes.com/2025/12/04/us/politics/letitia-james-indict-trump.html",
    "summary": "After a judge dismissed the Trump administration’s first attempt to indict the attorney general of New York State, a new grand jury effort failed, according to people familiar with the matter."
  },
  {
    "title": "Trump Trumpets Peace in Africa Amid War on Drug Boats, in Day of Dissonance",
    "link": "https://www.nytimes.com/2025/12/04/us/politics/trump-congo-rwanda-boat-strikes.html",
    "summary": "President Trump presided over a Congo-Rwanda peace deal on the same day his administration was being questioned about potential war crimes."
  },
  {
    "title": "Trump Switches Architects for White House Ballroom Project",
    "link": "https://www.nytimes.com/2025/12/04/us/politics/trump-ballroom-white-house-construction.html",
    "summary": "The president had clashed with the original designer and insisted on increasing the size and scope of the ballroom on a short timeline."
  },
  {
    "title": "Days After Trump Pardoned One Honduran Politician, Another Gets 22 Years",
    "link": "https://www.nytimes.com/2025/12/04/nyregion/honduras-congressman-drug-sentence.html",
    "summary": "President Trump pardoned the former Honduran president, who had been convicted for drug trafficking. Midence Oqueli Martinez Turcios, a former congressman, got nearly 22 years."
  },
  {
    "title": "Warner Bros. Discovery and Netflix Said to Be in Exclusive Talks",
    "link": "https://www.nytimes.com/2025/12/05/business/warner-brothers-discovery-netflix.html",
    "summary": "Netflix would acquire Warner television and film studios as well as HBO Max in a deal that would bulk up the world’s biggest paid streaming service."
  },
  {
    "title": "Best TV Shows of 2025",
    "link": "https://www.nytimes.com/2025/12/04/arts/television/best-tv-shows-of-2025.html",
    "summary": "Many of the year’s best series seemed to be in conversation with one another, including “Severance,” “The Pitt,” “Andor,” “Pluribus,” “The Lowdown” and others."
  },
  {
    "title": "Her Roof Was About to Be Fixed. Then Immigration Agents Showed Up.",
    "link": "https://www.nytimes.com/2025/12/04/us/new-orleans-border-patrol-immigration-home-repair.html",
    "summary": "The Trump administration’s deportation agenda is reverberating beyond immigrant communities as agents begin fanning out around New Orleans."
  },
  {
    "title": "ICE Separates Boy, 6, From Father During Effort to Deport Them to China",
    "link": "https://www.nytimes.com/2025/12/04/nyregion/chinese-father-son-migrants-separated.html",
    "summary": "The child and his father fled China earlier this year and the boy had just been enrolled in school. Federal officials have tried and failed to send them back."
  },
  {
    "title": "Tim Walz Calls Trump’s Tirade Against Somalis in Minnesota ‘Vile’",
    "link": "https://www.nytimes.com/2025/12/04/us/tim-walz-trump-somalia-minnesota.html",
    "summary": "Minnesota’s governor said the president’s xenophobic remarks were dangerous as the state continued to face fiscal questions about a fraud scandal."
  },
  {
    "title": "As Trump Covets Nobel Peace Prize, FIFA Cozies Up to Him With Its Own Award",
    "link": "https://www.nytimes.com/2025/12/05/us/politics/trump-fifa-peace-prize-world-cup-infantino.html",
    "summary": "Gianni Infantino, head of soccer’s governing body, has been ingratiating himself with the president to help ensure a successful 2026 World Cup."
  },
  {
    "title": "Trump’s Relationship With the President of FIFA",
    "link": "https://www.nytimes.com/video/world/100000010563247/trumps-relationship-with-the-president-of-fifa.html",
    "summary": "Gianni Infantino, head of soccer’s governing body, FIFA, has lauded President Trump at almost every opportunity, even starting a FIFA Peace Prize after Mr. Trump didn’t win the Nobel. Luke Broadwater, a White House reporter, describes the bromance."
  },
  {
    "title": "On Pope Leo’s Visit to Lebanon and Turkey, A.I. Was a Frequent Concern",
    "link": "https://www.nytimes.com/2025/12/05/world/asia/pope-leo-lebanon-turkey-ai-technology.html",
    "summary": "On his first trip as pontiff, Leo XIV predictably called for peace and unity. But he also addressed technology’s promise and pitfalls."
  },
  {
    "title": "Eurovision Is in Turmoil as Israel’s Participation Leads to Boycott",
    "link": "https://www.nytimes.com/2025/12/04/arts/music/eurovision-israel-boycott.html",
    "summary": "The Netherlands and Slovenia also said they would not take part in next year’s contest, meant to be its celebratory 70th edition."
  },
  {
    "title": "Meta Weighs Cuts to Its Metaverse Unit",
    "link": "https://www.nytimes.com/2025/12/04/technology/meta-cuts-metaverse-unit.html",
    "summary": "Meta plans to direct its investments to focus on wearables like its augmented reality glasses but does not plan to abandon building the metaverse."
  },
  {
    "title": "Macron Urges Xi to Help End War in Ukraine",
    "link": "https://www.nytimes.com/2025/12/04/world/asia/china-france-macron-ukraine.html",
    "summary": "As President Emmanuel Macron of France visited China, its leader, Xi Jinping, said his country would play a constructive role in ending the fighting."
  },
  {
    "title": "Amid Russian Sabotage, U.K. Points Finger at Putin Over Novichok Death",
    "link": "https://www.nytimes.com/2025/12/04/world/europe/putin-novichok-salisbury-skripal-poisoning.html",
    "summary": "A British woman died from exposure to a nerve agent because of a botched assassination plot that the Russian leader must have authorized, an official report found."
  },
  {
    "title": "What to Know About Putin’s Visit to India as Oil Trade Dries Up",
    "link": "https://www.nytimes.com/2025/12/03/world/asia/india-russia-putin-visit-arms.html",
    "summary": "The Trump administration, which crippled Russia’s oil sales to India with sanctions, will be watching Mr. Putin’s talks with Prime Minister Narendra Modi."
  },
  {
    "title": "The One Child Policy’s Legacy: A Surplus of Single Men",
    "link": "https://www.nytimes.com/2025/12/04/opinion/china-dating-men-one-child-policy.html",
    "summary": "A decade after the end of the one-child policy, China has over 30 million so-called surplus men. Can this dating boot camp help them find love?"
  },
  {
    "title": "Avocado Prices Keep Going Up. Blame Narcoinflation.",
    "link": "https://www.nytimes.com/2025/12/05/opinion/mexico-sheinbaum-cartels-extortion-trump.html",
    "summary": "Cartel extortion is pushing up prices in Mexico — and becoming a political problem President Claudia Sheinbaum can’t ignore."
  },
  {
    "title": "Lawmakers Split on the Military’s Defense of Boat Strikes",
    "link": "https://www.nytimes.com/2025/12/04/briefing/boat-strikes-congress-reading-gifts.html",
    "summary": "Also, a man was arrested on charges of planting pipe bombs before Jan. 6. Here’s the latest at the end of Thursday."
  },
  {
    "title": "Stellantis Is in Default for Moving Jeep Production to U.S., Canada Says",
    "link": "https://www.nytimes.com/2025/12/04/world/canada/lawsuit-stellantis-us-jeep-production.html",
    "summary": "The automaker switched production from Ontario in a bid to please President Trump. But the company defaulted on contracts covering hundreds of millions of dollars in assistance, Canada said."
  },
  {
    "title": "Yemen’s Civil War Could Escalate Again. Here’s What to Know.",
    "link": "https://www.nytimes.com/2025/12/05/world/middleeast/yemen-separatism.html",
    "summary": "An armed group backed by the United Arab Emirates has pushed into the oil-rich province of Hadramout, a move that could reignite conflict in Yemen after years of a stalemate."
  },
  {
    "title": "Human Remains Found Buried at San Diego Home",
    "link": "https://www.nytimes.com/2025/12/04/us/human-remains-investigation-san-diego-home.html",
    "summary": "Prosecutors are looking at potential connections to a former resident, who faces a murder charge in another case."
  },
  {
    "title": "Biden to Attend First Event for Presidential Library",
    "link": "https://www.nytimes.com/2025/12/04/us/politics/biden-presidential-library.html",
    "summary": "His plans for the library have been slow to take shape, but he has invited potential donors to a holiday reception in Washington this month."
  }
]