[
  {
    "title": "For Shooting Suspect, a Long Path of Conflict From Afghanistan to America",
    "link": "https://www.nytimes.com/2025/11/27/us/guard-shooting-suspect-profile.html",
    "summary": "Rahmanullah Lakanwal was among the Afghans who came to the United States after the Taliban takeover of Afghanistan. Earlier, he served in a paramilitary unit that worked with U.S. forces."
  },
  {
    "title": "‘My Baby Girl Has Passed to Glory,’ Says Father of Guard Soldier Killed in D.C. Shooting",
    "link": "https://www.nytimes.com/2025/11/28/us/politics/dc-shooting-victims-beckstrom-wolfe.html",
    "summary": "Specialist Sara Beckstrom, who died on Thursday, was not initially excited to go to Washington, but had grown to enjoy the city. Staff Sgt. Andrew Wolfe remained in critical condition on Friday."
  },
  {
    "title": "Trump Says U.S. Will Pause Migration From ‘Third World Countries’ After D.C. Shooting",
    "link": "https://www.nytimes.com/2025/11/28/us/trump-immigration-pause-third-world-countries.html",
    "summary": "In social media posts, President Trump also seemed to target migrants who were already in the country."
  },
  {
    "title": "Trump Uses National Guard Shooting to Cast Suspicion on Refugees",
    "link": "https://www.nytimes.com/2025/11/27/us/politics/trump-national-guard-shooting.html",
    "summary": "President Trump claimed there were “a lot of problems with Afghans,” without providing evidence, as his administration announced that it was implementing new immigration guidelines."
  },
  {
    "title": "Officials Had Been Warned for Over a Year Before Hong Kong Fire",
    "link": "https://www.nytimes.com/2025/11/28/world/asia/hong-kong-fire-officials-warned.html",
    "summary": "Residents of Wang Fuk Court apartments had raised concerns about flammable foam panels and scaffold netting, but the government did not take decisive action."
  },
  {
    "title": "A Hong Kong Fire Survivor’s Escape, in His Own Words",
    "link": "https://www.nytimes.com/2025/11/28/world/asia/hong-kong-fire-survivor-escape-story.html",
    "summary": "In his own words, William Li, a resident of the Hong Kong apartment complex that became an inferno, recounted how he and two neighbors survived until help arrived."
  },
  {
    "title": "Death Toll Rises to 128 in Hong Kong High-Rise Fire",
    "link": "https://www.nytimes.com/2025/11/28/world/asia/hong-kong-fire.html",
    "summary": "Hope of finding survivors has dwindled, with many residents of the Wang Fuk Court towers still unaccounted for. Eight more people were arrested Friday over the blaze."
  },
  {
    "title": "Andriy Yermak, Zelensky’s Chief of Staff, Resigns",
    "link": "https://www.nytimes.com/2025/11/28/world/europe/zelensky-yermak-resigns-ukraine-corruption-scandal.html",
    "summary": "Andriy Yermak, President Volodymyr Zelensky’s chief of staff and top peace negotiator, became the highest-ranking casualty of an investigation into a vast kickback scheme."
  },
  {
    "title": "John Tesh Keeps Bouncing Ba-Ba-Ba-Ba-Ba Back",
    "link": "https://www.nytimes.com/2025/11/28/arts/music/john-tesh-roundball-rock-nba-song.html",
    "summary": "The resurgence of “Roundball Rock,” the N.B.A. theme song he composed, has made the musician more visible than he’s been in over 20 years. He hasn’t been idle."
  },
  {
    "title": "Shoppers Head Into the Holidays With Spending Plans Intact",
    "link": "https://www.nytimes.com/2025/11/28/business/holidays-spending-consumer-sentiment.html",
    "summary": "Prices are higher, and the job market is weakening, but many people plan to spend heartily this season."
  },
  {
    "title": "How Gen Z Is Shopping",
    "link": "https://www.nytimes.com/2025/11/28/briefing/how-gen-z-is-shopping.html",
    "summary": "We look at their habits on Black Friday."
  },
  {
    "title": "In Turkey, Pope Seeks to Soothe an Ancient Christian Divide",
    "link": "https://www.nytimes.com/2025/11/28/world/middleeast/pope-leo-turkey-church.html",
    "summary": "In Istanbul, Pope Leo XIV will meet the patriarch of the Eastern Orthodox Church to show amity between two of the world’s largest Christian groups."
  },
  {
    "title": "Pope Leo Visits Turkey on His First Trip as Pontiff",
    "link": "https://www.nytimes.com/2025/11/27/world/europe/pope-leo-trip-pictures.html",
    "summary": "The pope started his six-day trip, which will also include a visit to Lebanon."
  },
  {
    "title": "Why Nadine Menendez Still Hasn’t Visited Her Husband in Prison",
    "link": "https://www.nytimes.com/2025/11/28/nyregion/nadine-robert-menenedez-prison.html",
    "summary": "Robert Menendez, a former Democratic senator, has been in prison since June. He hasn’t seen his wife, who is set to begin serving her sentence next summer."
  },
  {
    "title": "‘Hey, Lemonade!’: A Backstage Fixture at the Grand Ole Opry",
    "link": "https://www.nytimes.com/2025/11/28/us/politics/grand-ole-opry-lemonade.html",
    "summary": "Legions of backstage workers have helped the Grand Ole Opry thrive for a century in Nashville. Diana McBride is known for her lemonade — and much more."
  },
  {
    "title": "Israeli Forces Kill Two Palestinians in West Bank After They Appear to Surrender, Video Shows",
    "link": "https://www.nytimes.com/2025/11/28/world/middleeast/israel-west-bank-shooting-palestinians-video.html",
    "summary": "The Israeli authorities said they were investigating the shooting, which came amid days of extensive military operations in the West Bank."
  },
  {
    "title": "Israeli Raid in Southern Syria Kills at Least 13, Syrian Officials Say",
    "link": "https://www.nytimes.com/2025/11/28/world/europe/israel-syria-raid-beit-jinn.html",
    "summary": "The raid was one of Israel’s deadliest cross-border incursions since Bashar al-Assad, Syria’s former dictator, was ousted last year."
  },
  {
    "title": "At Last, a Name for the Murderous Face in a Holocaust Photo",
    "link": "https://www.nytimes.com/2025/11/28/science/holocaust-nazi-photography.html",
    "summary": "With the help of A.I., a historian has identified the killer in a 1941 image that defined the savagery of the Nazi regime."
  },
  {
    "title": "What I Love When I Love America",
    "link": "https://www.nytimes.com/2025/11/28/opinion/america-love-of-country.html",
    "summary": "My love of country this Thanksgiving season is not based on what this or that politician does, but on what America has always been."
  },
  {
    "title": "Goodbye, Price Tags. Hello Dynamic Pricing.",
    "link": "https://www.nytimes.com/2025/11/28/opinion/dynamic-pricing-algorithms.html",
    "summary": "Shopping has always been a game. And now it’s being rigged against you."
  },
  {
    "title": "Hondurans Fear Unrest Ahead of Election as Trump Endorses a Candidate",
    "link": "https://www.nytimes.com/2025/11/28/world/americas/honduras-election-trump-administration.html",
    "summary": "On Sunday, voters will choose between a left-wing presidential candidate and two conservatives, one backed by President Trump. The results are likely to be bitterly contested."
  },
  {
    "title": "Aftershocks of an Art Crime Reverberate in Japan",
    "link": "https://www.nytimes.com/2025/11/28/world/asia/japan-art-forgeries.html",
    "summary": "At least four works by a famous convicted forger have been discovered in Japan. Transparency about the mistakes, however, has sparked as much curiosity as scandal."
  },
  {
    "title": "Did Myanmar’s Junta Demolish Scam Centers Just for Show?",
    "link": "https://www.nytimes.com/2025/11/28/world/asia/myanmar-scam-centers-junta.html",
    "summary": "Myanmar’s junta made a grand display of demolishing buildings that hosted the centers, even broadcasting the explosions. But the scammers have found new homes."
  },
  {
    "title": "N.Y. Lawmakers Put Pressure on Hochul to Sign Prison Reform Bills",
    "link": "https://www.nytimes.com/2025/11/28/nyregion/ny-prisons-abuse-lawmakers-reform.html",
    "summary": "The bills, which have already passed the State Legislature, would help prevent brutality in prisons, supporters say. But the governor has yet to enact them."
  }
]