[
  {
    "title": "Senate Republicans Block Effort to Check Trump’s War Powers in Venezuela",
    "link": "https://www.nytimes.com/2026/01/14/us/politics/trump-venezuela-war-powers-vote.html",
    "summary": "G.O.P. leaders succeeded in pressuring fellow senators who initially supported the measure that would have limited President Trump’s military authority in Venezuela."
  },
  {
    "title": "U.S. Races to Sell Venezuelan Oil, Transforming Ties With Former Foe",
    "link": "https://www.nytimes.com/2026/01/14/world/americas/venezuela-oil-us-deal.html",
    "summary": "U.S. officials brokered the sale of hundreds of millions of dollars worth of Venezuelan oil to stabilize the country’s economy after capturing its president."
  },
  {
    "title": "Venezuelan Immigrants Urge Appeals Court to Restore Deportation Protections",
    "link": "https://www.nytimes.com/2026/01/14/us/venezuelan-immigrants-appeal-tps-ruling.html",
    "summary": "The Trump administration has ended Temporary Protected Status for about 600,000 Venezuelan immigrants, part of a broader effort to curb avenues for immigrants to remain in the United States."
  },
  {
    "title": "James Luckey-Lange Among Americans Freed in Venezuela",
    "link": "https://www.nytimes.com/2026/01/14/world/americas/venezuela-american-prisoner-luckey-lange.html",
    "summary": "James Luckey-Lange, 28, was released this week with several other U.S. citizens from the country’s notorious prison system after going missing in December, his family said."
  },
  {
    "title": "Federal Agent Shoots Man in Minneapolis, Prompting Tense Protests",
    "link": "https://www.nytimes.com/2026/01/14/us/minneapolis-federal-agent-shooting-immigration.html",
    "summary": "The agent shot a Venezuelan man who was resisting arrest, an official said. Protesters and law enforcement officers clashed for hours, as city officials urged people to go home."
  },
  {
    "title": "Woman Killed by ICE Agent Seemed at Fault, N.Y. Republican Says",
    "link": "https://www.nytimes.com/2026/01/14/nyregion/blakeman-ice-minneapolis.html",
    "summary": "Bruce Blakeman, the likely Republican candidate for governor, said the killing of Renee Good was just one point of disagreement between him and Gov. Kathy Hochul, a Democrat."
  },
  {
    "title": "Trump Says Iran Is Stopping Its Killings of Protesters as U.S. Moves Troops",
    "link": "https://www.nytimes.com/2026/01/14/us/politics/us-base-qatar-iran.html",
    "summary": "Nonessential personnel were moved from Al Udeid Air Base in Qatar, an American site that could be a target of Iran if President Trump ordered an attack on the country."
  },
  {
    "title": "Trump’s Gulf Allies Do Not Want Him to Bomb Iran",
    "link": "https://www.nytimes.com/2026/01/14/world/middleeast/gulf-trump-iran.html",
    "summary": "While several of the Gulf Arab countries harbor little love for Iran, they worry that the consequences of rising tensions could blow back on them."
  },
  {
    "title": "Iran Postpones Execution of Protester as Trump Threatens ‘Strong Action’",
    "link": "https://www.nytimes.com/2026/01/14/world/middleeast/iran-protests-soltani-execution-trump.html",
    "summary": "Iran had planned to put a 26-year-old protester to death amid the wave of unrest in the country, but apparently stood down for now."
  },
  {
    "title": "After Danish and U.S. Officials Meet on Greenland, Trump Remains Unmoved",
    "link": "https://www.nytimes.com/2026/01/14/us/politics/greenland-trump-denmark.html",
    "summary": "Denmark’s foreign minister left the White House complex saying that his country had a “fundamental disagreement” with President Trump, as several NATO countries sent troops to Greenland."
  },
  {
    "title": "Why Greenland Matters for a Warming World",
    "link": "https://www.nytimes.com/2026/01/14/world/europe/greenland-climate.html",
    "summary": "The fate of the world’s largest island has outsize importance for billions of people on the planet, because as the climate warms, Greenland is losing ice. That has consequences."
  },
  {
    "title": "Harper Lee Expanded on Her View of the South in Letters to a Friend",
    "link": "https://www.nytimes.com/2026/01/14/arts/harper-lee-letters-opinions-civil-rights-movement.html",
    "summary": "In decades of correspondence, the author gave her friend, JoBeth McDaniel, a mix of opinions, advice on writing and insight into the impact of the Civil Rights movement."
  },
  {
    "title": "Congress Is Spurning Many of Trump’s Proposed Spending Cuts",
    "link": "https://www.nytimes.com/2026/01/14/us/politics/congress-trump-spending-cuts.html",
    "summary": "Months after the partisan clash that led to the longest shutdown in history, lawmakers have agreed on spending bills that look far different from what the president wanted."
  },
  {
    "title": "3 More Lawmakers in Video Say Federal Prosecutors Are Investigating Them",
    "link": "https://www.nytimes.com/2026/01/14/us/politics/crow-goodlander-houlahan-trump-investigation.html",
    "summary": "The lawmakers, all Democrats who urged military service members not to follow illegal orders, said prosecutors had contacted them. But it is unclear what crime they might have committed."
  },
  {
    "title": "Trump Administration to Halt Immigrant Visa Processing for 75 Countries",
    "link": "https://www.nytimes.com/2026/01/14/us/politics/trump-suspends-visa-75-countries.html",
    "summary": "Federal officials said the move was meant to discourage immigration by people whom they deemed likely to rely on public benefits."
  },
  {
    "title": "H.H.S. Reverses Decision to Cut $2 Billion for Mental Health and Addiction Services",
    "link": "https://www.nytimes.com/2026/01/14/health/samhsa-funding-cuts.html",
    "summary": "A day after funding termination notices went out to more than 2,000 programs nationwide, the administration reversed itself and reinstated the money."
  },
  {
    "title": "Trump Signs Bill Allowing Schools to Serve Whole Milk Again",
    "link": "https://www.nytimes.com/2026/01/14/us/trump-whole-milk-schools-bill.html",
    "summary": "The law, which was approved unanimously by Congress late last year, also gives schools more flexibility in serving nondairy milks."
  },
  {
    "title": "Is Whole Milk Healthier for Kids?",
    "link": "https://www.nytimes.com/2026/01/14/well/eat/health-effects-whole-milk-kids.html",
    "summary": "A new law will allow full-fat and 2 percent milk to be served in schools. Here’s what to know."
  },
  {
    "title": "Federal Judges Uphold California’s New Congressional Maps",
    "link": "https://www.nytimes.com/2026/01/14/us/politics/federal-court-california-redistricting-decision.html",
    "summary": "A panel in Los Angeles sided with Gov. Gavin Newsom in a decision that will help Democrats counter Republican gerrymandering in Texas. Republicans are expected to appeal."
  },
  {
    "title": "What Voters Told Democrats About ICE, Rising Costs and Party Perceptions",
    "link": "https://www.nytimes.com/2026/01/14/us/politics/ice-immigration-inflation-democrats-voter-feedback.html",
    "summary": "In focus groups, swing voters gave Democratic politicians some tough feedback on the party."
  },
  {
    "title": "Tony Dokoupil’s Road Trip on CBS News Hits a Rough Patch",
    "link": "https://www.nytimes.com/2026/01/14/arts/television/cbs-news-tony-dokoupil.html",
    "summary": "A stretch of big news revealed growing pains for CBS’s new evening anchor and problems with its Bari Weiss-era philosophy."
  },
  {
    "title": "NASA Begins Astronaut Space Station Medical Evacuation: What to Know",
    "link": "https://www.nytimes.com/2026/01/14/science/nasa-astronauts-iss-return.html",
    "summary": "Four astronauts departed from the I.S.S. about a month earlier than scheduled because a crew member, who was not identified, has an undisclosed medical issue."
  },
  {
    "title": "Au Pair Testifies of Lurid Plot in Virginia Double-Murder Trial",
    "link": "https://www.nytimes.com/2026/01/14/us/au-pair-banfield-murder-trial.html",
    "summary": "Juliana Peres Magalhães wrapped up testimony on Wednesday in the case against Brendan Banfield, her former lover, who is accused of killing his wife and another man."
  },
  {
    "title": "Life, Liberty and the Pursuit of Unhappiness",
    "link": "https://www.nytimes.com/2026/01/14/opinion/america-quality-of-life.html",
    "summary": "One reason for the toxicity of American politics may be that our quality of life is slipping behind our peers’."
  },
  {
    "title": "Renee Good’s Family Should Be Able to Sue the Officer Who Killed Her",
    "link": "https://www.nytimes.com/2026/01/14/opinion/renee-good-civil-rights-constitution.html",
    "summary": "An ICE killing in Minneapolis can be the impetus for finally closing a gaping hole in our constitutional protections."
  },
  {
    "title": "Boeing Knew About Flaws in UPS Plane That Crashed in Louisville, N.T.S.B. Says",
    "link": "https://www.nytimes.com/2026/01/14/us/louisville-crash-report.html",
    "summary": "In a report Wednesday, the National Transportation Safety Board said fractures that appeared to have led the left engine to separate from the plane’s wing had occurred at least four other times."
  },
  {
    "title": "Frank Dunlop, 98, Dies; Director Gave Theater a Free-Spirited Spin",
    "link": "https://www.nytimes.com/2026/01/14/theater/frank-dunlop-dead.html",
    "summary": "In 1970, he founded London’s Young Vic, an adventurous “people’s theater” (the Who took the stage at one point) before shaking up the Brooklyn Academy of Music."
  },
  {
    "title": "Crane Collapses on Expressway Outside Bangkok, Killing at Least 2",
    "link": "https://www.nytimes.com/2026/01/15/world/asia/thailand-crane-expressway-rama2.html",
    "summary": "The deadly episode came a day after a crane fell on a moving train in northeastern Thailand, killing at least 32 people."
  }
]