[
  {
    "title": "New Photos of Jeffrey Epstein’s Manhattan Townhouse",
    "link": "https://www.nytimes.com/2025/08/05/us/jeffrey-epstein-mansion-photos.html",
    "summary": "In his seven-story townhouse, the sex offender hosted the elite, displayed photos with presidents and showcased a first edition of “Lolita,” according to previously unreported photos and letters."
  },
  {
    "title": "A Public School Enrollment Crisis, and a Nuclear Reactor on the Moon",
    "link": "https://www.nytimes.com/2025/08/05/podcasts/the-headlines/school-enrollment-nuclear-reactor-moon.html",
    "summary": "Plus, remembering “the Willy Wonka of cheese.”"
  },
  {
    "title": "Trump’s Deal-Making With Other Elite Schools Scrambles Harvard Negotiations",
    "link": "https://www.nytimes.com/2025/08/04/us/politics/harvard-trump-brown.html",
    "summary": "The university was open to spending $500 million, but a $50 million settlement with Brown has prompted new debates in Cambridge."
  },
  {
    "title": "Public Schools Try to Sell Themselves as More Students Use Vouchers",
    "link": "https://www.nytimes.com/2025/08/05/us/public-school-enrollment-decline-vouchers.html",
    "summary": "A decline in the number of children and rise in the number of choices has created a crisis for public schools. Some are trying new strategies to recruit students."
  },
  {
    "title": "After Trump’s Firing of BLS Commissioner, Republicans Fall in Line With His Criticism",
    "link": "https://www.nytimes.com/2025/08/04/us/politics/trump-republicans-bls-jobs-analysis.html",
    "summary": "President Trump’s decision to fire the head of the Bureau of Labor Statistics forced his allies into the awkward spot of criticizing an agency they had freely cited in the past."
  },
  {
    "title": "Inside Trump’s New Tactic to Separate Immigrant Families",
    "link": "https://www.nytimes.com/2025/08/05/us/politics/trump-administration-family-separation.html",
    "summary": "The practice appears to be a more targeted version of the mass separation of migrant children from their parents from President Trump’s first term, which caused a global outcry."
  },
  {
    "title": "Trump Questions Discrimination Claims, Even One His First Administration Brought",
    "link": "https://www.nytimes.com/2025/08/05/business/cfpb-vought-townstone-redlining.html",
    "summary": "The case against a Chicago mortgage lender has become a Rorschach test for the Consumer Financial Protection Bureau, epitomizing how the left and the right feel about the agency."
  },
  {
    "title": "UN Security Council to Discuss Israel-Gaza War and Hostages",
    "link": "https://www.nytimes.com/2025/08/05/world/middleeast/un-israel-gaza-war-hostages.html",
    "summary": "The U.N. Security Council is set to discuss the war and the hostages held in the territory as Israel said it would allow some private-sector goods to enter."
  },
  {
    "title": "On Gaza, Germany’s Government Faces Pressure From All Sides",
    "link": "https://www.nytimes.com/2025/08/05/world/europe/germany-gaza-israel-hunger-merz.html",
    "summary": "Germany, after the Holocaust, has a special bond with Israel. But a hunger crisis in Gaza is creating a demand for Berlin to take bolder action."
  },
  {
    "title": "After 50 Years of Writing, Jamaica Kincaid Insists She’s Still an Amateur",
    "link": "https://www.nytimes.com/2025/08/05/magazine/jamaica-kincaid-book-essays-garden.html",
    "summary": "A new, career-spanning essay collection shows how she has never lost touch with the mischievous creativity of her 7-year-old self."
  },
  {
    "title": "Jeju Air Plane Crash Highlights Decades of Blunders and Deadly Runway Wall",
    "link": "https://www.nytimes.com/2025/08/05/world/asia/jeju-air-crash-south-korea-investigation.html",
    "summary": "The New York Times identified a series of missteps that made a Jeju Air flight’s catastrophic end much more deadly."
  },
  {
    "title": "Takeaways From the Times Investigation Into the Jeju Air Crash",
    "link": "https://www.nytimes.com/2025/08/05/world/asia/jeju-air-plane-crash-investigation-takeaways.html",
    "summary": "Original designs for a structure at the end of the runway stipulated that it should break apart easily on impact. It ended up being made of concrete."
  },
  {
    "title": "G.O.P. Bets Big on Hispanic Voters With New Texas Map",
    "link": "https://www.nytimes.com/2025/08/05/us/politics/republican-redistricting-latinos.html",
    "summary": "In order to flip five U.S. House seats, Republicans are gambling that they can retain President Trump’s 2024 gains with Latinos and that voters won’t mind their hardball tactics."
  },
  {
    "title": "The Origins of the Political Power Grab in Texas",
    "link": "https://www.nytimes.com/2025/08/04/us/politics/texas-redistricting-politics.html",
    "summary": "President Trump seized a moment ripe for another redistricting war."
  },
  {
    "title": "Photos: What Atomic Bombs Did to Hiroshima and Nagasaki",
    "link": "https://www.nytimes.com/2025/08/05/world/asia/hiroshima-nagasaki-japan-nuclear-photos.html",
    "summary": "What the world’s only atomic bombings, carried out by Americans, did to Hiroshima and Nagasaki."
  },
  {
    "title": "Elizabeth Warren, Campaigning for Mamdani, Scorns Cuomo and Billionaires",
    "link": "https://www.nytimes.com/2025/08/04/nyregion/mamdani-elizabeth-warren-cuomo.html",
    "summary": "Zohran Mamdani, the Democratic candidate for mayor of New York City, appeared with Senator Elizabeth Warren to highlight his plan for free universal child care."
  },
  {
    "title": "16 Handles’ CEO and YouTuber Danny Duncan are Trying to Save Frozen Yogurt",
    "link": "https://www.nytimes.com/2025/08/04/style/frozen-yogurt-16-handles-ceo.html",
    "summary": "The frozen treat was inescapable a decade ago, then seemed to vanish. But one C.E.O., with help from the YouTuber Danny Duncan, is firing up the fro-yo time machine."
  },
  {
    "title": "The America We Knew Is Rapidly Slipping Away",
    "link": "https://www.nytimes.com/2025/08/04/opinion/columnists/friedman-trump-labor-firing.html",
    "summary": "When Trump fired the top labor statistics official, the aides responsible for running our economy went along for the ride."
  },
  {
    "title": "Mahmoud Khalil Tells His Story",
    "link": "https://www.nytimes.com/2025/08/05/opinion/ezra-klein-podcast-mahmoud-khalil.html",
    "summary": "The Palestinian activist discusses the Columbia protests, ICE detention and free speech in America."
  },
  {
    "title": "A Tussle in Texas",
    "link": "https://www.nytimes.com/2025/08/05/briefing/texas-house-democrats.html",
    "summary": "We take a look at the political fight over a redrawn map."
  },
  {
    "title": "Stephen Colbert Chides Trump for Firing the Messenger (Again)",
    "link": "https://www.nytimes.com/2025/08/05/arts/television/stephen-colbert-trump-job-report.html",
    "summary": "“No, you fool!” Colbert said after the president ousted a Labor Department official over a jobs report. “Now there’s one less job!”"
  },
  {
    "title": "Tennessee Inmate to Be Executed Despite Ethical Health Concerns",
    "link": "https://www.nytimes.com/2025/08/05/us/politics/tennessee-execution-heart-implant.html",
    "summary": "Lawyers for Byron Black, found guilty of three murders, have argued that an execution may be more painful because of his heart implant."
  },
  {
    "title": "Norway’s Hedged Bet on Europe’s Energy Future: A Garbage Disposal for Emissions",
    "link": "https://www.nytimes.com/2025/08/05/business/norway-cabon-capture-northern-lights.html",
    "summary": "A business called Northern Lights is seen as a model for efforts to pump carbon dioxide deep into wells, but high costs remain an obstacle."
  },
  {
    "title": "A Zoo in Denmark Wants to Feed Your Pets to Its Predators",
    "link": "https://www.nytimes.com/2025/08/04/science/zoos-denmark-food-pets.html",
    "summary": "A Danish zoo is asking owners of companion animals nearing life’s end to instead donate them as food for captive lynxes, lions and other carnivores."
  },
  {
    "title": "Torrential Rain Batters Hong Kong, Flooding the Waterlogged City",
    "link": "https://www.nytimes.com/2025/08/05/world/asia/hong-kong-floods.html",
    "summary": "Record-setting rain has brought chaos to parts of Hong Kong, with submerged streets, stranded buses and landslides. Residents were advised to avoid going out."
  }
]