[
  {
    "title": "What Is IEEPA, the Law Trump Used to Impose Tariffs?",
    "link": "https://www.nytimes.com/2025/02/02/us/politics/trump-tariffs-ieepa.html",
    "summary": "A federal appeals court struck down tariffs that President Trump had imposed by invoking a decades-old law."
  },
  {
    "title": "Trump Administration Weighs Having Military Lawyers Work as Immigration Judges",
    "link": "https://www.nytimes.com/2025/08/29/us/politics/military-lawyers-immigration-judges.html",
    "summary": "No final decision has been made, but the proposal comes as President Trump increasingly uses the military in various aspects of domestic life."
  },
  {
    "title": "Transportation Dept. Cancels $679 Million for Offshore Wind Projects",
    "link": "https://www.nytimes.com/2025/08/29/climate/transportation-dept-cancels-679-million-wind-industry.html",
    "summary": "The Trump administration’s campaign against wind power continued as it targeted funding for marine terminals and ports to support development of the industry."
  },
  {
    "title": "Trump Administration Bars Palestinian Officials From U.N. Meeting in New York",
    "link": "https://www.nytimes.com/2025/08/29/us/politics/trump-palestinians-un.html",
    "summary": "The United States generally allows foreign officials to attend the United Nations General Assembly. The administration’s move comes amid a new push for Palestinian statehood."
  },
  {
    "title": "What to Know About Secret Service Protection for Former Vice Presidents",
    "link": "https://www.nytimes.com/2025/08/29/us/politics/secret-service-vice-presidents-harris-trump.html",
    "summary": "The Secret Service usually protects a former vice president for six months after they leave office."
  },
  {
    "title": "Will the C.D.C. Survive?",
    "link": "https://www.nytimes.com/2025/08/29/health/cdc-kennedy-public-health.html",
    "summary": "Robert F. Kennedy Jr.’s assault may have dealt lasting damage to the agency, experts fear, with harsh consequences for public health."
  },
  {
    "title": "How the Trump-Kennedy Alliance Is Pushing the Boundaries of Public Health",
    "link": "https://www.nytimes.com/2025/08/29/us/politics/trump-kennedy-alliance-vaccines.html",
    "summary": "The mutually beneficial relationship between President Trump and Robert F. Kennedy Jr. is based on a striking alignment of some of their views."
  },
  {
    "title": "What to Know About Jim O’Neill, the New Acting C.D.C. Director",
    "link": "https://www.nytimes.com/2025/08/29/health/james-oneill-cdc.html",
    "summary": "The selection of Jim O’Neill, a former Silicon Valley executive, drew objections from Democrats, who noted his lack of medical or scientific training."
  },
  {
    "title": "Missouri Unveils Redistricting Plan, Aiming to Add a Republican Seat",
    "link": "https://www.nytimes.com/2025/08/29/us/missouri-governor-redistricting-maps.html",
    "summary": "Following Texas, Gov. Mike Kehoe called a special legislative session to redraw his state’s Congressional district lines to boost Republicans."
  },
  {
    "title": "Iowa’s Joni Ernst Will Not Seek Re-election, Putting a Competitive Senate Seat in Play",
    "link": "https://www.nytimes.com/2025/08/29/us/politics/joni-ernst-senate-iowa-re-election.html",
    "summary": "Democrats still face an uphill fight to win in Iowa and retake the majority in the closely divided Senate."
  },
  {
    "title": "Gov. Greg Abbott Signs Controversial Redistricting Bill, Redrawing Congressional Map",
    "link": "https://www.nytimes.com/2025/08/29/us/politics/abbott-texas-legislature-redistricting-map.html",
    "summary": "After a bruising redistricting fight, Gov. Greg Abbott signed a new congressional map into law. But the Republican-led Legislature, newly emboldened, has not stopped there."
  },
  {
    "title": "The Overlooked Element to the ‘KPop Demon Hunters’ Phenomenon",
    "link": "https://www.nytimes.com/2025/08/28/movies/kpop-demon-hunters-fandom.html",
    "summary": "Beyond its catchy songs and memorable characters, the Netflix movie does an admirable job of capturing what it’s like to be an adoring fan."
  },
  {
    "title": "Families of Minneapolis Church Shooting Victims Pay Loving Tributes",
    "link": "https://www.nytimes.com/2025/08/29/us/minneapolis-shooting-victims-families.html",
    "summary": "The impact of the deaths of Fletcher Merkel, 8, and Harper Moyski, 10, and the injuries sustained by 18 others are only beginning to be felt."
  },
  {
    "title": "Conservatives Use Minneapolis Shooting in Anti-Transgender Campaigns",
    "link": "https://www.nytimes.com/2025/08/29/us/politics/minneapolis-shooting-anti-transgender-conservatives-robin-westman.html",
    "summary": "Activists are pointing to the attacker’s gender identity to falsely portray all transgender people as prone to mental illness and violence."
  },
  {
    "title": "‘The Queen of Versailles’ Puts Her Life in the Hands of a ‘Wicked’ Diva",
    "link": "https://www.nytimes.com/2025/08/29/theater/queen-of-versailles-chenoweth-broadway.html",
    "summary": "A 2012 documentary asked if Jacqueline Siegel was a benefactor or victim of American greed. A new musical starring Kristin Chenoweth raises doubts."
  },
  {
    "title": "Riding Amtrak’s New Acela Train: Sleeker, Comfier and a Tiny Bit Faster",
    "link": "https://www.nytimes.com/2025/08/29/travel/amtrak-acela-train-launch.html",
    "summary": "The NextGen high-speed trains feel more like those in China, Japan or France. But topping out at 160 m.p.h., they’re still relatively slow."
  },
  {
    "title": "Strangers Come Together to Deliver Baby Girl at Burning Man Festival",
    "link": "https://www.nytimes.com/2025/08/29/us/burning-man-baby.html",
    "summary": "A woman unexpectedly went into labor at the desert festival. Within minutes, a neonatal nurse, an OB-GYN, a pediatric doctor and other attendees filled her camper."
  },
  {
    "title": "Can This Chef Revive Babbo, Mario Batali’s Signature Restaurant?",
    "link": "https://www.nytimes.com/2025/08/29/dining/mark-ladner-babbo-mario-batali.html",
    "summary": "Mark Ladner, a master of Italian cooking and a Batali protégé, is reinventing the Manhattan restaurant under the same famous (and infamous) name."
  },
  {
    "title": "Why the Texas Democrats’ Walkout Worked",
    "link": "https://www.nytimes.com/2025/08/29/opinion/gerrymandering-texas-newsom-trump.html",
    "summary": "Losing loudly has been a crucial feature of successful political movements."
  },
  {
    "title": "Los Angeles Wildfires Left the City With a Toxic Mess",
    "link": "https://www.nytimes.com/2025/08/29/opinion/los-angeles-wildfires-toxic-public-health.html",
    "summary": "Urban wildfires are becoming public health emergencies."
  },
  {
    "title": "Appeals Court: Many Trump Tariffs Are Illegal",
    "link": "https://www.nytimes.com/2025/08/29/briefing/tariffs-recission-katrina.html",
    "summary": "Also, Hurricane Katrina’s legacy. Here’s the latest at the end of Friday."
  },
  {
    "title": "At Least 70 Drown Off Mauritania After Boat Capsizes",
    "link": "https://www.nytimes.com/2025/08/29/world/africa/boat-capsize-mauritania-gambia-senegal.html",
    "summary": "Around 150 people boarded a boat in Gambia that was thought to have been headed for Europe. The boat capsized after traveling about 380 miles."
  },
  {
    "title": "3 Workers at Rikers Are Suspended After Another Man Dies in Custody",
    "link": "https://www.nytimes.com/2025/08/29/nyregion/rikers-death-ardit-billa.html",
    "summary": "The death of the 29-year-old, who was found in his cell after midnight, is the latest of several at the Rikers Island jail complex in New York."
  },
  {
    "title": "Looted by Nazis, a 17th-Century Painting Resurfaces. But Not for Long.",
    "link": "https://www.nytimes.com/2025/08/28/arts/argentina-giuseppe-ghislandi-painting-found.html",
    "summary": "The artwork had been missing for 80 years before Dutch journalists spotted it in a real estate listing in Argentina."
  },
  {
    "title": "Alabama Man Once Barred From Office Is Elected Mayor",
    "link": "https://www.nytimes.com/2025/08/29/us/politics/newbern-alabama-mayor-patrick-braxton.html",
    "summary": "Patrick Braxton won the first mayoral election in a half century in the small town of Newbern, five years after its leaders put up roadblocks to his assuming office."
  }
]