[
  {
    "title": "Senate Blocks War Powers Resolution to Limit Trump’s Ability to Strike Iran Again",
    "link": "https://www.nytimes.com/2025/06/27/us/politics/trump-war-powers-iran-strike.html",
    "summary": "The vote against the measure was mostly along party lines, with Republicans opposing it and Democrats almost unanimously in favor."
  },
  {
    "title": "Judge Strikes Down Trump Order Targeting Susman Godfrey Law Firm",
    "link": "https://www.nytimes.com/2025/06/27/us/politics/trump-susan-godfrey-law-firm-order.html",
    "summary": "The ruling completed a clean sweep for the handful of law firms that took the risk of fighting the Trump administration in court, rather than accepting punitive conditions."
  },
  {
    "title": "Don Bacon, House Republican Who Often Criticizes Trump, Won’t Seek Re-election",
    "link": "https://www.nytimes.com/2025/06/27/us/politics/don-bacon-retiring.html",
    "summary": "The departure of the five-term lawmaker from Nebraska enhances Democrats’ chances of picking up a seat in the narrowly divided House."
  },
  {
    "title": "Trump Says U.S. Ending Trade Talks With Canada Over Digital Services Taxes",
    "link": "https://www.nytimes.com/2025/06/27/business/trump-ends-canada-trade-talks.html",
    "summary": "The president said he would cease negotiations and impose new tariffs because of Canada’s imminent, new digital services taxes."
  },
  {
    "title": "S&P 500 Hits a Record High, Surging Through Trump Turmoil",
    "link": "https://www.nytimes.com/2025/06/27/business/sp-500-record-trump.html",
    "summary": "The index has regained all the ground it lost in March and early April, when President Trump proposed his broad array of tariffs."
  },
  {
    "title": "Trump Encourages Powell to Resign in Latest Attack on the Fed Chair",
    "link": "https://www.nytimes.com/2025/06/27/business/trump-powell-federal-reserve-resign.html",
    "summary": "Jerome H. Powell, whose term does not expire until May, has argued that the central bank can afford to be patient about cutting interest rates amid uncertainty about the economic outlook."
  },
  {
    "title": "How Long-term Compounding Multiplies the Awesome Power of the Stock Market",
    "link": "https://www.nytimes.com/2025/06/27/business/stock-market-investing-index-funds.html",
    "summary": "Time is the secret ingredient of investing, a market veteran says. Over many decades, diversified stock index funds have produced extraordinary results."
  },
  {
    "title": "University of Virginia President Resigns Under Pressure From Trump Administration",
    "link": "https://www.nytimes.com/2025/06/27/us/politics/uva-president-resigns-jim-ryan-trump.html",
    "summary": "The Justice Department had demanded that James E. Ryan step down in order to help resolve a civil rights investigation into the school."
  },
  {
    "title": "Harvard and University of Toronto Announce a Contingency Plan for Some International Students",
    "link": "https://www.nytimes.com/2025/06/27/us/harvard-international-students-university-of-toronto.html",
    "summary": "Students at the Kennedy School of Government can study online or finish their degrees at the University of Toronto."
  },
  {
    "title": "Jeff Bezos and Lauren Sánchez Tie the Knot",
    "link": "https://www.nytimes.com/2025/06/27/world/europe/jeff-bezos-lauren-sanchez-married.html",
    "summary": "The bride announced the marriage on Friday night in an Instagram post under the name Lauren Sánchez Bezos."
  },
  {
    "title": "Budapest Pride Parade Will Go On Despite Orban’s Ban. How Will He Respond?",
    "link": "https://www.nytimes.com/2025/06/28/world/europe/hungary-orban-gay-pride.html",
    "summary": "Prime Minister Viktor Orban’s party enacted the ban, trying to create a dilemma for the opposition leader. Now it is the government that faces a tough choice."
  },
  {
    "title": "In Birthright Citizenship Case, Supreme Court Limits Power of Judges to Block Trump Policies",
    "link": "https://www.nytimes.com/2025/06/27/us/supreme-court-birthright-citizenship.html",
    "summary": "The ruling clears a major hurdle to President Trump’s agenda and could reshape American citizenship, at least temporarily, as lower court challenges proceed."
  },
  {
    "title": "What the Supreme Court’s Ruling Will Mean for Birthright Citizenship",
    "link": "https://www.nytimes.com/2025/06/27/us/politics/27nat-birthright-citizenship-impacts.html",
    "summary": "The ruling left unsettled the question of whether children born to immigrants without full legal status in the United States are entitled to automatic citizenship. So what happens now?"
  },
  {
    "title": "Minnesota Rep. Melissa Hortman and Husband Lie in State Alongside Their Dog, Gilbert",
    "link": "https://www.nytimes.com/2025/06/27/us/politics/minnesota-melissa-hortman-dog-lying-in-state.html",
    "summary": "Gilbert, Representative Melissa Hortman’s dog, is being honored at the State Capitol with Ms. Hortman and her husband, Mark. They were all killed in a shooting at their home this month."
  },
  {
    "title": "Chinese Police Detain Dozens of Writers Over Gay Erotic Online Novels",
    "link": "https://www.nytimes.com/2025/06/28/world/asia/china-boys-love-women.html",
    "summary": "The genre known as Boys’ Love, stories written mostly by and for straight women, has been in the authorities’ sights for years."
  },
  {
    "title": "Authorities Rescue Girl Whose Mother Livestreamed Her Sexual Abuse",
    "link": "https://www.nytimes.com/2025/06/27/us/online-child-abuse.html",
    "summary": "The 9-year-old from Vietnam was abused by her mother for customers watching on smartphone apps in the U.S. and elsewhere. The mother said she needed the money."
  },
  {
    "title": "A Special ‘Climate’ Visa? People in Tuvalu Are Applying Fast.",
    "link": "https://www.nytimes.com/2025/06/27/climate/a-special-climate-visa-people-in-tuvalu-are-applying-fast.html",
    "summary": "Nearly half the citizens of the tiny Pacific Island nation have already applied in a lottery for Australian visas amid an existential threat from global warming and sea-level rise."
  },
  {
    "title": "The Supreme Court’s Intolerable Ruling on Birthright Citizenship",
    "link": "https://www.nytimes.com/2025/06/27/opinion/birthright-citizenship-case-supreme-court.html",
    "summary": "The court didn’t rule on the legality of Trump’s order, but it didn’t have to."
  },
  {
    "title": "The Internet Needs Sex",
    "link": "https://www.nytimes.com/2025/06/27/opinion/pornography-restrictions-free-speech-obscenity.html",
    "summary": "And an internet without it is one that offers a pale shadow of human potential and possibility."
  },
  {
    "title": "Getty Villa Is Reopening in Los Angeles After Palisades Fire",
    "link": "https://www.nytimes.com/2025/06/27/arts/design/getty-villa-reopen-after-fire.html",
    "summary": "Although the museum’s artwork was unscathed, roughly 1,400 trees on the property burned during the Palisades fire. Visible traces of the devastation are intentional."
  },
  {
    "title": "Tech C.E.O. Pays $400,000 to Conduct the Toronto Symphony",
    "link": "https://www.nytimes.com/2025/06/27/arts/music/mandle-cheung-toronto-symphony-mahler.html",
    "summary": "Mandle Cheung, a 78-year-old amateur conductor, led a performance of Mahler’s “Resurrection” Symphony over the objections of some musicians."
  },
  {
    "title": "Sean ‘Diddy’ Combs Trial: Takeaways From Defense’s Closing Arguments",
    "link": "https://www.nytimes.com/2025/06/27/arts/music/sean-combs-diddy-trial-defense-closings.html",
    "summary": "Mr. Combs’s lead lawyer made a final appeal to the jury, arguing in often sarcastic tones that the government’s evidence contradicted its case against the hip-hop mogul."
  },
  {
    "title": "Newsom Signs Budget That Includes Health Care Cuts for Undocumented Immigrants",
    "link": "https://www.nytimes.com/2025/06/27/us/newsom-budget-immigrant-health.html",
    "summary": "Gov. Gavin Newsom of California signed a budget bill on Friday that depends in part on rolling back those benefits to help close a $12 billion deficit."
  }
]