[
  {
    "title": "For Netanyahu, Trump’s Nod to Peace Puts Him in a Tough Spot",
    "link": "https://www.nytimes.com/2025/10/04/world/middleeast/netanyahu-israel-trump-gaza-plan.html",
    "summary": "The Israeli leader thought he had a plan from the U.S. president that would have represented total victory over Hamas. Suddenly, it looks as though he might not get everything he wants."
  },
  {
    "title": "Trump’s Approach on Gaza: Deal First, Details Later",
    "link": "https://www.nytimes.com/2025/10/04/us/politics/trump-gaza-diplomacy.html",
    "summary": "“We’ll see how it all turns out,” President Trump said after Hamas agreed to portions of his cease-fire plan, with conditions."
  },
  {
    "title": "Trump’s Gaza Peace Plan: What to Know",
    "link": "https://www.nytimes.com/2025/10/04/world/middleeast/hamas-trump-gaza-deal.html",
    "summary": "Israel and Hamas said they would work with President Trump’s plan to end the war, but a number of sticking points could derail efforts to reach a diplomatic breakthrough."
  },
  {
    "title": "This Program Rescued Army Recruiting",
    "link": "https://www.nytimes.com/2025/10/04/us/politics/army-recruiting-trump.html",
    "summary": "The defense secretary cites a ‘Trump bump.’ But the Army’s recruiting surge wouldn’t have been possible without the program started three years ago at Fort Jackson."
  },
  {
    "title": "Trump Seizes On Government Shutdown to Punish Political Foes",
    "link": "https://www.nytimes.com/2025/10/04/us/politics/trump-shutdown-punish-foes.html",
    "summary": "The White House has cut or paused billions in funding to Democratic-run cities and states since the federal government came to a halt."
  },
  {
    "title": "After Trump’s Medicaid Cuts, Patients at Rural Maine Clinics Feel the Fallout",
    "link": "https://www.nytimes.com/2025/10/04/us/medicaid-cuts-trump-maine-clinics.html",
    "summary": "The Trump administration has cut off funding for certain providers around the country whose offerings include abortion. Patients in Maine are among those who will feel the fallout."
  },
  {
    "title": "What Happens When Socialists Are in Charge? Portland Offers a Glimpse.",
    "link": "https://www.nytimes.com/2025/10/04/us/politics/portland-socialists-mamdani.html",
    "summary": "A West Coast version of Zohran Mamdani’s campaign is playing out in Portland. But the socialist city councilors, who say the city has been “run by the rich” for too long, are facing significant opposition."
  },
  {
    "title": "Mamdani Is More Foe Than Friend in the Suburbs, Even Among Democrats",
    "link": "https://www.nytimes.com/2025/10/04/nyregion/mamdani-suburbs-voters-republicans.html",
    "summary": "Just outside New York City, Republicans are using Zohran Mamdani as an attack line for the 2026 midterms, much as they vilified the city in 2022."
  },
  {
    "title": "How Private Equity Oversees the Ethics of Drug Research",
    "link": "https://www.nytimes.com/2025/10/04/health/drug-trials-ethics-ozempic.html",
    "summary": "Many drug trials are vetted by companies with ties to the drugmakers, raising concerns about conflicts of interest and patient safety."
  },
  {
    "title": "The Tech Jester Who Pranks San Francisco",
    "link": "https://www.nytimes.com/2025/10/04/us/riley-walz-san-francisco-parking-tickets-app.html",
    "summary": "Riley Walz, 23, has gained fame for his online antics. His latest stunt has upset city officials."
  },
  {
    "title": "When A.I. Came for Hollywood",
    "link": "https://www.nytimes.com/2025/10/04/opinion/ai-hollywood-tilly-norwood-actress.html",
    "summary": "The Dream Factory is going full fantasy, human factor be damned."
  },
  {
    "title": "‘If You Don’t Want This Consequence, Don’t Vote for Republicans’",
    "link": "https://www.nytimes.com/2025/10/04/opinion/republicans-government-shutdown.html",
    "summary": "This week, the round table convenes to discuss who wins and who loses when the government shuts down."
  },
  {
    "title": "Best Intentions",
    "link": "https://www.nytimes.com/2025/10/04/briefing/best-intentions.html",
    "summary": "Everyone’s “intentional” these days, but don’t let the word’s wholesale application to every activity of modern life deprive you of its benefits."
  },
  {
    "title": "Russian Drones Hit 2 Passenger Trains, Ukraine Says",
    "link": "https://www.nytimes.com/2025/10/04/world/europe/ukraine-russia-train-drones.html",
    "summary": "The drone strikes killed at least one person and injured dozens of others, officials said. The attack came amid rising alarm about the status of a nuclear plant relying solely on generators."
  },
  {
    "title": "Synagogue Attack Increases Pressure on Starmer in the U.K.",
    "link": "https://www.nytimes.com/2025/10/04/world/europe/manchester-synagogue-palestine-antisemitism-starmer-labour-party.html",
    "summary": "The prime minister vowed to rid the Labour Party of antisemitism. But a competing political reality, activist anger over the war in Gaza, has complicated that effort."
  },
  {
    "title": "2 Girls Found Dead Atop a J Train in Suspected Subway Surfing Accident",
    "link": "https://www.nytimes.com/2025/10/04/nyregion/teenage-girls-dead-subway-surfing.html",
    "summary": "The teenagers, found unconscious on the roof of a train in Brooklyn, appear to be the latest casualties of a popular and deadly game."
  },
  {
    "title": "Discount Airlines Like Spirit and Frontier Changed Flying. Now They’re in Trouble.",
    "link": "https://www.nytimes.com/2025/10/04/business/spirit-frontier-low-cost-airlines.html",
    "summary": "Carriers like Spirit and Frontier have lost customers to bigger competitors and seen their costs balloon. Some are in financial distress."
  }
]