[
  {
    "title": "China’s Trade Surplus Climbs Past $1 Trillion for First Time",
    "link": "https://www.nytimes.com/2025/12/07/business/china-trade-surplus.html",
    "summary": "President Trump’s tariffs weren’t enough to hold back the global export flood by China, which pushed past last year’s record in just 11 months."
  },
  {
    "title": "China’s Weak Currency Is Powering Its Exports and Drawing Criticism",
    "link": "https://www.nytimes.com/2025/12/07/business/china-rmb-currency.html",
    "summary": "China’s renminbi is lagging the currencies of key trading partners, making Chinese goods and services cheap and helping to drive exports."
  },
  {
    "title": "A Major Test of Presidential Power, and How States Make Billions From Online Casinos",
    "link": "https://www.nytimes.com/2025/12/08/podcasts/the-headlines/president-power-scotus-online-casinos.html",
    "summary": "Plus, the social changes sweeping Iran."
  },
  {
    "title": "A Weakened Hamas Still Dominates Gaza, Building Day by Day",
    "link": "https://www.nytimes.com/2025/12/08/world/middleeast/hamas-gaza.html",
    "summary": "A cease-fire after two years of war with Israel has allowed Hamas to tighten its grip on power again. “It’s still standing,” one Israeli official said."
  },
  {
    "title": "Syrians Celebrate Anniversary of Bashar al-Assad’s Fall",
    "link": "https://www.nytimes.com/2025/12/08/world/middleeast/syria-anniversary-assad-fall.html",
    "summary": "A year ago, rebels overthrew President Bashar al-Assad, ending decades of dictatorship and civil war. But challenges remain for the new leadership."
  },
  {
    "title": "The New Syria",
    "link": "https://www.nytimes.com/2025/12/07/world/syria-anniversary-assad-benin-trump.html",
    "summary": "The country certainly still faces many challenges. But some things are now going right there — and those are worth our attention, too."
  },
  {
    "title": "Powell Faces Pressure From Multiple Fronts as Fed Prepares to Cut Rates",
    "link": "https://www.nytimes.com/2025/12/08/business/economy/jerome-powell-federal-reserve.html",
    "summary": "The chair of the central bank is dealing with internal divisions while being besieged by President Trump and front-runners jockeying to replace him."
  },
  {
    "title": "U.S. Deports Second Planeload of Iranians, Officials Say",
    "link": "https://www.nytimes.com/2025/12/07/world/middleeast/us-deports-second-planeload-iranians.html",
    "summary": "The plane, carrying about 50 Iranians and other deportees, took off from Arizona on Sunday, under a deal the Trump administration reached with Iran two months ago."
  },
  {
    "title": "Trump Hosts the Kennedy Center Honors, Breaking Tradition",
    "link": "https://www.nytimes.com/2025/12/07/us/politics/trump-kennedy-center-honors.html",
    "summary": "Past presidents have attended the marquee event, but on Sunday Mr. Trump was the first to host it, putting his cultural takeover of Washington in sharp relief."
  },
  {
    "title": "Must the Military Disobey Unlawful Orders? Pam Bondi Has Said Yes.",
    "link": "https://www.nytimes.com/2025/12/08/us/politics/military-unlawful-orders-pam-bondi.html",
    "summary": "As a lawyer for a conservative think tank, Ms. Bondi, now the attorney general, filed a Supreme Court brief last year saying service members who followed such orders were committing crimes."
  },
  {
    "title": "Supreme Court to Hear Major Test of Trump’s Power to Fire Officials",
    "link": "https://www.nytimes.com/2025/12/08/us/politics/supreme-court-trump-presidential-power.html",
    "summary": "The court’s conservative majority has generally let President Trump remove leaders of independent agencies like the Federal Trade Commission, at least temporarily."
  },
  {
    "title": "Thai Jets Bomb Cambodia as at Least 5 Die in New Wave of Fighting",
    "link": "https://www.nytimes.com/2025/12/08/world/asia/thailand-cambodia-f16-jets.html",
    "summary": "Each side accused the other of firing first. The hostilities came weeks after President Trump had cast himself as a peacemaker in the decades-old border dispute."
  },
  {
    "title": "Zelensky to Meet With European Leaders as Ukraine Peace Talks Drag On",
    "link": "https://www.nytimes.com/2025/12/08/world/europe/zelensky-ukraine-war-peace-talks-europe-london.html",
    "summary": "Ukraine’s president was expected in London to discuss with the leaders of Britain, France and Germany ways of ending the conflict against Russia."
  },
  {
    "title": "He Was a Russian Activist in Exile. His Own Wife Accused Him of Spying.",
    "link": "https://www.nytimes.com/2025/12/08/world/europe/russia-spy-poland.html",
    "summary": "Poland has charged a little-known Russian opposition figure with espionage and participating in a bomb plot. His friends are perplexed."
  },
  {
    "title": "4 Takeaways From The Times’s Examination of N.Y.C. Subway Collisions",
    "link": "https://www.nytimes.com/2025/12/08/nyregion/nyc-subway-strikes-takeaways.html",
    "summary": "New York City train operators witness more people being struck by trains than drivers in any other American system. Afterward, many struggle to get the help they need."
  },
  {
    "title": "New Orleans Restaurants Feel Squeezed as Border Patrol Sweeps In",
    "link": "https://www.nytimes.com/2025/12/08/us/new-orleans-restaurants-immigration-workers-border-patrol.html",
    "summary": "Ripple effects from a federal crackdown illustrate how heavily the city’s robust dining scene depends both directly and indirectly on immigrant workers."
  },
  {
    "title": "Golden Globes to Announce 2026 Nominations",
    "link": "https://www.nytimes.com/2025/12/08/business/media/golden-globes-nominations-2026.html",
    "summary": "Movies like “One Battle After Another” and “Hamnet” are considered strong contenders for the top awards, along with television shows like “The Pitt” and “The Studio.”"
  },
  {
    "title": "What Trump’s East Wing Demolition Says About Our Preoccupation With ‘Renovation’",
    "link": "https://www.nytimes.com/2025/12/08/style/trump-east-wing-demolition-renovations-society.html",
    "summary": "The gutting of the East Wing of the White House and our national preoccupation with “renovation.”"
  },
  {
    "title": "A Corruption Scandal in Ukraine",
    "link": "https://www.nytimes.com/2025/12/08/briefing/a-corruption-scandal-in-ukraine.html",
    "summary": "We examine an investigation that is testing Volodymyr Zelensky’s government."
  },
  {
    "title": "United Nations Cuts Its 2026 Emergency Aid Budget in Half",
    "link": "https://www.nytimes.com/2025/12/08/world/united-nations-humanitarian-aid-cuts.html",
    "summary": "Huge reductions in foreign aid by the United States and Europe have led the U.N.’s emergency relief coordinator to slash its fund-raising targets for next year."
  },
  {
    "title": "Miami Hasn’t Had a Democratic Mayor in Almost 30 Years. Is That About to Change?",
    "link": "https://www.nytimes.com/2025/12/08/us/miami-mayor-election-gonzalez-higgins.html",
    "summary": "Democrats see their voters energized in a county that President Trump won. Republicans fear the runoff could add to recent losses."
  },
  {
    "title": "Obamacare Users Face Higher Deductibles, Higher Premiums",
    "link": "https://www.nytimes.com/2025/12/08/health/obamacare-deductibles-premiums-health-insurance.html",
    "summary": "People who have insurance under the Affordable Care Act are being asked to pay more for plans that will cover less of their care."
  },
  {
    "title": "Dogs in Kimonos: Japan Reinvents a Children’s Holiday With Pets in Mind",
    "link": "https://www.nytimes.com/2025/12/08/world/asia/japan-pets-festival.html",
    "summary": "A traditional Japanese festival is being adapted for poodles and Pomeranians, amid a booming pet industry and a dearth of children."
  }
]