[
  {
    "title": "Trump Insists Tariffs Will Buoy the Economy and Ease Cost Concerns",
    "link": "https://www.nytimes.com/2025/12/08/us/politics/trump-trade-affordability.html",
    "summary": "The president rolled out a $12 billion bailout for farmers as he makes the case that his policy is working — or will soon."
  },
  {
    "title": "Trump Plans $12 Billion Bailout to Aid Farmers Hit by Tariffs",
    "link": "https://www.nytimes.com/2025/12/08/us/politics/trump-farmers-aid-bailout.html",
    "summary": "The federal aid comes after China boycotted American farm products in retaliation for U.S. tariffs."
  },
  {
    "title": "Trump Clears Sale of More Powerful Nvidia A.I. Chips to China",
    "link": "https://www.nytimes.com/2025/12/08/business/trump-nvidia-chips-china.html",
    "summary": "Approval for the H200 chip followed months of haggling between tech industry backers and defense hawks."
  },
  {
    "title": "A Frustrated Congress Pushes the Pentagon to Produce Its Boat Strike Orders",
    "link": "https://www.nytimes.com/2025/12/08/us/politics/defense-bill-congress-boat-strikes.html",
    "summary": "In a sign of bipartisan frustration with the Defense Department, the final defense policy bill aims to compel the Pentagon to share execute orders and video documentation."
  },
  {
    "title": "Massachusetts Church Keeps Anti-ICE Nativity Scene, Defying Diocese Leaders",
    "link": "https://www.nytimes.com/2025/12/08/us/massachusetts-church-ice-nativity-scene.html",
    "summary": "The Christmas display, which replaces Jesus, Mary and Joseph with a sign saying “ICE Was Here,” has drawn criticism from Catholic leaders and immigration officials."
  },
  {
    "title": "Trump Criticizes Zelensky as Ukraine Peace Talks Drag On With European Leaders",
    "link": "https://www.nytimes.com/2025/12/08/world/europe/zelensky-ukraine-war-peace-talks-europe-london.html",
    "summary": "Despite pressure from the Trump administration, Mr. Zelensky, after meeting with European leaders who vowed continued support in the war, said Ukraine’s position on territory had not changed."
  },
  {
    "title": "Russian Court Sentences 4 Soldiers to Prison for Killing Texan",
    "link": "https://www.nytimes.com/2025/12/08/world/europe/russia-soldiers-sentence-murder-texas.html",
    "summary": "Russell Bonner Bentley III, 64, who was living in the occupied Donbas region of Ukraine, was beaten and tortured to death after he was suspected of being an American saboteur, investigators said."
  },
  {
    "title": "N.Y. Archdiocese Will Negotiate Sex-Abuse Settlement for 1,300 Accusers",
    "link": "https://www.nytimes.com/2025/12/08/nyregion/ny-archdiocese-sex-abuse-settlement.html",
    "summary": "The archdiocese will raise at least $300 million to fund the settlement. It has agreed with its accusers on a mediator to conduct negotiations."
  },
  {
    "title": "With Cheap Tickets and Lax Etiquette, a Theater Builds an Older Fan Base",
    "link": "https://www.nytimes.com/2025/12/09/world/asia/skorea-aging-movies.html",
    "summary": "The Hollywood Classic cinema in Seoul is popular in a country where 70-year-olds now outnumber people in their 20s."
  },
  {
    "title": "Supreme Court Seems Poised to Give Trump More Power to Fire Independent Officials",
    "link": "https://www.nytimes.com/2025/12/08/us/politics/supreme-court-trump-presidential-power.html",
    "summary": "A ruling in the president’s favor in the case, which deals with his attempt to remove a member of the Federal Trade Commission, would be a major expansion of presidential authority."
  },
  {
    "title": "Supreme Court Questions N.Y. Ban on Religious Exemptions for Vaccines",
    "link": "https://www.nytimes.com/2025/12/08/nyregion/ny-school-vaccinations.html",
    "summary": "The U.S. Supreme Court directed a lower court to review the ban, which applies to strict vaccine requirements in New York schools."
  },
  {
    "title": "Honduras Issues Warrant for Juan Orlando Hernández",
    "link": "https://www.nytimes.com/2025/12/08/world/americas/honduras-hernandez-arrest-warrant.html",
    "summary": "The attorney general said he had asked Interpol to detain Juan Orlando Hernández, who was freed from a U.S. prison last week."
  },
  {
    "title": "Trump Stands in the Middle as Netflix and Paramount Vie for a Megadeal",
    "link": "https://www.nytimes.com/2025/12/08/business/media/trump-netflix-paramount-deal.html",
    "summary": "The president has shattered norms by pledging to “be involved” in the regulatory fate of a transaction that could reshape the news and entertainment industries."
  },
  {
    "title": "Jared Kushner Is Part of Paramount’s Bid for Warner Bros. Discovery",
    "link": "https://www.nytimes.com/2025/12/08/business/media/jared-kushner-paramount-bid-warner-bros-discovery.html",
    "summary": "Mr. Kushner’s private equity fund is one of the many groups helping Paramount mount a hostile bid to buy the group, whose holdings include CNN."
  },
  {
    "title": "G.O.P. Senators Push Health Care Options as Vote Looms",
    "link": "https://www.nytimes.com/2025/12/08/us/politics/obamacare-subsidy-vote-aca.html",
    "summary": "The Senate is set to vote later this week on a three-year extension of Affordable Care Act subsidies that Republicans oppose. The G.O.P. has yet to coalesce around an alternative."
  },
  {
    "title": "DeSantis Designates CAIR, Muslim Advocacy Group, a ‘Terrorist Organization’",
    "link": "https://www.nytimes.com/2025/12/08/us/desantis-cair-muslim-terrorism-florida.html",
    "summary": "The executive order from the Florida governor came after another Republican governor, Greg Abbott of Texas, issued a similar declaration last month."
  },
  {
    "title": "How Japan Built a Rare-Earth Supply Chain Without China",
    "link": "https://www.nytimes.com/2025/12/08/business/japan-rare-earths-lynas.html",
    "summary": "The 15-year effort by Japan is a model for countries now scrambling to reduce their dependence on Beijing’s critical metals."
  },
  {
    "title": "A.I. Videos Have Flooded Social Media. No One Was Ready.",
    "link": "https://www.nytimes.com/2025/12/08/technology/ai-slop-sora-social-media.html",
    "summary": "Apps like OpenAI’s Sora are fooling millions of users into thinking A.I. videos are real, even when they include warning labels."
  },
  {
    "title": "Why Some Doctors Say There Are Cancers That Shouldn’t Be Treated",
    "link": "https://www.nytimes.com/2025/12/08/health/cancer-young-people-deaths.html",
    "summary": "Statistics show a clear spike in eight cancers in younger people, but that has brought a debate over whether many cases ever needed to be found."
  },
  {
    "title": "The Best New Restaurants in New York in 2025",
    "link": "https://www.nytimes.com/2025/12/08/dining/best-new-nyc-restaurants.html",
    "summary": "Here are the new kids on the block our critics loved most this year."
  },
  {
    "title": "Best New York City Dishes",
    "link": "https://www.nytimes.com/2025/12/08/dining/best-nyc-dishes.html",
    "summary": "Bánh cuốn, chicken bastilla and 10 other unforgettable plates from 2025."
  },
  {
    "title": "Nancy Mace: Why The Republican House Isn’t Working",
    "link": "https://www.nytimes.com/2025/12/08/opinion/nancy-mace-congress-republicans.html",
    "summary": "The system in the House promotes control by party leaders over accountability and achievement."
  },
  {
    "title": "Top N.Y. Cannabis Official Resigns as Major Investigation Is Dropped",
    "link": "https://www.nytimes.com/2025/12/08/nyregion/cannabis-regulators-omnium.html",
    "summary": "Gov. Kathy Hochul demanded the resignation of the head of New York’s Office of Cannabis Management following the withdrawal of a case against a Long Island-based company."
  },
  {
    "title": "John Noble Wilford, Times Reporter Who Covered the Moon Landing, Dies at 92",
    "link": "https://www.nytimes.com/2025/12/08/science/john-noble-wilford-dead.html",
    "summary": "He gave readers a comprehensive and lyrical account of the historic mission in 1969. His science coverage as a Pulitzer-winning journalist and an author took him around the world."
  },
  {
    "title": "University of Oklahoma Removes a Teacher It Says Urged Students to Protest",
    "link": "https://www.nytimes.com/2025/12/08/us/oklahoma-university-removes-instructor-protest-bible-gender.html",
    "summary": "The protest was over the removal of another instructor, who gave a failing grade on a paper about gender that relied on the Bible as its main source."
  }
]