[
  {
    "title": "Strike Set Back Iran’s Nuclear Program by Only a Few Months, U.S. Report Says",
    "link": "https://www.nytimes.com/2025/06/24/us/politics/iran-nuclear-sites.html",
    "summary": "Preliminary classified findings indicate that the attack sealed off the entrances to two facilities but did not collapse their underground buildings."
  },
  {
    "title": "How Iran Became Isolated",
    "link": "https://www.nytimes.com/video/world/middleeast/100000010248215/how-iran-became-isolated.html",
    "summary": "Christina Goldbaum, a New York Times reporter, and Katrin Bennhold, a senior writer on the international desk, discuss how the power dynamics in the Middle East could change as Iran has become more isolated."
  },
  {
    "title": "Intel Report on Iran Upends Victory Lap Trump Was Hoping for at NATO",
    "link": "https://www.nytimes.com/2025/06/24/us/politics/trump-nato-iran.html",
    "summary": "President Trump had been eager to celebrate the U.S. strikes on Iran, but a new report indicates the attack set back Iran’s nuclear program by only a few months."
  },
  {
    "title": "How B-2 Bombers Can Fly to Iran and Back",
    "link": "https://www.nytimes.com/2025/06/24/us/politics/b2-pilots-iran.html",
    "summary": "The U.S. crews involved in attacking the nuclear site at Fordo probably trained for years. But dropping 30,000-pound bombs was almost certainly a new experience."
  },
  {
    "title": "What to Watch for When the N.Y.C. Mayoral Results Come In",
    "link": "https://www.nytimes.com/2025/06/24/nyregion/when-know-nyc-mayor-primary-winner.html",
    "summary": "A winner on Tuesday night is unlikely, but not impossible. Ranked-choice voting will play a big role in the outcome. Here’s what else you should look for as votes are counted."
  },
  {
    "title": "Anthony Weiner Hopes Voters Have Forgiven or Forgotten",
    "link": "https://www.nytimes.com/2025/06/24/nyregion/anthony-weiner-comeback-council.html",
    "summary": "Mr. Weiner returned from a prison term to launch an unlikely campaign for the City Council. Outside a polling place on Tuesday, it was hot, mostly friendly and a little awkward."
  },
  {
    "title": "How People Are Coping With the East Coast Heat Spike",
    "link": "https://www.nytimes.com/2025/06/24/us/heat-wave-east-coast.html",
    "summary": "A brutally hot day across the Eastern United States left residents struggling to find relief."
  },
  {
    "title": "A Heat Wave Hits New York Earlier Than Usual for a Second Year in a Row",
    "link": "https://www.nytimes.com/2025/06/24/nyregion/nyc-heat-wave.html",
    "summary": "Climate change is increasingly making weather extremes more common."
  },
  {
    "title": "Toronto Sees Record Temperatures as Extreme Heat Settles Over Canada",
    "link": "https://www.nytimes.com/2025/06/24/world/canada/toronto-heat-wave.html",
    "summary": "Sweltering temperatures not seen in Toronto in nearly a decade have prompted health alerts, pool closures and warnings to students to expect “uncomfortable conditions.”"
  },
  {
    "title": "House Conservatives Warn They Can’t Back Senate Bill to Enact Trump’s Agenda",
    "link": "https://www.nytimes.com/2025/06/24/us/politics/house-conservatives-senate-big-beautiful-bill.html",
    "summary": "Both President Trump and Senate Republican leaders are pressing for the House to accept their version of the sprawling domestic policy bill, but some right-wing holdouts are opposed to key pieces."
  },
  {
    "title": "Returning to Supreme Court, Trump Accuses Judge in Migrant Case of Defiance",
    "link": "https://www.nytimes.com/2025/06/24/us/supreme-court-migrants-sudan.html",
    "summary": "After the justices let the administration deport migrants to countries with which they had no connection, a federal judge blocked the removal of eight men."
  },
  {
    "title": "Cassidy, in Break With RFK Jr., Calls for Vaccine Meeting Delay",
    "link": "https://www.nytimes.com/2025/06/24/us/politics/cassidy-kennedy-vaccine-committee.html",
    "summary": "The Senate health committee chairman said new members of a key advisory panel who were appointed by Robert F. Kennedy Jr. “lack experience.”"
  },
  {
    "title": "Real Doctors of New York Spill Their Guts",
    "link": "https://www.nytimes.com/2025/06/24/well/real-doctors-of-new-york-spill-their-guts.html",
    "summary": "E.R. doctors want you to know that they are people, too. At an event called Airway, one confessed, “I do not like these big, high stakes, bloody, messy, risky procedures.”"
  },
  {
    "title": "Bobby Sherman, Easygoing Teen Idol of the 1960s and ’70s, Dies at 81",
    "link": "https://www.nytimes.com/2025/06/24/arts/music/bobby-sherman-dead.html",
    "summary": "First on TV and then on the pop charts, he became so popular so young, he once said, that he “didn’t really have time to have an ego.”"
  },
  {
    "title": "A Colorado County Shows Why Mike Lee’s Plan to Sell Public Land Failed",
    "link": "https://www.nytimes.com/2025/06/24/us/politics/mike-lee-public-lands-selloff-colorado.html",
    "summary": "Senator Mike Lee hoped to sell millions of acres of federal land through President Trump’s policy bill, in part to ease housing costs. The opposition was bipartisan, in Congress and the West."
  },
  {
    "title": "Marcia Resnick, Whose Camera Captured New York’s ‘Bad Boys’, Dies at 74",
    "link": "https://www.nytimes.com/2025/06/24/arts/marcia-resnick-dead.html",
    "summary": "A conceptual artist, she used photography to make surrealistic images and then went on to document Manhattan’s downtown scene and its mostly male provocateurs."
  },
  {
    "title": "Sean ‘Diddy’ Combs Thanks the Judge at His Federal Trial as His Defense Rests",
    "link": "https://www.nytimes.com/2025/06/24/arts/music/sean-combs-diddy-trial-prosecution-rests.html",
    "summary": "After 28 days of testimony in the federal sex-trafficking and racketeering trial, both sides rested. The music mogul did not take the stand."
  },
  {
    "title": "Women in Menopause Don’t Care",
    "link": "https://www.nytimes.com/2025/06/24/well/menopause-melani-sanders-club.html",
    "summary": "The “We Do Not Care” club, founded by influencer Melani Sanders, celebrates women who have stopped trying to please everyone."
  },
  {
    "title": "If This Mideast War Is Over, Get Ready for Some Interesting Politics",
    "link": "https://www.nytimes.com/2025/06/24/opinion/iran-israel-regime-change.html",
    "summary": "Everyone went all the way in the Israel-Iran conflict, bursting through psychological and military barriers we never imagined would be breached."
  },
  {
    "title": "A.I. Doesn’t Have to Mean a ‘White-Collar Blood Bath’ of Job Loss",
    "link": "https://www.nytimes.com/2025/06/24/opinion/ai-job-loss-white-collar.html",
    "summary": "Instead of asking which future is coming, we should be asking which future we want."
  },
  {
    "title": "Missing Bolts and Other Failures Caused Plane Panel to Blow Off, N.T.S.B. Says",
    "link": "https://www.nytimes.com/2025/06/24/us/politics/boeing-alaska-airlines-plane-737-panel-accident.html",
    "summary": "A panel came off an Alaska Airlines Boeing 737 Max 9 midair last year in an incident that was nearly disastrous but for the heroics of the crew, according to government investigators."
  },
  {
    "title": "Blake Farenthold, 63, Congressman Who Quit in Harassment Case, Dies",
    "link": "https://www.nytimes.com/2025/06/24/us/politics/blake-farenthold-dead.html",
    "summary": "A Texas Republican, he gave up his seat after news broke that public funds had been used to settle the case, made by his former communications director."
  },
  {
    "title": "4 Arrested After Pride Flags Are Slashed at Atlanta L.G.B.T.Q. Landmark",
    "link": "https://www.nytimes.com/2025/06/24/us/politics/atlanta-hate-crime-pride-flags.html",
    "summary": "A group of six young men traveled to Atlanta before dawn and tore flags at a rainbow crosswalk, the police said. Two of them remain at large as the authorities consider hate crime charges."
  },
  {
    "title": "Lynn Hamilton, a Steady Presence on ‘Sanford and Son,’ Dies at 95",
    "link": "https://www.nytimes.com/2025/06/24/arts/television/lynn-hamilton-dead.html",
    "summary": "A former Broadway actress, she was a no-nonsense foil for the unruly Fred Sanford. She also warmed hearts with a recurring role on the “The Waltons.”"
  }
]