[
  {
    "title": "Tariffs Are Here to Stay, Even if the Supreme Court Rules Against Trump",
    "link": "https://www.nytimes.com/2025/11/05/us/politics/trump-tariff-alternatives.html",
    "summary": "The Trump administration says it has plenty of other options to impose tariffs, if the court rules against the president."
  },
  {
    "title": "Takeaways From the NYC Mayoral Election and Zohran Mamdani’s Stunning Win",
    "link": "https://www.nytimes.com/2025/11/05/nyregion/nyc-mayor-election-mamdani-takeaways.html",
    "summary": "Zohran Mamdani motivated voters to head for the polls, using a broad coalition of supporters to overcome Andrew Cuomo’s success in siphoning Republican votes."
  },
  {
    "title": "How Zohran Mamdani Beat Back New York’s Elite and Was Elected Mayor",
    "link": "https://www.nytimes.com/2025/11/04/nyregion/how-zohran-mamdani-won-nyc-mayor.html",
    "summary": "The 34-year-old assemblyman won the Democratic primary by defying the city’s all-powerful establishment. He secured the mayoralty by delicately disarming it."
  },
  {
    "title": "Passage of California’s Prop. 50 Raises Newsom’s Political Profile",
    "link": "https://www.nytimes.com/2025/11/05/us/newsom-california-election.html",
    "summary": "The passage of Proposition 50 cemented Gov. Gavin Newsom’s position as President Trump’s chief antagonist and raised his national political profile."
  },
  {
    "title": "Republicans Swiftly File Lawsuit in Bid to Block California’s New House Maps",
    "link": "https://www.nytimes.com/2025/11/05/us/republicans-lawsuit-california-redistricting-maps.html",
    "summary": "Republicans asked a federal court to block newly approved maps in California that were designed to flip as many as five House seats for Democrats."
  },
  {
    "title": "Elections Show Trump’s Edge on the Economy Slipping",
    "link": "https://www.nytimes.com/2025/11/05/us/politics/trump-elections-economy-inflation.html",
    "summary": "Democrats harnessed worries about the cost of living, with polls showing that Republicans’ longtime advantage on the economy has evaporated."
  },
  {
    "title": "6 Takeaways From Elections in Virginia, New Jersey, New York and Beyond",
    "link": "https://www.nytimes.com/2025/11/05/us/politics/election-takeaways-democrats.html",
    "summary": "In Virginia, New Jersey and beyond, Democratic voters powered their candidates to victory and sent a warning sign to President Trump and his Republican Party."
  },
  {
    "title": "He’s Been Charged With Dozens of Crimes. Nobody Knows His Name.",
    "link": "https://www.nytimes.com/2025/11/05/nyregion/nyc-criminal-identity-names.html",
    "summary": "He called himself by many names as he cycled in and out of prison. He is to be sentenced in Queens for deed fraud, but investigators still do not know his true identity."
  },
  {
    "title": "Some SNAP Recipients May Not Receive Food Stamps in November Amid Government Shutdown",
    "link": "https://www.nytimes.com/2025/11/05/us/politics/snap-payments-white-house.html",
    "summary": "Anti-hunger groups and state officials have warned that the administration’s plans to make partial payments are onerous and could still result in severe harm."
  },
  {
    "title": "As Government Shutdown Stalemate Persists, Frustration Defies Party Lines",
    "link": "https://www.nytimes.com/2025/11/05/us/politics/shutdown-congress-georgia-health-care.html",
    "summary": "The partisan divisions in Washington are as deep as ever, but some voters in both parties have grown weary of the standoff and want it to end."
  },
  {
    "title": "UPS Plane Crash Near Louisville Airport Kills at Least 9, Officials Say",
    "link": "https://www.nytimes.com/2025/11/04/us/louisville-ups-plane-crash.html",
    "summary": "The plane crashed and exploded shortly after taking off from a Kentucky airport, disrupting operations at the delivery company’s main air cargo hub."
  },
  {
    "title": "What We Know About the UPS Plane Crash in Louisville",
    "link": "https://www.nytimes.com/2025/11/04/us/plane-crash-louisville-kentucky-ups.html",
    "summary": "At least nine people died when a cargo plane crashed after takeoff in Louisville, Ky. The airport in reopened Wednesday morning, but officials warned the death toll could rise."
  },
  {
    "title": "After Deadly Plane Crash at UPS Hub in Louisville, Some Deliveries May Be Delayed",
    "link": "https://www.nytimes.com/2025/11/05/world/europe/ups-louisville-shipping-delays.html",
    "summary": "The crash killed nine people and forced a halt to operations at UPS Worldport, a major automated package sorting facility. UPS said that some deliveries could be delayed."
  },
  {
    "title": "In ‘Wicked: For Good,’ Ariana Grande Solidifies Herself as a Dramatic Actress",
    "link": "https://www.nytimes.com/2025/11/05/movies/ariana-grande-wicked-for-good.html",
    "summary": "The pop superstar reinvented herself in the first “Wicked,” but the sequel shows just how much further she can go as an actress."
  },
  {
    "title": "Elizabeth Tsurkov Recounts 2 1/2 Years of Captivity",
    "link": "https://www.nytimes.com/2025/11/05/world/middleeast/tsurkov-kataib-torture-kidnap.html",
    "summary": "Elizabeth Tsurkov, a citizen of Israel and Russia, recounts a harrowing story of cruelty, survival, U.S. diplomatic pressure and, finally, release from the grip of a group backed by Iran."
  },
  {
    "title": "What to Know About Kataib Hezbollah, the Iraqi Militia That Held Tsurkov Captive",
    "link": "https://www.nytimes.com/2025/11/05/world/europe/what-to-know-about-the-militia-that-kidnapped-elizabeth-tsurkov.html",
    "summary": "Kataib Hezbollah, a hard-line Iraqi militia linked to Iran, held Elizabeth Tsurkov, a citizen of Israel and Russia, hostage for more than two years."
  },
  {
    "title": "Brazil Proposes a New Type of Fund to Protect Tropical Forests",
    "link": "https://www.nytimes.com/2025/11/05/climate/cop30-amazon-brazil-forest-fund.html",
    "summary": "The multibillion-dollar fund would essentially pay countries to keep forests standing, hoping for success where earlier forest-protection ideas have struggled."
  },
  {
    "title": "A Harrowing Escape From the Drone-Infested Hellscape of Ukraine’s Front Lines",
    "link": "https://www.nytimes.com/2025/11/05/magazine/ukraine-russia-war-drones.html",
    "summary": "In Ukraine, unmanned weapons hunt the wounded and medics alike. Moving injured soldiers to safety has never been more difficult."
  },
  {
    "title": "For Dick Cheney, a Journey From Champion of War to Voice of Resistance",
    "link": "https://www.nytimes.com/2025/11/04/us/politics/dick-cheney-trump.html",
    "summary": "Dick Cheney was to many the embodiment of the unpopular and bloody Iraq war. But his late-in-life anti-Trumpism changed his image for some of his longtime critics."
  },
  {
    "title": "The Greatest Breakfast Sandwich May Be the One With Pastrami",
    "link": "https://www.nytimes.com/2025/11/05/dining/pastrami-breakfast-sandwich.html",
    "summary": "New York City has been overlooking the obvious all along."
  },
  {
    "title": "Mamdani’s Victory Is Less Significant Than You Think",
    "link": "https://www.nytimes.com/2025/11/05/opinion/mamdani-interesting-times-podcast.html",
    "summary": "New York’s next mayor won’t save the Democrats."
  },
  {
    "title": "Six Ways Zohran Mamdani Can Improve New York City",
    "link": "https://www.nytimes.com/2025/11/04/opinion/mayor-mamdani-new-york-election.html",
    "summary": "Mamdani, who campaigned on sweeping promises, can build a positive legacy by focusing on tangible accomplishments."
  },
  {
    "title": "2 Spooky Flashes Lit Up the Moon. Here’s What Made Them.",
    "link": "https://www.nytimes.com/2025/11/05/science/moon-asteroids-impact.html",
    "summary": "A Japanese astronomer captured a pair of objects slamming into the lunar surface in recent days."
  },
  {
    "title": "Scars in the Blue Mosque Reveal Afghanistan’s Rifts",
    "link": "https://www.nytimes.com/2025/11/05/world/africa/blue-mosque-afghanistan-earthquake.html",
    "summary": "The namesake of Mazar-i-Sharif suffered countless cracks in a 6.3-magnitude quake, but, like Afghanistan, it has endured for centuries."
  },
  {
    "title": "Attacked by Swarm of Wasps, American Father and Son Die in Laos",
    "link": "https://www.nytimes.com/2025/11/05/world/asia/laos-wasp-attack-father-son.html",
    "summary": "Daniel Owen, 47, and his son, Cooper, 15, died after being stung dozens of times last month by what appeared to be so-called murder hornets."
  },
  {
    "title": "Bob Trumpy, Star Receiver Turned NBC Football Analyst, Dies at 80",
    "link": "https://www.nytimes.com/2025/11/04/sports/bob-trumpy-dead.html",
    "summary": "He made his mark with the Cincinnati Bengals as a fast pass-catching tight end. He later joined announcers like Bob Costas and Dick Enberg in the broadcast booth."
  }
]