[
  {
    "title": "Trump’s Security Strategy Focuses on Profit, Not Spreading Democracy",
    "link": "https://www.nytimes.com/2025/12/05/us/politics/trump-national-security-strategy.html",
    "summary": "President Trump’s new National Security Strategy describes a country that is focused on doing business and reducing migration while avoiding passing judgment on authoritarians."
  },
  {
    "title": "U.S. Warns of Europe’s ‘Civilizational Erasure’ Through Immigration",
    "link": "https://www.nytimes.com/2025/12/05/world/europe/trump-europe.html",
    "summary": "America’s goal should be “to help Europe correct its current trajectory,” the administration said in its new National Security Strategy."
  },
  {
    "title": "Supreme Court Agrees to Review Trump Order Restricting Birthright Citizenship",
    "link": "https://www.nytimes.com/2025/12/05/us/politics/supreme-court-trump-birthright-citizenship.html",
    "summary": "The administration asked the justices to uphold an executive order ending birthright citizenship after lower courts ruled it violated the Constitution."
  },
  {
    "title": "The Supreme Court, Once Wary of Partisan Gerrymandering, Goes All In",
    "link": "https://www.nytimes.com/2025/12/05/us/politics/supreme-court-partisan-gerrymandering.html",
    "summary": "The court’s conservative majority said that Texas’ asserted political motives justified letting the state use voting maps meant to disadvantage Democrats in the midterms."
  },
  {
    "title": "Frank Gehry, the Disrupter, Opened Their Imaginations",
    "link": "https://www.nytimes.com/2025/12/05/arts/design/frank-gehry-appraisal-disney-hall-bilbao-los-angeles.html",
    "summary": "Architects, artists, clients and partners assess his life and impact over eight decades."
  },
  {
    "title": "Frank O. Gehry, Titan of Architecture, Is Dead at 96",
    "link": "https://www.nytimes.com/2025/12/05/arts/design/frank-gehry-dead.html",
    "summary": "He burst onto the scene with an attention-getting renovation of his Southern California home before going on to design some of the world’s most recognizable buildings."
  },
  {
    "title": "Frank Gehry: 12 Essential, Stunning Projects",
    "link": "https://www.nytimes.com/2025/12/05/arts/design/frank-gehry-buildings-photos.html",
    "summary": "A singular genius, Gehry redefined architecture with joyful buildings like the Walt Disney Concert Hall in Los Angeles and the Guggenheim Museum Bilbao."
  },
  {
    "title": "Running Out of Time, Republicans in Congress Still Lack a Health Plan",
    "link": "https://www.nytimes.com/2025/12/05/us/politics/republicans-congress-health-care.html",
    "summary": "Top Republicans have said they want to produce a proposal in short order to counter Democrats pressing for an extension of health care subsidies. They have not gotten far."
  },
  {
    "title": "As Bongino Celebrates Arrest in Pipe Bomb Case, Others on the Right Remain Skeptical",
    "link": "https://www.nytimes.com/2025/12/05/us/politics/dan-bongino-pipe-bomb-arrest.html",
    "summary": "Some activists have lashed out, in a reprise of the backlash over the unsuccessful effort by Trump appointees to shut down the Epstein investigation."
  },
  {
    "title": "C.D.C. Vaccine Committee Ends Recommendation That All Newborns Receive Hepatitis B Shots",
    "link": "https://www.nytimes.com/2025/12/05/health/kennedy-vaccine-committee-vote-hepatitisb.html",
    "summary": "In a move toward Health Secretary Robert F. Kennedy Jr.’s goal of upending vaccine policy, the committee recommended delaying the shots for infants whose mothers test negative for the virus."
  },
  {
    "title": "Halligan Continues as U.S. Attorney, Prompting Criticism From Judges",
    "link": "https://www.nytimes.com/2025/12/05/us/politics/halligan-us-attorney-judiciary.html",
    "summary": "The Justice Department has seized on a lack of explicit instruction from a federal judge to keep Lindsey Halligan in place for now."
  },
  {
    "title": "Elon Musk Loves What Mario Nawfal Has to Say",
    "link": "https://www.nytimes.com/2025/12/05/business/media/elon-musk-mario-nawfal-x.html",
    "summary": "Mario Nawfal has a knack for getting Mr. Musk’s attention online, and for turning that into big business."
  },
  {
    "title": "Lots of Oil, Little Production: What to Know About Venezuelan Energy",
    "link": "https://www.nytimes.com/2025/12/05/business/energy-environment/venezuela-oil-trump.html",
    "summary": "The South American country increasingly at odds with the Trump administration has the world’s largest oil reserves."
  },
  {
    "title": "Netflix to Buy Warner Bros in $83 Billion Deal",
    "link": "https://www.nytimes.com/2025/12/05/business/warner-brothers-discovery-netflix.html",
    "summary": "The deal to acquire the Hollywood behemoth’s television and film studios as well as HBO Max will bulk up the world’s biggest paid streaming service."
  },
  {
    "title": "Netflix Changes Course Again With Warner Bros. Deal",
    "link": "https://www.nytimes.com/2025/12/05/business/media/netflix-movie-theaters-warner-bros.html",
    "summary": "The streaming giant has changed its strategy many times over the years. But the decision to get deeply into theatrical releases may be the most startling yet."
  },
  {
    "title": "CNN Is Excluded From Netflix’s Warner Bros. Deal for Now",
    "link": "https://www.nytimes.com/2025/12/05/business/media/cnn-netflix-warner-bros-discovery-deal.html",
    "summary": "The prospect of Paramount’s buying Warner Bros. Discovery had led CNN journalists to wonder if the channel may be combined with CBS News. Instead, CNN will remain in a separate corporate entity."
  },
  {
    "title": "Rich New Yorkers Threaten to Leave. Then They Find Out How Hard That Is.",
    "link": "https://www.nytimes.com/2025/12/05/nyregion/nyc-income-tax-rich.html",
    "summary": "Tax accountants and lawyers detail the arduous process wealthy New Yorkers would have to face to avoid paying New York State and city taxes."
  },
  {
    "title": "Mamdani Woos Wealthy Donors Alongside Grassroots Givers for Transition",
    "link": "https://www.nytimes.com/2025/12/05/nyregion/mamdani-transition-fund-raisers.html",
    "summary": "Mayor-elect Zohran Mamdani has turned to crypto kings, movie stars and an oil heir, among others, to help reach his $4 million goal to fund his transition and Jan. 1 inauguration."
  },
  {
    "title": "San Diego to Pay $30 Million to Family of Konoa Wilson, Teen Killed by Police",
    "link": "https://www.nytimes.com/2025/12/05/us/konoa-wilson-police-shooting-san-diego.html",
    "summary": "Konoa Wilson was 16 when he was fatally shot. The settlement, one of the largest in a police killing, surpasses the $27 million paid to the family of George Floyd."
  },
  {
    "title": "Olivia Nuzzi and Vanity Fair Will Part Ways",
    "link": "https://www.nytimes.com/2025/12/05/business/media/vanity-fair-olivia-nuzzi.html",
    "summary": "Condé Nast, the magazine’s parent company, said her contract would expire at the end of the year."
  },
  {
    "title": "How Kit Kat Was Killed: Video Shows What a Waymo Couldn’t See",
    "link": "https://www.nytimes.com/2025/12/05/us/waymo-kit-kat-san-francisco.html",
    "summary": "Surveillance video shows a woman crouching beside a Waymo self-driving taxi, trying to lure a beloved neighborhood cat to safety. A second later, the car drove off."
  },
  {
    "title": "Versace Announces Dario Vitale’s Shocking Departure",
    "link": "https://www.nytimes.com/2025/12/05/style/versace-dario-vitale-prada.html",
    "summary": "After one hit collection, the designer Dario Vitale will be leaving the brand. What’s going on?"
  },
  {
    "title": "Trump’s Immigration Crackdown Could Be Illegal",
    "link": "https://www.nytimes.com/2025/12/05/opinion/immigration-restrictions-dc-shooting.html",
    "summary": "Once nativism escalates, it’s hard to stop."
  },
  {
    "title": "The One Child Policy’s Legacy: A Surplus of Single Men",
    "link": "https://www.nytimes.com/2025/12/04/opinion/china-dating-men-one-child-policy.html",
    "summary": "A decade after the end of the one-child policy, China has over 30 million so-called surplus men. Can this dating boot camp help them find love?"
  },
  {
    "title": "Justices to Review Trump’s Order Restricting Birthright Citizenship",
    "link": "https://www.nytimes.com/2025/12/05/briefing/supreme-court-birthright-citizenship.html",
    "summary": "Also, the celebrated architect Frank Gehry dies at 96. Here’s the latest at the end of Friday."
  },
  {
    "title": "How Batteries Got Cheaper and Made the Electric Grid More Reliable",
    "link": "https://www.nytimes.com/2025/12/05/business/energy-environment/battery-prices-electric-grids.html",
    "summary": "An early grid battery was installed in the Atacama Desert in Chile 15 years ago. Now, as prices have tumbled, they are increasingly being used around the world."
  },
  {
    "title": "Biden Says Republicans Aim to Turn L.G.B.T.Q. Identity Into ‘Something Scary’",
    "link": "https://www.nytimes.com/2025/12/05/us/biden-lgbtq-award.html",
    "summary": "The former president defended his support for transgender rights, a stance that has provoked second-guessing among some Democrats."
  },
  {
    "title": "At the National Archives, a Deep Dive Into the American Story",
    "link": "https://www.nytimes.com/2025/12/05/arts/national-archives-ai-america.html",
    "summary": "A new $40-million exhibit, opening nine months after President Trump fired the chief archivist, uses technology to explore the 13 billion-plus items in its vaults."
  },
  {
    "title": "Post-Trump, What Happens to His War Chest? Utah Offers One Clue.",
    "link": "https://www.nytimes.com/2025/12/05/us/politics/trump-utah-map-2028-house-seat.html",
    "summary": "A Trump-aligned political group is quietly spending millions to help state Republicans have a friendlier House map in 2028 — not in 2026, as with all of his other redistricting efforts."
  }
]