[
  {
    "title": "Mamdani Stuns Cuomo in New York Mayoral Primary",
    "link": "https://www.nytimes.com/2025/06/25/nyregion/cuomo-mamdani-mayor-primary-nyc.html",
    "summary": "Zohran Mamdani, a state assemblyman and democratic socialist, had a commanding lead over former Gov. Andrew M. Cuomo, who conceded in the Democratic primary."
  },
  {
    "title": "A New Political Star Emerges Out of a Fractured Democratic Party",
    "link": "https://www.nytimes.com/2025/06/25/nyregion/democratic-party-zohran-mamdani.html",
    "summary": "The emergence of Zohran Mamdani, a democratic socialist, is likely to divide national Democrats, who are already torn about what the party should stand for."
  },
  {
    "title": "5 Takeaways From the New York City Mayoral Primary",
    "link": "https://www.nytimes.com/2025/06/25/nyregion/nyc-mayor-primary-mamdani-takeaways.html",
    "summary": "Here are some of the factors that drove Zohran Mamdani to the cusp of a seismic upset, and how they will affect the general election in November."
  },
  {
    "title": "Cuomo, Chastened, Will Reassess Plans to Run as an Independent",
    "link": "https://www.nytimes.com/2025/06/25/nyregion/nyc-mayor-election-november.html",
    "summary": "The shape of the mayor’s race in November and the future of Andrew M. Cuomo are now in flux after Zohran Mamdani’s performance on Tuesday."
  },
  {
    "title": "A Political Shock in New York, and Democrats Demand Details on Iran Strike",
    "link": "https://www.nytimes.com/2025/06/25/podcasts/the-headlines/nyc-mayor-mamdani-iran-strike.html",
    "summary": "Plus, the 100 best films of the 21st century."
  },
  {
    "title": "Promise of Victory Over H.I.V. Fades as U.S. Withdraws Support",
    "link": "https://www.nytimes.com/2025/06/25/health/hiv-lenacapavir-vaccine-trump-cuts-africa.html",
    "summary": "A new drug that gives almost complete protection against the virus was to be administered across Africa this year. Now, much of the funding for that effort is gone."
  },
  {
    "title": "The Evolution of Trump’s Views on Foreign Aid",
    "link": "https://www.nytimes.com/2025/06/25/health/trump-usaid-foreign-aid-video.html",
    "summary": "The administration has gutted agencies like U.S.A.I.D., and President Trump has denigrated their work as wasteful and rife with fraud. His views on humanitarian assistance have seesawed since he entered political life."
  },
  {
    "title": "Online and IRL, Trump Offers a Window Into His Psyche",
    "link": "https://www.nytimes.com/2025/06/24/us/politics/online-trump-transparency-complications.html",
    "summary": "Other countries used to need spies to discern the thinking of American presidents. Now they just need a Truth Social account."
  },
  {
    "title": "The Bombing of Iran May Teach an Unwelcome Lesson on Nuclear Weapons",
    "link": "https://www.nytimes.com/2025/06/25/world/middleeast/iran-trump-nuclear-weapons.html",
    "summary": "Will America’s pre-emptive strike discourage other countries from pursuing a weapon — or just the opposite?"
  },
  {
    "title": "The Weapon That Terrorizes Ukrainians by Night",
    "link": "https://www.nytimes.com/2025/06/25/magazine/ukraine-russia-war-drone-shahed-iran.html",
    "summary": "How Russia’s terrifying long-range drone program has brought about a deadly new phase in the war."
  },
  {
    "title": "How a Birthday Boat Ride on Lake Tahoe Turned Tragic",
    "link": "https://www.nytimes.com/2025/06/24/us/lake-tahoe-deaths-weather.html",
    "summary": "Eight people died when a surprise storm caused dangerous waves on the lake along the California-Nevada border, upending boats and tossing passengers into the frigid water."
  },
  {
    "title": "U.S. Textile Makers, Feeling Forgotten by Trump, Hope Boom Days Are Ahead",
    "link": "https://www.nytimes.com/2025/06/25/business/textile-manufacturing-trump-tariffs.html",
    "summary": "The Trump administration faces hard choices in determining what industries to protect as it uses tariffs to construct an industrial policy."
  },
  {
    "title": "With Bezos Wedding, Venice Braces for Love in the Time of Tech Billionaires",
    "link": "https://www.nytimes.com/2025/06/25/world/europe/venice-jeff-bezos-lauren-sanchez-wedding.html",
    "summary": "The celebration of Jeff Bezos and Lauren Sánchez has divided a city that centuries ago set the standard for opulence."
  },
  {
    "title": "Taco Trucks Feed Workers After the Palisades Fire",
    "link": "https://www.nytimes.com/2025/06/25/dining/taco-trucks-palisades-fires-california.html",
    "summary": "A huddle of trucks has become the most reliable place for cleanup crews and contractors to find lunch."
  },
  {
    "title": "Democratic Leaders Tried to Crush Zohran Mamdani. They Should Have Been Taking Notes.",
    "link": "https://www.nytimes.com/2025/06/25/opinion/zohran-mamdani-democratic-party.html",
    "summary": "Democratic leaders have a curiosity problem, and it’s losing them elections."
  },
  {
    "title": "Times Readers Open Up About the Real Cost of Motherhood",
    "link": "https://www.nytimes.com/2025/06/25/opinion/motherhood-penalty-career.html",
    "summary": "What’s the real cost of motherhood? Here’s what our readers said."
  },
  {
    "title": "A Primary and a Heat Wave",
    "link": "https://www.nytimes.com/2025/06/25/briefing/a-primary-and-a-heat-wave.html",
    "summary": "We’re covering the upset in New York City and the weather."
  },
  {
    "title": "Late Night Is Taken Aback by Trump’s Potty Mouth",
    "link": "https://www.nytimes.com/2025/06/25/arts/television/late-night-trump-profanity.html",
    "summary": "Seth Meyers said that even with “zero standards of expectations for Trump,” he was shocked to see the president use profanity on the White House lawn."
  },
  {
    "title": "China Tightens Controls on Fentanyl but Calls It a U.S. Problem",
    "link": "https://www.nytimes.com/2025/06/25/world/asia/china-fentanyl-us-trade.html",
    "summary": "Two chemicals used to make the powerful opioid will be more strictly regulated, but an official said it was “the United States’ responsibility to solve the issue.”"
  },
  {
    "title": "Kenyans Return to the Streets a Year After Deadly Tax Protests",
    "link": "https://www.nytimes.com/2025/06/25/world/africa/kenya-protests-ruto.html",
    "summary": "The police fired tear gas at demonstrators who were expressing anger at the government over growing economic hardship and a lack of accountability for killings at earlier rallies."
  },
  {
    "title": "With Trump’s Help, Scandal-Ridden Brazilian Meatpacker JBS Makes a Comeback",
    "link": "https://www.nytimes.com/2025/06/25/world/americas/brazil-meatpacker-jbs-trump-nyse.html",
    "summary": "JBS, a giant Brazilian firm once fined billions for bribery, is trading on the New York Stock Exchange. Some credit President Trump’s era of deal-making for the company’s success."
  },
  {
    "title": "Four Astronauts Lift Off on Axiom Mission to the I.S.S.",
    "link": "https://www.nytimes.com/2025/06/25/science/spacex-launch-axiom-mission-4-watch.html",
    "summary": "Sponsored by governments but ferried by a private company, astronauts from Hungary, India and Poland are going to the space station for the first time."
  }
]