[
  {
    "title": "A Second Weak Jobs Report Challenges Trump’s Claim the Economy Is Booming",
    "link": "https://www.nytimes.com/2025/09/05/us/politics/trump-jobs-report-tariffs-deportations.html",
    "summary": "After a bad employment report in August, President Trump fired the official in charge of the numbers. This month’s data was just as disappointing."
  },
  {
    "title": "What the Unemployment Rate Isn’t Telling Us",
    "link": "https://www.nytimes.com/video/jobs/100000010377364/what-the-unemployment-rate-isnt-telling-us.html",
    "summary": "The latest job report shows that unemployment remains steady, but it’s not telling the full story. Lydia DePillis, economy reporter for The New York Times, explains how low job growth is being offset by the Trump administration’s deportation campaign."
  },
  {
    "title": "Will Trump Have to Run From the Economy?",
    "link": "https://www.nytimes.com/2025/09/05/us/politics/trump-economy-jobs-midterms.html",
    "summary": "It’s the issue voters cared most about in 2024, and there are signs of trouble."
  },
  {
    "title": "U.S. Oil Giant ConocoPhillips Will Lay Off Up to 25% of Its Work Force",
    "link": "https://www.nytimes.com/2025/09/03/business/energy-environment/oil-layoffs-conocophillips.html",
    "summary": "ConocoPhillips of Houston on Wednesday announced plans to reduce its global work force by up to 25 percent."
  },
  {
    "title": "How Trump’s Blunt-Force Diplomacy Is Pushing His Rivals Together",
    "link": "https://www.nytimes.com/2025/09/05/us/politics/trump-diplomacy-rivals.html",
    "summary": "Some of President Trump’s pressure tactics appear to have backfired, sending would-be allies into the embrace of China."
  },
  {
    "title": "Trump Will Host G20 Summit in 2026 at His Doral Resort",
    "link": "https://www.nytimes.com/2025/09/05/us/politics/trump-g20-summit-miami.html",
    "summary": "President Trump faced withering bipartisan criticism in his first term for a similar idea that would have mixed foreign diplomacy with his personal business interests."
  },
  {
    "title": "The Return of the ‘War Department’ Is a Message From Trump",
    "link": "https://www.nytimes.com/2025/09/05/us/politics/trump-war-department-defense-history.html",
    "summary": "President Trump and his defense secretary say they want to return to the era when America won wars. They largely ignore the greatest accomplishment of the past 80 years: avoiding superpower conflict."
  },
  {
    "title": "Trump Says U.S. Military Has ‘Never Fought to Win’ Since World War II",
    "link": "https://www.nytimes.com/2025/09/05/us/politics/trump-military-wars.html",
    "summary": "As he signed an order recognizing the Defense Department as the “Department of War,” President Trump said that the country “could have won every war, but we really chose to be very politically correct.”"
  },
  {
    "title": "How a Top Secret SEAL Team 6 Mission Into North Korea Fell Apart",
    "link": "https://www.nytimes.com/2025/09/05/us/navy-seal-north-korea-trump-2019.html",
    "summary": "The 2019 operation, greenlit by President Trump, sought a strategic edge. It left unarmed North Koreans dead."
  },
  {
    "title": "Trump Didn’t Notify Congress About a High-Stakes SEALs Mission. That Could Be an Issue.",
    "link": "https://www.nytimes.com/2025/09/05/us/politics/trump-congress-national-security-navy-seals.html",
    "summary": "The Trump administration failed to tell lawmakers about a 2019 SEAL Team 6 incursion into North Korean territory that went awry."
  },
  {
    "title": "Food Delivery Drivers Feel Strain of Italy’s Ban on Outdoor Work on Hottest Days",
    "link": "https://www.nytimes.com/2025/09/06/world/europe/italy-food-delivery-drivers-heat-rules.html",
    "summary": "Delivery riders are already some of the most vulnerable workers of booming gig economies. During successive heat waves this summer in Italy, it got complicated."
  },
  {
    "title": "South Koreans Are Swept Up in Immigration Raid at Hyundai Plant in Georgia",
    "link": "https://www.nytimes.com/2025/09/05/us/georgia-battery-plant-hyundai-lg-ice-raid.html",
    "summary": "They were among nearly 500 workers apprehended at a construction site for a South Korean battery maker, officials said. The episode prompted diplomatic concern in Seoul."
  },
  {
    "title": "Abrego Garcia Now Facing Shifting Threats of Deportation",
    "link": "https://www.nytimes.com/2025/09/05/us/politics/trump-deportations-abrego-garcia-el-salvador.html",
    "summary": "A court had ruled that Kilmar Armando Abrego Garcia could not be sent back to his homeland, but now the administration sees a loophole. On Friday, Mr. Abrego Garcia’s lawyers were told that he would be sent to the small African nation of Eswatini."
  },
  {
    "title": "Would Anyone Use a Chinese Stablecoin?",
    "link": "https://www.nytimes.com/2025/09/06/business/china-stablecoin-trump.html",
    "summary": "A new law in Hong Kong could pave the way for digital currencies tied to China."
  },
  {
    "title": "Federal Report on Drinking Is Withdrawn",
    "link": "https://www.nytimes.com/2025/09/05/health/alcohol-drinking-hhs-report.html",
    "summary": "The upcoming U.S. Dietary Guidelines will instead be influenced by a competing study, favored by industry, which found that moderate alcohol consumption was healthy."
  },
  {
    "title": "A Revived Focus on an Unproven Link Between Tylenol and Autism",
    "link": "https://www.nytimes.com/2025/09/05/health/autism-acetaminophen-tylenol.html",
    "summary": "Studies over the last decade of acetaminophen use in pregnancy — including a recent scientific review — have yielded mixed results but have not found a causal connection."
  },
  {
    "title": "CBS Abruptly Changes Editing Rules After Attacks From Administration",
    "link": "https://www.nytimes.com/2025/09/05/business/cbs-face-the-nation-editing-rules.html",
    "summary": "The Sunday show “Face the Nation” will no longer edit recorded interviews with newsmakers. The administration accused the network of deceptively editing an appearance of the homeland security secretary."
  },
  {
    "title": "A Japanese Island Preserves an Ancient and Ghostly Theater Form",
    "link": "https://www.nytimes.com/2025/09/06/world/asia/sado-island-japan-noh-theater.html",
    "summary": "Noh was once the entertainment of medieval warriors. Today, remote Sado Islanders embrace one of the world’s oldest surviving types of drama."
  },
  {
    "title": "Anthropic Agrees to Pay $1.5 Billion to Settle Lawsuit With Book Authors",
    "link": "https://www.nytimes.com/2025/09/05/technology/anthropic-settlement-copyright-ai.html",
    "summary": "The settlement is the largest payout in the history of U.S. copyright cases and could lead more A.I. companies to pay rights holders for use of their works."
  },
  {
    "title": "How Giorgio Armani Conquered Hollywood",
    "link": "https://www.nytimes.com/2025/09/05/fashion/giorgio-armani-hollywood-wanda-mcdaniel.html",
    "summary": "Armani amassed a cavalcade of celebrity spokespeople. Many came through a former journalist named Wanda McDaniel."
  },
  {
    "title": "Powerball Lottery Hopefuls Love This California Gas Station",
    "link": "https://www.nytimes.com/2025/09/05/us/lottery-tickets-california-gas-station.html",
    "summary": "A Syrian immigrant in Southern California beat the odds — twice — and now some Powerball players see an ineffable magic at work in his store."
  },
  {
    "title": "As Powerball Nears Record, Ticket Buyers Dream of New Houses and Winning in Secret",
    "link": "https://www.nytimes.com/2025/09/05/us/powerball-lottery-winners.html",
    "summary": "The Powerball jackpot hit $1.8 billion ahead of Saturday’s drawing, making it the second-largest and inspiring many to play."
  },
  {
    "title": "Trump’s Immigration Policy Is a Factor in Slow Job Growth",
    "link": "https://www.nytimes.com/2025/09/05/opinion/jobs-report-immigration-trump-fed.html",
    "summary": "Economic data suggests labor supply and immigration changes are affecting job growth. The Federal Reserve can’t fix that, but Trump can."
  },
  {
    "title": "This Is Why America Is Losing to China",
    "link": "https://www.nytimes.com/2025/09/04/opinion/china-global-superpower-dan-wang.html",
    "summary": "Our biggest adversary is waiting for the West to collapse."
  },
  {
    "title": "Adams Insists He’s Running for Mayor Despite Saudi Ambassadorship Talks",
    "link": "https://www.nytimes.com/2025/09/05/nyregion/eric-adams-saudi-arabia-ambassador.html",
    "summary": "The discussions were said to be part of an effort to consolidate opposition to Zohran Mamdani’s campaign for mayor, but appeared to be fading on Friday."
  },
  {
    "title": "With ‘Ghost Bat’ Drone, Australia Gears Up for New Arms Race",
    "link": "https://www.nytimes.com/2025/09/06/world/australia/australia-ghost-bat-drone.html",
    "summary": "A new class of aircraft developed with Boeing, it will be the first military plane designed and manufactured in the country in half a century."
  },
  {
    "title": "What Is Swedish Culture? IKEA? Yes. Abba? Not This Time.",
    "link": "https://www.nytimes.com/2025/09/03/arts/music/swedish-culture-ikea-abba.html",
    "summary": "A government initiative to create a Swedish “cultural canon” concerned many in the country’s cultural world. The final list has sparked debate over the choices."
  }
]