[
  {
    "title": "Who Is Andrew Ferguson, the FTC Chairman Who Tilted the Agency to Trump?",
    "link": "https://www.nytimes.com/2025/12/08/technology/ftc-andrew-ferguson-regulator.html",
    "summary": "Andrew Ferguson has used the Federal Trade Commission’s consumer protection mandate to investigate issues important to President Trump and his base."
  },
  {
    "title": "Planes, Trade and Nuclear Energy: Supreme Court Weighs Fate of Independent Regulators",
    "link": "https://www.nytimes.com/2025/12/08/business/supreme-court-independent-regulators.html",
    "summary": "The court heard arguments Monday on a case that could determine the independence of agencies like the National Transportation Safety Board and the Nuclear Regulatory Commission."
  },
  {
    "title": "Obamacare Users Will Be Asked to Pay More for Plans That Cover Less",
    "link": "https://www.nytimes.com/2025/12/08/health/obamacare-deductibles-premiums-health-insurance.html",
    "summary": "People who have health insurance under the Affordable Care Act will face higher deductibles and higher premiums."
  },
  {
    "title": "App That Tracks ICE Raids Sues U.S., Saying Officials Pressured Apple to Remove It",
    "link": "https://www.nytimes.com/2025/12/08/business/apple-iceblock-lawsuit.html",
    "summary": "The developer of ICEBlock, which notifies users of ICE agent sightings, said Attorney General Pam Bondi censored his free speech."
  },
  {
    "title": "Paramount Makes Hostile Bid for Warner Bros. Discovery",
    "link": "https://www.nytimes.com/2025/12/08/business/paramount-warner-bros-discovery-netflix.html",
    "summary": "The offer to shareholders comes days after Warner Bros. agreed to sell its streaming and studio business to Netflix."
  },
  {
    "title": "Trump Looms Over Netflix’s Deal for Warner Bros. Discovery",
    "link": "https://www.nytimes.com/2025/12/08/business/dealbook/trump-effect-netflix-warner-bros.html",
    "summary": "President Trump said the acquisition “could be a problem,” suggesting he will insert himself into the regulatory review of the transaction."
  },
  {
    "title": "The U.S. Gave Mexico a List of Russian Spies. Mexico Let Them Stay.",
    "link": "https://www.nytimes.com/2025/12/08/world/americas/mexico-russia-spies.html",
    "summary": "Moscow has ramped up covert operations in Mexico, with spies meeting handlers in its bustling capital and seaside resorts, U.S. officials say."
  },
  {
    "title": "Trump Criticizes Zelensky as Ukraine Peace Talks Drag On With European Leaders",
    "link": "https://www.nytimes.com/2025/12/08/world/europe/zelensky-ukraine-war-peace-talks-europe-london.html",
    "summary": "The destiny of Ukraine “is the destiny of Europe,” the German chancellor said on Monday, as he and other leaders met with President Volodymyr Zelensky in London."
  },
  {
    "title": "How Japan Built a Rare-Earth Supply Chain Without China",
    "link": "https://www.nytimes.com/2025/12/08/business/japan-rare-earths-lynas.html",
    "summary": "The 15-year effort by Japan is a model for countries now scrambling to reduce their dependence on Beijing’s critical metals."
  },
  {
    "title": "Despite Trump’s Tariffs, China’s Trade Surplus Climbs Past $1 Trillion for First Time",
    "link": "https://www.nytimes.com/2025/12/07/business/china-trade-surplus.html",
    "summary": "President Trump’s tariffs weren’t enough to hold back the global export flood by China, which pushed past last year’s record in just 11 months."
  },
  {
    "title": "6 Memorable Moments From the ‘Trump Kennedy Center’ Honors",
    "link": "https://www.nytimes.com/2025/12/08/arts/trump-kennedy-center-honors-moments.html",
    "summary": "President Trump expressed his love of “Phantom of the Opera,” got in more digs at Jimmy Kimmel and joked — perhaps — about adding his name to the arts center he has taken over."
  },
  {
    "title": "At the Kennedy Center Honors, Little Glitz and One Striking Accessory",
    "link": "https://www.nytimes.com/2025/12/08/style/melania-trump-kennedy-center-honors-style.html",
    "summary": "Melania Trump went minimal, Gloria Gaynor dressed to shine, but the star of the night was the president."
  },
  {
    "title": "A Data Center Wrapped in a Mystery Comes to the New Mexican Desert",
    "link": "https://www.nytimes.com/2025/12/07/business/boarderplex-new-mexico-data-center-mystery.html",
    "summary": "As wealthier areas are pushing back against huge A.I. data centers, speculators are pitching places like Doña Ana County, N.M., on their vision. Local officials are eager for a deal — even if they don’t quite know the terms."
  },
  {
    "title": "Syrians Celebrate Anniversary of Bashar al-Assad’s Fall",
    "link": "https://www.nytimes.com/2025/12/08/world/middleeast/syria-anniversary-assad-fall.html",
    "summary": "A year ago, rebels overthrew President Bashar al-Assad, ending decades of dictatorship and civil war. But challenges remain for the new leadership."
  },
  {
    "title": "A Weakened Hamas Still Dominates Gaza, Building Day by Day",
    "link": "https://www.nytimes.com/2025/12/08/world/middleeast/hamas-gaza.html",
    "summary": "A cease-fire after two years of war with Israel has allowed Hamas to tighten its grip on power again. “It’s still standing,” one Israeli official said."
  },
  {
    "title": "At a Democratic Governors Event, Hope, Nerves and Buzz for the Midterms and 2028 Election",
    "link": "https://www.nytimes.com/2025/12/08/us/politics/democratic-governors-midterms-2028-election.html",
    "summary": "At an annual event for Democratic governors, optimism about next year overshadowed the search for a long-term vision. As Gretchen Whitmer put it, adding an expletive: “Let’s go!”"
  },
  {
    "title": "Colin Allred Drops Out of Democratic Primary for U.S. Senate in Texas",
    "link": "https://www.nytimes.com/2025/12/08/us/colin-allred-senate-texas-primary.html",
    "summary": "His departure came as Representative Jasmine Crockett, a rising star in the party, appeared likely to announce her own Senate run soon."
  },
  {
    "title": "4 Takeaways From The Times’s Examination of N.Y.C. Subway Collisions",
    "link": "https://www.nytimes.com/2025/12/08/nyregion/nyc-subway-strikes-takeaways.html",
    "summary": "New York City train operators witness more people being struck by trains than drivers in any other American system. Afterward, many struggle to get the help they need."
  },
  {
    "title": "Golden Globe Nominations Confirm the Allure of Warner Bros.",
    "link": "https://www.nytimes.com/2025/12/08/business/media/golden-globes-nominations-2026.html",
    "summary": "The studio’s film “One Battle After Another,” and an HBO show it owns, “The White Lotus,” scored the most nominations for movies and television shows."
  },
  {
    "title": "Golden Globe 2026 Nominees: Full List Including ‘One Battle After Another’",
    "link": "https://www.nytimes.com/2025/12/08/movies/golden-globes-nominees-2026-list.html",
    "summary": "The movies and TV series competing for the 83rd Golden Globes. The ceremony will air on Jan. 11."
  },
  {
    "title": "Golden Globes 2026 Snubs and Surprises: ‘Wicked: For Good’ Misses a Major Nomination",
    "link": "https://www.nytimes.com/2025/12/08/movies/golden-globe-nominations-snubs-surprises-2026.html",
    "summary": "Though its stars are up for acting prizes, the film is not in the running for best musical or comedy, only for box office achievement."
  },
  {
    "title": "Why Some Doctors Say There Are Cancers That Shouldn’t Be Treated",
    "link": "https://www.nytimes.com/2025/12/08/health/cancer-young-people-deaths.html",
    "summary": "Statistics show a clear spike in eight cancers in younger people, but that has brought a debate over whether many cases ever needed to be found."
  },
  {
    "title": "Cancer-Detecting Blood Tests Are on the Rise. Do They Work?",
    "link": "https://www.nytimes.com/2025/12/02/well/cancer-detecting-blood-tests-are-on-the-rise-do-they-work.html",
    "summary": "The tests have not been approved by federal regulators, but that hasn’t stopped patients from wanting them — and doctors from worrying."
  },
  {
    "title": "The Best New Restaurants in New York in 2025",
    "link": "https://www.nytimes.com/2025/12/08/dining/best-new-nyc-restaurants.html",
    "summary": "Here are the new kids on the block our critics loved most this year."
  },
  {
    "title": "Best New York City Dishes",
    "link": "https://www.nytimes.com/2025/12/08/dining/best-nyc-dishes.html",
    "summary": "Bánh cuốn, chicken bastilla and 10 other unforgettable plates from 2025."
  },
  {
    "title": "These State Laws Won’t Get Junk Food Out of Kids’ School Lunches",
    "link": "https://www.nytimes.com/2025/12/08/opinion/kids-ultraprocessed-foods-school.html",
    "summary": "Many states have proposed bans on the sale of ultraprocessed foods in schools. The problem is the way they define ultraprocessing."
  },
  {
    "title": "A Corruption Scandal in Ukraine",
    "link": "https://www.nytimes.com/2025/12/08/briefing/a-corruption-scandal-in-ukraine.html",
    "summary": "We examine an investigation that is testing Volodymyr Zelensky’s government."
  },
  {
    "title": "7.6-Magnitude Earthquake Near Japan Triggers Tsunami Warning",
    "link": "https://www.nytimes.com/2025/12/08/world/asia/japan-earthquake-tsunami.html",
    "summary": "The earthquake struck off the coast of Aomori Prefecture, on Japan’s main island, Honshu."
  },
  {
    "title": "Mamdani Confirms He Will Leave Queens One-Bedroom for Gracie Mansion",
    "link": "https://www.nytimes.com/2025/12/08/nyregion/zohran-mamdani-gracie-mansion-rama-duwaji.html",
    "summary": "Mayor-elect Zohran Mamdani and his wife, Rama Duwaji, will move into the official residence in Manhattan sometime after his inauguration."
  },
  {
    "title": "Why Thailand and Cambodia Are Fighting",
    "link": "https://www.nytimes.com/2025/12/08/world/asia/thailand-cambodia-border-fighting-strikes.html",
    "summary": "The latest violence comes months after President Trump helped mediate a cease-fire between the two nations."
  },
  {
    "title": "Todd Combs Leaves Berkshire Hathaway for JPMorgan Chase as Buffett Nears Retirement",
    "link": "https://www.nytimes.com/2025/12/08/business/dealbook/berkshire-todd-combs-jpmorgan.html",
    "summary": "The departure of the senior stock picker was one of several leadership changes ahead of Mr. Buffett’s planned departure as chief executive of Berkshire Hathaway."
  }
]