[
  {
    "title": "How Netanyahu Prolonged the War in Gaza to Stay in Power",
    "link": "https://www.nytimes.com/2025/07/11/magazine/benjamin-netanyahu-gaza-war.html",
    "summary": "Secret meetings, altered records, ignored intelligence: the inside story of the prime minister’s political calculations since Oct. 7."
  },
  {
    "title": "Takeaways From the Times Investigation Into Benjamin Netanyahu",
    "link": "https://www.nytimes.com/2025/07/11/magazine/benjamin-netanyahu-gaza-investigation-takeaways.html",
    "summary": "Prolonging the Gaza war helped the Israeli prime minister forestall a political reckoning."
  },
  {
    "title": "Netanyahu’s War",
    "link": "https://www.nytimes.com/2025/07/11/briefing/benjamin-netanyahu-israel.html",
    "summary": "We spoke to the Jerusalem bureau chief about his investigative profile about the Israeli prime minister."
  },
  {
    "title": "How Netanyahu Prolonged the Gaza War, and the F.B.I.’s Loyalty Test",
    "link": "https://www.nytimes.com/2025/07/11/podcasts/the-headlines/benjamin-netanyahu-ice-arrests-california.html",
    "summary": "Plus, your Friday news quiz."
  },
  {
    "title": "Kerr County Repeatedly Sought Help with Flood Risk. Texas Said No.",
    "link": "https://www.nytimes.com/2025/07/10/us/politics/texas-flood-alarm-system.html",
    "summary": "Kerr County failed to secure a warning system, even as local officials remained aware of the risks and as billions of dollars were available for similar projects."
  },
  {
    "title": "Why the Texas Flood Site Didn’t Have Warning Sirens",
    "link": "https://www.nytimes.com/video/us/100000010277667/why-the-texas-flood-site-didnt-have-warning-sirens.html",
    "summary": "Officials in Kerr County made several attempts over the past decade to get funds for a flood warning system, but those applications were rejected. Christopher Flavelle, a reporter for The New York Times, breaks down what went wrong."
  },
  {
    "title": "Trump’s Seesawing on Tariffs Gives the World Whiplash",
    "link": "https://www.nytimes.com/2025/07/11/world/europe/trump-tariffs-global-trade-deals.html",
    "summary": "Blunt letters dictating terms posted to social media and changes late in negotiations have left trading partners wondering what President Trump will do next."
  },
  {
    "title": "Behind Trump’s Decision to Tax Brazil to Save Bolsonaro",
    "link": "https://www.nytimes.com/2025/07/11/world/americas/brazil-trump-tariffs.html",
    "summary": "Right-wing Brazilians wanted sanctions against the judge prosecuting Brazil’s former president. President Trump opted for something far bigger — tariffs."
  },
  {
    "title": "Targeting Brazil, Trump Tests Legal Limit of His Tariff Powers",
    "link": "https://www.nytimes.com/2025/07/10/us/politics/trump-brazil-tariffs-legal-limit.html",
    "summary": "The president signaled he would seek to use the threat of steep levies to reorient trade and protect his political allies."
  },
  {
    "title": "The F.B.I. Is Using Polygraphs to Test Officials’ Loyalty",
    "link": "https://www.nytimes.com/2025/07/10/us/politics/fbi-polygraph-kash-patel.html",
    "summary": "Some senior officials who have taken the test have been asked whether they said anything negative about the F.B.I. director, Kash Patel."
  },
  {
    "title": "Federal Agents Clash With Protesters During Immigration Raid at California Farm",
    "link": "https://www.nytimes.com/2025/07/11/us/ice-raid-california-cannabis-farm.html",
    "summary": "Officers appeared to use crowd control munitions and tear gas against protesters. The F.B.I. said it was searching for a person who appeared to fire a pistol at officers."
  },
  {
    "title": "Justice Dept. Demands Private Patient Info From Trans Youth Medicine Providers",
    "link": "https://www.nytimes.com/2025/07/10/health/transgender-medicine-minors-trump-subpoena.html",
    "summary": "Doctors and hospitals were subpoenaed for private information on gender-related care for minors, the latest move by the Trump administration to stop the treatments."
  },
  {
    "title": "State Department to Soon Begin Mass Layoffs",
    "link": "https://www.nytimes.com/2025/07/10/us/politics/state-department-mass-layoffs.html",
    "summary": "Secretary of State Marco Rubio’s plan to downsize a “bloated” department had been on hold after a court ruling."
  },
  {
    "title": "Srebrenica, a Massacre Foretold, Still Casts Its Shadow",
    "link": "https://www.nytimes.com/2025/07/11/us/srebrenica-massacre-bosnia.html",
    "summary": "The town was supposed to be a “safe area,” protected by U.N. peacekeepers, but Serb forces massacred 8,000 Muslim men and boys there."
  },
  {
    "title": "After Trump’s SNAP Cuts, 300,000 in NYC Could Lose Food Benefits",
    "link": "https://www.nytimes.com/2025/07/11/nyregion/nyc-snap-food-stamps-trump.html",
    "summary": "The president’s sweeping new law includes work requirements for more people and less coverage for some noncitizens. Republicans argue the cuts are needed to tackle waste and fraud."
  },
  {
    "title": "Does Brooklyn Need a New Waterfront Neighborhood?",
    "link": "https://www.nytimes.com/2025/07/11/nyregion/brooklyn-marine-terminal-development.html",
    "summary": "The risks and opportunities of turning 122 industrial acres over to developers."
  },
  {
    "title": "Nantucket’s Workers Are Living on the Margins",
    "link": "https://www.nytimes.com/2025/07/11/realestate/nantucket-affordable-housing-homeless.html",
    "summary": "Teachers, police officers, firefighters and other workers live in overcrowded and substandard housing, or even in their cars on the beach."
  },
  {
    "title": "How James Gunn Modeled Superman’s Dog Krypto After His Own Pet",
    "link": "https://www.nytimes.com/2025/07/11/movies/superman-krypto-dog-james-gunn.html",
    "summary": "For the furry sidekick, Krypto, in “Superman,” the director James Gunn found inspiration — and a physical model — in his own unruly pet."
  },
  {
    "title": "Superman’s Other Secret Weakness? Journalism Ethics.",
    "link": "https://www.nytimes.com/2025/07/11/arts/superman-lois-lane-clark-kent-journalism.html",
    "summary": "Writing for The Daily Planet about his heroic alter ego raises thorny issues for Clark Kent. Lois Lane has her conflicts, too."
  },
  {
    "title": "Another Day, Another Chatbot’s Nazi Meltdown",
    "link": "https://www.nytimes.com/2025/07/11/opinion/ai-grok-x-llm.html",
    "summary": "The folks at X say don’t worry; they’re on it."
  },
  {
    "title": "The Dollar’s in Trouble, but Not for the Reason You Think",
    "link": "https://www.nytimes.com/2025/07/11/opinion/dollar-money-currency-payment.html",
    "summary": "New payment systems allow users and banks to bypass the U.S. currency and sanctions."
  },
  {
    "title": "Ronny Chieng Ponders Iran’s Threat to Kill a Sunbathing Trump",
    "link": "https://www.nytimes.com/2025/07/11/arts/television/ronny-chieng-iran-trump-threat.html",
    "summary": "The “Daily Show” host called the threat “an attack on all of America, because now we all have to picture him with his bare belly glistening in the sun.”"
  },
  {
    "title": "Kurdish PKK Fighters Burn Weapons in Step Toward Peace With Turkey",
    "link": "https://www.nytimes.com/2025/07/11/world/middleeast/pkk-turkey-conflict-arms-peace.html",
    "summary": "The disarmament of the P.K.K., a group that has battled since the 1980s for Kurdish independence, could end a conflict that has killed more than 40,000 people."
  },
  {
    "title": "Two Dozen Hospitalized in Mass Drug Overdose in Baltimore",
    "link": "https://www.nytimes.com/2025/07/11/us/baltimore-drug-overdoses.html",
    "summary": "An unusually large number of overdoses sent crews searching alleys and homes for victims. Officials have not said what type of drug was involved."
  },
  {
    "title": "At Least 13 People Died by Suicide Amid U.K. Post Office Scandal, Report Says",
    "link": "https://www.nytimes.com/2025/07/10/world/europe/uk-post-office-scandal-report.html",
    "summary": "A public inquiry into the wrongful prosecutions of about 1,000 postal workers has uncovered more victims than previously known, according to a report."
  },
  {
    "title": "Livvy Dunne Tried to Buy Babe Ruth’s Former Apartment. An N.Y.C. Co-op Board Said ‘No’.",
    "link": "https://www.nytimes.com/2025/07/10/realestate/livvy-dunne-babe-ruth-apartment-nyc.html",
    "summary": "The influencer and former collegiate gymnast tried to buy the Manhattan two-bedroom, but instead joined the ranks of high-profile rejects like Madonna and Calvin Klein."
  }
]