[
  {
    "title": "After Trump’s Ultimatum, Greenland Talks Include Sovereign U.S. Bases, No Drilling for Russia",
    "link": "https://www.nytimes.com/2026/01/22/world/europe/trump-greenland-deal-framework.html",
    "summary": "Negotiators have discussed proposals to check Russian and Chinese influence in the Arctic and transfer sovereignty over pockets of Greenlandic land to the United States, an idea opposed by Denmark."
  },
  {
    "title": "Denmark Bristles at Idea of Giving Up Any Sovereignty in Greenland",
    "link": "https://www.nytimes.com/2026/01/22/world/europe/denmark-greenland-trump-us-reaction.html",
    "summary": "American and NATO officials have discussed giving the United States sovereignty over U.S. military bases in Greenland. The Danes don’t seem to like that."
  },
  {
    "title": "Few Voters Say Trump’s Second Term Has Made the Country Better, Poll Finds",
    "link": "https://www.nytimes.com/2026/01/22/us/politics/trump-poll-second-term.html",
    "summary": "A majority of voters said that Mr. Trump had focused on the wrong priorities and that they disapproved of his handling of top issues, but the president still enjoys strong support from Republicans."
  },
  {
    "title": "The Voters Who Have Taken a U-Turn on Trump",
    "link": "https://www.nytimes.com/2026/01/22/upshot/trump-poll-analysis-times-siena.html",
    "summary": "One year later, the second Trump coalition has come apart, a Times/Siena poll finds."
  },
  {
    "title": "Oscar Nominations: ‘Sinners’ Breaks Record With 16",
    "link": "https://www.nytimes.com/2026/01/22/movies/oscar-nominations-announcement.html",
    "summary": "“One Battle After Another” was close behind with 13 nods. Acting nominees include Michael B. Jordan, Kate Hudson, Timothée Chalamet and Teyana Taylor."
  },
  {
    "title": "Sinners’ Broke the Oscars Record These 3 Films Once Held",
    "link": "https://www.nytimes.com/2026/01/22/movies/sinners-oscars-record-nominations.html",
    "summary": "As categories evolved over time, the way to make academy history did, too. But for decades, no film topped 14 nods, until “Sinners” smashed the record."
  },
  {
    "title": "2026 Oscar Nominations: See the Full List",
    "link": "https://www.nytimes.com/2026/01/22/movies/2026-oscar-nominees-list.html",
    "summary": "The movies competing for the 98th Academy Awards. The ceremony will air on March 15."
  },
  {
    "title": "Oscar Snubs and Surprises: ‘Sinners’ Makes History, ‘Wicked’ Withers",
    "link": "https://www.nytimes.com/2026/01/22/movies/oscar-snubs-wicked-sinners-bugonia.html",
    "summary": "Ariana Grande, Chase Infiniti and Paul Mescal were shut out, but voters made room for Delroy Lindo, Kate Hudson and “F1.”"
  },
  {
    "title": "Protester Nekima Levy Armstrong Who Interrupted Minnesota Church Service Is Arrested, Officials Say",
    "link": "https://www.nytimes.com/2026/01/22/us/nekima-levy-armstrong-arrest-minnesota-church.html",
    "summary": "A standoff between demonstrators and congregants at Cities Church in St. Paul on Sunday added to tensions around federal immigration enforcement in the state."
  },
  {
    "title": "‘High Alert, All the Time’: Minneapolis Sees ICE Around Every Corner",
    "link": "https://www.nytimes.com/2026/01/22/us/minnesota-scene-ice.html",
    "summary": "Federal agents have been carrying out an immigration crackdown in Minnesota for weeks. Some residents say they carry a sense of dread even on empty streets."
  },
  {
    "title": "Detention of 5-Year-Old by Federal Agents Incenses Minneapolis",
    "link": "https://www.nytimes.com/2026/01/22/us/liam-detention-ice-minneapolis.html",
    "summary": "A photo showed the boy with an oversized hat and Spider-Man backpack being held next to a vehicle as his father was detained. A Homeland Security spokeswoman said the man had fled and left the child."
  },
  {
    "title": "Jack Smith Defends Trump Investigations Before Lawmakers",
    "link": "https://www.nytimes.com/live/2026/01/22/us/trump-davos-news#section-244846985",
    "summary": "The former special prosecutor is getting what is most likely his best opportunity to challenge President Trump’s claims of political persecution."
  },
  {
    "title": "Consumer Prices Rose 2.8 Percent Through November 2025, a Sign of Sticky Inflation",
    "link": "https://www.nytimes.com/2026/01/22/business/consumer-prices-inflation-economy.html",
    "summary": "The Federal Reserve’s preferred gauge for inflation in October and November was released belatedly after the government shutdown."
  },
  {
    "title": "Georgia and Other Southern States Prepare for Storm’s Snow and Bitter Cold",
    "link": "https://www.nytimes.com/2026/01/22/us/snow-ice-winter-storm-south-preparations.html",
    "summary": "The path of an approaching winter storm is not clear yet, but much of the country, including places unused to frigid weather, is bracing for the worst."
  },
  {
    "title": "Winter Storm Forecast: What to Expect as Snow and Ice Move Across the U.S. This Weekend",
    "link": "https://www.nytimes.com/2026/01/22/weather/winter-storm-forecast-snow-ice.html",
    "summary": "Half the U.S. population will likely see some effect from the sprawling storm that will move across the country this weekend, meteorologists said."
  },
  {
    "title": "Takeaways From the Times’ Look at Kash Patel’s FBI: Misleading Stats, Mismanagement and Meltdowns",
    "link": "https://www.nytimes.com/2026/01/22/magazine/trump-fbi-kash-patel-takeaways.html",
    "summary": "Many current and former employees say Kash Patel’s first year as F.B.I. director was marred by vendettas, mismanagement and meltdowns."
  },
  {
    "title": "Betting on Prediction Markets Is Their Job. They Make Millions.",
    "link": "https://www.nytimes.com/2026/01/22/business/prediction-markets-polymarket-kalshi.html",
    "summary": "Welcome to the era of the Polymarket sharp."
  },
  {
    "title": "Some Immune Systems Defeat Cancer. Could That Become a Drug?",
    "link": "https://www.nytimes.com/2026/01/22/health/lung-cancer-antibodies-immune-system.html",
    "summary": "Researchers found an antibody that seems to play a role in people with better lung cancer prognoses, but turning it into a treatment could be difficult."
  },
  {
    "title": "Murder Rate Drops to Lowest Level Since at Least 1900, New Report Says",
    "link": "https://www.nytimes.com/2026/01/22/us/murder-rate-drop-report.html",
    "summary": "A decline in homicides across the country was a stunning reversal after crime rose during the pandemic."
  },
  {
    "title": "Elon Musk’s Grok A.I. Chatbot Made Millions of Sexualized Images, New Estimates Show",
    "link": "https://www.nytimes.com/2026/01/22/technology/grok-x-ai-elon-musk-deepfakes.html",
    "summary": "Over nine days, Elon Musk’s Grok chatbot generated and posted 4.4 million images, of which at least 41 percent were sexualized images of women."
  },
  {
    "title": "Are You Aging Well? 4 Simple Tests to Find Out.",
    "link": "https://www.nytimes.com/2026/01/22/well/aging-tests-longevity.html",
    "summary": "They can’t guarantee future health, but they can tell you the trajectory you’re on."
  },
  {
    "title": "How Do You Preserve the Free World When America Goes Rogue?",
    "link": "https://www.nytimes.com/2026/01/22/opinion/canada-carney-trump-greenland-nato.html",
    "summary": "How do you preserve the free world when America goes rogue?"
  },
  {
    "title": "No, Young Men Are Not Returning to Church",
    "link": "https://www.nytimes.com/2026/01/22/opinion/interesting-times-ryan-burge.html",
    "summary": "All the Religious Trends You’re Wrong About"
  },
  {
    "title": "Trump Takes Davos",
    "link": "https://www.nytimes.com/2026/01/22/briefing/trump-takes-davos.html",
    "summary": "We look at the news coming out of the World Economic Forum in Switzerland."
  },
  {
    "title": "Tell Us About Your Grand Romantic Gestures",
    "link": "https://www.nytimes.com/2026/01/16/well/family/tell-us-about-your-grand-romantic-gestures.html",
    "summary": "From the over-the-top marriage proposals to the thoughtful surprises that made a huge impact."
  },
  {
    "title": "Malfunction Forces Japan to Take Restarted Nuclear Plant Offline",
    "link": "https://www.nytimes.com/2026/01/22/business/japan-nuclear-offline.html",
    "summary": "The setback occurred hours after one of the world’s largest nuclear complexes restarted, ending more than a decade of dormancy following the 2011 Fukushima Daiichi meltdown."
  },
  {
    "title": "Scammers Keep Stealing Food Stamps. New Cards Might Stop Them.",
    "link": "https://www.nytimes.com/2026/01/22/nyregion/ebt-food-stamp-skimming.html",
    "summary": "New York is joining the small group of states switching to chip-and-pin cards to evade skimming devices that siphon money for food from low-income people."
  },
  {
    "title": "National Park Service Removes Sign on Climate Change From Fort Sumter",
    "link": "https://www.nytimes.com/2026/01/22/climate/park-service-erases-climate-facts-at-fort-sumter-where-the-civil-war-began.html",
    "summary": "The historic site, on an island in South Carolina, could be inundated by rising seas in decades to come. A display on the threat has been removed."
  }
]