[
  {
    "title": "When Trump Meets Putin, Anything Could Happen",
    "link": "https://www.nytimes.com/2025/08/12/us/politics/trump-putin-meeting-russia-ukraine.html",
    "summary": "The U.S. president is pushing to end the war in Ukraine, but analysts say the Russian leader could turn a hastily planned meeting to his advantage."
  },
  {
    "title": "Russia Makes Battlefield Advances in Ukraine, Seeking an Edge in Trump Talks",
    "link": "https://www.nytimes.com/2025/08/12/world/europe/russia-ukraine-battlefield-pokrovsk-trump.html",
    "summary": "Russian forces have moved several miles into Ukrainian-held territory in the east, threatening to outflank Ukraine’s positions."
  },
  {
    "title": "For Trump, Cities Like Washington Are Real Estate in Need of Fixing Up",
    "link": "https://www.nytimes.com/2025/08/12/us/politics/trump-dc-crime.html",
    "summary": "“It’s a natural instinct as a real estate person,” he said in announcing his federal takeover of the capital’s police, despite falling crime."
  },
  {
    "title": "Mexico and Brazil Rebut Trump’s Claims About Violence in Their Cities",
    "link": "https://www.nytimes.com/2025/08/12/world/americas/trump-crime-mexico-brazil.html",
    "summary": "President Trump compared crime in Washington to violence in Latin American capitals. Mexico City’s mayor said “many parts of the world would like to have” her city’s safety."
  },
  {
    "title": "Trump Promised a Golden Age. Then a Montana Lumber Plant Closed Down.",
    "link": "https://www.nytimes.com/2025/08/12/us/trump-plant-closure-montana.html",
    "summary": "Anger over well-paid manufacturing jobs giving way to lower-wage work fueled President Trump’s rise. With his movement now in power, who gets blamed as the trend continues?"
  },
  {
    "title": "Key Inflation Gauge Sped Up in July as Companies Grappled With Tariffs",
    "link": "https://www.nytimes.com/2025/08/12/business/cpi-inflation-trump-tariffs.html",
    "summary": "July’s Consumer Price Index report showed an acceleration in “core” prices that strip out volatile food and energy items."
  },
  {
    "title": "Appeals Court Allows DOGE Access to Sensitive Data at Several Agencies",
    "link": "https://www.nytimes.com/2025/08/12/us/politics/appeals-court-doge-data.html",
    "summary": "The decision cited a Supreme Court order in June granting DOGE analysts sweeping access to other data stored at the Social Security Administration."
  },
  {
    "title": "How College Financial Troubles Could Reshape Student Life",
    "link": "https://www.nytimes.com/2025/08/12/us/college-financial-troubles-student-experience.html",
    "summary": "Austerity is coming to colleges boxed in by President Trump’s cuts and their own troubles. As they lay off workers, cut majors and take other steps, the changes may eventually be felt in classrooms."
  },
  {
    "title": "These Are the Voters Who Should Scare Democrats Most",
    "link": "https://www.nytimes.com/2025/08/12/us/politics/democrats-working-class-voters.html",
    "summary": "Working-class Americans who until recently voted Democratic said the party should not count on a backlash to President Trump to win them back. Still, there were pockets of opportunity."
  },
  {
    "title": "Sherrod Brown Plans to Try for a Senate Comeback in Ohio",
    "link": "https://www.nytimes.com/2025/08/12/us/politics/sherrod-brown-plans-to-try-for-a-senate-comeback-in-ohio.html",
    "summary": "The former three-term senator is said to be running to get his old job back, delivering a recruitment coup for Democrats facing an uphill battle to win a Senate majority next year."
  },
  {
    "title": "What Does It Mean to Be a ‘Very American’ Artist Now?",
    "link": "https://www.nytimes.com/2025/08/12/t-magazine/robert-longo.html",
    "summary": "Robert Longo was a little nervous about opening a big show in Denmark this year."
  },
  {
    "title": "Zakaria Zubeidi, Palestinian Militia and Theater Leader, Speaks After Release From Prison",
    "link": "https://www.nytimes.com/2025/08/12/world/middleeast/zakaria-zubeidi-palestine-interview.html",
    "summary": "Zakaria Zubeidi inspired Palestinians and horrified Israelis. Freed from jail during a recent truce, he questions what his many lives have achieved."
  },
  {
    "title": "Israeli Hostage Families Call for Nationwide Walkout",
    "link": "https://www.nytimes.com/2025/08/12/world/middleeast/israel-general-strike.html",
    "summary": "Relatives of captives held by Hamas excoriated the Israeli government for what they called “an endless war without purpose.” It was unclear how many would join them."
  },
  {
    "title": "Hidden Inside Our Electronics, Tiny Doodles From Another Era",
    "link": "https://www.nytimes.com/2025/08/12/technology/silicon-chips-doodles.html",
    "summary": "Decades ago, designers etched microscopic doodles onto silicon chips to leave their marks. Now, techno-archaeologists search for the tiny fossils."
  },
  {
    "title": "A.I. Start-Up Perplexity Offers to Buy Google’s Chrome Browser for $34.5 Billion",
    "link": "https://www.nytimes.com/2025/08/12/technology/perplexity-google-chrome-bid.html",
    "summary": "The tiny start-up hopes to take advantage of an upcoming antitrust ruling against the tech giant."
  },
  {
    "title": "Trump Is Squandering the Greatest Gift of the Manhattan Project",
    "link": "https://www.nytimes.com/2025/08/12/opinion/trump-manhattan-project.html",
    "summary": "The U.S. risks not just being left behind, but out of the game entirely."
  },
  {
    "title": "A Right-Wing Influencer Tried to Be a Tradwife. It Almost Broke Her.",
    "link": "https://www.nytimes.com/2025/08/11/opinion/lauren-southern-tradwife-maga.html",
    "summary": "Being an anti-feminist, it turns out, is no shield against abusive male power."
  },
  {
    "title": "3 Dead, 1 Injured After Target Shooting in Austin, Texas",
    "link": "https://www.nytimes.com/2025/08/11/us/austin-shooting.html",
    "summary": "Ethan Nieneker, who was charged with capital murder, had a history of domestic violence, mental health problems and arrests."
  },
  {
    "title": "As Europe’s Heat Waves Intensify, France Bickers About Air-Conditioning",
    "link": "https://www.nytimes.com/2025/08/12/world/europe/heat-waves-france-air-conditioning.html",
    "summary": "As heat waves batter Europe, the need (or not) for air-conditioning has become part of the political tug of war in France between the right and the left."
  },
  {
    "title": "Philippines Condemns China After South China Sea Collision Captured on Video",
    "link": "https://www.nytimes.com/2025/08/12/world/asia/south-china-sea-chinese-navy-philippines-collision.html",
    "summary": "Footage shows a Chinese coast guard vessel chasing a Philippine boat and then ramming a Chinese warship. It was the latest confrontation in the contested waters."
  },
  {
    "title": "South Korea’s Ex-First Lady Kim Keon Hee Is Arrested on Corruption Charges",
    "link": "https://www.nytimes.com/2025/08/12/world/asia/south-korea-former-first-lady-arrest.html",
    "summary": "Kim Keon Hee, accused of accepting Chanel bags and other items as bribes, is the only former first lady in the country to have been put behind bars. Her husband has also been jailed on insurrection charges."
  }
]