[
  {
    "title": "European Leaders Back Zelensky After Trump’s Russia-Ukraine Peace Plan Excludes Them",
    "link": "https://www.nytimes.com/2025/11/21/world/europe/ukraine-russia-trump-peace-plan.html",
    "summary": "A U.S.-Russian proposal would require Kyiv to give up territory and reduce its army. If Moscow complies with the terms, it could receive benefits including reintegration into the global economy."
  },
  {
    "title": "Former Reform U.K. Politician Sent to Prison for Taking Pro-Russia Bribes",
    "link": "https://www.nytimes.com/2025/11/21/world/europe/reform-uk-nathan-gill-russia-bribes.html",
    "summary": "Nathan Gill was sentenced to 10 and a half years on Friday after admitting he was paid to make pro-Russian speeches in the European Parliament."
  },
  {
    "title": "Top Fed Official Boosts Odds of a December Rate Cut",
    "link": "https://www.nytimes.com/2025/11/21/business/fed-interest-rates-inflation-jobs.html",
    "summary": "John C. Williams, president of the Federal Reserve Bank of New York, said the central bank had scope to lower borrowing costs ‘in the near term.’"
  },
  {
    "title": "Uneasiness Over A.I. Spending Looms Over Markets",
    "link": "https://www.nytimes.com/2025/11/20/business/stocks-ai-global.html",
    "summary": "After stocks briefly rallied on Nvidia’s strong earnings, investors’ growing concerns of an A.I. bubble have returned, driving broad market swings."
  },
  {
    "title": "The Fed, Crypto and A.I. Weigh on the Markets",
    "link": "https://www.nytimes.com/2025/11/21/business/dealbook/stocks-crypto-fed-market-turmoil.html",
    "summary": "Growing jitters over the Federal Reserve, crypto and the future of the artificial intelligence boom have helped drive a global sell-off."
  },
  {
    "title": "Trump’s All-but-Forgotten Border Wall Reaches an Angry Laredo, Texas",
    "link": "https://www.nytimes.com/2025/11/21/us/politics/trump-border-wall-laredo-texas.html",
    "summary": "Once the symbol of the president’s immigration policies, the wall has been eclipsed by his deportation efforts, but with $46.5 billion from Congress, construction is ramping up on the Rio Grande."
  },
  {
    "title": "China Offers Panda Totes, but No New Commitments, at Climate Talks",
    "link": "https://www.nytimes.com/2025/11/21/climate/china-climate-leadership-belem-cop30.html",
    "summary": "The United States has retreated on climate. China, the only superpower at COP30 and the world leader in clean energy, is not filling the void."
  },
  {
    "title": "Fine Chocolate in Brazil, Home of the Cacao Bean",
    "link": "https://www.nytimes.com/2025/11/21/climate/cop30-belem-chocolate.html",
    "summary": "A new generation of craft chocolate makers in Brazil is creating bars with “identity.” And they’re helping to sustain the forest, too."
  },
  {
    "title": "G.O.P. Redistricting Push May Backfire, Giving Democrats a Midterm Edge",
    "link": "https://www.nytimes.com/2025/11/21/upshot/republicans-redistricting-gerrymanders-update.html",
    "summary": "A series of setbacks for Republicans leaves an unlikely opening for Democrats to narrowly win this year’s redistricting wars."
  },
  {
    "title": "A War Photographer for Whom the Battle Continues",
    "link": "https://www.nytimes.com/2025/11/21/arts/design/al-rockoff-war-photography-killing-fields.html",
    "summary": "Rockoff, who risked his life to photograph the brutality of the Khmer Rouge, has struggled ever since. Now he says his historic negatives have been taken from him."
  },
  {
    "title": "Roblox Rolls Out Face Scans for Age Verification: What to Know",
    "link": "https://www.nytimes.com/2025/11/21/business/roblox-age-verification.html",
    "summary": "The popular gaming platform said the tool was designed to stop children from chatting with older users they didn’t know."
  },
  {
    "title": "We Asked Roblox’s C.E.O. About Child Safety. It Got Tense.",
    "link": "https://www.nytimes.com/2025/11/21/podcasts/hardfork-roblox-child-safety.html",
    "summary": "This week the company announced that it would require users to undergo an A.I.-powered age estimation process in order to chat with others on the platform. Will this change reassure parents?"
  },
  {
    "title": "At Least 52 Kidnapped From Nigeria School in Second Mass Abduction This Week",
    "link": "https://www.nytimes.com/2025/11/21/world/africa/nigeria-school-abduction.html",
    "summary": "Students and teachers were taken captive from a Catholic school in the latest in a wave of such attacks in the country."
  },
  {
    "title": "Japan’s New Leader Mentions Taiwan, and Tanks Her Relationship With China",
    "link": "https://www.nytimes.com/2025/11/21/world/asia/japan-china-taiwan-dispute.html",
    "summary": "Facing reprisals from Beijing for a remark over Taiwan, Prime Minister Sanae Takaichi must walk a fine line to prevent escalating the dispute without looking weak at home."
  },
  {
    "title": "Trump Promised Lower Prices. His Policies Are Raising Them.",
    "link": "https://www.nytimes.com/2025/11/21/opinion/trump-prices-affordability-promises-inflation.html",
    "summary": "From the day he took the oath of office, the president has pursued policies that are making life in America less affordable."
  },
  {
    "title": "What Trump’s Immigration Policies Are Doing to People Here Legally",
    "link": "https://www.nytimes.com/2025/11/21/opinion/ice-immigration-green-card-detention.html",
    "summary": "Something new is happening in the breadth and ferocity of efforts to change the makeup of this country."
  },
  {
    "title": "Is President Trump’s Power Over the Republican Party Waning?",
    "link": "https://www.nytimes.com/2025/11/21/briefing/is-president-trumps-power-over-the-republican-party-waning.html",
    "summary": "Some members of the party are defying him."
  },
  {
    "title": "A Tap-to-Pay Society Is Leaving These New Yorkers Behind",
    "link": "https://www.nytimes.com/2025/11/21/nyregion/cashless-economy.html",
    "summary": "As fewer people carry cash, vendors, street performers and people experiencing homelessness and unemployment are at a disadvantage."
  },
  {
    "title": "Researcher’s Smuggling Arrest Casts Light on Dispute Over Chinese Students",
    "link": "https://www.nytimes.com/2025/11/21/world/asia/chinese-students-us.html",
    "summary": "As some lawmakers press U.S. universities to curtail ties with China, a postdoctoral student’s prosecution raises questions about how big the danger actually is."
  },
  {
    "title": "After Syria’s 14-Year Civil War, a Search for Victims Leads to Mass Graves",
    "link": "https://www.nytimes.com/2025/11/21/world/middleeast/syria-mass-graves-civil-war.html",
    "summary": "More than 100,000 people disappeared during the civil war. To bring closure to some of their families, the new government faces the challenging task of exhuming remains from scores of burial sites."
  },
  {
    "title": "L.A. Charges Companies to Keep Names on Arenas for Olympics",
    "link": "https://www.nytimes.com/2025/11/21/us/los-angles-olympics-naming-rights.html",
    "summary": "Olympic organizers usually strip naming rights from host venues. Los Angeles is pioneering a new business model for the 2028 Games by charging sponsors extra fees instead."
  }
]