[
  {
    "title": "Ukraine, U.S. Meet About Trump’s Peace Plan to End War With Russia",
    "link": "https://www.nytimes.com/2025/11/23/world/europe/ukraine-switzerland-russia-peace-talks.html",
    "summary": "President Trump lashed out at Ukraine even as the talks on his peace proposal were still taking place, accusing the country’s leadership of being ungrateful for American support."
  },
  {
    "title": "Why a Man With U.S. Ties Fought for Russia in Ukraine",
    "link": "https://www.nytimes.com/2025/11/24/us/politics/russian-soldier-war.html",
    "summary": "Col. Andrei Demurenko’s war story began at Fort Leavenworth, Kan., at a moment of hope and peace. It ended with a mortar blast in Ukraine."
  },
  {
    "title": "U.S. and Ukraine Hail ‘Meaningful Progress’ on Peace Plan",
    "link": "https://www.nytimes.com/2025/11/24/world/europe/ukraine-zelensky-rubio-russia-peace-plan.html",
    "summary": "Washington and Kyiv said that “highly productive” discussions over a proposal to end the war with Russia would continue. But details remained unclear."
  },
  {
    "title": "Trump’s Deadline for Ukraine, and Marjorie Taylor Greene’s Abrupt Resignation",
    "link": "https://www.nytimes.com/2025/11/24/podcasts/the-headlines/ukraine-peace-talks-mamdani-troops.html",
    "summary": "Plus, a new crash-test dummy."
  },
  {
    "title": "Why Europe and the United States Are Still Haggling on Trade",
    "link": "https://www.nytimes.com/2025/11/24/business/eu-trade-trump-tariffs.html",
    "summary": "While the two sides reached a broad agreement months ago, American officials will visit Brussels this week to discuss the details. Europe has a wish list, but so does the United States."
  },
  {
    "title": "How One German Toymaker Made Money Despite U.S. Tariffs",
    "link": "https://www.nytimes.com/2025/11/24/business/germany-toys-holidays-tariffs-trump.html",
    "summary": "A combination of strategic planning, good timing and a long-awaited product helped the maker of electronic story boxes weather the onset of tariffs."
  },
  {
    "title": "Trade Chaos Causes Businesses to Rethink Their Relationship With the U.S.",
    "link": "https://www.nytimes.com/2025/11/24/business/tariffs-trade-small-business.html",
    "summary": "From Sweden to Brazil, six small companies talk about how they are communicating with their U.S. customers amid uncertainty over Trump’s changing tariffs."
  },
  {
    "title": "Billionaires Have a Bigger Role in Higher Education Under President Trump",
    "link": "https://www.nytimes.com/2025/11/24/us/billionaires-influence-universities-trump.html",
    "summary": "A new set of billionaires with an interest in higher education has helped oust college presidents and even assisted the Trump administration in its effort to overhaul the industry."
  },
  {
    "title": "Trump Welcomes A.P.’s Photographers. Its Reporters? Not So Much.",
    "link": "https://www.nytimes.com/2025/11/24/business/media/associated-press-president-trump.html",
    "summary": "The White House now has conflicting approaches for Associated Press journalists as it fights the news service in court over access to presidential events."
  },
  {
    "title": "Our Staff’s Favorite Thanksgiving Recipes | Thanksgiving Recipes 2024 | NYT Cooking",
    "link": "https://cooking.nytimes.com/article/thanksgiving-recipes-staff-picks",
    "summary": "Reporters and editors shared the holiday dishes they love. Here are their recommendations for Thanksgiving side dishes, turkey and more."
  },
  {
    "title": "Restrained, Beaten, Asphyxiated: New York Prison Guards’ Brutality Grows",
    "link": "https://www.nytimes.com/2025/11/24/nyregion/ny-prison-guards-abuse-brutality.html",
    "summary": "As frustrations among corrections officers mount, abusive treatment of inmates is rising and becoming more vicious, records and interviews show."
  },
  {
    "title": "Why Are Guards Using Force More Often in New York’s Prisons?",
    "link": "https://www.nytimes.com/2025/11/24/nyregion/ny-prison-guards-use-force.html",
    "summary": "State prison guards say they are doing so because their jobs have become more dangerous. A New York Times analysis points to a different reality."
  },
  {
    "title": "These Hospitals Figured Out How to Slash C-Section Rates",
    "link": "https://www.nytimes.com/2025/11/24/health/c-section-rate-decline-solutions.html",
    "summary": "Financial and social incentives can nudge doctors away from the operating room."
  },
  {
    "title": "A Stand Against Coal Could Push Oakland Toward Bankruptcy",
    "link": "https://www.nytimes.com/2025/11/24/us/oakland-coal-port-budget-bankruptcy.html",
    "summary": "After Oakland, Calif., reneged on a contract allowing coal shipments, a Kentucky company went under. Courts say the city must now pay hundreds of millions of dollars."
  },
  {
    "title": "F.B.I. Letters Send Shivers Through California’s Political Inner Circle",
    "link": "https://www.nytimes.com/2025/11/23/us/california-fbi-state-capitol-corruption.html",
    "summary": "The indictment of Gov. Gavin Newsom’s former chief of staff shocked many power players in California. Now, some wonder how far the investigation will spread."
  },
  {
    "title": "Denmark Offers Lessons as Europe Toughens Up on Immigration",
    "link": "https://www.nytimes.com/2025/11/23/world/europe/denmark-immigration-uk.html",
    "summary": "Like other European leaders, British Labour politicians are borrowing from Denmark’s restrictive asylum policy. One of its architects cautions that “balance” is necessary."
  },
  {
    "title": "His Right Foot: One Tiny Drawing for Sale, Maybe by Michelangelo",
    "link": "https://www.nytimes.com/2025/11/24/arts/design/michelangelo-drawing-christies-auction-foot-old-master.html",
    "summary": "The Renaissance artist painted more than 100 figures in the Sistine Chapel ceiling, yet studies for only a handful remain. Could this five-inch drawing at Christie’s be one?"
  },
  {
    "title": "Driving an E.V. Across North Dakota? Thank the Standing Rock Tribe.",
    "link": "https://www.nytimes.com/2025/11/18/climate/electic-vehicle-chargers-north-dakota.html",
    "summary": "A tribally owned network of chargers will soon be complete, connecting reservations and bridging a gap in the Midwest."
  },
  {
    "title": "America’s Caregivers Are in Crisis",
    "link": "https://www.nytimes.com/2025/11/24/opinion/caregiving-crisis.html",
    "summary": "Caregivers are at the brink of despair."
  },
  {
    "title": "Carville: How About a Sweeping, Aggressive, Unvarnished Platform of Pure Economic Rage",
    "link": "https://www.nytimes.com/2025/11/24/opinion/democrats-platform-economic-rage.html",
    "summary": "Democrats also have to shed the last vestiges of woke."
  },
  {
    "title": "Israel Military Commanders Punished Over Hamas Attack Mistakes",
    "link": "https://www.nytimes.com/2025/11/23/world/middleeast/israel-punishes-commanders-hamas-attack.html",
    "summary": "About a dozen people were told they face dismissal or discipline for mistakes tied to the deadly Hamas-led attack that set off the war in Gaza."
  },
  {
    "title": "Russian Disinformation Comes to Mexico, Seeking to Rupture US Ties",
    "link": "https://www.nytimes.com/2025/11/24/world/americas/russia-disinformation-mexico.html",
    "summary": "A U.S. government cable said that Kremlin-run outlets had scaled up their efforts across Latin America, seeking to turn people against the United States and garner support for Russia."
  },
  {
    "title": "How a Sabotaged Ankle Monitor Ended Bolsonaro’s House Arrest",
    "link": "https://www.nytimes.com/2025/11/23/world/americas/jair-bolsonaro-ankle-monitor-brazil.html",
    "summary": "Shortly before he was expected to start serving a 27-year sentence, Brazil’s former president took a soldering iron to his tracking device."
  },
  {
    "title": "Jamil Abdullah Al-Amin, Black Power Activist Known as H. Rap Brown, Dies at 82",
    "link": "https://www.nytimes.com/2025/11/23/us/h-rap-brown-dead.html",
    "summary": "A charismatic orator in the 1960s, he called for armed resistance to white oppression. As a Muslim cleric, he was convicted of murder in 2000 and died in detention."
  }
]