[
  {
    "title": "Signs of Fatigue: Trump Faces Realities of Aging in Office",
    "link": "https://www.nytimes.com/2025/11/25/us/politics/trump-age-health.html",
    "summary": "President Trump has always used his stamina and energy as a political strength. But that image is getting harder for him to sustain."
  },
  {
    "title": "Donors to Trump’s Transition Revealed a Year Later",
    "link": "https://www.nytimes.com/2025/11/26/us/politics/trump-transition-donors.html",
    "summary": "A 46-person list includes billionaires and people he went on to appoint to positions of power."
  },
  {
    "title": "Democrats Say F.B.I. Is Investigating Them Over Illegal Orders Video",
    "link": "https://www.nytimes.com/2025/11/25/us/politics/congress-military-video-fbi.html",
    "summary": "The move came one day after the Pentagon said it was investigating Senator Mark Kelly for his participation in the video."
  },
  {
    "title": "Trump Administration Will Raise Prices for Foreign Tourists at National Parks",
    "link": "https://www.nytimes.com/2025/11/25/us/politics/national-parks-prices-tourists-trump.html",
    "summary": "The price increases comes as more and more international travelers are choosing to stay away from the United States and amid turmoil at the National Park Service."
  },
  {
    "title": "Market Volatility Underscores Epic Buildup of Global Risk",
    "link": "https://www.nytimes.com/2025/11/25/business/economy/stocks-bitcoin-markets-risk.html",
    "summary": "Some experts see a dangerous combination of factors reminiscent of practices that led to previous financial crises."
  },
  {
    "title": "Trump’s Retribution Push Has Expanded Even as It Hits Legal Barriers",
    "link": "https://www.nytimes.com/2025/11/25/us/politics/trumps-retribution-legal-barriers.html",
    "summary": "A judge dismissed indictments against two of the president’s foes, but a new Pentagon investigation of a prominent Democrat shows how he is using a whole-of-government approach to punish those who cross him."
  },
  {
    "title": "The ‘Wild Card’ in the Comey and James Cases: Will Judges Pick the Next Prosecutor?",
    "link": "https://www.nytimes.com/2025/11/25/us/politics/comey-james-cases-next-steps.html",
    "summary": "The dismissal of indictments that President Trump sought against his perceived foes opens the door for federal judges to pick a new U.S. attorney to replace a Trump loyalist."
  },
  {
    "title": "Republicans Fight With Trump’s Team Over Ukraine Talks",
    "link": "https://www.nytimes.com/2025/11/25/us/politics/republicans-trump-ukraine.html",
    "summary": "Senator Mitch McConnell and several other lawmakers have accused President Trump’s team of appeasing the Kremlin, warning that doing so would not lead to lasting peace."
  },
  {
    "title": "The 2026 Putin Calendar Is Here: ‘ A Man for Every Season’",
    "link": "https://www.nytimes.com/2025/11/25/world/europe/putin-calendar-russia.html",
    "summary": "January shows the Russian leader astride a snowmobile. For February, he flips a judo partner. In August, he offers advice: “My recipe for energy: Sleep little, work a lot and don’t whine.”"
  },
  {
    "title": "100 Notable Books of 2025",
    "link": "https://www.nytimes.com/2025/11/24/books/notable-books.html",
    "summary": "Here is the standout fiction and nonfiction of the year, selected by the staff of The New York Times Book Review."
  },
  {
    "title": "Pope Leo to Visit Turkey and Lebanon",
    "link": "https://www.nytimes.com/2025/11/26/world/middleeast/pope-leo-trip-turkey-lebanon.html",
    "summary": "Leo XIV will meet political and religious leaders in Turkey and Lebanon, providing an early test of his geopolitical mettle. Here’s what to know."
  },
  {
    "title": "Hamas Says It Returned Body of Another Hostage From Gaza",
    "link": "https://www.nytimes.com/2025/11/25/world/middleeast/hostage-returned-israel-gaza.html",
    "summary": "The remains were not yet identified. Before the handover on Tuesday, Israel said the bodies of three other captives were still in the enclave."
  },
  {
    "title": "‘You Start Getting Desperate’: How It Feels to Be Young and Jobless in Britain",
    "link": "https://www.nytimes.com/2025/11/26/world/europe/uk-budget-youth-unemployment-minimum-wage.html",
    "summary": "Rising youth unemployment is one of the challenges that will affect the success of the British chancellor’s economic approach as she unveils a crucial budget on Wednesday."
  },
  {
    "title": "A Major Moment for the British Economy: What to Watch in the U.K. Budget",
    "link": "https://www.nytimes.com/2025/11/26/business/uk-budget-rachel-reeves-tax-spending.html",
    "summary": "Rachel Reeves, the top economic official in an increasingly unpopular government, will appear in Parliament to present tax and spending plans."
  },
  {
    "title": "Robert Irwin Wins ‘Dancing With the Stars’",
    "link": "https://www.nytimes.com/2025/11/23/style/robert-irwin-dancing-with-the-stars.html",
    "summary": "His story began with loss, but the lessons of his “Crocodile Hunter” father helped Irwin spread a message of love as he won Season 34 of “Dancing With the Stars.”"
  },
  {
    "title": "The ‘New’ Solution for the N.Y.C. Housing Crisis: Single-Room Apartments",
    "link": "https://www.nytimes.com/2025/11/25/nyregion/sro-apartments-nyc.html",
    "summary": "There is a push to revive single-room occupancy housing, where kitchens and bathrooms are shared among apartments as small as 100 square feet each."
  },
  {
    "title": "Will Dressing Up Fix Flying?",
    "link": "https://www.nytimes.com/2025/11/24/style/dress-up-for-flying-sean-duffy.html",
    "summary": "Transportation Secretary Sean Duffy has introduced a campaign meant to encourage civility."
  },
  {
    "title": "Sean Duffy Wants Healthier In-Flight Snacks Along With Better-Dressed Travelers",
    "link": "https://www.nytimes.com/2025/11/25/us/sean-duffy-healthier-plane-snacks.html",
    "summary": "Sean Duffy, who has been promoting greater decorum among air travelers, said he would like to see choices besides salty pretzels and buttery cookies."
  },
  {
    "title": "Boston Mayor Wu Questions Mamdani’s Approach to Meeting With Trump",
    "link": "https://www.nytimes.com/2025/11/25/nyregion/mamdani-trump-michelle-wu.html",
    "summary": "Mayor-elect Zohran Mamdani won praise for his meeting with President Trump. But Michelle Wu, the like-minded mayor of Boston, said “flattery is not the way.”"
  },
  {
    "title": "In City Hall Housecleaning, Mamdani Asks 179 Adams Staff Members to Quit",
    "link": "https://www.nytimes.com/2025/11/25/nyregion/mamdani-adams-staff-resignations.html",
    "summary": "Zohran Mamdani will be sworn in as mayor on Jan. 1. His request for resignations targeted political appointees."
  },
  {
    "title": "Indiana Lawmakers Are Poised to Vote on Redistricting After All",
    "link": "https://www.nytimes.com/2025/11/25/us/indiana-redistricting-republicans.html",
    "summary": "Republican leaders in the legislature backtracked and said they would vote on a new congressional map that President Trump wants, though support remained uncertain."
  },
  {
    "title": "Fears About A.I. Prompt Talks of Super PACs to Rein In the Industry",
    "link": "https://www.nytimes.com/2025/11/25/us/politics/ai-super-pac-anthropic.html",
    "summary": "As artificial intelligence companies prepare to pour money into the midterm elections, some in the A.I. world are hatching plans of their own to curb the industry’s influence."
  },
  {
    "title": "Joan Branson, Richard Branson’s Wife of 35 Years, Dies at 80",
    "link": "https://www.nytimes.com/2025/11/25/world/europe/joan-branson-dead.html",
    "summary": "Mr. Branson, the Virgin Atlantic founder, announced her death in an Instagram post."
  },
  {
    "title": "It’s Time to Build Nuclear Power Plants Again",
    "link": "https://www.nytimes.com/2025/11/26/opinion/nuclear-energy-california-massachusetts.html",
    "summary": "California and eight other states have outdated restrictions on building nuclear power plants."
  },
  {
    "title": "Thanksgiving Is a Celebration of American Rebirth",
    "link": "https://www.nytimes.com/2025/11/25/opinion/thanksgiving-and-the-new-births-of-freedom.html",
    "summary": "An opportunity for families and friends and, by extension, communities, states, and the country itself to have a national reset."
  },
  {
    "title": "Thanksgiving Costs Draw Scrutiny",
    "link": "https://www.nytimes.com/2025/11/25/briefing/thanksgiving-costs-draw-scrutiny.html",
    "summary": "Also, the 100 most notable books of the year. Here’s the latest at the end of Tuesday."
  },
  {
    "title": "Prosecutors Prepare to Try Suspect in Etan Patz Case for the Third Time",
    "link": "https://www.nytimes.com/2025/11/25/nyregion/etan-patz-retrial.html",
    "summary": "The defendant, Pedro Hernandez, was convicted in 2017 of kidnapping the 6-year-old, who disappeared in 1979 in SoHo."
  },
  {
    "title": "Taiwan’s President to Seek an Extra $40 Billion for Military",
    "link": "https://www.nytimes.com/2025/11/25/world/asia/taiwan-40-billion-military-trump.html",
    "summary": "President Lai Ching-te says the spending, which must be approved by the island’s legislature, would fund purchases of arms from the United States."
  },
  {
    "title": "Violence Is Driving Catastrophic Hunger in Nigeria, U.N. Report Says",
    "link": "https://www.nytimes.com/2025/11/25/world/africa/nigeria-food-violence-usaid.html",
    "summary": "Africa’s most populous nation was already facing one of the world’s biggest hunger crises. It’s getting much worse."
  },
  {
    "title": "Penny Oleksiak, Canadian Swimmer, Faces 2-Year Ban Over Antidoping Testing Rules",
    "link": "https://www.nytimes.com/2025/11/25/world/canada/penny-oleksiak-swimming-ban-doping-testing.html",
    "summary": "Penny Oleksiak, 25, who has won seven Olympic medals, was sanctioned under antidoping rules. Her suspension ends before the 2028 Summer Olympics in Los Angeles."
  }
]