[
  {
    "title": "Supreme Court Allows Trump to Gut Education Department With Mass Firings",
    "link": "https://www.nytimes.com/2025/07/14/us/politics/supreme-court-education-department.html",
    "summary": "The move by the justices represents an expansion of executive power, allowing President Trump to dismantle the inner workings of a government department."
  },
  {
    "title": "What to Know About Trump’s Cuts to the Education Department",
    "link": "https://www.nytimes.com/2025/07/14/us/trump-administration-education-department-dismantle.html",
    "summary": "Cuts have hit most of the department’s main functions, which include investigating civil rights complaints, providing financial aid, researching what works in education, testing students and disbursing federal funding."
  },
  {
    "title": "24 States Sue Trump Over $6.8 Billion Withheld From Education",
    "link": "https://www.nytimes.com/2025/07/14/us/states-sue-trump-education-funds-afterschool.html",
    "summary": "Providers say after-school programs and other services for the coming school year are threatened without the federal money, which was abruptly withheld."
  },
  {
    "title": "Behind Trump’s Tough Talk on Russia and Putin, Doubts and Missing Details",
    "link": "https://www.nytimes.com/2025/07/14/us/politics/trump-russia-ukraine-nato.html",
    "summary": "Pentagon officials said details were still being worked out, and experts doubted Mr. Trump’s threat of huge tariffs for Russian trading partners."
  },
  {
    "title": "Trump Reluctantly Comes Around to Backing Ukraine. Will He Stick With It?",
    "link": "https://www.nytimes.com/2025/07/14/us/politics/trump-ukraine-biden.html",
    "summary": "President Trump is formalizing a new plan to sell American weapons to European allies, who would pass them onto Kyiv. But he made it clear this wasn’t his war."
  },
  {
    "title": "Marjorie Taylor Greene Criticizes Trump’s Plan to Speed Weapons to Ukraine",
    "link": "https://www.nytimes.com/2025/07/14/us/politics/marjorie-taylor-greene-trump-ukraine.html",
    "summary": "The right-wing congresswoman from Georgia suggested that the president’s new proposal to help speed weapons to Ukraine betrays the promise to voters to end U.S. involvement in foreign conflicts."
  },
  {
    "title": "Nvidia Says U.S. Has Lifted Restrictions on A.I. Chip Sales to China",
    "link": "https://www.nytimes.com/2025/07/14/technology/nvidia-ai-chip-sales-china.html",
    "summary": "The Silicon Valley chip giant said the Trump administration, which had shut down its sales to China three months ago, had assured it that licenses for the sales would now be granted."
  },
  {
    "title": "Meta Built a Data Center Next Door. The Neighbors’ Water Taps Went Dry.",
    "link": "https://www.nytimes.com/2025/07/14/technology/meta-data-center-water.html",
    "summary": "In the race to develop artificial intelligence, tech giants are building data centers that guzzle up water. That has led to problems for people who live nearby."
  },
  {
    "title": "More Woody Guthrie Songs? Yes, From a Trove of Homemade Recordings.",
    "link": "https://www.nytimes.com/2025/07/14/arts/music/woody-guthrie-tapes-woody-at-home.html",
    "summary": "A new, intimate album will include 13 previously unheard songs and a rewrite of “This Land Is Your Land.”"
  },
  {
    "title": "Israel and Iran Usher In New Era of Psychological Warfare",
    "link": "https://www.nytimes.com/2025/07/15/technology/israel-iran-psychological-warfare.html",
    "summary": "The 12-day conflict was marked by a flurry of propaganda, disinformation and covert operations aided by artificial intelligence and spread by social media."
  },
  {
    "title": "China’s Economy Grows Steadily Despite Trump’s Tariffs",
    "link": "https://www.nytimes.com/2025/07/14/business/china-economy-gdp-q2.html",
    "summary": "Official figures showed modest growth in the second quarter as exports shifted to other countries and Beijing invested in manufacturing and infrastructure."
  },
  {
    "title": "John MacArthur, Firebrand Preacher and Culture Warrior, Dies at 86",
    "link": "https://www.nytimes.com/2025/07/15/us/john-macarthur-dead.html",
    "summary": "He was a theologically uncompromising pastor in Southern California who influenced generations of evangelical preachers."
  },
  {
    "title": "Cuomo to Fight On in Mayor’s Race After Bruising Primary Loss to Mamdani",
    "link": "https://www.nytimes.com/2025/07/14/nyregion/andrew-cuomo-mamdani-nyc-mayor.html",
    "summary": "Former Gov. Andrew M. Cuomo announced he would run as a third-party candidate against Assemblyman Zohran Mamdani, the Democratic nominee for New York City mayor."
  },
  {
    "title": "Fewer Than 100 Unaccounted For in Texas Flood as Officials Decry ‘Blame Game’",
    "link": "https://www.nytimes.com/2025/07/14/us/texas-kerr-county-flood-response.html",
    "summary": "In Kerr County, where the most deaths occurred, officials said they were receiving threats, even as they continued to deflect questions about flood warnings."
  },
  {
    "title": "I’m a Genocide Scholar. I Know It When I See It.",
    "link": "https://www.nytimes.com/2025/07/15/opinion/israel-gaza-holocaust-genocide-palestinians.html",
    "summary": "A scholar of genocide comes to a painful conclusion about Israel’s actions in Gaza."
  },
  {
    "title": "Why Trump’s Base Can’t Let Go of Epstein",
    "link": "https://www.nytimes.com/2025/07/14/opinion/trump-jeffrey-epstein-files.html",
    "summary": "Having nurtured conspiracy theories for his entire political career, he suddenly seems in danger of being consumed by one."
  },
  {
    "title": "Nine People Killed in Fire at Massachusetts Assisted Living Facility",
    "link": "https://www.nytimes.com/2025/07/14/us/fire-gabriel-house-fall-river-massachusetts.html",
    "summary": "The fire broke out on Sunday in the city of Fall River, a state official said. More than 30 residents were taken to hospitals."
  },
  {
    "title": "Arizona Governor Seeks Investigation of Federal Handling of Grand Canyon Fire",
    "link": "https://www.nytimes.com/2025/07/14/us/arizona-grand-canyon-wildfire-controlled-burn.html",
    "summary": "Gov. Katie Hobbs questioned why the U.S. government decided to manage the Dragon Bravo fire, which started with a lightning strike, as a “controlled burn” during the height of the summer."
  },
  {
    "title": "Fauja Singh, Marathon Runner at an Advanced Age, Is Dead",
    "link": "https://www.nytimes.com/2025/07/14/sports/fauja-singh-dead.html",
    "summary": "Competing in London in 2011, he claimed to be 100, though his exact age remained a mystery. “I run while talking to God,” he said in explaining his endurance."
  },
  {
    "title": "Unreleased Beyoncé Music Stolen During Cowboy Carter Tour in Atlanta, Police Say",
    "link": "https://www.nytimes.com/2025/07/14/us/beyonce-unreleased-music-stolen-atlanta.html",
    "summary": "Two members of Beyoncé’s team said that their S.U.V. was broken into  on July 8, just before a series of concerts in Atlanta, the authorities said. The police said a suspect had emerged."
  }
]