[
  {
    "title": "How Trump and Nvidia’s C.E.O. Became Partners on the International Stage",
    "link": "https://www.nytimes.com/2025/11/19/technology/trump-nvidia-jensen-huang.html",
    "summary": "Over the last 10 months, President Trump has become close with Jensen Huang, Nvidia’s chief executive, as the company’s chips have become a tool in trade and peace talks."
  },
  {
    "title": "Nvidia and Walmart Could Ease Wall St.’s Jitters. Or Make Them Worse.",
    "link": "https://www.nytimes.com/2025/11/19/business/stock-market-nvidia-walmart-earnings.html",
    "summary": "After four consecutive down days, the stock market is looking increasingly queasy. Earnings reports from Nvidia, Walmart and Target could hint at what’s ahead."
  },
  {
    "title": "Europe’s Chip Dreams Confront Business Realities",
    "link": "https://www.nytimes.com/2025/11/19/technology/europe-tsmc-chips.html",
    "summary": "European chipmakers need TSMC’s help to grow their own semiconductor supply chain, but the chip giant’s Taiwanese suppliers find Europe a tough place to do business."
  },
  {
    "title": "In the A.I. Race, Chinese Talent Still Drives American Research",
    "link": "https://www.nytimes.com/2025/11/19/technology/ai-research-chinese-talent.html",
    "summary": "Although some Silicon Valley executives paint China as the enemy, Chinese brains continue to play a major role in U.S. research."
  },
  {
    "title": "A $7 Billion Opioid Reckoning, and Trump’s Defense of the Saudi Crown Prince",
    "link": "https://www.nytimes.com/2025/11/19/podcasts/the-headlines/opioid-settlement-trump-defense-saudi-crown-prince.html",
    "summary": "Plus, young men are flocking to the Orthodox Church."
  },
  {
    "title": "Trump Lauds M.B.S. During White House Visit and Dismisses Khashoggi’s Killing",
    "link": "https://www.nytimes.com/2025/11/18/us/politics/trump-saudi-crown-prince-visit.html",
    "summary": "President Trump rejected a U.S. intelligence report finding that Crown Prince Mohammed bin Salman had ordered the murder of a journalist."
  },
  {
    "title": "Once a Pariah, Saudi Prince Resets U.S. Relations on His Own Terms",
    "link": "https://www.nytimes.com/2025/11/18/us/politics/prince-mohammed-trump-us-saudi-arabia.html",
    "summary": "Seven years ago, Crown Prince Mohammed bin Salman couldn’t visit Washington. When he arrived at the White House on Tuesday, he got F-35s, the world’s fastest chips and the central role in the remaking of the Middle East."
  },
  {
    "title": "Here’s Who’s Attending Trump’s Dinner for the Saudi Crown Prince: Elon Musk, Cristiano Ronaldo and more.",
    "link": "https://www.nytimes.com/2025/11/18/us/politics/trump-saudi-dinner-guests.html",
    "summary": "Here are some of the notable guests invited to President Trump’s dinner for Crown Prince Mohammed bin Salman of Saudi Arabia."
  },
  {
    "title": "Orthodox Church Pews Are Overflowing With Converts",
    "link": "https://www.nytimes.com/2025/11/19/us/orthodox-christianity.html",
    "summary": "“In the whole history of the Orthodox Church in America, this has never been seen,” a priest said about the surge of young men drawn to the demanding practice of Christianity."
  },
  {
    "title": "How Two New York Times Reporters Cover Christianity in Trump’s Polarized America",
    "link": "https://www.nytimes.com/2025/11/19/us/trump-politics-religion-christianity.html",
    "summary": "We asked our journalists who write about religion nationwide about how they navigate debates about what Christianity is and isn’t."
  },
  {
    "title": "Comey’s Lawyers Head to Court to Argue Vindictive Prosecution by Trump",
    "link": "https://www.nytimes.com/2025/11/19/us/politics/comey-vindictive-prosecution-trump.html",
    "summary": "James B. Comey’s lawyers are expected to argue that the Justice Department effectively allowed itself to be taken captive by the president’s desire for political revenge."
  },
  {
    "title": "Congress Overwhelmingly Approves Releasing Epstein Files",
    "link": "https://www.nytimes.com/2025/11/18/us/politics/house-vote-epstein-files.html",
    "summary": "After a near-unanimous House vote, the Senate agreed to quickly clear the bill for President Trump’s signature."
  },
  {
    "title": "Trump Berates Mary Bruce of ABC News After Question About Jamal Khashoggi",
    "link": "https://www.nytimes.com/2025/11/18/business/media/trump-reporter-khashoggi-saudis.html",
    "summary": "The president grew frustrated with Mary Bruce of ABC News over her questions during his meeting with the Saudi crown prince. On Friday, he told a Bloomberg News reporter, “Quiet, piggy.”"
  },
  {
    "title": "Harvard Opens New Investigation Into Summers and Epstein",
    "link": "https://www.nytimes.com/2025/11/19/us/harvard-summers-epstein-investigation.html",
    "summary": "The university is reviewing newly released emails between convicted sex offender Jeffrey Epstein and former Harvard President Lawrence H. Summers, among other people at the institution."
  },
  {
    "title": "Thanksgiving Pies So Good, You’ll Want to Skip Dinner",
    "link": "https://cooking.nytimes.com/article/pies-thanksgiving-desserts",
    "summary": "Go straight to the good stuff this Thanksgiving: apple and cream, chocolaty espresso, honeyed cranberry, and more."
  },
  {
    "title": "Anxiety Over Trump’s Crackdown Alters Life for Many Immigrants, Poll Finds",
    "link": "https://www.nytimes.com/2025/11/19/us/immigration-poll-trump-crackdown.html",
    "summary": "Months into the Trump deportation campaign, one-third of noncitizens, including about 60 percent of undocumented immigrants, say they are avoiding aspects of daily life."
  },
  {
    "title": "Russia Pounds Ukraine Even as Zelensky Aims to Revive Peace Talks",
    "link": "https://www.nytimes.com/2025/11/19/world/europe/ukraine-russia-strikes-peace-talks.html",
    "summary": "At least 19 people were killed in the city of Ternopil when missiles hit a residential building, the authorities there said."
  },
  {
    "title": "Zelensky Under Siege as Corruption Case Shatters Ukraine’s Wartime Unity",
    "link": "https://www.nytimes.com/2025/11/19/world/europe/ukraine-zelensky-corruption.html",
    "summary": "An anti-Zelensky political coalition is coalescing as the president’s allies are accused of enriching themselves while the country’s soldiers die on the battlefield."
  },
  {
    "title": "For Victims of Sexual Assault on Cruise Ships, Justice Can Be Elusive",
    "link": "https://www.nytimes.com/2025/11/19/travel/cruise-lines-sexual-assault.html",
    "summary": "As cruise travel hits record demand, cases of sexual assault have also risen. Many accusers learn that the rights they had on land don’t always apply."
  },
  {
    "title": "Who’s Running to Replace Jerry Nadler? 10 People and Counting.",
    "link": "https://www.nytimes.com/2025/11/19/nyregion/nadler-candidates-who-running.html",
    "summary": "Mr. Nadler’s coveted House seat in Manhattan will be up for grabs next year in a district that is the wealthiest in New York."
  },
  {
    "title": "2 Democratic Activists Join a Crowded House Race in Manhattan",
    "link": "https://www.nytimes.com/2025/11/19/nyregion/shurka-kasky-nadler-election.html",
    "summary": "Cameron Kasky is a Parkland school shooting survivor; Mathew Shurka helped form a group to pressure Congress to ban conversion therapy."
  },
  {
    "title": "Iowa City Made Its Buses Free. Traffic Cleared, and So Did the Air.",
    "link": "https://www.nytimes.com/2025/11/18/climate/iowa-city-free-buses.html",
    "summary": "Ridership jumped, people cut back on driving and, over the summer, the city extended the program another year."
  },
  {
    "title": "Body Slams, Curated: Pro Wrestling Enters Its Museum Era",
    "link": "https://www.nytimes.com/2025/11/18/arts/design/professional-wrestling-art-drag.html",
    "summary": "The over-the-top spectacle has been slicing into the art world, with gallery shows, performances and a forthcoming major exhibition."
  },
  {
    "title": "Jeffrey Epstein’s Victims Are the Real Story",
    "link": "https://www.nytimes.com/2025/11/19/opinion/epstein-files-victims.html",
    "summary": "Women’s pain is not entertainment."
  },
  {
    "title": "Patreon’s C.E.O.: My Vision for a Better Internet",
    "link": "https://www.nytimes.com/2025/11/19/opinion/patreon-algorithms-social-media-internet.html",
    "summary": "The internet should enrich people, not advertisers."
  },
  {
    "title": "Stephen Colbert Celebrates ‘Epstein Rockin’ Eve’",
    "link": "https://www.nytimes.com/2025/11/19/arts/television/late-night-trump-epstein-files.html",
    "summary": "“Stay up for a ball drop you’re going to want to miss,” the “Late Show” host said as Congress voted for the release of the Jeffrey Epstein files."
  },
  {
    "title": "Smoking Weed Could Lead to Less Drinking, New Study Suggests",
    "link": "https://www.nytimes.com/2025/11/19/well/weed-cannabis-alcohol-drinking.html",
    "summary": "In a makeshift bar on a college campus, researchers studied how smoking cannabis affected alcohol consumption."
  },
  {
    "title": "At This College, the English Dept. Is Out. ‘Human Narratives’ Is In.",
    "link": "https://www.nytimes.com/2025/11/19/nyregion/montclair-state-restructuring.html",
    "summary": "At Montclair State University in New Jersey, a departmental restructuring plan is igniting concerns about the future of the humanities."
  },
  {
    "title": "At $236 Million, Klimt Piece Is Second Most Expensive Painting Sold at Auction",
    "link": "https://www.nytimes.com/2025/11/18/arts/design/portrait-auction-record-klimt-sothebys.html",
    "summary": "At $236.4 million, a portrait by Gustav Klimt is the second most expensive painting at auction, while Maurizio Cattelan’s golden toilet drew $12.1 million."
  },
  {
    "title": "Federal Judge Orders Some Texas Schools to Remove Ten Commandment Posters",
    "link": "https://www.nytimes.com/2025/11/18/us/politics/texas-ten-commandments.html",
    "summary": "The judge sided with families of students who had argued that the displays infringed on their religious freedom."
  }
]