[
  {
    "title": "Trump Administration Is Taking Billions in Stakes in Firms Like Intel",
    "link": "https://www.nytimes.com/2025/11/25/us/politics/trump-intel-steel-minerals-china.html",
    "summary": "The Trump administration is trading billions of dollars of taxpayer money for ownership stakes in companies. The unusual practice shows no sign of slowing."
  },
  {
    "title": "Judge Tosses Criminal Charges Against James Comey and Letitia James",
    "link": "https://www.nytimes.com/2025/11/24/nyregion/james-comey-case-dismissed.html",
    "summary": "The decision is a setback for the president’s efforts to wield the criminal justice system against his perceived enemies."
  },
  {
    "title": "Trump’s Retribution Campaign Hits a Major Roadblock, and Health Care Costs Set to Surge",
    "link": "https://www.nytimes.com/2025/11/25/podcasts/the-headlines/trump-comey-james-health-care-costs.html",
    "summary": "Plus, what a social media break can do for your brain."
  },
  {
    "title": "How Rubio Tried to Bring a Pro-Russia Peace Plan to Middle Ground",
    "link": "https://www.nytimes.com/2025/11/24/us/politics/trump-russia-ukraine-peace-plan-middle-ground.html",
    "summary": "While President Trump attacked the Ukrainians, Secretary of State Marco Rubio flew to Geneva to seize control of negotiations that were going off the rails."
  },
  {
    "title": "As Trump Pushes to End Ukraine War, Europe Toils to Have a Say",
    "link": "https://www.nytimes.com/2025/11/25/world/europe/trump-ukraine-war-peace-plan-merz-macron-starmer.html",
    "summary": "Initially cut out of development of the 28-point peace plan, European leaders are now trying to recast its pro-Russia slant. So far, it seems to be working."
  },
  {
    "title": "Russia Bombards Kyiv After Peace Talks End in Geneva",
    "link": "https://www.nytimes.com/2025/11/25/world/europe/ukraine-russia-strike-peace-plan.html",
    "summary": "A missile-and-drone attack killed at least six people in Ukraine’s capital, the authorities said, hours after officials said they had made some headway on a peace proposal."
  },
  {
    "title": "Army Chief Says France Must ‘Accept Losing Our Children,’ Igniting Uproar",
    "link": "https://www.nytimes.com/2025/11/24/world/europe/france-voluntary-military-service.html",
    "summary": "The furor erupted as President Emmanuel Macron is expected to present a plan for paid, voluntary military service to bolster the armed forces against the threat from Russia."
  },
  {
    "title": "Mamdani Response to Protest Inflames Tensions with Jewish Leaders",
    "link": "https://www.nytimes.com/2025/11/24/nyregion/mamdani-synagogue-protest.html",
    "summary": "The mayor-elect chastised a synagogue that hosted an event promoting migration to Israel and settlements in occupied territories. His stance further tested his strained relationship with pro-Israel Jews."
  },
  {
    "title": "Challengers Take on N.Y. House Democrats, Targeting Their Ties to Israel",
    "link": "https://www.nytimes.com/2025/11/25/nyregion/israel-congress-mamdani-challengers.html",
    "summary": "Several Democratic incumbents are facing primary battles after Zohran Mamdani’s win suggested that being pro-Israel was no longer a universal selling point."
  },
  {
    "title": "Drug Arrests and Gun Seizures Fell as Homeland Security Pursued Immigration",
    "link": "https://www.nytimes.com/2025/11/25/us/politics/drug-arrests-gun-seizures-homeland-security-immigration.html",
    "summary": "Internal documents reveal the impact on crime fighting as the Trump administration diverts special agents to its mass deportation agenda."
  },
  {
    "title": "Deported and Desperate to Be Reunited With Their Children",
    "link": "https://www.nytimes.com/2025/11/25/nyregion/venezuela-children-deported-parents.html",
    "summary": "Across the United States, children have been left in the care of relatives and neighbors after deportations. In Venezuela, parents are clamoring for the return of their sons and daughters."
  },
  {
    "title": "U.S. Plans Compounds to House Palestinians in Israeli-Held Half of Gaza",
    "link": "https://www.nytimes.com/2025/11/25/world/middleeast/us-compounds-palestinians-israel-gaza-strip.html",
    "summary": "The project could offer relief for tens of thousands of Palestinians who have endured two years of war, but has raised questions about whether it could entrench the partition of Gaza into Israeli- and Hamas-controlled zones."
  },
  {
    "title": "Schumer Faces Pushback From ‘Fight Club’ Group of Senate Democrats",
    "link": "https://www.nytimes.com/2025/11/24/us/politics/schumer-democrats-senate-fight-club.html",
    "summary": "A group of liberal senators is quietly challenging the minority leader over his approach to the midterms and President Trump, in a sign of the party’s deep frustration."
  },
  {
    "title": "Boeing Tackles Quality With a ‘War on Defects’",
    "link": "https://www.nytimes.com/2025/11/25/business/boeing-737-max-factory.html",
    "summary": "Two years after a panel flew off a 737 Max, Boeing is doing more inspections, completing work in its intended order and making other changes. Can the company keep it up?"
  },
  {
    "title": "Faux Jewels and Slimming Belts: Why Shopping on TikTok Is a Lot Like QVC",
    "link": "https://www.nytimes.com/2025/11/25/business/media/tiktok-shop-black-friday.html",
    "summary": "The popular app’s online marketplace is growing rapidly in the United States, driven by TikTok’s popularity and influencer advertisements that look a lot like TV infomercials."
  },
  {
    "title": "A.I. Can Do More of Your Shopping This Holiday Season",
    "link": "https://www.nytimes.com/2025/11/25/technology/chatgpt-holiday-shopping.html",
    "summary": "New tools and features from retailers and tech companies use artificial intelligence to help people find gifts and make decisions about their shopping lists."
  },
  {
    "title": "China and Japan, With Trump in the Middle, Stoke an Existential Showdown",
    "link": "https://www.nytimes.com/2025/11/25/world/asia/japan-takaichi-trump-china-xi.html",
    "summary": "With Japan’s new leader refusing to back down from China’s show of force and claims on Taiwan, Xi Jinping picks up the phone to try to pry the U.S.-Japan alliance apart."
  },
  {
    "title": "Warmed by Japan’s Support, Taiwan Takes Up Sushi Diplomacy",
    "link": "https://www.nytimes.com/2025/11/25/world/asia/taiwan-china-japan-sushi.html",
    "summary": "China closed off Japanese seafood imports after Japan’s new leader declared strong support for Taiwan. Suddenly, sushi is everywhere on Taiwanese social media."
  },
  {
    "title": "I’m a Professor. A.I. Has Changed My Classroom, but Not for the Worse.",
    "link": "https://www.nytimes.com/2025/11/25/magazine/ai-higher-education-students-teachers.html",
    "summary": "My students’ easy access to chatbots forced me to make humanities instruction even more human."
  },
  {
    "title": "Prosecutor Used Flawed A.I. to Keep a Man in Jail, His Lawyers Say",
    "link": "https://www.nytimes.com/2025/11/25/us/prosecutor-artificial-intelligence-errors-lawyers-california.html",
    "summary": "The case is among the first in which a prosecutor is accused of filing court papers marred by A.I.-generated mistakes."
  },
  {
    "title": "100 Notable Books of 2025",
    "link": "https://www.nytimes.com/2025/11/24/books/notable-books.html",
    "summary": "Here is the standout fiction and nonfiction of the year, selected by the staff of The New York Times Book Review."
  },
  {
    "title": "Trump’s Broken Promise to Confront Corporate Power",
    "link": "https://www.nytimes.com/2025/11/25/opinion/trump-antitrust-corporations-consumers.html",
    "summary": "The Trump administration is using its antitrust powers mostly to protect Mr. Trump."
  },
  {
    "title": "I Went to an Anti-Vaccine Conference. Medicine Is in Trouble.",
    "link": "https://www.nytimes.com/2025/11/25/opinion/children-health-defense-kennedy.html",
    "summary": "A journey to the fringe of MAHA."
  },
  {
    "title": "Jimmy Kimmel Is Charmed by the Trump-Mamdani Bromance",
    "link": "https://www.nytimes.com/2025/11/25/arts/television/jimmy-kimmel-trump-mamdani.html",
    "summary": "“What a turn of events!” Kimmel said of the president’s warm words for New York’s mayor-elect. “It was like he was giving a wedding toast to his new son-in-law.”"
  },
  {
    "title": "Budget Will Be a Big Test for the UK’s Most Unpopular Chancellor in Decades",
    "link": "https://www.nytimes.com/2025/11/25/business/rachel-reeves-uk-budget.html",
    "summary": "Rachel Reeves, who has had a bruising tenure as the country’s top economic official, is set to announce tax and spending measures that risk stoking more discontent."
  },
  {
    "title": "Ritz-Carlton Is Sued Over Luxury Safari Camp in Kenya",
    "link": "https://www.nytimes.com/2025/11/24/travel/ritz-carlton-safari-camp-masai-tribe-great-migration.html",
    "summary": "Ritz-Carlton’s luxury camp in Kenya’s Masai Mara offers “front row seats” to the Great Migration. But some Masai tribe members and wildlife experts say it’s in a sensitive area and should not have been approved."
  },
  {
    "title": "Thomas King, Award-Winning Canadian Author, Says He Is Not Indigenous",
    "link": "https://www.nytimes.com/2025/11/25/world/canada/thomas-king-indigenous.html",
    "summary": "Thomas King said he felt “ripped in half” on learning he had no Indigenous ancestry. The Canadian author has dedicated his career to writing about Indigenous people."
  }
]