[
  {
    "title": "At Trump’s Summit, No Deal on Ukraine, and No Consequence for Putin",
    "link": "https://www.nytimes.com/2025/08/15/us/politics/trump-putin-summit-ukrainians.html",
    "summary": "President Trump’s failure to reach an accord on Ukraine only made his warm welcome for the Russian leader more striking."
  },
  {
    "title": "Trump and Putin Put on a Show in Summit, but No Ukraine Deal Emerges",
    "link": "https://www.nytimes.com/2025/08/15/us/politics/trump-putin-alaska-ukraine.html",
    "summary": "President Trump gave President Vladimir Putin a warm public reception, effectively ending his diplomatic isolation over the past three years for his invasion of Ukraine. But Mr. Putin did not agree to stop the war."
  },
  {
    "title": "After Trump-Putin Alaska Summit, Europeans Worry Trump Will Pressure Zelensky",
    "link": "https://www.nytimes.com/2025/08/16/world/europe/putin-trump-alaska-summit-ukraine.html",
    "summary": "With no strategy of their own for ending the war, the continent’s leaders are anxious that President Trump will force Kyiv to accept terms that favor Russia too much."
  },
  {
    "title": "Trump Administration Backs Off New Attempt to Widen Control of D.C. Police",
    "link": "https://www.nytimes.com/2025/08/15/us/washington-dc-police-trump-lawsuit.html",
    "summary": "The chief will remain after a lawsuit challenged the Justice Department’s attempt to install a new leader as part of an effort to put the agency under federal control."
  },
  {
    "title": "Where D.C. Crime Is Bad, Residents Question Trump’s Motives for Federal Takeover",
    "link": "https://www.nytimes.com/2025/08/16/us/politics/trump-washington-crime.html",
    "summary": "The president might have found allies in Southeast Washington, where violent crime has long vexed residents. But when he described the city as “disgusting,” with “roving mobs,” his remarks left those looking for help cold."
  },
  {
    "title": "4 Takeaways From the Week Trump Took Control of D.C.’s Police",
    "link": "https://www.nytimes.com/2025/08/15/us/politics/trump-washington-crime-takeaways.html",
    "summary": "The administration’s grip on the city has only tightened as the week has worn on, while pushback has begun to intensify."
  },
  {
    "title": "Trump Is Testing D.C.’s Home Rule. What Is It?",
    "link": "https://www.nytimes.com/2025/08/15/upshot/washington-dc-home-rule-explained.html",
    "summary": "The city’s limited self-governance has set the stage for the president’s police takeover."
  },
  {
    "title": "Newsom’s Gerrymander of California Has a Formidable Foe: Schwarzenegger",
    "link": "https://www.nytimes.com/2025/08/15/us/politics/schwarzenegger-newsom-california-redistricting.html",
    "summary": "The actor-turned-governor helped overhaul how California draws political maps. In an interview with The New York Times, he said he would fight to preserve that legacy."
  },
  {
    "title": "California Lawmakers Release a Proposed House Map Favoring Democrats",
    "link": "https://www.nytimes.com/2025/08/15/us/california-redistricting-maps-released.html",
    "summary": "The plan would help Democrats flip five seats, offsetting the gains Republicans hope to make by redrawing maps in Texas."
  },
  {
    "title": "Environmental Groups Face ‘Generational’ Setbacks Under Trump",
    "link": "https://www.nytimes.com/2025/08/16/climate/environmental-strategy-trump.html",
    "summary": "As President Trump dismantles the country’s efforts to fight climate change, environmental groups are back on their heels."
  },
  {
    "title": "MAHA Draft Report Brings Relief to Some, Chagrin to Others",
    "link": "https://www.nytimes.com/2025/08/15/health/maha-draft-report-pesticides.html",
    "summary": "A draft of an upcoming White House report on children’s health was not as harsh toward the agriculture industry as some of Robert F. Kennedy Jr.’s allies had hoped."
  },
  {
    "title": "Judge Rejects Trump’s Attempt to End Standards of Care for Detained Migrant Children",
    "link": "https://www.nytimes.com/2025/08/15/us/migrant-children-trump-flores-settlement.html",
    "summary": "Court-mandated oversight will remain in place for migrant children in custody. Lawyers have reported poor medical care and lack of sunlight and showers."
  },
  {
    "title": "‘South Park’ Is Crude and Childish. That May Make It Perfect for This Moment.",
    "link": "https://www.nytimes.com/2025/08/16/arts/television/south-park-trump-administration-paramount.html",
    "summary": "For decades, “South Park” has been crude, cynical and childish. That may be what makes it perfect for this moment."
  },
  {
    "title": "Air Canada’s Flight Attendants Reject Call for Arbitration",
    "link": "https://www.nytimes.com/2025/08/15/world/canada/air-canada-flight-attendant-strike.html",
    "summary": "Ahead of the work stoppage, the airline said it had canceled most of the 700 flights that it directly operates, which carry about 130,000 people each day."
  },
  {
    "title": "Mamdani’s Video Savvy: Easy to Envy, Hard to Duplicate",
    "link": "https://www.nytimes.com/2025/08/16/nyregion/cuomo-adams-mamdani-social-media.html",
    "summary": "Former Gov. Andrew M. Cuomo and Mayor Eric Adams are trying to mimic Assemblyman Zohran Mamdani’s buzzy online videos in the New York City mayor’s race."
  },
  {
    "title": "C.E.O.s Want Their Companies to Adopt A.I. But Do They Get It Themselves?",
    "link": "https://www.nytimes.com/2025/08/16/business/ceos-adopt-ai.html",
    "summary": "Some are being nudged to learn how to use the nascent technology. Coming to the C-suite retreat: mandatory website-building exercises using A.I. tools."
  },
  {
    "title": "Unraveling in Las Vegas, Then a Massacre in New York",
    "link": "https://www.nytimes.com/2025/08/16/nyregion/park-avenue-gunman-profile.html",
    "summary": "Shane Tamura was barely known in the city where he lived, working at night and navigating mental health crises. He drove 2,500 miles east to commit New York’s deadliest shooting in a quarter-century."
  },
  {
    "title": "Criminal Fights Crime",
    "link": "https://www.nytimes.com/2025/08/16/opinion/criminal-fights-crime.html",
    "summary": "Democrats should remember: “It’s the crime, stupid!”"
  },
  {
    "title": "Trump’s Political Theater Won’t Save D.C.",
    "link": "https://www.nytimes.com/2025/08/16/opinion/trump-national-guard-crime-dc.html",
    "summary": "It’s been a summer full of Trump’s overreach. Our round table convenes to discuss."
  },
  {
    "title": "No Deal",
    "link": "https://www.nytimes.com/2025/08/16/briefing/no-deal.html",
    "summary": "President Trump came home empty-handed."
  },
  {
    "title": "Congressman’s Stock Trades Draw More Scrutiny After Key Votes",
    "link": "https://www.nytimes.com/2025/08/16/us/politics/bresnahan-congress-stock-trading.html",
    "summary": "Representative Rob Bresnahan Jr. has traded stocks that could be affected by his work in Congress, raising questions about potential conflicts of interest."
  },
  {
    "title": "Arrests in Turkey Silence Erdogan’s Rivals, Opposition Says",
    "link": "https://www.nytimes.com/2025/08/16/world/europe/turkey-erdogan-corruption-drive.html",
    "summary": "Turkey has arrested at least 390 people associated with the political opposition since March."
  },
  {
    "title": "Once Seen as Divisive, South Korea’s New Leader Tries for Charming",
    "link": "https://www.nytimes.com/2025/08/16/world/asia/south-korea-president-lee.html",
    "summary": "To South Koreans weary of the political polarization that led briefly to martial law, President Lee Jae Myung is showing a more human touch than his predecessor. But his biggest challenges lie ahead."
  }
]