[
  {
    "title": "How Trump Decided to Strike Iran",
    "link": "https://www.nytimes.com/2025/06/22/us/politics/trump-iran-decision-strikes.html",
    "summary": "When Israel began its assault on Iran, President Trump kept his distance. But within days he was on a path that led to an extensive bombing mission aided by political and military ruses."
  },
  {
    "title": "Trump’s Risky Gamble on Attacking Iran",
    "link": "https://www.nytimes.com/video/us/politics/100000010243288/trumps-risky-gamble-on-attacking-iran.html",
    "summary": "With his strikes on Iran, President Trump is betting that the United States can repel any retaliation, and that the U.S. has destroyed the regime’s chances of reconstituting Iran’s nuclear program. David Sanger, the White House and national security correspondent for The New York Times, explains the risk."
  },
  {
    "title": "Iran’s Nuclear Dreams May Survive Even a Devastating American Blow",
    "link": "https://www.nytimes.com/2025/06/23/world/middleeast/iran-nuclear-program-us-strikes.html",
    "summary": "Through revolution and upheaval, the program has become intertwined with the country’s security and national identity."
  },
  {
    "title": "6 Trump Voters React to the U.S.’ Bombing of Nuclear Sites in Iran",
    "link": "https://www.nytimes.com/2025/06/23/us/trump-voters-iran-reaction.html",
    "summary": "In interviews, Trump supporters expressed a range of emotions — anger, wariness and avid support. But the dominant theme? Anxiety about what comes next."
  },
  {
    "title": "Inside the U.S. Strikes on Iran, and a Dangerous Heat Wave Spreads",
    "link": "https://www.nytimes.com/2025/06/23/podcasts/the-headlines/us-strikes-iran-heat-wave-robotaxi-tesla.html",
    "summary": "Plus, Tesla’s new Robotaxi."
  },
  {
    "title": "The Closing Arguments of the N.Y.C. Mayoral Candidates",
    "link": "https://www.nytimes.com/2025/06/23/nyregion/mayor-primary-speech-nyc.html",
    "summary": "Ahead of the June 24 primary, The New York Times analyzed the closing campaign speeches of the four leading Democrats running for mayor."
  },
  {
    "title": "Big Names, Bigger Money and Global Themes Color the N.Y.C. Council Races",
    "link": "https://www.nytimes.com/2025/06/23/nyregion/city-council-primaries-nyc.html",
    "summary": "All 51 seats are up for election this year, and the Democratic primary battles feature crowded fields, moneyed interests and some recognizable figures."
  },
  {
    "title": "In Dallas, a MAGA Summit for Young Women Pushes for ‘Less Burnout, More Babies’",
    "link": "https://www.nytimes.com/2025/06/23/style/trump-maga-women.html",
    "summary": "The wellness influencer universe is resonating with people who might not otherwise be drawn to politics."
  },
  {
    "title": "Judge Orders Abrego Garcia Released on Smuggling Charges Before Trial",
    "link": "https://www.nytimes.com/2025/06/22/us/politics/abrego-garcia-bail-smuggling-charges.html",
    "summary": "The order to release Kilmar Armando Abrego Garcia from criminal custody as he awaits trial was a rebuke to the Trump administration. But he is likely to remain in immigration custody."
  },
  {
    "title": "How Hugo Aguilar Ortiz Became Mexico’s Most Powerful Indigenous Lawyer",
    "link": "https://www.nytimes.com/2025/06/23/world/americas/hugo-aguilar-ortiz-mexico-chief-justice.html",
    "summary": "Hugo Aguilar Ortiz grew up in a remote Mixtec-speaking village. He is now one of the most powerful lawyers in Mexico."
  },
  {
    "title": "The Dalai Lama at 90: His Nation Faces a Moment of Truth",
    "link": "https://www.nytimes.com/2025/06/12/world/asia/dalai-lama-age-birthday-tibet.html",
    "summary": "The Tibetan spiritual leader has vowed to reveal a succession plan when his birthday is celebrated on July 6. He may get creative to thwart Chinese interference."
  },
  {
    "title": "How Iran Might Strike Back",
    "link": "https://www.nytimes.com/2025/06/22/opinion/iran-nuclear-strike-israel-war.html",
    "summary": "Among the most likely options are asymmetric or terrorist attacks, although the time frame is impossible to gauge."
  },
  {
    "title": "Can We See Our Future in China’s Cameras?",
    "link": "https://www.nytimes.com/2025/06/23/opinion/china-surveillance-cameras.html",
    "summary": "Promises of safety and convenience belie the machinery of political abuse."
  },
  {
    "title": "Inside Trump’s Decision",
    "link": "https://www.nytimes.com/2025/06/23/briefing/inside-trumps-decision.html",
    "summary": "The Times pieced together the days and hours leading up to President Trump’s decision to strike Iran. It’s a story of diplomacy, deception and a secret that almost got out."
  },
  {
    "title": "Russian Attack on Kyiv Kills at Least 7, Ukraine Says",
    "link": "https://www.nytimes.com/2025/06/23/world/europe/ukraine-russia-kyiv-attack.html",
    "summary": "The barrage was the latest in a series of deadly strikes by Moscow, which have intensified as cease-fire talks have largely stalled."
  },
  {
    "title": "Compass Sues Zillow, Accusing Site of Gate-Keeping Home Listings",
    "link": "https://www.nytimes.com/2025/06/23/realestate/compass-zillow-lawsuit.html",
    "summary": "Compass, the real estate brokerage, claims that Zillow, the website that has 227 million unique visitors a month, has conspired to maintain a monopoly over digital home listings."
  },
  {
    "title": "Vera Rubin Scientists Reveal Telescope’s First Images",
    "link": "https://www.nytimes.com/2025/06/23/science/vera-rubin-scientists-reveal-telescopes-first-images.html",
    "summary": "Scenes from nebulas in the Milky Way and a cluster of galaxies are a teaser of how the observatory will transform astronomy, with more imagery expected later on Monday."
  },
  {
    "title": "‘The Better Life Is Out of Reach’: The Chinese Dream Is Slipping Away",
    "link": "https://www.nytimes.com/2025/06/23/business/china-upward-mobility-inequality.html",
    "summary": "Promised a path to prosperity through hard work and education, China’s working class youths are hitting immovable ceilings."
  }
]