[
  {
    "title": "Trump Administration Authorizes Covert C.I.A. Action in Venezuela",
    "link": "https://www.nytimes.com/2025/10/15/us/politics/trump-covert-cia-action-venezuela.html",
    "summary": "The development comes as the U.S. military is drawing up options for President Trump to consider, including possible strikes inside the country."
  },
  {
    "title": "The Supreme Court Case That Could Hand the House to Republicans",
    "link": "https://www.nytimes.com/2025/10/15/upshot/supreme-court-voting-rights-gerrymander.html",
    "summary": "Democrats would be in danger of losing around a dozen majority-minority districts across the South if the court struck down part of the Voting Rights Act."
  },
  {
    "title": "Who Are the Louisiana Voters Behind a Major Supreme Court Challenge?",
    "link": "https://www.nytimes.com/2025/10/12/us/politics/supreme-court-voting-rights.html",
    "summary": "There is little information in court filings about the dozen plaintiffs who challenged the state’s voting map as an illegal racial gerrymander."
  },
  {
    "title": "Supreme Court Asks When Police Can Enter Without Warrant in Emergency",
    "link": "https://www.nytimes.com/2025/10/15/us/politics/supreme-court-warrants-emergency.html",
    "summary": "Montana is defending the actions of law enforcement officers who did not have a warrant when they responded to a possibly suicidal Army veteran."
  },
  {
    "title": "ICE Is Cracking Down on Chicago. Some Chicagoans Are Fighting Back.",
    "link": "https://www.nytimes.com/2025/10/14/us/chicago-ice-trump.html",
    "summary": "Residents have begun forming volunteer groups to monitor their neighborhoods for federal immigration agents. Others honk their horns or blow whistles when they see agents nearby."
  },
  {
    "title": "Meta Removes Facebook Group That Shared Information on ICE Agents",
    "link": "https://www.nytimes.com/2025/10/15/technology/meta-removes-ice-facebook-page.html",
    "summary": "The Facebook page was taken down for “violating our policies against coordinated harm,” according to Meta."
  },
  {
    "title": "L.A. County Declares State of Emergency Over Immigration Raids",
    "link": "https://www.nytimes.com/2025/10/15/world/americas/los-angeles-emergency-immigration-raids.html",
    "summary": "The move would allow county officials to provide financial aid to those affected by Immigration and Customs Enforcement raids."
  },
  {
    "title": "U.S. Says It Revoked Visas of Some People Who Criticized Charlie Kirk",
    "link": "https://www.nytimes.com/2025/10/15/us/politics/charlie-kirk-state-department-visas.html",
    "summary": "The State Department’s X account listed six examples of people who it said had made comments about the assassination of Mr. Kirk, a right-wing activist, and said it was withdrawing their visas."
  },
  {
    "title": "Julia Roberts and Luca Guadagnino on ‘After the Hunt’ and Ambiguity",
    "link": "https://www.nytimes.com/2025/10/15/movies/julia-roberts-luca-guadagnino-after-the-hunt.html",
    "summary": "The film touches on #MeToo and cancel culture, but the star and director wanted audiences to make up their own minds."
  },
  {
    "title": "With Truce in Place, Hamas Pursues Bloody Crackdown on Rivals in Gaza",
    "link": "https://www.nytimes.com/2025/10/15/world/middleeast/hamas-crackdown-rivals-gaza.html",
    "summary": "A video this week captured Hamas fighters in Gaza executing Palestinian rivals as the militant group tries to assert that it is still the dominant force in the territory after two years of war with Israel."
  },
  {
    "title": "First Burials to Be Held for Israelis Returned From Gaza",
    "link": "https://www.nytimes.com/2025/10/15/world/middleeast/israel-hostages-hamas-returned-gaza-funerals.html",
    "summary": "Hamas has handed over the bodies of eight people, but says it is struggling to find the remains of others in Gaza after two years of war."
  },
  {
    "title": "Spies, Burgers and Bombs: After a New War, Old Wounds Resurface in Tehran",
    "link": "https://www.nytimes.com/2025/10/15/world/middleeast/iran-tehran-united-states.html",
    "summary": "A deep sense of unease has gripped Iran since American and Israeli airstrikes in June, but on a recent visit to the capital, we found that many Iranians seemed to be just trying to get by."
  },
  {
    "title": "How the UK’s Hurricane-Strength Storm of 1987 Became a Famous Weather Forecasting Failure",
    "link": "https://www.nytimes.com/2025/10/15/weather/uk-great-storm-1987-forecast.html",
    "summary": "The Great Storm of 1987 was a forecasting blunder that left at least 18 people dead, felled 15 million trees and caused a billion pounds’ worth of damage."
  },
  {
    "title": "With Tariff Threat and Trade Controls, China and U.S. Renew Game of Chicken",
    "link": "https://www.nytimes.com/2025/10/15/world/asia/china-trump-tariffs.html",
    "summary": "Xi Jinping’s need to project strength before a crucial meeting of Communist Party leaders may help explain why Beijing announced new rare earth controls."
  },
  {
    "title": "America Is Heavily Reliant on China for Raw Materials in Medicines",
    "link": "https://www.nytimes.com/2025/10/15/health/us-drugs-china-production.html",
    "summary": "A new analysis found that nearly 700 drugs approved for use in the United States depend on chemicals solely produced in China."
  },
  {
    "title": "U.S. to Take Control of More Companies as China’s Rare Earth Dominance Grows",
    "link": "https://www.nytimes.com/2025/10/15/us/politics/us-government-companies-china.html",
    "summary": "Treasury Secretary Scott Bessent said China’s dominance of rare earths calls for a more assertive American industrial policy."
  },
  {
    "title": "Delaware’s Highest Court Considers Elon Musk’s Tesla Pay Plan",
    "link": "https://www.nytimes.com/2025/10/15/business/elon-musk-delaware-pay-package.html",
    "summary": "The justices on the State Supreme Court heard arguments in a long dispute about whether the Tesla chief executive’s compensation was fair to shareholders."
  },
  {
    "title": "Putin Welcomes Syria’s New President in Moscow, While Still Harboring al-Assad",
    "link": "https://www.nytimes.com/2025/10/15/world/europe/russia-syria-putin-al-shara-moscow-visit-assad.html",
    "summary": "The meeting in Moscow between President Vladimir V. Putin of Russia and President Ahmed al-Shara of Syria showcased the adaptability of two leaders once at odds."
  },
  {
    "title": "Syria’s New Leaders Are Talking to Russia, a Former Enemy",
    "link": "https://www.nytimes.com/2025/10/15/world/middleeast/syria-russia-ahmed-al-shara-putin.html",
    "summary": "President Ahmed al-Shara is making his first trip to Moscow, which backed the regime his rebels overthrew. Both sides have reasons to put the past aside."
  },
  {
    "title": "Is Manresa Wilds the Future of Public Parks?",
    "link": "https://www.nytimes.com/2025/10/15/arts/design/manresa-wilds-connecticut-power-station.html",
    "summary": "A shuttered plant is reimagined as Manresa Wilds, an example of an old facility repurposed to solve a new century’s problems."
  },
  {
    "title": "How D’Angelo Made His Masterpiece, ‘Voodoo’",
    "link": "https://www.nytimes.com/2025/10/15/arts/music/dangelo-voodoo.html",
    "summary": "The singer, songwriter and producer’s 2000 album was the result of years in the studio listening to inspiring music, jamming and rediscovering his artistic purpose."
  },
  {
    "title": "40 Years After ‘The Goonies,’ Fans Still Flock to Astoria, Oregon",
    "link": "https://www.nytimes.com/2025/10/15/travel/goonies-astoria-oregon.html",
    "summary": "Astoria, Ore., the setting of the classic 1985 teen movie, invites fans to follow their inner adventurer and explore a scenic corner of the Northwest."
  },
  {
    "title": "A Lesson From the German Resistance That Applies Today",
    "link": "https://www.nytimes.com/2025/10/15/opinion/defiance-nazi-germany.html",
    "summary": "The best safeguard against tyranny is a legion of people who believe in an authority higher than any political program."
  },
  {
    "title": "Stephen Colbert Ridicules Trump’s Time Magazine Cover",
    "link": "https://www.nytimes.com/2025/10/15/arts/television/stephen-colbert-trump-time-magazine.html",
    "summary": "“The Late Show” host called President Trump’s photo the “worst Georgia O’Keeffe ever.”"
  },
  {
    "title": "G.O.P. Officials Condemn Racist and Homophobic Texts From Young Republicans Members",
    "link": "https://www.nytimes.com/2025/10/15/us/politics/young-republicans-texts-backlash-racist-homophobic.html",
    "summary": "Some G.O.P. officials who participated in a monthslong online chat are losing their jobs or being pressured to resign."
  },
  {
    "title": "Florida Grand Jury Hears Evidence in Investigation of Charity Tied to Casey DeSantis",
    "link": "https://www.nytimes.com/2025/10/15/us/florida-charity-casey-desantis.html",
    "summary": "The inquiry is focused on $10 million that the charity received last year, then gave to political committees that helped Gov. Ron DeSantis defeat a ballot measure."
  },
  {
    "title": "Afghanistan and Pakistan Announce Cease-Fire After a Week of Deadly Clashes",
    "link": "https://www.nytimes.com/2025/10/15/world/asia/clashes-afghanistan-pakistan.html",
    "summary": "The cease-fire went into effect on Wednesday, hours after 12 Afghan people died and 100 others were injured in fighting along the two countries’ border."
  },
  {
    "title": "Nassau Police Charge Man With Raping and Killing Teenager in 1984",
    "link": "https://www.nytimes.com/2025/10/15/nyregion/nassau-cold-case-charges-theresa-fusco.html",
    "summary": "Theresa Fusco was left in the woods near the roller rink where she had worked. “I loved her and I miss her,” her father said. “She lives in my heart.”"
  }
]