[
  {
    "title": "With Trump in Power, Democrats Try to Redefine Themselves as Disrupters",
    "link": "https://www.nytimes.com/2025/12/25/us/politics/trump-democrats-washington-midterm-elections.html",
    "summary": "Since President Trump’s rise, Democrats have served as defenders of a political system many Americans believe is broken. Now the party is trying a new approach."
  },
  {
    "title": "Trump Says ‘Housing First’ Failed the Homeless. Here’s What the Evidence Says.",
    "link": "https://www.nytimes.com/2025/12/25/us/trump-housing-first.html",
    "summary": "The Trump administration has sought to move away from the model, which supporters call “evidence based” but opponents consider overly permissive."
  },
  {
    "title": "Kennedy Center’s Christmas Eve Jazz Show Canceled After Trump Name Added to Building",
    "link": "https://www.nytimes.com/2025/12/24/us/kennedy-center-christmas-eve-concert-trump.html",
    "summary": "Chuck Redd, a jazz musician, said he canceled his annual concert after President Trump’s name was affixed to the Washington building’s facade."
  },
  {
    "title": "Republicans Who Backed Afghan Visas Are Mum as Trump Halts Them",
    "link": "https://www.nytimes.com/2025/12/25/us/politics/republicans-afghan-visas.html",
    "summary": "After a fatal shooting, the Trump administration froze a visa program for Afghans that Republicans in Congress had championed. The G.O.P. has not objected."
  },
  {
    "title": "Man Shot in ICE Confrontation in Maryland, Officials Say",
    "link": "https://www.nytimes.com/2025/12/24/us/immigrant-shot-maryland-ice.html",
    "summary": "Federal and local officials said the man, an immigrant from Portugal, tried to flee and harm agents. He and another man were hospitalized after a vehicle they were in crashed."
  },
  {
    "title": "Why Russia Is Likely to Reject the New US-Ukrainian Peace Plan",
    "link": "https://www.nytimes.com/2025/12/25/world/europe/russia-ukraine-peace-plan.html",
    "summary": "The first draft essentially called for Ukraine’s surrender. The revised version includes the security guarantees Kyiv wants to prevent future Russian aggression."
  },
  {
    "title": "‘Carol of the Bells’ Once Filled the Air Here. Now It’s Only Bombs.",
    "link": "https://www.nytimes.com/2025/12/25/world/europe/ukraine-carol-of-the-bells-pokrovsk.html",
    "summary": "Mykola Leontovych, the Ukrainian composer of the famed festive song, lived in the eastern city of Pokrovsk. Months of Russian assaults have erased most tributes to his life there."
  },
  {
    "title": "A Million More Epstein Documents Have Been Found, Justice Dept. Says",
    "link": "https://www.nytimes.com/2025/12/24/us/politics/epstein-files-documents-doj.html",
    "summary": "Democratic lawmakers, who had criticized the Justice Department’s release of the material, accused the Trump administration of violating the law mandating the release of the files."
  },
  {
    "title": "K-Pop in 2025: What ‘KPop Demon Hunters’ and NewJeans Tell Us About the Genre",
    "link": "https://www.nytimes.com/2025/12/25/arts/music/k-pop-newjeans-katseye-kpop-demon-hunters.html",
    "summary": "The genre peaked in terms of global awareness with “KPop Demon Hunters,” while the industry’s most promising new act was mired in a legal morass."
  },
  {
    "title": "Heavy Rains and Floods Threaten California on Christmas Day",
    "link": "https://www.nytimes.com/2025/12/25/weather/rain-flooding-los-angeles-storm.html",
    "summary": "Much of Southern California remained at risk of potentially deadly floods on Thursday, as heavy rains showed little sign of easing through the week."
  },
  {
    "title": "They Were Supposed to Protect Young Workers. Instead, They Cashed In.",
    "link": "https://www.nytimes.com/2025/12/25/nyregion/j1-visa-sponsors-profits-abuse.html",
    "summary": "Profit-seekers co-opted America’s premier cultural exchange program, the J-1 visa, which brought young people to work in the United States. Some sponsors charged thousands in fees."
  },
  {
    "title": "After Suffering in Israeli Prison, a Gaza Detainee Comes Home to More Pain",
    "link": "https://www.nytimes.com/2025/12/25/world/middleeast/gaza-detainee-family-killed.html",
    "summary": "Haitham Salem spent 11 months held by Israel without charge and said he endured beatings and abuse. He was released as part of the cease-fire deal, longing to return to his family."
  },
  {
    "title": "Tesla Robotaxis Are Big on Wall St. but Lagging on Roads",
    "link": "https://www.nytimes.com/2025/12/25/business/tesla-robotaxis-austin-waymo.html",
    "summary": "Shares of Tesla have hit new highs on optimism about the company’s self-driving taxis. But experts say Tesla is far behind Waymo, which has a big head start."
  },
  {
    "title": "With Airspace Closed, a Lonely Christmas for Many Venezuelans",
    "link": "https://www.nytimes.com/2025/12/25/world/americas/venezuela-christmas-closed-airspace.html",
    "summary": "The holidays usually bring home huge numbers from the Venezuelan diaspora. But this year, after international airlines halted almost all service, many people are spending Christmas alone and on edge."
  },
  {
    "title": "Coquito Was Once a Puerto Rican Secret. Now Everybody Knows.",
    "link": "https://www.nytimes.com/2025/12/24/nyregion/coquito-puerto-rico-nyc.html",
    "summary": "The Puerto Rican rum and coconut drink used to be passed down within families, but now it has become a holiday party staple beyond the community."
  },
  {
    "title": "After a Plane Crashed in the Texas Fog, 2 Stories of Rescue",
    "link": "https://www.nytimes.com/2025/12/24/us/galveston-plane-crash-rescue-mexico-navy.html",
    "summary": "A plane from Mexico was on a medical mission on Monday when it crashed into Galveston Bay, and two men on the water that day helped save two lives."
  },
  {
    "title": "Will Zohran Mamdani Be the 111th or the 112th Mayor of New York? It Depends.",
    "link": "https://www.nytimes.com/2025/12/25/nyregion/will-mamdani-be-the-111th-or-the-112th-mayor-of-new-york-it-depends.html",
    "summary": "An arcane numbering system and the misplacement of an official record have caused confusion on where Zohran Mamdani falls in history."
  },
  {
    "title": "He Was Locked Up in a Psych Ward. It Helped Him Get His Life Together.",
    "link": "https://www.nytimes.com/2025/12/24/nyregion/nyc-homeless-mentally-ill-treatment.html",
    "summary": "Lamar Brown went through a rigorous program at a New York State psychiatric hospital aimed at stopping the “revolving door” for homeless people with mental illness."
  },
  {
    "title": "‘Marty Supreme’ Review: Timothée Chalamet Sprints to the Top",
    "link": "https://www.nytimes.com/2025/12/24/movies/marty-supreme-review-timothee-chalamet.html",
    "summary": "The actor stars as a magnetic, striving table-tennis champ in Josh Safdie’s new movie, one of the most exciting movies of the year."
  },
  {
    "title": "The Ping-Pong Hustler Who Inspired ‘Marty Supreme’",
    "link": "https://www.nytimes.com/2025/12/24/movies/real-marty-supreme-timothee-chalamet.html",
    "summary": "Volleying questions with the table tennis champ Marty Reisman, an inspiration for Timothée Chalamet’s new film, showed that he was a character in his own right."
  },
  {
    "title": "Christmas Dinner Can Feel Endless. Embrace It.",
    "link": "https://www.nytimes.com/2025/12/25/opinion/holiday-dinner-endless.html",
    "summary": "A long-neglected one-act from a theatrical master offers the key to enjoying your family gatherings."
  },
  {
    "title": "Martin Scorsese: Rob Reiner Had Me in the Palm of His Hand",
    "link": "https://www.nytimes.com/2025/12/25/opinion/culture/martin-scorsese-rob-reiner.html",
    "summary": "“We had a natural affinity for each other,” Martin Scorsese writes of Rob Reiner."
  },
  {
    "title": "Your Picks",
    "link": "https://www.nytimes.com/2025/12/25/briefing/your-picks.html",
    "summary": "We revisit the most-read stories of 2025."
  },
  {
    "title": "Winner in Arkansas Takes $1.817 Billion Powerball Jackpot",
    "link": "https://www.nytimes.com/2025/12/25/us/powerball-jackpot-win-ticket-arkansas.html",
    "summary": "A single ticket drawn Wednesday night won the second-largest U.S. lottery jackpot ever."
  },
  {
    "title": "Pope Leo Surprises St. Peter’s Crowd Before Christmas Eve Mass",
    "link": "https://www.nytimes.com/2025/12/25/world/europe/pope-leo-surprises-st-peters-crowd-before-christmas-eve-mass.html",
    "summary": "Pope Leo XIV greeted the soggy faithful in St. Peter’s Square in both English and Italian and apologized that there wasn’t enough room in the basilica for them all."
  },
  {
    "title": "​North Korea Unveils the Completed Hull of What It Calls a Nuclear Submarine",
    "link": "https://www.nytimes.com/2025/12/25/world/asia/north-korea-nuclear-submarine.html",
    "summary": "The debut followed the North’s first test of a new surface-to-air missile and the arrival of a U.S. nuclear-powered attack sub for a port call in South Korea."
  },
  {
    "title": "Why China, a One-Party State, Is Backing Elections in This Country",
    "link": "https://www.nytimes.com/2025/12/25/world/asia/china-myanmar-election.html",
    "summary": "The vote in Myanmar, widely seen as a sham, is a bid for legitimacy by the military government. It is also a way for Beijing to exert its influence there."
  }
]