[
  {
    "title": "Trump Shares Photo of Captured Nicolás Maduro, Blindfolded and Handcuffed",
    "link": "https://www.nytimes.com/2026/01/03/world/americas/maduro-photo-trump.html",
    "summary": "The Venezuelan president and his wife were flown out of Caracas by helicopter to the U.S.S. Iwo Jima, a warship taking them to New York."
  },
  {
    "title": "Inside ‘Operation Absolute Resolve,’ the U.S. Effort to Capture Maduro",
    "link": "https://www.nytimes.com/2026/01/03/us/politics/trump-capture-maduro-venezuela.html",
    "summary": "The tactically precise operation successfully extracted Mr. Maduro with no loss of American life, a result heralded by President Trump amid larger questions about the legality and rationale for the U.S. actions in Venezuela."
  },
  {
    "title": "The Trump Administration Approved a Big Lithium Mine. A Top Official’s Husband Profited.",
    "link": "https://www.nytimes.com/2026/01/03/climate/lithium-mine-interior-karen-budd-falen-water-contract.html",
    "summary": "Karen Budd-Falen, the No. 3 at the Interior Department, didn’t disclose a $3.5 million water-rights contract between her husband and the developers of a Nevada mine, records show."
  },
  {
    "title": "Why Haven’t Trump’s Tariffs Had a Bigger Impact?",
    "link": "https://www.nytimes.com/2026/01/03/business/economy/trump-tariffs-prices-impact.html",
    "summary": "Steep import taxes have raised prices and affected U.S. businesses, but not quite as much as expected. A new report offers some reasons."
  },
  {
    "title": "Mamdani Acts on Vow to Protect Renters With Move Against a Big Landlord",
    "link": "https://www.nytimes.com/2026/01/03/nyregion/mamdani-pinnacle-housing.html",
    "summary": "Mayor Zohran Mamdani said New York City would intervene in the Pinnacle Group’s bankruptcy case. Tenants have long complained about living conditions in the company’s properties."
  },
  {
    "title": "On a Brooklyn Boulevard, Mamdani Revives a Project Hampered by Scandal",
    "link": "https://www.nytimes.com/2026/01/03/nyregion/mamdani-mcguinness-boulevard-bike-lanes.html",
    "summary": "The bike-lane project, a source of corruption charges during the Adams administration, will be finished as planned in Greenpoint, Mayor Zohran Mamdani said."
  },
  {
    "title": "An ‘Avoidable Tragedy’: The Hazards That Led to the Swiss Fire Disaster",
    "link": "https://www.nytimes.com/2026/01/03/world/europe/switzerland-fire-avoidable-hazards.html",
    "summary": "The fire that killed at least 40 people in a Swiss bar on New Year’s Day was made more likely by apparent flaws in the site’s design and management, experts say."
  },
  {
    "title": "Managers of Swiss Bar Are Suspected of Negligence in Deadly Fire, Police Say",
    "link": "https://www.nytimes.com/2026/01/03/world/europe/swiss-fire-bar-managers-charged.html",
    "summary": "The Swiss authorities say small fireworks on beverage bottles probably ignited foam insulation on the bar’s basement ceiling, setting off the broader blaze."
  },
  {
    "title": "Bryan Kohberger’s Family Stayed Silent for Years. Until Now.",
    "link": "https://www.nytimes.com/2026/01/03/us/idaho-murders-bryan-kohberger-family.html",
    "summary": "Since the arrest of Bryan Kohberger in the murder of four college students, a case that captivated the nation, his family has stayed silent. His sister now describes their pain and confusion."
  },
  {
    "title": "Angie Katsanevas Went From Real Housewives Outsider to the Center Snowflake",
    "link": "https://www.nytimes.com/2026/01/03/style/angie-katsanevas-real-housewives-salt-lake-city.html",
    "summary": "Angie Katsanevas has carved her own path through life, and her deadly quips on “The Real Housewives of Salt Lake City” have made her a breakout star."
  },
  {
    "title": "Trump’s Attack on Venezuela Is Illegal and Unwise",
    "link": "https://www.nytimes.com/2026/01/03/opinion/venezuela-attack-trump-us.html",
    "summary": "We know that Mr. Trump’s warmongering violates the law."
  },
  {
    "title": "To Trump, on Venezuela: You Break It, You Own It",
    "link": "https://www.nytimes.com/2026/01/03/opinion/venezuela-trump.html",
    "summary": "His administration just decapitated the country’s leadership; he’s now responsible for what comes next there."
  },
  {
    "title": "Why Security Guarantees Are So Crucial, and Thorny, for Ukraine",
    "link": "https://www.nytimes.com/2026/01/03/world/europe/ukraine-russia-trump-peace-security-guarantees.html",
    "summary": "While Kyiv has reported progress in negotiations, and is accelerating talks in the coming days, major questions remain unresolved about which countries will provide what kind of security for how long."
  },
  {
    "title": "Hannah Dugan, Wisconsin Judge Convicted of Obstructing Immigration Agents, Resigns",
    "link": "https://www.nytimes.com/2026/01/03/us/hannah-dugan-wisconsin-judge-resigns.html",
    "summary": "Hannah C. Dugan, a state court judge, was convicted by a jury in federal court. Wisconsin lawmakers called on her to resign from the bench."
  },
  {
    "title": "Richard Pollak, 91, Dies; Edited Magazine That Criticized the Media",
    "link": "https://www.nytimes.com/2026/01/02/business/media/richard-pollak-dead.html",
    "summary": "He was a founder of More, which skewered the foibles of the press in the 1970s, and later wrote a critical biography of the psychoanalyst Bruno Bettelheim."
  },
  {
    "title": "Whales Are in Danger in N.Y. Waterways: ‘Like Deer Crossing the Road’",
    "link": "https://www.nytimes.com/2026/01/03/nyregion/new-york-whales-threat-waterways.html",
    "summary": "As conservation efforts make the waters in the New York region more inviting for whales, increasing traffic from ships and boats has contributed to a climbing number of strandings."
  }
]