[
  {
    "title": "CDC Standoff: RFK Jr.’s Push to Fire Director Devolves Into Chaos",
    "link": "https://www.nytimes.com/2025/08/28/health/rfk-jr-susan-monarez-cdc-vaccines.html",
    "summary": "Lawyers for the agency’s chief, Susan Monarez, insist that the impasse with Health Secretary Robert F. Kennedy Jr. can only be resolved by President Trump."
  },
  {
    "title": "Steven Cook, a Former Chemical Industry Lawyer, Now at E.P.A., Wants to Change PFAS Rules",
    "link": "https://www.nytimes.com/2025/08/28/climate/steven-cook-epa-pfas-forever-chemicals.html",
    "summary": "A Trump appointee has proposed rewriting a measure that requires companies to clean up “forever chemicals,” documents show. The new version would shift costs from polluters."
  },
  {
    "title": "Trump’s Fed Feud Spotlights Mortgage Data Privacy: Is Your Information Public?",
    "link": "https://www.nytimes.com/2025/08/28/business/mortgage-data-privacy-lisa-cook-trump.html",
    "summary": "After President Trump accused a Federal Reserve governor of mortgage fraud, everyday citizens are waking up to just how much information is out there."
  },
  {
    "title": "Survivors of Minneapolis Catholic School Shooting Face Long Road Ahead",
    "link": "https://www.nytimes.com/2025/08/28/us/minneapolis-school-shooting-victims-survivors-injuries.html",
    "summary": "Children who survive school shootings deal with a host of complex feelings, ranging from anxiety and grief to guilt and shame."
  },
  {
    "title": "What We Know About the Minneapolis Catholic School Shooting",
    "link": "https://www.nytimes.com/2025/08/27/us/minneapolis-school-shooting-minnesota.html",
    "summary": "The attack on a back-to-school Mass at Annunciation Catholic Church killed 2 children and injured 17 others. Investigators are searching the shooter’s writings and videos for a motive."
  },
  {
    "title": "2 Weeks After Trump Talks, Russia Bombards Kyiv, Killing at Least 18",
    "link": "https://www.nytimes.com/2025/08/28/world/europe/ukraine-russia-strikes.html",
    "summary": "The strikes, which hit a five-story apartment building, a shopping mall and buildings used by European governments, were the largest on the Ukrainian capital since the Alaska summit."
  },
  {
    "title": "Russian Drones Are Flying Over U.S. Weapons Routes in Germany, Officials Say",
    "link": "https://www.nytimes.com/2025/08/28/us/politics/russian-drones-weapons-routes.html",
    "summary": "U.S. and European military officials are increasingly concerned about the flights, even as Russian acts of sabotage have declined."
  },
  {
    "title": "Medicare Will Require Prior Approval for Certain Procedures",
    "link": "https://www.nytimes.com/2025/08/28/health/medicare-prior-approval-health-care.html",
    "summary": "A pilot program in six states will use a tactic employed by private insurers that has been heavily criticized for delaying and denying medical care."
  },
  {
    "title": "Are A.I. Tools Making Doctors Worse at Their Jobs?",
    "link": "https://www.nytimes.com/2025/08/28/well/ai-making-doctors-worse-deskilling.html",
    "summary": "Physicians are using the technology for diagnoses and more — but may be losing skills in the process."
  },
  {
    "title": "Their Beach Home in the Hamptons Is a Driveway",
    "link": "https://www.nytimes.com/2025/08/28/style/hamptons-long-island-beach-home-driveway.html",
    "summary": "Tucked among exclusive real estate, a family’s 18-foot-wide strip of land is not just an oceanside parking spot. It’s their legacy."
  },
  {
    "title": "Israel’s Exhausted Soldiers Complicate Plans for Gaza Assault",
    "link": "https://www.nytimes.com/2025/08/28/world/middleeast/israels-exhausted-reservists-gaza.html",
    "summary": "Worn down by hundreds of days of military service, fewer Israeli reservists are turning up for duty. Others are refusing to fight in a war they no longer believe in."
  },
  {
    "title": "A Gaza City Neighborhood Is Now a Wasteland, Satellite Images Show",
    "link": "https://www.nytimes.com/2025/08/28/world/middleeast/gaza-city-zeitoun-destruction.html",
    "summary": "With Israel’s expanded assault looming, Zeitoun already resembles other parts of Gaza that have been largely flattened in the war."
  },
  {
    "title": "European Nations Move to Restart Iran Sanctions Over Nuclear Program",
    "link": "https://www.nytimes.com/2025/08/28/world/middleeast/iran-nuclear-europe-sanctions.html",
    "summary": "Britain, France and Germany said the country had violated the terms of a 2015 nuclear deal. Iran’s foreign minister called their action “illegal.”"
  },
  {
    "title": "Israeli Airstrikes Kill Soldiers in Syria, Officials There Say",
    "link": "https://www.nytimes.com/2025/08/28/world/middleeast/israel-syria-attack-damascus.html",
    "summary": "The strikes near the capital, Damascus, were the latest Israeli military intervention in the country since a new government came to power."
  },
  {
    "title": "U.S. Government Cracks Down on Organ Transplant System",
    "link": "https://www.nytimes.com/2025/08/28/us/federal-crackdown-organ-donations.html",
    "summary": "Organ donation groups accused of safety lapses are facing multiple investigations, and new policies are underway to protect patients."
  },
  {
    "title": "A Push for More Organ Transplants Is Putting Donors at Risk",
    "link": "https://www.nytimes.com/2025/07/20/us/organ-transplants-donors-alive.html",
    "summary": "People across the United States have endured rushed or premature attempts to remove their organs. Some were gasping, crying or showing other signs of life."
  },
  {
    "title": "Nothing Could Topple the ‘Queen of Heels.’ Then Trump Came Along.",
    "link": "https://www.nytimes.com/2025/08/28/us/politics/tariffs-luxury-shoes-brazil-trump.html",
    "summary": "The president’s steep tariffs and erratic moves have turned manufacturing abroad into a minefield, even for entrepreneurs who set up in countries viewed as safe alternatives to China."
  },
  {
    "title": "‘Deliver Me From Nowhere’ Isn’t the Bruce Springsteen Biopic We Expected",
    "link": "https://www.nytimes.com/2025/08/28/movies/bruce-springsteen-biopic-jeremy-allen-white.html",
    "summary": "Jeremy Allen White and Jeremy Strong, the stars of “Springsteen: Deliver Me From Nowhere,” and the director Scott Cooper on capturing a haunted rock icon."
  },
  {
    "title": "‘The Wizard of Oz’ Is Getting an A.I. Glow Up.",
    "link": "https://www.nytimes.com/2025/08/28/business/media/sphere-wizard-of-oz-ai.html",
    "summary": "The classic film was “enhanced” using A.I. tools so that it could be an immersive experience at the Sphere in Las Vegas."
  },
  {
    "title": "Trump Raises the Stakes",
    "link": "https://www.nytimes.com/2025/08/28/opinion/trump-justice-bolton-cook.html",
    "summary": "The president has raised the stakes."
  },
  {
    "title": "Disney World Is the Happiest Place on Earth, if You Can Afford It",
    "link": "https://www.nytimes.com/2025/08/28/opinion/disney-world-economy-middle-class-rich.html",
    "summary": "The theme-park operator, like so many other companies, is abandoning America’s middle class."
  },
  {
    "title": "A Shooting in Minnesota",
    "link": "https://www.nytimes.com/2025/08/28/briefing/shooting-minneapolis.html",
    "summary": "We have the latest on the attack on Annunciation Catholic Church."
  },
  {
    "title": "Atlanta Journal-Constitution to Quit Print Cold Turkey",
    "link": "https://www.nytimes.com/2025/08/28/business/media/atlanta-journal-constitution-print-edition.html",
    "summary": "The publication says the time is right to pour all of its resources into its online news operation and get its journalism “in front of the most people.”"
  },
  {
    "title": "Sharpton, Mamdani and Hundreds More Gather in Lower Manhattan for ‘March on Wall Street’",
    "link": "https://www.nytimes.com/2025/08/28/nyregion/sharpton-wall-street-march-trump-dei.html",
    "summary": "The marchers, led by the Rev. Al Sharpton, protested President Trump’s crackdown on diversity, equity and inclusion policies. Zohran Mamdani, the Democratic candidate for mayor, made an appearance."
  },
  {
    "title": "Homeland Security’s Embrace of Art Reopens an Old Debate",
    "link": "https://www.nytimes.com/2025/08/28/arts/design/gast-dhs-american-progress.html",
    "summary": "Showcasing “American Progress,” John Gast’s tableau of Manifest Destiny, is of a piece with the administration’s desire for a more traditional view of American history."
  },
  {
    "title": "E. Jean Carroll Is Telling Her Story in a Documentary. Will It Find a Buyer?",
    "link": "https://www.nytimes.com/2025/08/28/movies/e-jean-carroll-documentary.html",
    "summary": "The film, from Ivy Meeropol, will play Telluride. But as distributors pull back from nonfiction titles, especially political ones, a release isn’t certain."
  }
]