[
  {
    "title": "What if Democrats’ Big Shutdown Loss Turns Out to Be a Win?",
    "link": "https://www.nytimes.com/2025/11/11/us/politics/democrats-shutdown.html",
    "summary": "Despite considerable hand-wringing in the party about caving to Republicans in the government closure, some Democrats see potential upsides in the outcome."
  },
  {
    "title": "As Shutdown Nears End, Trump Still Confronts Soaring Health Costs",
    "link": "https://www.nytimes.com/2025/11/11/us/politics/trump-shutdown-health-care-costs-aca.html",
    "summary": "The central issue of the government closure remains unresolved, leaving Republicans under political pressure ahead of the midterms."
  },
  {
    "title": "Duffy Won’t Give Timeline to Restore Flights as Shutdown Appears Near End",
    "link": "https://www.nytimes.com/2025/11/11/us/flights-canceled-shutdown.html",
    "summary": "The transportation secretary said data would guide the decision. He also stepped up his warnings of potential chaos, saying some airlines could ground their fleets if the shutdown continued."
  },
  {
    "title": "Johnson to Seat Grijalva, Seven Weeks After She Was Elected",
    "link": "https://www.nytimes.com/2025/11/11/us/politics/adelita-grijalva-swearing-in-congress.html",
    "summary": "Speaker Mike Johnson had refused to swear in Representative-elect Adelita Grijalva, a Democrat of Arizona, claiming he lacked the power to do so."
  },
  {
    "title": "Xi’s Military Purges Show Unease About China’s Nuclear Forces",
    "link": "https://www.nytimes.com/2025/11/12/world/asia/xi-trump-military-purges.html",
    "summary": "The shake-up in China’s armed forces comes as both Beijing and Washington are pushing through major changes in their country’s militaries, in different ways."
  },
  {
    "title": "Newsom in the Spotlight at the Climate Conference That Trump Decided to Skip",
    "link": "https://www.nytimes.com/2025/11/11/climate/gavin-newsom-cop30-belem-climate.html",
    "summary": "The California governor painted the president as a threat to American competitiveness by letting China dominate the renewable energy industry."
  },
  {
    "title": "There’s a New Forecast for Peak Oil Demand. It’s Increasingly Cloudy.",
    "link": "https://www.nytimes.com/2025/11/12/climate/iea-fossil-fuel-forecast.html",
    "summary": "The International Energy Agency once projected that oil and gas demand could level off by 2030. Now it’s backing off, sort of."
  },
  {
    "title": "Senator Criticizes Rubio for Paying $7.5 Million to Equatorial Guinea to Take Deportees",
    "link": "https://www.nytimes.com/2025/11/11/us/politics/marco-rubio-equatorial-guinea.html",
    "summary": "Senator Jeanne Shaheen, Democrat of New Hampshire, said the African country has a long history of corruption. The amount paid is far more than recent annual assistance given to it."
  },
  {
    "title": "States That Rely on the Colorado River Miss Deadline to Agree on Cuts",
    "link": "https://www.nytimes.com/2025/11/11/climate/states-that-rely-on-the-colorado-river-miss-deadline-to-agree-on-cuts.html",
    "summary": "A plan to sustainably manage the shrinking waterway could soon be up to the Trump administration — or eventually the Supreme Court."
  },
  {
    "title": "Jack Schlossberg, Social Media Provocateur, Gives Politics a Try",
    "link": "https://www.nytimes.com/2025/11/11/style/jack-schlossberg-social-media-provocateur-gives-politics-a-try.html",
    "summary": "As he prepares a Congressional run, J.F.K.’s grandson admits, “I’m not for everybody.”"
  },
  {
    "title": "Jack Schlossberg, Kennedy Heir, to Seek Nadler’s N.Y. Congressional Seat",
    "link": "https://www.nytimes.com/2025/11/11/nyregion/jack-schlossberg-congress-run.html",
    "summary": "Mr. Schlossberg, the son of Caroline Kennedy, said the Democratic Party needed someone who could stand up to President Trump and his allies."
  },
  {
    "title": "Why Factories Will Keep Looking for Alternatives to China",
    "link": "https://www.nytimes.com/2025/11/12/business/trump-tariffs-china-vietnam.html",
    "summary": "A trade truce between the United States and China has calmed nerves, but it won’t stop the broader movement of companies to countries like Vietnam."
  },
  {
    "title": "What It Takes to Move a Factory From China to Vietnam",
    "link": "https://www.nytimes.com/video/world/asia/100000010493279/china-vietnam-factory-manufacturing.html",
    "summary": "Tariffs have forced Chinese companies to move their operations to Vietnam. Alexandra Stevenson, our Shanghai bureau chief, visits a factory in Ho Chi Minh City to see how one of the biggest challenges isn’t relocating machinery and tools, but overcoming language barriers."
  },
  {
    "title": "Halt in Fees on Chinese Vessels Endangers U.S. Shipbuilding Efforts",
    "link": "https://www.nytimes.com/2025/11/11/business/commercial-shipbuilding-us-china.html",
    "summary": "The two countries agreed to suspend the fees for a year as part of their recent trade pact, but America still aims to build more commercial ships."
  },
  {
    "title": "Archbishop Paul Coakley Is Picked to Lead American Bishops",
    "link": "https://www.nytimes.com/2025/11/11/us/bishops-coakley-immigration.html",
    "summary": "“We face a growing worldview that is so often at odds with the Gospel mandate to love thy neighbor,” the group said in a letter to Pope Leo."
  },
  {
    "title": "Key Netanyahu Minister Steps Down From Israel’s Government",
    "link": "https://www.nytimes.com/2025/11/11/world/middleeast/israel-ron-dermer-resigns-netanyahu.html",
    "summary": "Ron Dermer, a longtime ally of Prime Minister Benjamin Netanyahu and an influential figure in the Israeli government throughout the war in Gaza, resigned as minister of strategic affairs."
  },
  {
    "title": "Israel Arrests 4 After Jewish Extremist Attack in West Bank",
    "link": "https://www.nytimes.com/2025/11/11/world/middleeast/israel-extremist-attack-west-bank.html",
    "summary": "Dozens of masked Israelis attacked an industrial zone, torching vehicles and wounding Palestinians, according to Palestinian officials."
  },
  {
    "title": "Justice Department to Investigate Protests at Turning Point Event at Berkeley",
    "link": "https://www.nytimes.com/2025/11/11/us/berkeley-protests-turning-point-doj-investigation.html",
    "summary": "The announcement came a day after protesters confronted attendees of a campus event hosted by Turning Point USA, the conservative group founded by Charlie Kirk."
  },
  {
    "title": "Cleto Escobedo III, Jimmy Kimmel’s Bandleader, Dies at 59",
    "link": "https://www.nytimes.com/2025/11/11/arts/cleto-escobedo-dead-jimmy-kimmel-live.html",
    "summary": "Mr. Kimmel said that he and Mr. Escobedo, who led Cleto and the Cletones on “Jimmy Kimmel Live!,” had been “inseparable since I was 9 years old.”"
  },
  {
    "title": "Meet the New Antisemites, Same as the Old Antisemites",
    "link": "https://www.nytimes.com/2025/11/11/opinion/antisemitic-politics-carlson-fuentes.html",
    "summary": "A bigotry for morons will always be political gold in a world of morons."
  },
  {
    "title": "Steve Bannon Thinks Zohran Mamdani Is a Genius. It’s Not a Feint.",
    "link": "https://www.nytimes.com/2025/11/11/opinion/mamdani-election-strategy-democrats.html",
    "summary": "Key elements of the mayor-elect’s campaign have enormous potential for a party that was badly beaten in 2024."
  },
  {
    "title": "Trump Threatened to Sue the BBC for $1 Billion. What Are His Chances?",
    "link": "https://www.nytimes.com/2025/11/11/world/europe/trump-bbc-lawsuit-hurdles.html",
    "summary": "Legal experts say President Trump’s litigation track record offers both hope and warning to the British public broadcaster, which he has threatened with a $1 billion suit."
  },
  {
    "title": "Infant Formula Recall Expands as Botulism Outbreak Grows",
    "link": "https://www.nytimes.com/2025/11/11/health/byheart-infant-formula-recall-botulism.html",
    "summary": "Federal health officials said caregivers should stop using all ByHeart powdered formula products after 15 infants in 12 states were hospitalized."
  },
  {
    "title": "How a New Bridge Partly Collapsed in China’s Southwest",
    "link": "https://www.nytimes.com/2025/11/12/world/asia/china-sichuan-bridge-collapse.html",
    "summary": "A section of the tall bridge in mountainous Sichuan Province fell, apparently after a landslide. No casualties were reported."
  },
  {
    "title": "Kansas County Agrees to Pay $3 Million Over Police Raid of Newspaper",
    "link": "https://www.nytimes.com/2025/11/11/us/marion-county-record-raid-settlement.html",
    "summary": "The search of The Marion County Record’s office in 2023 touched off a national conversation about press freedom."
  }
]