[
  {
    "title": "As Floods Hit, Key Roles Were Vacant at Weather Service Offices in Texas",
    "link": "https://www.nytimes.com/2025/07/05/us/politics/texas-floods-warnings-vacancies.html",
    "summary": "Some experts say staff shortages might have complicated forecasters’ ability to coordinate responses with local emergency management officials."
  },
  {
    "title": "China and Russia Keep Their Distance From Iran During Crisis",
    "link": "https://www.nytimes.com/2025/07/06/us/politics/axis-china-russia-iran-north-korea.html",
    "summary": "Some U.S. officials talked about an “axis” of authoritarian nations, but the American and Israeli war with Iran has exposed the limits of that idea."
  },
  {
    "title": "Netanyahu Heads to Washington as Trump Pushes for Israel-Hamas Cease-Fire",
    "link": "https://www.nytimes.com/2025/07/06/world/middleeast/netanyahu-trump-israel-war-gaza.html",
    "summary": "Prime Minister Benjamin Netanyahu of Israel is set to meet with President Trump on Monday as attention has turned from Iran to a cease-fire for Gaza."
  },
  {
    "title": "Khamenei Appears in Public for First Time Since Israel War Began",
    "link": "https://www.nytimes.com/2025/07/05/world/middleeast/ayatollah-khamenei-iran-israel.html",
    "summary": "The long absence of Iran’s supreme leader, Ayatollah Ali Khamenei, from public life had fueled speculation about his health and threats to his life."
  },
  {
    "title": "North Carolina Braces For Medicaid Cuts Because of Trump’s Bill",
    "link": "https://www.nytimes.com/2025/07/06/us/north-carolina-medicaid-cuts.html",
    "summary": "President Trump’s domestic policy law jeopardizes plans to reopen one rural county’s hospital — and health coverage for hundreds of thousands of state residents."
  },
  {
    "title": "Southwest’s C.E.O. on Why Now Is the Time for Bag Fees and Assigned Seats",
    "link": "https://www.nytimes.com/2025/07/06/business/southwest-bags-seats-bob-jordan.html",
    "summary": "Bob Jordan recently introduced major changes to the way the low-cost airline works, which caused a stir among loyal fliers and left them wondering what sets it apart from competitors."
  },
  {
    "title": "She Wanted to Save the World From A.I. Then the Killings Started.",
    "link": "https://www.nytimes.com/2025/07/06/business/ziz-lasota-zizians-rationalists.html",
    "summary": "At first, Ziz LaSota seemed much like any other philosophically inclined young tech aspirant. Now, she and her followers are in jail, six people are dead, and Rationalists are examining whether their ideas played a role."
  },
  {
    "title": "The Coder ‘Village’ at the Heart of China’s A.I. Frenzy",
    "link": "https://www.nytimes.com/2025/07/06/technology/china-artificial-intelligence-hangzhou.html",
    "summary": "As China vies with Silicon Valley for primacy, Hangzhou, home to DeepSeek and Alibaba, is where its aspiring tech titans mingle and share ideas."
  },
  {
    "title": "Europe’s Dilemma: Build a Military Industry or Keep Relying on the U.S.",
    "link": "https://www.nytimes.com/2025/07/06/world/europe/europe-military-spending.html",
    "summary": "Europeans have agreed to pay more for arms and want to spend it at home. But can its manufacturers rush to compete with dominant U.S. firms?"
  },
  {
    "title": "Caught Between Tariffs and China, Mexico Adapts to an Unpredictable U.S.",
    "link": "https://www.nytimes.com/2025/07/06/world/americas/mexico-trump-tariffs-us-china.html",
    "summary": "Relying on Asian suppliers is no longer a safe bet for many factories in Mexico. Companies are racing to change, and they are being encouraged by the government."
  },
  {
    "title": "The Royal Box: Who’s in Wimbledon’s Most Exclusive Seats?",
    "link": "https://www.nytimes.com/2025/07/05/sports/tennis/wimbledon-royal-box-who.html",
    "summary": "The event’s most coveted seats are available only through invitation, reserved for celebrities and dignitaries. Here’s a look at who’s sitting in them."
  },
  {
    "title": "The Hunt for a 316-Year-Old Stradivarius Stolen in the Fog of War",
    "link": "https://www.nytimes.com/2025/07/06/arts/music/the-hunt-for-a-316-year-old-stradivarius-stolen-in-the-fog-of-war.html",
    "summary": "The violin by the famed Italian luthier was plundered at the end of World War II and presumed lost or destroyed. Now experts say they believe it has resurfaced."
  },
  {
    "title": "Jeff Flake: The Republican Fever Must Break",
    "link": "https://www.nytimes.com/2025/07/06/opinion/trump-tillis-senate-republicans.html",
    "summary": "What Senator Thom Tillis’s retirement says about today’s Republican Party."
  },
  {
    "title": "One of the Worst Industries in the World Gets Its Comeuppance",
    "link": "https://www.nytimes.com/2025/07/06/opinion/scotus-porn-free-speech.html",
    "summary": "Porn platforms just got what they deserved at the Supreme Court."
  },
  {
    "title": "Can Australia Pull Off Barring Children From Social Media?",
    "link": "https://www.nytimes.com/2025/07/06/world/australia/kids-social-media-ban.html",
    "summary": "A law that restricts social media use to people 16 and over goes into effect in December, but much about it remains unclear or undecided."
  },
  {
    "title": "Albert Ojwang Was Killed in Police Custody. Kenyans Are Not About to Let It Go.",
    "link": "https://www.nytimes.com/2025/07/06/world/africa/kenya-africa-albert-ojwang-funeral.html",
    "summary": "At the funeral for Albert Ojwang, protesters in Kenya said his death was a call to action for the country’s youth."
  },
  {
    "title": "Tropical Storm Chantal Makes Landfall in South Carolina",
    "link": "https://www.nytimes.com/2025/07/05/weather/tropical-storm-chantal-south-carolina.html",
    "summary": "Chantal has already started weakening as it moves inland, but forecasters said flash floods and life-threatening rip currents were expected along the coast."
  },
  {
    "title": "What Do Mamdani and the MAGA Movement Have in Common? ‘Hot’ Supporters.",
    "link": "https://www.nytimes.com/2025/07/05/style/hot-voting-politics-mamdani-maga.html",
    "summary": "Political messengers on both sides of the aisle are leaning on the same adjective in an attempt to appeal to young voters."
  }
]