[
  {
    "title": "What We Know About Tyler Robinson, Suspect in Charlie Kirk Shooting",
    "link": "https://www.nytimes.com/2025/09/12/us/tyler-robinson-charlie-kirk-shooting-suspect.html",
    "summary": "The suspect, 22, was arrested in southwestern Utah after a friend had contacted the authorities, officials said."
  },
  {
    "title": "Here’s What Some of the Bullet Casing Engravings in the Charlie Kirk Shooting Mean",
    "link": "https://www.nytimes.com/2025/09/12/us/charlie-kirk-bullet-casings-engravings.html",
    "summary": "Many of the messages adopt the flippant, sarcastic chatter often found on online message boards and in-game chats."
  },
  {
    "title": "As Trump Vows Vengeance, Utah’s Governor Calls to Lower the Temperature",
    "link": "https://www.nytimes.com/2025/09/12/us/trump-tyler-robinson-utah-shooting.html",
    "summary": "“At some point, we have to find an off-ramp, or it’s going to get much, much worse,” Gov. Spencer Cox, a Republican, said of political violence after a suspect was caught in the assassination of Charlie Kirk."
  },
  {
    "title": "Rubio Leads Charge in Trump’s New War in Latin America",
    "link": "https://www.nytimes.com/2025/09/12/us/politics/rubio-trump-drugs-venezuela.html",
    "summary": "The secretary of state is shaping what could be the most consequential military actions of President Trump’s second term."
  },
  {
    "title": "Qatar Prime Minister to Meet Trump Officials After Israeli Strikes in Doha",
    "link": "https://www.nytimes.com/2025/09/12/world/middleeast/qatar-prime-minister-trump-rubio.html",
    "summary": "President Trump is said to be planning a meeting with Sheikh Mohammed bin Abdulrahman al-Thani in New York on Friday, after an attack that has rattled Persian Gulf states."
  },
  {
    "title": "F.D.A. Reviews Reports of Covid Vaccine Deaths",
    "link": "https://www.nytimes.com/2025/09/12/health/fda-covid-vaccines-injuries-deaths.html",
    "summary": "The agency plans to highlight possible links between the shots and accounts of deaths involving children and birth defects to an influential C.D.C. panel meeting next week."
  },
  {
    "title": "Former Judge Sushila Karki Named Nepal’s Leader After Gen Z Protests",
    "link": "https://www.nytimes.com/2025/09/12/world/asia/nepal-protests-leader-karki-gen-z.html",
    "summary": "Sushila Karki, a former chief justice, was the choice of the student protesters whose mass rallies led to violent clashes and toppled the government."
  },
  {
    "title": "Nepal Has a New Leader After Days of Unrest. Here’s What to Know.",
    "link": "https://www.nytimes.com/2025/09/10/world/asia/nepal-gen-z-protests.html",
    "summary": "Supported by Gen Z protest leaders, Sushila Karki is a former chief justice and anti-corruption activist."
  },
  {
    "title": "As the Fed Prepares to Lower Rates, 2 Seats on Its Board Are in Limbo",
    "link": "https://www.nytimes.com/2025/09/12/business/federal-reserve-board-interest-rates.html",
    "summary": "The Senate looks poised to confirm President Trump’s pick to join the central bank in time for the policy meeting next week, while another governor’s fate remains up in the air."
  },
  {
    "title": "Is ‘The Pitt’ Really an ‘ER’ Spinoff? Michael Crichton’s Estate Says It Is.",
    "link": "https://www.nytimes.com/2025/09/12/business/the-pitt-er-michael-crichton-lawsuit.html",
    "summary": "The estate of the best-selling author, which has intellectual property rights to “ER,” and the creators of the new hit TV show are waging a legal battle over whether it’s a stealth reboot."
  },
  {
    "title": "NATO Steps Up Defenses After Russian Drones Violate Polish Airspace",
    "link": "https://www.nytimes.com/2025/09/12/world/europe/nato-eastern-europe-drone-defenses.html",
    "summary": "Increased air patrols, air defense systems and other protections will be mobilized over Eastern Europe."
  },
  {
    "title": "Opposition to Putin Pulls Up European Leaders Dragged Down at Home",
    "link": "https://www.nytimes.com/2025/09/12/world/europe/europe-starmer-macron-merz.html",
    "summary": "The foreign policy successes of Keir Starmer of Britain, Emmanuel Macron of France and Friedrich Merz of Germany are in contrast with their dismal domestic performances."
  },
  {
    "title": "Man Fatally Shot in Confrontation With ICE Officers in Chicago Area",
    "link": "https://www.nytimes.com/2025/09/12/us/ice-shooting-chicago.html",
    "summary": "The shooting took place amid a federal crackdown on illegal immigration in the region that is being called Operation Midway Blitz."
  },
  {
    "title": "Freed South Korean Workers Return From the U.S. to Tearful Cheers",
    "link": "https://www.nytimes.com/2025/09/12/world/asia/korean-workers-georgia-arrest.html",
    "summary": "The workers, whose detention in a workplace immigration sweep set off outrage in South Korea, expressed both relief and anger."
  },
  {
    "title": "Roblox Sued for Wrongful Death After Teenager’s Suicide",
    "link": "https://www.nytimes.com/2025/09/12/technology/roblox-lawsuit-child-safety.html",
    "summary": "At age 7, Ethan Dallas began playing the online game, where he met Nate. Deadly abuse followed, said Ethan’s mother, who blames Roblox."
  },
  {
    "title": "Natalie Massenet and Erik Torstensson’s Messy Split, in Dueling Lawsuits",
    "link": "https://www.nytimes.com/2025/09/12/fashion/natalie-massenet-erik-torstensson-breakup-lawsuits.html",
    "summary": "In the messy, public split of the Net-a-Porter founder Natalie Massenet and Erik Torstensson, no accusations seem off limits."
  },
  {
    "title": "As Los Angeles Olympics Loom, Critics Worry Its Cultural Plan Is Lagging",
    "link": "https://www.nytimes.com/2025/09/11/arts/design/los-angeles-olympics-cultural-plan-lagging.html",
    "summary": "Planning and fund-raising for the “Cultural Olympiad,” the arts programming that is part of the 2028 games, should have been well underway by now, several experts say."
  },
  {
    "title": "In High-Profile Closings, Los Angeles Restaurateurs See Trouble",
    "link": "https://www.nytimes.com/2025/09/11/dining/los-angeles-restaurants-closings.html",
    "summary": "The city’s turmoil, from wildfires to curfews, has exacted a toll on some of its best-loved restaurants and raised worries about the future."
  },
  {
    "title": "A.I.’s Prophet of Doom Wants to Shut It All Down",
    "link": "https://www.nytimes.com/2025/09/12/technology/ai-eliezer-yudkowsky-book.html",
    "summary": "Eliezer Yudkowsky has spent the past 20 years warning A.I. insiders of danger. Now, he’s making his case to the public."
  },
  {
    "title": "Believe in A.I.? Buy Beaten-Down Value Stocks.",
    "link": "https://www.nytimes.com/2025/09/12/business/ai-investing-value-stocks.html",
    "summary": "If artificial intelligence is really revolutionary, its benefits will spread to mundane companies and spawn new fields, Vanguard’s global chief economist says."
  },
  {
    "title": "David Ellison’s Spending at Paramount Has Changed Hollywood’s Mood",
    "link": "https://www.nytimes.com/2025/09/12/business/ellison-paramount-warner-bros.html",
    "summary": "David Ellison has gotten off to a fast start as the owner of Paramount, at least when it comes to buying things."
  },
  {
    "title": "An Annual Blast of Pacific Cold Water Did Not Occur, Alarming Scientists",
    "link": "https://www.nytimes.com/2025/09/12/climate/pacific-cold-water-upwelling.html",
    "summary": "The cold water upwell, which is vital to marine life, did not materialize for the first time on record. Researchers are trying to figure out why."
  },
  {
    "title": "Review: Gustavo Dudamel Gives a Glimpse of New York’s Future",
    "link": "https://www.nytimes.com/2025/09/12/arts/music/review-gustavo-dudamel-new-york-philharmonic-opening-night.html",
    "summary": "The superstar conductor opened the New York Philharmonic’s season, with his signature thrills that make a traditional concert format seem exceptional."
  },
  {
    "title": "A Plea for President Trump With a Fragile Country on Edge",
    "link": "https://www.nytimes.com/2025/09/12/opinion/donald-trump-charlie-kirk-aftermath.html",
    "summary": "Even if it sounds unrealistic, Trump can do something important with the entire country frayed and on edge: push for calm and unity."
  },
  {
    "title": "What MAGA Lost When It Lost Charlie Kirk",
    "link": "https://www.nytimes.com/2025/09/12/opinion/charlie-kirk-assassination-maga.html",
    "summary": "His death makes it harder to look ahead and glimpse what MAGA will stand for."
  },
  {
    "title": "Late Night Calls for Bringing the Political Temperature Down",
    "link": "https://www.nytimes.com/2025/09/12/arts/television/late-night-charlie-kirk.html",
    "summary": "Seth Meyers and other hosts talked about Charlie Kirk’s assassination, denouncing political violence and incendiary rhetoric."
  },
  {
    "title": "Belgian Authorities Say $10 Million Supply of Birth Control Has Not Yet Been Destroyed",
    "link": "https://www.nytimes.com/2025/09/12/world/europe/trump-birth-control.html",
    "summary": "Contraceptives bought by U.S.A.I.D. have been in limbo in a Belgian warehouse. The U.S. government said the products were destroyed, but local authorities found them."
  },
  {
    "title": "The Trump Administration Wants to Roll Back Airline Passenger Rights",
    "link": "https://www.nytimes.com/2025/09/11/travel/airline-passenger-protections-trump-transportation-department.html",
    "summary": "The Transportation Department’s apparent openness to undoing government policies protecting the rights of airline passengers could have wide ramifications."
  },
  {
    "title": "Ego Nwodim Leaves ‘S.N.L.’ After 7 Seasons",
    "link": "https://www.nytimes.com/2025/09/12/arts/television/ego-nwodim-leaving-snl.html",
    "summary": "Nwodim, known for characters including Lisa From Temecula, is the fifth cast member to leave the sketch comedy show this summer."
  },
  {
    "title": "California Wants to Ban ‘Forever Chemicals’ in Pans. These Chefs Say Don’t Do It.",
    "link": "https://www.nytimes.com/2025/09/12/climate/rachael-ray-david-chang-pfas-forever-chemicals-cookware.html",
    "summary": "Rachael Ray and other food celebrities are speaking up in defense of nonstick pans. The actor Mark Ruffalo, who starred in a movie about the risky chemicals, is criticizing them."
  }
]