[
  {
    "title": "‘Your Countries Are Going to Hell’: Trump Airs His Grievances at the U.N.",
    "link": "https://www.nytimes.com/2025/09/23/us/politics/trump-un-aid-israel-gaza.html",
    "summary": "In a meandering address, President Trump rebuked global institutions and complained about immigration, environmentalists, windmills and more."
  },
  {
    "title": "ABC Affiliate Owners Boycott Jimmy Kimmel’s Return to Late Night",
    "link": "https://www.nytimes.com/2025/09/23/business/media/jimmy-kimmel-nexstar-sinclair-boycott.html",
    "summary": "Together, the two TV station groups, Sinclair and Nexstar, control more than 20 percent of ABC’s local affiliates."
  },
  {
    "title": "After Days of Silence, Joe Rogan Weighs In on Kimmel’s Suspension",
    "link": "https://www.nytimes.com/2025/09/23/arts/joe-rogan-jimmy-kimmel.html",
    "summary": "The influential podcaster said, “I definitely don’t think that the government should be involved, ever, in dictating what a comedian can or cannot say in a monologue.”"
  },
  {
    "title": "How to Watch Jimmy Kimmel’s Return Tonight if Your ABC Station Isn’t Airing It",
    "link": "https://www.nytimes.com/2025/09/23/us/politics/jimmy-kimmel-watch-time-stream.html",
    "summary": "The show is coming back after backlash from comments Mr. Kimmel made on air last week. But not everyone will be able to view the episode live."
  },
  {
    "title": "Despite Trump’s Pressure on Justice Dept., Certain Safeguards Are Beyond His Reach",
    "link": "https://www.nytimes.com/2025/09/23/us/politics/trump-justice-department.html",
    "summary": "The criminal justice system has protections that could ultimately give pause to some of President Trump’s moves for revenge."
  },
  {
    "title": "Jury Finds Ryan Routh Guilty of Trying to Assassinate Trump in Florida",
    "link": "https://www.nytimes.com/2025/09/23/us/trump-ryan-routh-trial-florida.html",
    "summary": "A federal jury convicted Ryan Routh, an itinerant building contractor, of attempting to assassinate a major presidential candidate last September."
  },
  {
    "title": "What’s the Dog in Rembrandt’s ‘The Night Watch’? A Longtime Mystery Is Solved.",
    "link": "https://www.nytimes.com/2025/09/23/arts/rembrandt-the-night-watch-dog.html",
    "summary": "What inspired that furry figure in the corner of Rembrandt’s celebrated painting? Researchers at the Rijksmuseum say they’ve solved the longtime mystery."
  },
  {
    "title": "On Covid and Autism, Trump Strays From the Science",
    "link": "https://www.nytimes.com/2025/09/23/us/politics/trump-covid-autism-science.html",
    "summary": "President Trump has used his position of authority to dole out flawed medical advice dating back to his first term, when he mused about injecting bleach to kill off the coronavirus."
  },
  {
    "title": "Trump Pushes Unproven Link Between Tylenol and Autism",
    "link": "https://www.nytimes.com/video/science/100000010414944/trump-pushes-unproven-link-between-tylenol-and-autism.html",
    "summary": "Top U.S. health officials urged pregnant women not to use acetaminophen, the active ingredient in Tylenol, claiming it could cause autism, though studies have been inconclusive. Azeen Ghorayshi, a science reporter for The New York Times, explains."
  },
  {
    "title": "F.D.A.’s Approval of a Drug for Autism Upends Review Process",
    "link": "https://www.nytimes.com/2025/09/23/health/fda-autism-treatment-leucovorin.html",
    "summary": "The agency expanded use of an old drug as a treatment for some people with autism. The endorsement sent some customers scrambling to buy over-the-counter supplements with the same ingredients."
  },
  {
    "title": "Harvard Dean Was Paid $150,000 as an Expert Witness in Tylenol Lawsuits",
    "link": "https://www.nytimes.com/2025/09/23/health/harvard-dean-autism-tylenol-lawsuits-payment.html",
    "summary": "The Trump administration has cited Dr. Andrea Baccarelli’s expertise to warn against using acetaminophen — the active ingredient in Tylenol — in pregnancy, based on an unproven autism link."
  },
  {
    "title": "Why Take Tylenol During Pregnancy? The Risks of Fevers.",
    "link": "https://www.nytimes.com/2025/09/23/well/tylenol-pregnancy-fevers.html",
    "summary": "Fevers during pregnancy can be dangerous, and acetaminophen is the go-to treatment for them. Doctors worry what will happen if women are afraid to take it."
  },
  {
    "title": "Camp Mystic to Reopen After Texas Floods, Over Objections From Victims’ Parents",
    "link": "https://www.nytimes.com/2025/09/23/us/camp-mystic-texas.html",
    "summary": "Twenty-seven children and counselors died in the Texas Hill Country camp, and many of their families expressed shock that the retreat on the Guadalupe River would be open for its 100th anniversary."
  },
  {
    "title": "Claudia Cardinale, Actress Who Was ‘Italy’s Girlfriend,’ Is Dead at 87",
    "link": "https://www.nytimes.com/2025/09/23/movies/claudia-cardinale-dead.html",
    "summary": "A sex symbol with girl-next-door appeal, she rose to fame in the 1960s and starred in more than 150 films, including the Oscar-winning ‘8½’ and ‘The Leopard.’"
  },
  {
    "title": "Zackery Nazario Died Subway Surfing. Is Social Media to Blame?",
    "link": "https://www.nytimes.com/2025/09/23/style/subway-surfing-death-nyc-tiktok.html",
    "summary": "Norma Nazario didn’t understand what had motivated her 15-year-old son to subway surf. Then she found his phone."
  },
  {
    "title": "In Georgia, a ‘Sponge Park’ Floods So the Neighborhood Won’t",
    "link": "https://www.nytimes.com/2025/09/22/climate/climate-georgia-sponge-park-flooding.html",
    "summary": "Dozens of houses were razed across a flood-prone neighborhood in Atlanta, mitigating floods and creating a long-desired park in the process."
  },
  {
    "title": "Judge in Gilgo Beach Case Spurns Request to Throw Out DNA Evidence",
    "link": "https://www.nytimes.com/2025/09/23/nyregion/gilgo-beach-rex-heuermann-hearing.html",
    "summary": "Lawyers for Rex Heuermann, who is charged with killing seven women, made last-ditch attempts to toss crucial evidence, but prosecutors are preparing for an expected trial next year."
  },
  {
    "title": "If Only We’d Fight as Hard to Save Our Democracy as Ukrainians Are to Save Theirs",
    "link": "https://www.nytimes.com/2025/09/23/opinion/ukraine-israel-russia-gaza-trump-america.html",
    "summary": "Ukrainians know that they can no longer count on an American democracy to save them."
  },
  {
    "title": "Now the Left Cares About Free Speech Again",
    "link": "https://www.nytimes.com/2025/09/23/opinion/free-speech-kimmel-kirk-left.html",
    "summary": "That’s often not been the case in recent years."
  },
  {
    "title": "At the U.N., Trump Bashed World Leaders",
    "link": "https://www.nytimes.com/2025/09/23/briefing/trump-un-speech-jimmy-kimmel-return.html",
    "summary": "Also, Jimmy Kimmel returns. Here’s the latest at the end of Tuesday."
  },
  {
    "title": "Stuck in Traffic, Emmanuel Macron Calls Trump About His Motorcade",
    "link": "https://www.nytimes.com/2025/09/23/us/macron-trump-unga-motorcade.html",
    "summary": "The French head of state experienced a frustration that many New Yorkers know all too well. He got stuck during the U.N. General Assembly."
  },
  {
    "title": "Boston to Pay $150,000 to 2 Wrongly Accused Black Men in White Woman’s Killing",
    "link": "https://www.nytimes.com/2025/09/23/us/black-men-wrongly-accused-1989-murder.html",
    "summary": "Boston’s mayor, Michelle Wu, apologized in 2023 to Alan Swanson and Willie Bennett for the actions of police after the 1989 killing of Carol Stuart."
  },
  {
    "title": "Typhoon Ragasa Floods Taiwan and Barrels Toward China’s Coast",
    "link": "https://www.nytimes.com/2025/09/23/world/asia/typhoon-ragasa-hong-kong-china.html",
    "summary": "Fourteen people were reported dead in Taiwan, with dozens missing. Hong Kong canceled flights, Macau shut casinos and Shenzhen planned to evacuate 400,000 people."
  },
  {
    "title": "Elk Hunters Found Dead at San Juan Forest Had Been Struck by Lightning",
    "link": "https://www.nytimes.com/2025/09/23/us/hunters-dead-colorado-lightning.html",
    "summary": "The two men were found last week after a search operation in the San Juan National Forest that involved hundreds on foot or on horseback and was supported by drones and helicopters."
  }
]