[
  {
    "title": "Supreme Court Keeps Ruling in Trump’s Favor, but Doesn’t Say Why",
    "link": "https://www.nytimes.com/2025/07/16/us/politics/supreme-courts-shadow-docket.html",
    "summary": "In a series of terse, unsigned orders, the court has often been giving the green light to President Trump’s agenda without a murmur of explanation."
  },
  {
    "title": "Senate Advances Trump Clawback of Foreign Aid and Public Broadcast Funds",
    "link": "https://www.nytimes.com/2025/07/15/us/politics/senate-rescission-foreign-aid-public-broadcasting.html",
    "summary": "The vote to take up legislation to rescind $9 billion in congressionally approved funds suggested that Republicans would bow to the president’s wishes in the simmering fight over spending powers."
  },
  {
    "title": "Senator Hawley Aims to Roll Back Medicaid Cuts He Voted for in Trump Policy Bill",
    "link": "https://www.nytimes.com/2025/07/15/us/politics/medicaid-hawley-trump-policy-bill.html",
    "summary": "The Republican senator introduced a bill Tuesday that would block restrictions on key strategies that states rely on to finance Medicaid and double a rural hospital fund."
  },
  {
    "title": "For Some Republicans, Trump’s Shift on Epstein Is Just the Latest Breach",
    "link": "https://www.nytimes.com/2025/07/15/us/politics/republicans-congress-trump-epstein.html",
    "summary": "Right-wing Republicans have also criticized the president’s stances on Iran and Ukraine, hinting at a broader fraying of his political coalition."
  },
  {
    "title": "Rising Inflation, and the Supreme Court’s ‘Shadow Docket’",
    "link": "https://www.nytimes.com/2025/07/16/podcasts/the-headlines/rising-inflation-supreme-courts-shadow-docket.html",
    "summary": "Plus, why that e-book cost your library $50."
  },
  {
    "title": "Despite Dire Warnings, the Economy Is Holding Up. Can That Last?",
    "link": "https://www.nytimes.com/2025/07/16/business/tariffs-recession-economists.html",
    "summary": "Economists say it will take time for the effects of trade policies to show up in economic data — but acknowledge they aren’t sure how long."
  },
  {
    "title": "Trump Announces ‘Great Deal’ on Trade With Indonesia",
    "link": "https://www.nytimes.com/2025/07/16/business/economy/indonesia-trump-tariff-trade-agreement.html",
    "summary": "President Trump said the agreement would partly walk back some of the steep tariffs he threatened on the country last week. Indonesia’s president called Mr. Trump a “tough negotiator.”"
  },
  {
    "title": "Canada’s Mark Carney Says There’s Little Hope of Avoiding U.S. Tariffs in Trade Deal",
    "link": "https://www.nytimes.com/2025/07/15/us/politics/canada-tariffs-mark-carney-trump.html",
    "summary": "After long insisting that Canada could avoid Trump tariffs through talks, Mark Carney now says that is unlikely for any nation."
  },
  {
    "title": "Trump Administration Initiates Trade Investigation of Brazil",
    "link": "https://www.nytimes.com/2025/07/15/us/politics/trump-brazil-trade-investigation.html",
    "summary": "The United States has begun investigating Brazil’s trade practices and “anti-corruption interference,” after the president’s criticisms of Brazil’s treatment of Jair Bolsonaro, a Trump ally."
  },
  {
    "title": "Republicans in Congress Shift to Backing Ukraine, Matching Trump’s Reversal",
    "link": "https://www.nytimes.com/2025/07/15/us/politics/ukraine-republicans-trump.html",
    "summary": "After years pressing to end U.S. aid to Ukraine, many Republicans have abandoned that position now that President Trump is supporting the country against Russian aggression."
  },
  {
    "title": "Mamdani Says He Will ‘Discourage’ the Term ‘Globalize the Intifada’",
    "link": "https://www.nytimes.com/2025/07/15/business/mamdani-globalize-intafada-business-leaders.html",
    "summary": "Zohran Mamdani, the Democratic nominee in the race for mayor of New York City, moved to distance himself from comments that sparked outrage during the primary."
  },
  {
    "title": "Andrew Cuomo Test Drives a Warmer, Friendlier Version of Himself",
    "link": "https://www.nytimes.com/2025/07/15/nyregion/andrew-cuomo-mayor-campaign.html",
    "summary": "Mr. Cuomo, the former governor of New York, has vowed to run a more energetic campaign than he did in the mayoral primary, and aimed to demonstrate that on Tuesday."
  },
  {
    "title": "Hollywood’s Master of Dread Is Afraid of … Everything",
    "link": "https://www.nytimes.com/2025/07/16/magazine/ari-aster-eddington-film.html",
    "summary": "Ari Aster, the man behind some of Hollywood’s most unsettling films, takes his own anxiety and puts it onscreen."
  },
  {
    "title": "As Iran Deports a Million Afghans, ‘Where Do We Even Go?’",
    "link": "https://www.nytimes.com/2025/07/16/world/middleeast/iran-deportations-afghanistan.html",
    "summary": "Afghans being forced out of Iran are grappling with an uncertain future in Afghanistan, where widespread poverty and severe restrictions on women and girls await."
  },
  {
    "title": "Afghan Women and Girls Deported From Iran Fear Returning to Afghanistan",
    "link": "https://www.nytimes.com/2025/07/16/world/asia/afghanistan-women-refugees.html",
    "summary": "“Get ready to cope” was the message from an aid worker to women returning to Taliban rule in Afghanistan after their expulsion from Iran."
  },
  {
    "title": "Upended by Meth, Some Communities Are Paying Users to Quit",
    "link": "https://www.nytimes.com/2025/07/16/health/meth-addiction-treatment-contingency-management.html",
    "summary": "Unlike with opioids, there is no medication to suppress cravings for meth and other stimulants. As use soars, hundreds of clinics are trying a radically different approach."
  },
  {
    "title": "China Is Spending Billions to Become an A.I. Superpower",
    "link": "https://www.nytimes.com/2025/07/16/technology/china-ai.html",
    "summary": "Beijing is taking an industrial policy approach to help its A.I. companies close the gap with those in the United States."
  },
  {
    "title": "Migration Fears Turn Europe’s Borderless Dreams Into Traffic Nightmares",
    "link": "https://www.nytimes.com/2025/07/16/world/europe/europe-border-checks-immigration.html",
    "summary": "Germany’s new government imposed border checks to demonstrate toughness on migration, though crossings started slowing years ago."
  },
  {
    "title": "Club Drugs Strain Health System on Ibiza, Spain’s Party Island",
    "link": "https://www.nytimes.com/2025/07/16/world/europe/ibiza-spain-tourism-drug-crisis.html",
    "summary": "Drug-related calls from nightclubs are driving Ibiza’s ambulance services to collapse, health workers say. It’s the latest example of tensions in Europe over tourism."
  },
  {
    "title": "Christopher Reeve to David Corenswet: The Actors Who Played Superman",
    "link": "https://www.nytimes.com/2025/07/16/movies/superman-actors-christopher-reeve-david-corenswet.html",
    "summary": "There’s more than one way to play the most classic of superheroes. Here’s how six actors have approached the role."
  },
  {
    "title": "Public Media Can Be a Lifeline. Gutting It Hurts Everyone.",
    "link": "https://www.nytimes.com/2025/07/16/opinion/pbs-npr-cuts-funding.html",
    "summary": "Abandoning local public radio and TV would accelerate a dangerous trend straining civic health."
  },
  {
    "title": "Revenge, Thy Name Is Emil Bove",
    "link": "https://www.nytimes.com/2025/07/16/opinion/emil-bove-trump-loyalty.html",
    "summary": "Trump wants his people calling the shots. And Bove has proved, above all, that he belongs to the president."
  },
  {
    "title": "Jimmy Fallon Fans the Flames of Burning MAGA Hats",
    "link": "https://www.nytimes.com/2025/07/16/arts/television/jimmy-fallon-jeffrey-epstein.html",
    "summary": "People torched the hats in videos, apparently upset about the Jeffrey Epstein case. “People in China were like, ‘Oh, come on, we worked so hard making them,’” Fallon said."
  },
  {
    "title": "Israel Attacks Near Syria’s Military Headquarters. Here’s What to Know.",
    "link": "https://www.nytimes.com/2025/07/15/world/middleeast/druse-syria-bedouin-israel-fighting.html",
    "summary": "Israel, which has intervened in Syria in support of the Druse minority, attacked the entrance of the government military headquarters in Damascus. The death toll in four days of violence rose to more than 200, a war monitor said."
  },
  {
    "title": "A Scion of Democratic Politics Defeats the Upstarts in an Arizona Primary",
    "link": "https://www.nytimes.com/2025/07/15/us/politics/grijalva-arizona-primary.html",
    "summary": "Adelita Grijalva beat back charges of “legacy” and embraced the memory of her father, Raúl Grijalva, to win the Democratic primary for the House seat opened by his death."
  },
  {
    "title": "Bally’s Bronx Casino Plan Appears Dead After Council Rejects Rezoning",
    "link": "https://www.nytimes.com/2025/07/16/nyregion/ballys-casino-bronx.html",
    "summary": "The City Council vote all but dooms the company’s chances of obtaining one of up to three casino licenses that New York State is expected to award this year."
  },
  {
    "title": "Robin Kaye, ‘American Idol’ Music Supervisor, and Her Husband Found Dead in LA Home",
    "link": "https://www.nytimes.com/2025/07/15/arts/american-idol-music-supervisor-killed.html",
    "summary": "Robin Kaye was found shot to death inside her home in Los Angeles with her husband, Thomas Deluca, the police said. A 22-year-old was arrested in connection with the case."
  }
]