[
  {
    "title": "Trump Fires BLS Commissioner, Claiming Weak Jobs Numbers Were ‘Rigged’",
    "link": "https://www.nytimes.com/2025/08/01/business/economy/trump-bls-firing-jobs-report.html",
    "summary": "Economists said ousting the head of the Bureau of Labor Statistics could undermine confidence in government economic data."
  },
  {
    "title": "Stock Market Posts Worst Week in Months on Renewed Economic Fears",
    "link": "https://www.nytimes.com/2025/08/01/business/economy/trump-tariffs-stock-markets-trade-dollar.html",
    "summary": "Data showing cracks in the U.S. labor market and President Trump’s newest barrage of tariffs shook investors around the world, weighing on stocks, the dollar and more."
  },
  {
    "title": "Fed Governor Resigns, Giving Trump Opportunity to Shape Central Bank",
    "link": "https://www.nytimes.com/2025/08/01/business/economy/fed-governor-kugler-resigns-trump.html",
    "summary": "The resignation comes as President Trump has openly pressured the central bank to lower interest rates and called for Jerome H. Powell, the chair, to step down."
  },
  {
    "title": "Trump Says He Ordered Nuclear Submarines Repositioned After Threats From Medvedev",
    "link": "https://www.nytimes.com/2025/08/01/us/politics/trump-nuclear-submarines-russia.html",
    "summary": "In a social media post, the president described the move as a deterrent prompted by threats by a former Russian leader. It is unclear if any submarines did actually change position."
  },
  {
    "title": "Corporation for Public Broadcasting Will Shut Down",
    "link": "https://www.nytimes.com/2025/08/01/business/media/corporation-for-public-broadcasting-shut-down.html",
    "summary": "The company is among the first casualties of a vote to strip roughly $500 million in federal funding from NPR, PBS and local stations across the country."
  },
  {
    "title": "Army Pilots Might Have Struggled to See Passenger Jet Before D.C. Crash",
    "link": "https://www.nytimes.com/2025/08/01/us/politics/army-pilots-jet-crash.html",
    "summary": "Light pollution from Washington, and even the passenger jet’s dim lights, might have contributed to difficulties spotting American Airlines Flight 5342 before the two aircraft collided on Jan. 29, Army experts said."
  },
  {
    "title": "Before D.C. Crash, Fates of 2 Pilots and Air Traffic Controller Entwined",
    "link": "https://www.nytimes.com/2025/08/01/us/politics/dc-plane-helicopter-crash.html",
    "summary": "Documents released in the inquiry into the deadly midair collision over the Potomac River on Jan. 29 reveal new details about three people whose decisions shaped the outcome of the disaster."
  },
  {
    "title": "A Former Rolling Stone Says the Met Has His Lost Guitar. The Museum Says No Way.",
    "link": "https://www.nytimes.com/2025/08/01/arts/music/mick-taylor-rolling-stones-guitar-met-museum.html",
    "summary": "Representatives for Mick Taylor, the Rolling Stones’ former guitarist, said the Les Paul was stolen from him decades ago. The museum says he never owned it and has not made a claim."
  },
  {
    "title": "The Publicist on Call for Controversy",
    "link": "https://www.nytimes.com/2025/08/01/style/mitchell-jackson-publicist.html",
    "summary": "Mitchell Jackson was fired from a high-profile journalism job at 25. Now he represents some of the most divisive figures in America, including the right-wing podcaster Candace Owens."
  },
  {
    "title": "Why Is California So Chilly This Summer?",
    "link": "https://www.nytimes.com/2025/08/01/weather/san-francisco-summer-temperatures-cold-california.html",
    "summary": "It’s been so cold in San Francisco, painters on the Golden Gate Bridge had to break out heaters."
  },
  {
    "title": "For Some, Return of Presidential Fitness Test Revives Painful Memories",
    "link": "https://www.nytimes.com/2025/08/01/well/trump-presidential-fitness-test.html",
    "summary": "Generations of Americans who struggled to complete a pull-up in front of their classmates winced as President Trump announced that he was reinstating the annual assessment."
  },
  {
    "title": "Newsom Wants to Gerrymander California. Schwarzenegger May Disagree.",
    "link": "https://www.nytimes.com/2025/08/01/us/schwarzenegger-newsom-gerrymandering-california.html",
    "summary": "As governor, Arnold Schwarzenegger championed the state’s nonpartisan redistricting system. Now, Gov. Gavin Newsom wants to pause it to help Democrats."
  },
  {
    "title": "In Tense Hearing, Texas Republicans Defend Redrawn Political Map",
    "link": "https://www.nytimes.com/2025/08/01/us/politics/texas-redistricting.html",
    "summary": "The legislative hearing was part of a rapidly moving redistricting process, pushed by President Trump, that could see the map approved next week."
  },
  {
    "title": "Radioactive Wasps Found at Nuclear Site in South Carolina Could Be a ‘Red Flag,’ Expert Says",
    "link": "https://www.nytimes.com/2025/08/01/science/radioactive-wasps-nuclear-savannah-river.html",
    "summary": "Four radioactive wasp nests may indicate previously undetected environmental contamination at the decades-old Savannah River Site. Here’s what to know."
  },
  {
    "title": "Trump’s Damaging Decision to Fire the B.L.S. Commissioner",
    "link": "https://www.nytimes.com/live/2025/08/01/opinion/thepoint/bls-commissioner-trump-fire-erika-mcentarfer",
    "summary": "The way the Bureau of Labor Statistics produces data is widely trusted. Firing the commissioner is damaging to that trust."
  },
  {
    "title": "I’m a Therapist. ChatGPT Is Eerily Effective.",
    "link": "https://www.nytimes.com/2025/08/01/opinion/chatgpt-therapist-journal-ai.html",
    "summary": "I was shocked to see ChatGPT echo the very tone I’d once cultivated."
  },
  {
    "title": "After a Weak Jobs Report, Trump Fired the Agency’s Leader",
    "link": "https://www.nytimes.com/2025/08/01/briefing/trump-jobs-report-radioactive-wasp-nests.html",
    "summary": "Also, radioactive wasp nests were found in South Carolina. Here’s the latest at the end of Friday."
  },
  {
    "title": "4 Dead in Anaconda, Montana, Bar Shooting; Police Search for Gunman",
    "link": "https://www.nytimes.com/2025/08/01/us/montana-anaconda-shooting.html",
    "summary": "Law enforcement officials engaged in a growing manhunt for the suspect, who lived nearby. They warned that he was believed to be armed."
  },
  {
    "title": "Mike Donilon Had $4 Million Incentive to Secure a 2024 Biden Win",
    "link": "https://www.nytimes.com/2025/08/01/us/politics/mike-donilon-biden-2024-bonus.html",
    "summary": "Mike Donilon was promised a bonus that would have doubled his payment for work on the campaign if the former president had been re-elected."
  },
  {
    "title": "Jury Says Tesla Was Partly to Blame for Fatal Crash",
    "link": "https://www.nytimes.com/2025/08/01/business/tesla-autopilot-federal-trial-verdict.html",
    "summary": "Lawyers for the family of a woman struck and killed by a Tesla sedan in 2019 argued that the company’s Autopilot software should have avoided the crash."
  },
  {
    "title": "Michael Cardozo, 84, New York City’s Longest-Serving Chief Lawyer, Dies",
    "link": "https://www.nytimes.com/2025/08/01/nyregion/michael-a-cardozo-dead.html",
    "summary": "As the city’s corporation counsel under Mayor Michael Bloomberg, he defended stop-and-frisk policing and a ban on smoking in bars and restaurants."
  }
]