[
  {
    "title": "Vance Boelter’s Life Before the Minnesota Shootings",
    "link": "https://www.nytimes.com/2025/07/19/us/minnesota-shootings-vance-boelter.html",
    "summary": "Periods of religious zealotry and an unsettled professional career were intertwined for years before he was accused of murder."
  },
  {
    "title": "Trump Administration Requests Release of Epstein Grand Jury Records. What’s Next?",
    "link": "https://www.nytimes.com/2025/07/18/us/politics/epstein-grand-jury-what-to-know.html",
    "summary": "The records are at the center of President Trump’s effort to manage fallout from the Epstein case. But unsealing them is complex and requires a judge to sign off."
  },
  {
    "title": "When It Comes to Jeffrey Epstein, Trump Says He Is Ready to Defer to the Courts",
    "link": "https://www.nytimes.com/2025/07/18/us/politics/trump-epstein-letter-birthday-courts.html",
    "summary": "After months of pushing back against federal judges and the courts, the president has requested the release of Epstein-related grand jury testimony to be “subject to Court approval.”"
  },
  {
    "title": "Trump Sues Wall Street Journal for Article on Note to Epstein",
    "link": "https://www.nytimes.com/2025/07/18/business/media/trump-sues-wall-street-journal-epstein.html",
    "summary": "The lawsuit argues that The Journal falsely claimed President Trump “authored, drew and signed” a lewd birthday card to Jeffrey Epstein."
  },
  {
    "title": "In Response to Epstein Letter Report, Trump Says He Doesn’t ‘Draw Pictures’",
    "link": "https://www.nytimes.com/2025/07/18/us/politics/trump-drawings-epstein.html",
    "summary": "The president disputes reporting from The Wall Street Journal that he drew a picture for Jeffrey Epstein, but as a real estate mogul, he often sketched for charity."
  },
  {
    "title": "Why Are More Than 100 People Still Missing in Texas, 2 Weeks After the Floods?",
    "link": "https://www.nytimes.com/2025/07/19/us/politics/texas-floods-missing.html",
    "summary": "The number of people unaccounted for dropped this week but remains stubbornly high as some searchers lose hope of finding them."
  },
  {
    "title": "After the Floods, a Pain So Vast It Makes Texas Feel Small",
    "link": "https://www.nytimes.com/2025/07/18/us/texas-hill-country-floods-impact.html",
    "summary": "The Hill Country has a hold on the hearts of many Texans, meaning the suffering caused by the disaster is reaching as far as the region’s appeal."
  },
  {
    "title": "Trump’s Immigration Crackdown Hits Senior Care Work Force",
    "link": "https://www.nytimes.com/2025/07/18/us/politics/immigration-senior-caregivers.html",
    "summary": "Nursing homes and home care agencies have lost workers as the Trump administration has moved to end deportation protections for migrants with temporary legal status."
  },
  {
    "title": "Under Trump, a New Focus for a Birth Control Program: Helping Women Get Pregnant",
    "link": "https://www.nytimes.com/2025/07/18/us/politics/under-trump-a-new-focus-for-a-birth-control-program-helping-women-get-pregnant.html",
    "summary": "A little-noticed plan for an “infertility training center” signals that the administration intends to take a new approach with Title X, which has long helped low-income women access contraception."
  },
  {
    "title": "E.P.A. Says It Will Eliminate Its Scientific Research Arm",
    "link": "https://www.nytimes.com/2025/07/18/climate/epa-firings-scientific-research.html",
    "summary": "The decision comes after a Supreme Court ruling allowing the Trump administration to slash the federal work force and dismantle agencies."
  },
  {
    "title": "How Superman Handles a Lois Lane Interview",
    "link": "https://www.nytimes.com/2025/07/18/movies/superman-clip.html",
    "summary": "James Gunn, the screenwriter and director of “Superman,” narrates a sequence featuring David Corenswet and Rachel Brosnahan."
  },
  {
    "title": "Superman’s Other Secret Weakness? Journalism Ethics.",
    "link": "https://www.nytimes.com/2025/07/11/arts/superman-lois-lane-clark-kent-journalism.html",
    "summary": "Writing for The Daily Planet about his heroic alter ego raises thorny issues for Clark Kent. Lois Lane has her conflicts, too."
  },
  {
    "title": "Democrats’ 2024 Autopsy Is Described as Avoiding the Likeliest Cause of Death",
    "link": "https://www.nytimes.com/2025/07/19/us/politics/democrats-2024-autopsy-harris-biden.html",
    "summary": "An audit being conducted by the D.N.C. is not looking at Joe Biden’s decision to run or key decisions by Kamala Harris’s team, according to six people briefed on the report."
  },
  {
    "title": "An Ancient Law Could Shape the Modern Future of America’s Beaches. Here’s How.",
    "link": "https://www.nytimes.com/2025/07/19/climate/beach-erosion-sea-walls.html",
    "summary": "The growing battle over how to manage sea level rise turns partly on a legal principle set down in Roman times."
  },
  {
    "title": "How a Sequoia Capital Partner’s Mamdani Posts Dragged the Firm Into Politics",
    "link": "https://www.nytimes.com/2025/07/19/technology/sequoia-capital-shaun-maguire-mamdani.html",
    "summary": "Sequoia Capital, which backed Nvidia, Google and Apple when they were start-ups, has long stayed above the fray. But one partner’s post about Zohran Mamdani set off a chain reaction."
  },
  {
    "title": "Mamdani Meets Jeffries in Brooklyn as He Seeks to Expand His Coalition",
    "link": "https://www.nytimes.com/2025/07/18/nyregion/zohran-mamdani-hakeem-jeffries.html",
    "summary": "No endorsement emerged from the meeting between Zohran Mamdani and Representative Hakeem Jeffries, but both said the gathering had been productive."
  },
  {
    "title": "Jane Austen’s Best Books",
    "link": "https://www.nytimes.com/article/jane-austen-books.html",
    "summary": "A peerless chronicler of class and romance, the “Pride and Prejudice” author was never prolific. But her work remains remarkably relevant, more than two centuries after her death."
  },
  {
    "title": "Russia Makes Gains in Ukraine in Summer Offensive",
    "link": "https://www.nytimes.com/2025/07/19/world/europe/russia-ukraine-military-economy.html",
    "summary": "The most important factors may be far from the battlefield."
  },
  {
    "title": "Sohei Kamiya Brings Trump-Style Populism to Japan’s Election",
    "link": "https://www.nytimes.com/2025/07/19/world/asia/japan-election-sohei-kamiya.html",
    "summary": "With his calls to limit foreign workers, fight globalism and put “Japanese First,” Sohei Kamiya has brought a fiery right-wing populism to Japan’s election on Sunday."
  },
  {
    "title": "Japan Election 2025: What to Know",
    "link": "https://www.nytimes.com/2025/07/19/world/asia/japan-election.html",
    "summary": "Shigeru Ishiba of the long-governing Liberal Democratic Party could face calls to resign if his party fares poorly in Sunday’s Upper House elections."
  },
  {
    "title": "MAGA’s New Target: Trump",
    "link": "https://www.nytimes.com/2025/07/19/opinion/trump-maga-epstein-deep-state.html",
    "summary": "The president is in a deep-state fugue."
  },
  {
    "title": "The Icelandic Landscape Is Changing, and It’s Changing Us",
    "link": "https://www.nytimes.com/2025/07/19/opinion/iceland-climate-change.html",
    "summary": "It is impossible to separate our language from its island at the edge of the Arctic."
  },
  {
    "title": "Open Season",
    "link": "https://www.nytimes.com/2025/07/19/briefing/open-season.html",
    "summary": "The popular notions of summer fun and the things we actually feel like doing can sometimes be at odds with each other."
  },
  {
    "title": "Vehicle Drives Into Crowd in Los Angeles, Injuring at Least 28",
    "link": "https://www.nytimes.com/2025/07/19/us/los-angeles-vehicle-crowd.html",
    "summary": "At least three people were in critical condition, the Los Angeles Fire Department said early Saturday."
  },
  {
    "title": "Tear It Down, They Said. He Just Kept Building.",
    "link": "https://www.nytimes.com/2025/07/19/world/asia/china-demolition-house.html",
    "summary": "Defying demolition orders, a Chinese man turned his home into a rickety 11-story tower. Now tourists are coming."
  },
  {
    "title": "Scams and a Rent Spike Follow New York City’s New Broker Fee Law",
    "link": "https://www.nytimes.com/2025/07/19/nyregion/nyc-broker-fee-fare-act.html",
    "summary": "The law mostly shifts fees from tenants to landlords. But since it took effect, some landlords have raised rents, and tenants say some brokers still try to make them pay fees."
  },
  {
    "title": "Stephen Colbert’s ‘Late Show’ Was Losing Millions at CBS Before Cancellation",
    "link": "https://www.nytimes.com/2025/07/18/business/media/stephen-colbert-late-show-cbs.html",
    "summary": "CBS could not figure out a path to profitability in an entertainment world increasingly dominated by streaming."
  }
]