[
  {
    "title": "Silicon Valley’s Man in the White House Is Benefiting Himself and His Friends",
    "link": "https://www.nytimes.com/2025/11/30/technology/david-sacks-white-house-profits.html",
    "summary": "David Sacks, the Trump administration’s A.I. and crypto czar, has helped formulate policies that aid his Silicon Valley friends and many of his own tech investments."
  },
  {
    "title": "Trump Frees Fraudster Just Days Into Seven-Year Prison Sentence",
    "link": "https://www.nytimes.com/2025/11/29/us/politics/trump-david-gentile-commutation.html",
    "summary": "David Gentile had been found guilty for his role in what prosecutors described as a $1.6 billion scheme that defrauded thousands of investors."
  },
  {
    "title": "The Ex-President Whom Trump Plans to Pardon Flooded America With Cocaine",
    "link": "https://www.nytimes.com/2025/11/29/nyregion/honduras-hernandez-drug-trafficking.html",
    "summary": "Juan Orlando Hernández, whom Mr. Trump called a victim of persecution, helped orchestrate a decades-long trafficking conspiracy. It ravaged his Central American country."
  },
  {
    "title": "In Announcing Pardon of Drug Trafficker While Threatening Venezuela, Trump Displays Contradictions",
    "link": "https://www.nytimes.com/2025/11/29/us/politics/trump-honduras-venezuela.html",
    "summary": "President Trump’s statements on social media less than 24 hours apart showed the dissonance in his campaign against drug trafficking."
  },
  {
    "title": "What to Know About Honduras’s Elections",
    "link": "https://www.nytimes.com/2025/11/30/world/americas/honduras-election.html",
    "summary": "President Trump has put a spotlight on Honduras as voters head to the polls. Their choices include the left-wing party in power and a candidate endorsed by Mr. Trump."
  },
  {
    "title": "The Political Price Shock of Data Centers and Electric Bills",
    "link": "https://www.nytimes.com/2025/11/30/us/politics/the-new-price-of-eggs-the-political-shocks-of-data-centers-and-electric-bills.html",
    "summary": "Democrats zeroed in on utilities and affordability to win Republican support in upset elections in Georgia and Virginia. Can the same playbook work in 2026?"
  },
  {
    "title": "Netanyahu Asks Israel’s President to Pardon Him in Corruption Cases",
    "link": "https://www.nytimes.com/2025/11/30/world/middleeast/netanyahu-pardon-request-israel.html",
    "summary": "Prime Minister Benjamin Netanyahu made the contentious appeal weeks after President Trump had made the same request to the Israeli president."
  },
  {
    "title": "The Netanyahu Corruption Trial, Explained",
    "link": "https://www.nytimes.com/2024/12/10/world/middleeast/the-netanyahu-corruption-trial-explained.html",
    "summary": "Prime Minister Benjamin Netanyahu asked Israel’s president to pardon him preemptively, before any verdicts were reached in his corruption cases. Here’s what to know about his trial."
  },
  {
    "title": "Pope Leo Calls for a Two-State Solution in Mideast Conflict",
    "link": "https://www.nytimes.com/2025/11/30/world/middleeast/pope-leo-two-state-solution-israel.html",
    "summary": "The pope, en route to Lebanon after visiting Turkey, said he had discussed with the Turkish president how the Vatican might help Israel and the Palestinian territories find peace."
  },
  {
    "title": "The Shocking Crash That Led Marin County to Reckon With the Dangers of E-Bikes",
    "link": "https://www.nytimes.com/2025/11/30/magazine/e-bikes-accidents-safety-legislation-california.html",
    "summary": "Unregulated e-bikes are a growing danger on American streets. In one Bay Area town, a terrible accident finally led to reform."
  },
  {
    "title": "The Language of Tom Stoppard, Ablaze With Energy and Urgency",
    "link": "https://www.nytimes.com/2025/11/29/theater/tom-stoppard-arcadia-travesties.html",
    "summary": "In works like “Travesties” and “Arcadia,” the playwright embraced the really big questions and wrestled words into coherent, exhilarating shape."
  },
  {
    "title": "When Tom Stoppard Confronted His Background in His Final Play ‘Leopoldstadt’",
    "link": "https://www.nytimes.com/2025/11/30/theater/tom-stoppard-leopoldstadt-jewish-heritage.html",
    "summary": "The playwright, who learned about his Jewish heritage late in life, addressed it in the Tony Award-winning drama “Leopoldstadt.”"
  },
  {
    "title": "Glenn Close, Ethan Hawke and Others Mourn Tom Stoppard",
    "link": "https://www.nytimes.com/2025/11/30/theater/tom-stoppard-tributes-reactions.html",
    "summary": "Nobody advanced or cherished the English language more than Stoppard, Tim Curry noted. Colleagues and fans agreed."
  },
  {
    "title": "America Has Sidelined Education. You Can Help.",
    "link": "https://www.nytimes.com/2025/11/30/opinion/communities-fund-charitable-giving.html",
    "summary": "The New York Times Communities Fund has partnered with charities that invest in education at critical junctures across people’s life spans."
  },
  {
    "title": "It’s OK That Our Long, Mostly Good Marriage Ended",
    "link": "https://www.nytimes.com/2025/11/30/opinion/marriage-divorce-happy.html",
    "summary": "Four years ago, my husband and I made an increasingly common choice: We hugged, apologized for our shortcomings and freed each other."
  },
  {
    "title": "The Dangers of E-bikes",
    "link": "https://www.nytimes.com/2025/11/30/briefing/the-dangers-of-e-bikes.html",
    "summary": "Injuries and deaths are rising — but the law hasn’t kept up."
  },
  {
    "title": "Mamdani, a Sharp Critic of Police Surveillance, Will Soon Oversee It",
    "link": "https://www.nytimes.com/2025/11/30/nyregion/mamdani-tisch-nypd-surveillance.html",
    "summary": "Zohran Mamdani, New York’s mayor-elect, has criticized the N.Y.P.D.’s surveillance tactics. He reappointed the police commissioner who helped create a ubiquitous web of monitoring."
  },
  {
    "title": "Deadly Floods in Indonesia Leave Hundreds Missing",
    "link": "https://www.nytimes.com/2025/11/30/world/asia/flooding-indonesia-thailand-southeast-asia.html",
    "summary": "Hundreds of people have been killed and millions displaced as extreme weather has ravaged Southeast Asia this month. Indonesia’s heavy rain was linked to two tropical cyclones."
  },
  {
    "title": "Fed Up With the Taliban, Pakistan Expels Masses of Afghans",
    "link": "https://www.nytimes.com/2025/11/30/world/asia/pakistan-afghans-mass-expulsions.html",
    "summary": "Labeling Afghans a national security threat, Pakistan has forced out about a million this year, depriving them of a haven from Afghanistan’s turmoil."
  },
  {
    "title": "Cory Booker Weds Alexis Lewis in a Private Ceremony",
    "link": "https://www.nytimes.com/2025/11/30/style/cory-booker-wedding-alexis-lewis.html",
    "summary": "The couple married at a courthouse in Newark days before hosting an intimate wedding in Washington, D.C. on Saturday. They shared their wedding details exclusively with The New York Times."
  }
]