[
  {
    "title": "Corporate America’s Newest Activist Investor: Donald Trump",
    "link": "https://www.nytimes.com/2025/08/23/business/trump-intel-us-steel-nvidia.html",
    "summary": "The president is demanding government stakes in U.S. companies and cuts of their revenue. Experts see some similarities to state-managed capitalism in other parts of the world."
  },
  {
    "title": "Intel's Downfall Underlines How Even Tech Giants Can Fade",
    "link": "https://www.nytimes.com/2025/08/23/technology/intel-computer-chips-tech-ai-trump.html",
    "summary": "The Silicon Valley chipmaker’s journey from icon to a government project, with the sale of a 10 percent stake to the Trump administration, underlines how even the mightiest in tech can fall."
  },
  {
    "title": "Lisa Cook, Who Broke Ground at the Fed, Faces Attack by Trump",
    "link": "https://www.nytimes.com/2025/08/23/business/lisa-cook-fed-trump.html",
    "summary": "The first Black woman to serve on the Federal Reserve board, Ms. Cook has long been a pathbreaker in a field dominated by white men."
  },
  {
    "title": "In Trump’s Second Term, Far-Right Agenda Enters the Mainstream",
    "link": "https://www.nytimes.com/2025/08/23/us/politics/trump-far-right.html",
    "summary": "President Trump has embraced an array of far-right views and talking points in ways that have delighted many right-wing activists who have long supported those ideas."
  },
  {
    "title": "What Counts as a ‘National Emergency’?",
    "link": "https://www.nytimes.com/video/us/100000010351409/what-counts-as-a-national-emergency.html",
    "summary": "In his seven months back in office, President Trump has declared nine national emergencies, plus a “crime emergency” in Washington. Those emergency declarations have been used to justify hundreds of actions — including immigration measures, sweeping tariffs and energy deregulation — that would typically require congressional approval or lengthy regulatory review, according to a New York Times analysis of presidential documents."
  },
  {
    "title": "Abrego Garcia’s Lawyers Say U.S. Officials Tried to Use Uganda Deportation Threat to ‘Coerce’ Guilty Plea",
    "link": "https://www.nytimes.com/2025/08/23/us/politics/abrego-garcia-coercion.html",
    "summary": "Officials dangled an offer to send Kilmar Armando Abrego Garcia to Costa Rica if he pleaded guilty to criminal charges, the lawyers said in a filing, then threatened to send him to Uganda if he did not."
  },
  {
    "title": "After Gaza Famine Report, U.S. Is Mostly Silent and Israel Defiant",
    "link": "https://www.nytimes.com/2025/08/23/world/middleeast/gaza-famine-report-us-reaction.html",
    "summary": "The White House has not commented on a report finding famine in Gaza. Analysts say that absent U.S. pressure, Israel is unlikely to change course."
  },
  {
    "title": "5 Takeaways From Ghislaine Maxwell’s Interview About Jeffrey Epstein",
    "link": "https://www.nytimes.com/2025/08/22/us/politics/ghislaine-maxwell-transcript-takeaways.html",
    "summary": "In a courthouse interview with the deputy attorney general, Ms. Maxwell, who has been convicted of sex trafficking, maintained that President Trump and other famous figures were not involved."
  },
  {
    "title": "Can Redesigns of Wagner Park and East River Park Save Lower Manhattan?",
    "link": "https://www.nytimes.com/2025/08/23/headway/nyc-manhattan-park-redesigns-wagner-east-river.html",
    "summary": "Two new parks fortifying the city’s coastline survived a bureaucratic gantlet that reveals why progress so often feels stuck."
  },
  {
    "title": "Where U.S. Medicines Are Made and How Trump’s Tariffs Could Affect Them",
    "link": "https://www.nytimes.com/2025/08/23/health/prescription-drugs-manufacturing-tariffs.html",
    "summary": "President Trump’s planned pharmaceutical tariffs threaten to hit many of the most common and well-known drugs that Americans take."
  },
  {
    "title": "Faced With Trump’s English Mandate, Mexico’s Truckers Report to Class",
    "link": "https://www.nytimes.com/2025/08/23/world/americas/mexico-english-truckers-trump.html",
    "summary": "Companies, fearing penalties that could put them out of business, race to make sure their drivers have enough English to communicate with U.S. officials."
  },
  {
    "title": "What to Know About the Menendez Brothers’ Parole Hearings",
    "link": "https://www.nytimes.com/article/menendez-brothers-parole-hearing.html",
    "summary": "In two hearings, California parole panels said the brothers should not be released from prison 36 years after they killed their parents."
  },
  {
    "title": "Texas Legislature Gives Final Approval to Redistricting Map Favoring Republicans",
    "link": "https://www.nytimes.com/2025/08/23/us/texas-redistricting.html",
    "summary": "The map’s passage was a major victory in President Trump’s push to get Republican state leaders to help his party keep control of the U.S. House."
  },
  {
    "title": "How Redistricting Wars Could Give the G.O.P. Up to 7 Seats",
    "link": "https://www.nytimes.com/2025/08/22/us/redistricting-gerrymandering-texas-california-stakes.html",
    "summary": "As a handful of states have made moves and begun discussing redrawing their maps, here’s what’s at stake."
  },
  {
    "title": "The White House Wants Indiana to Redistrict. Republicans There Are Split.",
    "link": "https://www.nytimes.com/2025/08/22/us/indiana-redistricting-congress-republicans.html",
    "summary": "As President Trump asks Republican-led states to redraw congressional maps, some Indiana conservatives are pushing back. “They should leave it alone,” one legislator said."
  },
  {
    "title": "Harvard Is Making Changes Trump Officials Want, Even Without a Deal",
    "link": "https://www.nytimes.com/2025/08/23/us/harvard-changes-academic-freedom-trump-deal.html",
    "summary": "Harvard has sued, fighting the Trump administration’s demands. But the university has also enacted a host of items on the White House wish list."
  },
  {
    "title": "Green Funerals Are Becoming a Popular Choice for Environmentally Conscious Americans",
    "link": "https://www.nytimes.com/2025/08/23/health/green-natural-burials.html",
    "summary": "More Americans are choosing burials in which everything is biodegradable."
  },
  {
    "title": "What to Know About Student Loan Repayment Plan Changes and Your Options",
    "link": "https://www.nytimes.com/article/student-loan-repayment-options.html",
    "summary": "Federal student loans have been upended by litigation and legislation. Here’s what you need to know to repay your loans, avoid tax bombs and more."
  },
  {
    "title": "Red Lobster Is Betting on Black Diners With Its Brand Comeback",
    "link": "https://www.nytimes.com/2025/08/22/dining/red-lobster-comeback.html",
    "summary": "Are nostalgia, a new chief executive and seafood boil bags enough to save the seafood chain after more than 60 years?"
  },
  {
    "title": "John Bolton, Trump and the Crisis of Trust in Federal Law Enforcement",
    "link": "https://www.nytimes.com/2025/08/23/opinion/john-bolton-trump-fbi.html",
    "summary": "If the F.B.I. is seen as a tool of retribution, it will come at the expense of its effectiveness in the long run."
  },
  {
    "title": "Clemency Is Broken. That Keeps Me Employed.",
    "link": "https://www.nytimes.com/2025/08/12/opinion/clemency-prison-documentaries-new-york.html",
    "summary": "One filmmaker’s playbook for helping people get clemency."
  },
  {
    "title": "The Water Cure",
    "link": "https://www.nytimes.com/2025/08/23/briefing/the-water-cure.html",
    "summary": "Whether you swim furiously or float motionless, being in the water is a magical feeling."
  },
  {
    "title": "Book Club: Read ‘Pride and Prejudice,’ by Jane Austen, With the Book Review",
    "link": "https://www.nytimes.com/2025/08/22/books/review/pride-and-prejudice-jane-austen-book-club.html",
    "summary": "In September, the Book Review Book Club will read and discuss Jane Austen’s classic, about the tortured romance of two people frazzled by miscommunications and assumptions."
  },
  {
    "title": "The All-Female Hacker House Trying to Break A.I.’s Glass Ceiling",
    "link": "https://www.nytimes.com/2025/08/23/business/ai-female-hackers-foundher-house.html",
    "summary": "FoundHer House, a home in San Francisco’s Glen Park neighborhood, is the rare all-female hacker house where residents are creating a supportive community to build their start-ups."
  },
  {
    "title": "Iran’s Evin Prison Is Holding Dissidents Again",
    "link": "https://www.nytimes.com/2025/08/23/world/middleeast/iran-evin-prisoners-return.html",
    "summary": "Israel largely destroyed Evin prison, one of Iran’s most infamous symbols of oppression, in June. Less than two months later, Iran began returning male prisoners."
  },
  {
    "title": "Rising Cost of a Day at the Beach Angers Italians",
    "link": "https://www.nytimes.com/2025/08/23/world/europe/italy-beach-costs-inflation-anger.html",
    "summary": "For Americans, the price of eggs became a rallying cry for consumers beaten down by high prices. For Italians, it’s the cost of beach umbrellas."
  }
]