[
  {
    "title": "The Russian Technocrat Who Helps Enable Putin and Manage the Ukraine War",
    "link": "https://www.nytimes.com/2025/08/10/world/europe/putin-russia-ukraine-war-sergei-kiriyenko.html",
    "summary": "For three years, Sergei V. Kiriyenko has handled the political aspects of the war in Ukraine, rising among a cadre of skilled managers who oversee the sprawling Russian state."
  },
  {
    "title": "Takeaways From The Times’s Reporting on Putin’s Powerful Aide",
    "link": "https://www.nytimes.com/2025/08/10/world/europe/russia-putin-kiriyenko-takeaways.html",
    "summary": "Showing an uncanny ability to adapt to circumstances, Sergei V. Kiriyenko has turned himself into a key engineer of President Vladimir V. Putin’s autocratic machine."
  },
  {
    "title": "Dmitri Kozak Was a Key Putin Aide. He Lost Power When He Balked at the Ukraine War.",
    "link": "https://www.nytimes.com/2025/08/10/world/europe/putin-russia-ukraine-war-dmitri-kozak.html",
    "summary": "Dmitri N. Kozak, who has said privately that the invasion was a mistake, has lost power to another senior Putin ally, Sergei V. Kiriyenko, who has embraced the military action."
  },
  {
    "title": "Netanyahu Doubles Down on Gaza Offensive After Global Backlash",
    "link": "https://www.nytimes.com/2025/08/10/world/middleeast/smotrich-israel-gaza-takeover-netanyahu.html",
    "summary": "This is not the first time the Israeli prime minister has called for one final military drive to dismantle Hamas and end the war."
  },
  {
    "title": "How Starmer, Macron and Merz Tried to Halt the War in Gaza",
    "link": "https://www.nytimes.com/2025/08/10/world/europe/gaza-europe-peace-plan-trump-netanyahu.html",
    "summary": "Images of starving children and Israel’s planned expansion of settlements spurred Britain, France and Germany to a tougher stance. Prime Minister Benjamin Netanyahu was undeterred."
  },
  {
    "title": "Why Young Americans Dread Turning 26: Health Insurance Chaos",
    "link": "https://www.nytimes.com/2025/08/09/health/young-adults-health-insurance-26.html",
    "summary": "Young adults without jobs that provide insurance find that their options are limited and expensive. The problem is about to get worse."
  },
  {
    "title": "A Guide to Finding Insurance at 26",
    "link": "https://www.nytimes.com/2025/08/09/health/finding-health-insurance.html",
    "summary": "It’s a difficult rite of passage for young adults without job-based insurance. Here are some tips for getting started."
  },
  {
    "title": "Dr. Phil’s Road From Oprah to ICE Raids",
    "link": "https://www.nytimes.com/2025/08/10/style/dr-phils-road-from-oprah-to-ice-raids.html",
    "summary": "The daytime TV fixture seems to have taken a rightward turn. But don’t call it politics."
  },
  {
    "title": "What Happened When Mark Zuckerberg Moved In Next Door",
    "link": "https://www.nytimes.com/2025/08/10/us/mark-zuckerberg-palo-alto.html",
    "summary": "The billionaire has bought at least 11 properties in Palo Alto, Calif., creating a compound for his family, a private school for his children — and headaches for his neighbors."
  },
  {
    "title": "Zuckerberg’s Compound Had Something That Violated City Code: A Private School",
    "link": "https://www.nytimes.com/2025/08/10/us/zuckerberg-compound-palo-alto-school.html",
    "summary": "The school, called BBS, enrolled 14 children in kindergarten through fourth grade and employed three full-time teachers and other staff members."
  },
  {
    "title": "Trump’s Cartel Order Revives ‘Bitter’ Memories in Latin America",
    "link": "https://www.nytimes.com/2025/08/10/us/trumps-cartel-order-revives-bitter-memories-in-latin-america.html",
    "summary": "The decision triggers fears that the U.S. might return to a pattern of military interference in the region that dates to the Monroe Doctrine."
  },
  {
    "title": "Can AriZona’s 99-Cent Iced Tea Survive Trump’s Tariffs?",
    "link": "https://www.nytimes.com/2025/08/10/business/arizon-iced-tea-99-cents-tarriffs.html",
    "summary": "The price has been AriZona’s calling card for nearly three decades. A 50 percent tariff on imported aluminum may change that."
  },
  {
    "title": "Environmental Leader Laments Loss of Bipartisanship on Climate Issues",
    "link": "https://www.nytimes.com/2025/08/10/us/environmental-leader-bipartisanship-climate.html",
    "summary": "Gene Karpinski, who retired from leading the League of Conservation Voters after two decades, said the group that once backed G.O.P. candidates now finds it difficult to do so."
  },
  {
    "title": "Cannabis Poisonings Are Rising, Mostly Among Kids",
    "link": "https://www.nytimes.com/2025/08/10/health/cannabis-poisoning-children.html",
    "summary": "As products like weed gummies proliferate, more children and teens are suffering symptoms including seizures and life-threatening breathing problems."
  },
  {
    "title": "Trump Raids Help Stir a Political Reversal for Karen Bass",
    "link": "https://www.nytimes.com/2025/08/10/us/politics/mayor-bass-los-angeles-raids.html",
    "summary": "The mayor of Los Angeles has emerged as a leading voice of the city’s resistance to the Trump administration after facing criticism for her handling of the wildfires."
  },
  {
    "title": "C.D.C. Workers Say Shooting Manifests Worst Fears About Anger Among Public",
    "link": "https://www.nytimes.com/2025/08/09/us/politics/cdc-shooting-staff.html",
    "summary": "Employees expressed horror at a shooting at the agency’s headquarters, and some said they viewed it as part of a pattern of threats and assaults on health workers."
  },
  {
    "title": "What We Know About the C.D.C. Shooting in Atlanta",
    "link": "https://www.nytimes.com/2025/08/10/us/cdc-shooting-atlanta.html",
    "summary": "A gunman who believed the Covid-19 vaccine had made him ill fired at the agency’s Atlanta offices, killing a police officer and rattling the public health community."
  },
  {
    "title": "Computer Science Grads Struggle to Find Jobs in the A.I. Age",
    "link": "https://www.nytimes.com/2025/08/10/technology/coding-ai-jobs-students.html",
    "summary": "As companies like Amazon and Microsoft lay off workers and embrace A.I. coding tools, computer science graduates say they’re struggling to land tech jobs."
  },
  {
    "title": "The Hidden Trauma of Jury Duty",
    "link": "https://www.nytimes.com/2025/08/10/well/the-hidden-trauma-of-jury-duty.html",
    "summary": "People who serve on disturbing cases can suffer mental health effects for years after a trial ends."
  },
  {
    "title": "If You Fly Economy, You’re Paying for Someone Else to Fly Private",
    "link": "https://www.nytimes.com/video/opinion/100000010331153/private-planes-faa.html",
    "summary": "The Times editorial board argues that Congress must change the Federal Aviation Administration’s funding structure."
  },
  {
    "title": "‘Acute, Sustained, Profound and Abiding Rage’: Canada Finds Its Voice",
    "link": "https://www.nytimes.com/2025/08/10/opinion/canada-america-allies.html",
    "summary": "America’s withdrawal from the global order is forcing former allies to rethink their identities."
  },
  {
    "title": "Jury Duties",
    "link": "https://www.nytimes.com/2025/08/10/briefing/jury-duty-mental-health-trauma.html",
    "summary": "Some jurors experience mental health effects years after a trial ends."
  },
  {
    "title": "Heavy Rains in Wisconsin Lead to Flooding and Early Closure of State Fair",
    "link": "https://www.nytimes.com/2025/08/10/us/wisconsin-flood-storms-rain.html",
    "summary": "Record-setting rainfall caused intense flooding in and around the Milwaukee area starting on Saturday night."
  },
  {
    "title": "Terry Reid, Rock Singer Known as ‘Superlungs,’ Dies at 75",
    "link": "https://www.nytimes.com/2025/08/10/arts/music/terry-reid-dead.html",
    "summary": "He missed his chance to be Led Zeppelin’s lead vocalist, but his solo work — and his otherworldly voice — drew raves from Aretha Franklin and others."
  },
  {
    "title": "Xi Looks to Tighten Grip After Scandals Shake China’s Military Elite",
    "link": "https://www.nytimes.com/2025/08/10/world/asia/china-military-corruption.html",
    "summary": "The Chinese leader’s crackdown on military corruption reveals how deep his concerns run, not only about battlefield readiness, but about political survival, as well."
  },
  {
    "title": "The 6 Social Security Myths That Won’t Go Away",
    "link": "https://www.nytimes.com/2025/08/10/business/social-security-retirement-myths.html",
    "summary": "The program gave birth to the idea of retirement and covers nearly all Americans — but now it faces major financial and customer service challenges."
  }
]