[
  {
    "title": "Which Senators Broke Ranks With Democrats to Advance the GOP Plan to End the Government Shutdown?",
    "link": "https://www.nytimes.com/2025/11/10/us/politics/senators-democrat-shutdown-vote.html",
    "summary": "Two of them are retiring, and none of the others face re-election in 2026."
  },
  {
    "title": "Age Is the Issue That Democrats Can’t Shut Down",
    "link": "https://www.nytimes.com/2025/11/10/us/politics/democrats-shutdown-age.html",
    "summary": "A restless Democratic base is seething at older leaders in Washington."
  },
  {
    "title": "Jeanne Shaheen Faces Shutdown Blowback From Her Daughter",
    "link": "https://www.nytimes.com/2025/11/10/us/politics/jeanne-shaheen-stefany-shutdown-deal.html",
    "summary": "Senator Jeanne Shaheen of New Hampshire voted to move to end the shutdown. But her daughter Stefany Shaheen, a congressional candidate in their state, sharply criticized the deal."
  },
  {
    "title": "Trump Tries to Seize ‘Affordability’ as Americans’ Economic Worries Grow",
    "link": "https://www.nytimes.com/2025/11/10/us/politics/trump-affordability-inflation-democrats.html",
    "summary": "The issue has buoyed Democrats and is resonating with an American electorate that is souring on the president’s economic agenda."
  },
  {
    "title": "How Syria’s President Transformed His Image",
    "link": "https://www.nytimes.com/video/world/middleeast/100000010515338/how-syrias-president-transformed-his-image.html",
    "summary": "Syrian President Ahmed al-Shara’s meeting with President Trump in Washington signifies a new turn for al-Shara, a former Islamist rebel leader who was once designated by the United States as a terrorist with a $10 million bounty on his head. Our reporter Christina Goldbaum describes the meeting."
  },
  {
    "title": "Syria’s President Meets Trump at White House for First Time",
    "link": "https://www.nytimes.com/2025/11/10/world/middleeast/syria-president-al-shara-trump-washington.html",
    "summary": "The visit by President Ahmed al-Shara is another step in the transformation of the former rebel leader once wanted by the United States as a terrorist."
  },
  {
    "title": "With SNAP on Hold, Low-Income Shoppers Cut Back and Businesses Worry",
    "link": "https://www.nytimes.com/2025/11/10/business/low-income-shoppers-spending-snap.html",
    "summary": "A delay in SNAP benefits mixed with a decline in foot traffic has many stores, restaurants and food producers concerned about sales."
  },
  {
    "title": "Supreme Court to Hear Major Challenge to Mail-In Ballot Laws",
    "link": "https://www.nytimes.com/2025/11/10/us/politics/supreme-court-mail-ballots-mississippi.html",
    "summary": "The justices agreed to hear a challenge to Mississippi’s law, a case that could upend similar measures in dozens of states before the 2026 election."
  },
  {
    "title": "Supreme Court Denies Request to Revisit Same-Sex Marriage Decision",
    "link": "https://www.nytimes.com/2025/11/10/us/politics/supreme-court-same-sex-marriage.html",
    "summary": "Kim Davis, a Kentucky county clerk who refused to issue same-sex marriage licenses, had asked the court to reconsider its landmark 2015 opinion."
  },
  {
    "title": "Marriage Ruling Relieves Gay Americans and Leaves Conservatives Pledging New Challenges",
    "link": "https://www.nytimes.com/2025/11/10/us/supreme-court-same-sex-marriage-reactions.html",
    "summary": "The Supreme Court chose not to revisit a case involving same-sex marriage. The number of married same-sex couples has doubled in the last 10 years."
  },
  {
    "title": "Prison Guards Shaved His Dreadlocks. The Supreme Court Seems Skeptical He Can Sue.",
    "link": "https://www.nytimes.com/2025/11/10/us/supreme-court-dreadlocks-prisoner.html",
    "summary": "Lower courts condemned the treatment of Damon Landor, a Rastafarian, but found that a federal law protecting religious rights barred him from suing prison officials for money."
  },
  {
    "title": "Why the BBC Is Facing Its Gravest Crisis in Decades",
    "link": "https://www.nytimes.com/2025/11/10/world/europe/bbc-news-trump.html",
    "summary": "The British public service broadcaster apologized on Monday for a misleadingly edited documentary about President Trump. But the scandal had already claimed two of its top executives."
  },
  {
    "title": "Trump Threatens to Sue the BBC for $1 Billion After Jan. 6 Documentary",
    "link": "https://www.nytimes.com/2025/11/10/world/europe/trump-bbc-lawsuit-documentary.html",
    "summary": "A lawyer for President Trump said the BBC’s editing of a speech he gave was “defamatory.” The broadcaster apologized on Monday for an “error in judgment.”"
  },
  {
    "title": "2025 Booker Prize Goes to David Szalay’s ‘Flesh’",
    "link": "https://www.nytimes.com/2025/11/10/books/booker-prize-2025-david-szalay-flesh.html",
    "summary": "The rags-to-riches tale had already made fans of Zadie Smith and Dua Lipa. Roddy Doyle, who chaired the judging panel, called the book “singular” and “extraordinary.”"
  },
  {
    "title": "M.L.B. Limits Bets on Individual Pitches After Gambling Charges",
    "link": "https://www.nytimes.com/2025/11/10/nyregion/mlb-prop-bet-pitches-limits.html",
    "summary": "Two Cleveland pitchers were accused of colluding with bettors. The league and its gambling company partners have put a $200 limit on wagers on individual pitches."
  },
  {
    "title": "Microbets, Parlays and Prop Bets: A Guide to the M.L.B. Gambling Scandal",
    "link": "https://www.nytimes.com/2025/11/10/nyregion/mlb-nba-gambling-microbets.html",
    "summary": "Federal prosecutors say two pitchers for the Cleveland Guardians tipped off bettors about what pitches they would throw, setting up rigged “microbets.” M.L.B. moved to limit such bets."
  },
  {
    "title": "At COP30 in Belém, Brazil, Chinese Technology Is Shifting Climate Politics",
    "link": "https://www.nytimes.com/2025/11/10/climate/cop30-belem-climate-energy-technology-china.html",
    "summary": "At this year’s climate summit, the United States is out and Europe is struggling. But emerging countries are embracing renewable energy thanks to a glut of cheap equipment."
  },
  {
    "title": "F.D.A. Will Remove Black Box Warnings From Hormone Treatments for Menopause",
    "link": "https://www.nytimes.com/2025/11/10/health/fda-hormone-replacement-menopause.html",
    "summary": "The benefits of hormone replacement have been underappreciated, Dr. Marty Makary, the agency’s commissioner, said on Monday. Critics described evidence for the change as insufficient."
  },
  {
    "title": "Chi Ossé Plans to Challenge Jeffries, Despite Mamdani’s Opposition",
    "link": "https://www.nytimes.com/2025/11/10/nyregion/chi-osse-hakeem-jeffries.html",
    "summary": "Chi Ossé, a New York City councilman, has told allies he is preparing to challenge Representative Hakeem Jeffries, the Democratic leader of the House."
  },
  {
    "title": "Mamdani Fills 2 Top Posts With Government Veteran and Trusted Aide",
    "link": "https://www.nytimes.com/2025/11/10/nyregion/mamdani-fuleihan-deputy-mayor.html",
    "summary": "The mayor-elect named Dean Fuleihan, a government veteran, to be his first deputy mayor. Elle Bisgaard-Church will serve as his chief of staff."
  },
  {
    "title": "A MAGA Senator Promised Hope for a Dying Ohio Mill. Then Reality Set In.",
    "link": "https://www.nytimes.com/2025/11/09/business/ohio-paper-mill-private-equity.html",
    "summary": "The town’s unionized workers wanted to believe that there was something better than what private equity owners had offered."
  },
  {
    "title": "Families of Children Killed in Texas Floods Sue Camp Mystic, Claiming Gross Negligence",
    "link": "https://www.nytimes.com/2025/11/10/us/camp-mystic-lawsuit.html",
    "summary": "Parents of campers and counselors who died in the July 4 Texas floods said the camp leadership did little before mounting “a hopeless ‘rescue’ effort from its self-created disaster.”"
  },
  {
    "title": "The 20-Somethings Who Raised $121 Million to Build Military Drones",
    "link": "https://www.nytimes.com/2025/11/10/business/neros-military-drones.html",
    "summary": "Neros, a company founded in 2023 by former teenage drone racers, won a coveted Army contract and is gaining popularity in the defense sector."
  },
  {
    "title": "The Post-Cold War Era Is Over. What Should We Call This New One?",
    "link": "https://www.nytimes.com/2025/11/10/opinion/era-technology-poly-epoch.html",
    "summary": "We have arrived at a “Polycene” moment where binary systems are giving way to multiple interconnected ones."
  },
  {
    "title": "What Were Democrats Thinking?",
    "link": "https://www.nytimes.com/2025/11/10/opinion/government-shutdown-democrats-republicans.html",
    "summary": "This is how the shutdown ends?"
  },
  {
    "title": "Congress Moves Closer to Ending the Shutdown",
    "link": "https://www.nytimes.com/2025/11/10/briefing/congress-moves-to-end-the-shutdown.html",
    "summary": "Also, the Supreme Court declined to hear a challenge to same-sex marriage. Here’s the latest at the end of Monday."
  },
  {
    "title": "Jonathan Braun, Felon Freed by Trump, to Be Sentenced Again in Brooklyn",
    "link": "https://www.nytimes.com/2025/11/10/nyregion/jonathan-braun-resentencing.html",
    "summary": "A Brooklyn federal judge found that Jonathan Braun had violated the rules of his release by assaulting a nanny, swinging an IV pole at a nurse and dodging tolls in luxury cars."
  },
  {
    "title": "Warren Buffett’s Berkshire Hathaway Farewell: ‘I’m Going Quiet’",
    "link": "https://www.nytimes.com/2025/11/10/business/warren-buffett-berkshire-farewell.html",
    "summary": "In one of his final missives as the company’s leader, Mr. Buffett said he would accelerate his plans to disburse his fortune to his children’s foundations."
  },
  {
    "title": "Sean ‘Diddy’ Combs Could Trim Prison Sentence With Drug Rehab Program",
    "link": "https://www.nytimes.com/2025/11/10/arts/music/sean-combs-diddy-fort-dix-drug-program.html",
    "summary": "A spokesman for the fallen music mogul, who is serving a four-year sentence for prostitution-related offenses at the Fort Dix prison complex in New Jersey, said he has been accepted to the program."
  },
  {
    "title": "Canada Lost Its Measles Elimination Status. What Does It Mean for the U.S.?",
    "link": "https://www.nytimes.com/2025/11/10/world/canada/canada-measles-what-to-know.html",
    "summary": "The disease was once considered eliminated in Canada, but not any more — there have been more than 5,000 cases in the last 12 months as vaccination rates have fallen."
  }
]