[
  {
    "title": "Trump Signs Bill to End Government Shutdown",
    "link": "https://www.nytimes.com/2025/11/12/us/politics/government-shutdown-vote-trump.html",
    "summary": "President Trump signed the bill ending the shutdown after 43 days, after the House approved it, largely on party lines."
  },
  {
    "title": "As Shutdown Ends, When Will SNAP and Air Travel Be Back to Normal?",
    "link": "https://www.nytimes.com/2025/11/12/us/shutdown-travel-snap-backpay.html",
    "summary": "Some programs like SNAP could be restored within hours, while other effects could take longer to unravel."
  },
  {
    "title": "The Shutdown Is Over. But for Federal Workers, the Anxiety Persists.",
    "link": "https://www.nytimes.com/2025/11/13/us/politics/shutdown-federal-workers-aftermath.html",
    "summary": "After being sidelined for more than a month, they are bracing for the backlog that awaits them and struggling with the financial burden of going without pay."
  },
  {
    "title": "How the Government Will Reopen, and What’s in the Epstein Emails",
    "link": "https://www.nytimes.com/2025/11/13/podcasts/the-headlines/government-re-open-epstein-emails.html",
    "summary": "Plus, the penny’s last day."
  },
  {
    "title": "After Trump Split, Epstein Said He Could ‘Take Him Down’",
    "link": "https://www.nytimes.com/2025/11/12/us/epstein-emails-trump.html",
    "summary": "Jeffrey Epstein cast himself as a Trump insider and wanted to leverage potentially damaging information about the president and his business dealings, according to emails with associates."
  },
  {
    "title": "What Epstein’s Emails Claim About Trump’s Knowledge of His Conduct",
    "link": "https://www.nytimes.com/2025/11/12/us/politics/epstein-emails-trump.html",
    "summary": "The House Oversight Committee on Wednesday released more than 20,000 pages of documents from Jeffrey Epstein’s estate. Times reporters provide context on key emails."
  },
  {
    "title": "What’s Behind the Coming House Vote on Releasing the Epstein Files",
    "link": "https://www.nytimes.com/2025/11/13/us/politics/house-vote-epstein-files.html",
    "summary": "Proponents of fuller transparency used an arcane rule to prod their leaders to act. When it became clear they had succeeded, the speaker agreed to hold a vote."
  },
  {
    "title": "Michael Wolff, Chronicler of Elites, Provided Epstein With Advice on Trump",
    "link": "https://www.nytimes.com/2025/11/12/business/media/michael-wolff-epstein-trump-emails.html",
    "summary": "Mr. Wolff was enough of an insider to provide advice to Jeffrey Epstein on how to handle his dealings with Donald J. Trump."
  },
  {
    "title": "Trump Administration Expected to Drastically Cut Housing Grants",
    "link": "https://www.nytimes.com/2025/11/12/us/politics/trump-homeless-funding.html",
    "summary": "In a major shift, HUD’s plan would direct most of the $3.5 billion in homelessness funds away from Housing First to programs that prioritize work and drug treatment."
  },
  {
    "title": "How Pakistan’s Spending Blitz Helped Win Over Trump and Flip U.S. Policy",
    "link": "https://www.nytimes.com/2025/11/13/world/asia/pakistan-trump-lobbying.html",
    "summary": "As Pakistan has hired lobbyists with close ties to President Trump, it has also received favorable tariff treatment and unique access in Washington."
  },
  {
    "title": "Comey and James Challenge Appointment of Trump Loyalist Overseeing Their Prosecutions",
    "link": "https://www.nytimes.com/2025/11/13/us/politics/lindsey-halligan-trump-attorney-court-challenge.html",
    "summary": "The outcome could have serious consequences for the cases against two of President Trump’s opponents, James B. Comey, the former F.B.I. director, and Letitia James, the New York attorney general."
  },
  {
    "title": "Ukraine’s Dilemma as Pokrovsk Teeters: Save Lives or Keep Holding On",
    "link": "https://www.nytimes.com/2025/11/13/world/europe/ukraine-pokrovsk-russia-battle.html",
    "summary": "Military analysts and some Ukrainian commanders worry that Kyiv may be repeating the mistake of staying in an embattled city longer than it should, aiming to inflict far more casualties than it suffers."
  },
  {
    "title": "I Watched This Haven From War Turn Into a Besieged Wasteland",
    "link": "https://www.nytimes.com/2025/11/13/world/europe/ukraine-russia-pokrovsk.html",
    "summary": "The Ukrainian city of Pokrovsk is on the verge of becoming another shattered trophy for the Russian Army."
  },
  {
    "title": "In Explaining His Gaffe, Heritage Foundation Leader Pleads Ignorance",
    "link": "https://www.nytimes.com/2025/11/13/us/politics/in-explaining-his-gaffe-heritage-foundation-leader-pleads-ignorance.html",
    "summary": "Kevin Roberts, under fire for defending Tucker Carlson’s interview with a white nationalist, said that he did not keep up with the news and that he had simply read an aide’s script."
  },
  {
    "title": "Catholic Bishops Rebuke Trump’s Immigration Tactics in Rare Statement",
    "link": "https://www.nytimes.com/2025/11/12/us/bishops-trump-immigration.html",
    "summary": "In a rare statement, the bishops framed the immigration crisis in starkly moral terms. “We feel compelled now in this environment to raise our voices in defense of God-given human dignity,” they said."
  },
  {
    "title": "How France Remembers the November 2015 Terrorist Attacks in Paris",
    "link": "https://www.nytimes.com/2025/11/13/world/europe/france-paris-terrorist-attacks-anniversary.html",
    "summary": "A decade ago, Islamic State militants killed 130 people in an assault that shocked France. Some survivors are still struggling, but for many of their compatriots, memories of the attacks are growing more distant."
  },
  {
    "title": "Will People Trust Voting by Phone? Alaska Is Going to Find Out.",
    "link": "https://www.nytimes.com/2025/11/13/us/politics/alaska-phone-voting-anchorage.html",
    "summary": "Anchorage will experiment with internet voting in local elections, betting that its ease and security will win over voters even in an era of election conspiracy theories."
  },
  {
    "title": "The Luxury Electric Vehicle Is in Trouble",
    "link": "https://www.nytimes.com/2025/11/13/business/luxury-electric-vehicles.html",
    "summary": "Sales of expensive battery-powered cars like the Ford F-150 Lightning have stalled, forcing automakers to slow production and offer more affordable vehicles."
  },
  {
    "title": "In the Faroe Islands’ Soccer Team, the Players Also Have Day Jobs",
    "link": "https://www.nytimes.com/2025/11/13/world/europe/this-scrappy-soccer-team-has-a-cinderella-chance-at-making-the-world-cup.html",
    "summary": "The Faroe Islands, rugged green specks in the North Atlantic, are an underdog. Most of the guys on the team have day jobs."
  },
  {
    "title": "Michelle Obama’s New Book Is a Historical Document Dressed Up as a Coffee-Table Tome",
    "link": "https://www.nytimes.com/2025/11/12/style/michelle-obama-the-look.html",
    "summary": "“The Look” should be studied by generations to come, not because of what it reveals about fashion, but politics."
  },
  {
    "title": "Welcome to the Washington Demolition Derby",
    "link": "https://www.nytimes.com/2025/11/13/opinion/trump-elections-virginia-new-york.html",
    "summary": "And yet, a little, precious seedling of hope is emerging."
  },
  {
    "title": "Trump v. James and Maurene Comey",
    "link": "https://www.nytimes.com/2025/11/13/opinion/trump-comey-james-maurene.html",
    "summary": "The legal precedent established by Maurene Comey’s case may turn out to be far more consequential than the finding in her father’s."
  },
  {
    "title": "Epstein’s Emails",
    "link": "https://www.nytimes.com/2025/11/13/briefing/epsteins-emails.html",
    "summary": "Congress released new files from the Epstein investigation. We explain what they mean."
  },
  {
    "title": "Late Night Pops Off on Trump Popping Up in Epstein Email Thread",
    "link": "https://www.nytimes.com/2025/11/13/arts/television/late-night-trump-epstein-emails.html",
    "summary": "Josh Johnson said that Jeffrey Epstein’s references to President Trump might not mean much: “Maybe the email was about how Trump never comes to his sex parties — rude.”"
  },
  {
    "title": "Calvin Duncan, Self-Taught Jailhouse Lawyer, Runs for Court Clerk in New Orleans",
    "link": "https://www.nytimes.com/2025/11/13/us/calvin-duncan-jailhouse-lawyer-new-orleans-louisiana.html",
    "summary": "Calvin Duncan was cleared of murder after he became a legal authority in prison. In New Orleans, his campaign for clerk of criminal court has struck a nerve."
  },
  {
    "title": "Erik Bottcher Joins Crowded House Primary to Succeed Nadler",
    "link": "https://www.nytimes.com/2025/11/13/nyregion/erik-bottcher-congress-nadler-schlossberg.html",
    "summary": "Erik Bottcher, a Democrat from Chelsea, began his career as an L.G.B.T.Q. rights activist. He faces a growing field of rivals vying for a Manhattan House seat."
  },
  {
    "title": "A BlackRock-Backed Roofing Conglomerate Goes Bust",
    "link": "https://www.nytimes.com/2025/11/13/business/economy/private-equity-roofers-contractors-blackrock.html",
    "summary": "Investment firms are buying and bundling contractors, leaving some workers and customers worse off."
  },
  {
    "title": "California Rain Forecast Suddenly Intensifies, Raising Flooding Risks",
    "link": "https://www.nytimes.com/2025/11/12/weather/california-storm-la-san-francisco-rain-forecast.html",
    "summary": "The storm is expected to move quickly through Northern California, but forecasters are concerned that it will stall in the southern part of the state."
  }
]