[
  {
    "title": "Intel Agrees to Sell U.S. a 10% Stake in Its Business",
    "link": "https://www.nytimes.com/2025/08/22/technology/trump-intel-stake.html",
    "summary": "The deal is among the largest government interventions in a U.S. company since the rescue of the auto industry after the 2008 financial crisis."
  },
  {
    "title": "Nvidia Is Making a New Chip for China Amid Debate on AI Exports",
    "link": "https://www.nytimes.com/2025/08/22/business/jensen-huang-nvidia-china.html",
    "summary": "Jensen Huang, Nvidia’s chief executive, said he plans to ask the Trump administration’s permission to sell a more powerful chip to Chinese companies."
  },
  {
    "title": "Pentagon Fires the Defense Intelligence Agency Chief",
    "link": "https://www.nytimes.com/2025/08/22/us/politics/defense-intelligence-agency-chief-fired.html",
    "summary": "The move comes weeks after the agency drafted a preliminary report contradicting President Trump’s contention that U.S. strikes had “obliterated” nuclear sites in Iran."
  },
  {
    "title": "Search of Bolton’s Home Shows Uneasy Mix of Retribution and Law Enforcement",
    "link": "https://www.nytimes.com/2025/08/22/us/politics/trump-bolton-search-analysis.html",
    "summary": "It is not clear what evidence the authorities have that John Bolton mishandled classified information, but President Trump’s efforts to punish rivals immediately stoked questions about the investigation."
  },
  {
    "title": "San Francisco Had Avoided Trump’s Ire. Until Now.",
    "link": "https://www.nytimes.com/2025/08/22/us/politics/san-francisco-trump-cities.html",
    "summary": "The president focused on cities like Los Angeles and Washington as he deployed federal troops and railed against crime. But on Friday, in reference to San Francisco, he said, “We’ll clean that one up, too.”"
  },
  {
    "title": "Justice Department Releases Ghislaine Maxwell Interview Transcripts",
    "link": "https://www.nytimes.com/2025/08/22/us/politics/ghislaine-maxwell-doj-transcript-trump.html",
    "summary": "The transcripts and audio, covering two days of discussions between Ms. Maxwell and Todd Blanche, the Justice Department’s No. 2, are likely to raise as many questions as they answer."
  },
  {
    "title": "Justice Dept. Gives Congress Some Subpoenaed Epstein Files",
    "link": "https://www.nytimes.com/2025/08/22/us/politics/house-subpoena-epstein-files.html",
    "summary": "The G.O.P. chairman of a key House panel was forced to issue the subpoena after a few Republicans banded together with Democrats to push it through."
  },
  {
    "title": "Jerome Powell Suggests Fed Will Soon Cut Interest Rates in Jackson Hole Speech",
    "link": "https://www.nytimes.com/2025/08/22/business/powell-speech-jackson-hole-fed-inflation.html",
    "summary": "Jerome H. Powell said the “balance of risks” across the economy had started to shift, raising the odds the central bank lowers borrowing costs at its next meeting in September."
  },
  {
    "title": "What to Know About the Fed’s Lisa Cook and Mortgage Fraud Allegations",
    "link": "https://www.nytimes.com/2025/08/22/us/politics/trump-lisa-cook-fed-mortgage-fraud.html",
    "summary": "Trump administration officials have accused the Federal Reserve governor of mortgage fraud and called for her to resign."
  },
  {
    "title": "5 Dead After Tour Bus Crashes on Western New York Highway",
    "link": "https://www.nytimes.com/2025/08/22/nyregion/new-york-tour-bus-crash.html",
    "summary": "The bus, which was carrying 54 people to New York City from Niagara Falls, veered off the New York State Thruway near Buffalo."
  },
  {
    "title": "Abrego Garcia, Free From Tennessee Jail, Is Returning to Maryland, Lawyer Says",
    "link": "https://www.nytimes.com/2025/08/22/us/politics/abrego-garcia-free-maryland.html",
    "summary": "It remains unclear what will happen next to Kilmar Armando Abrego Garcia. The Justice Department has said that if he was released from custody in Tennessee, it would likely seek to re-deport him."
  },
  {
    "title": "DeSantis Says He Is Undeterred by Order Shutting Down Florida’s ‘Alligator Alcatraz’",
    "link": "https://www.nytimes.com/2025/08/22/us/desantis-florida-alligator-alcatraz.html",
    "summary": "A federal judge had ordered that much of the Florida immigration detention center be dismantled, a ruling Gov. Ron DeSantis called “preordained.”"
  },
  {
    "title": "With Close Associates Under Fire, Mayor Adams Remains Defiant",
    "link": "https://www.nytimes.com/2025/08/22/nyregion/adams-mamdani-nyc-mayor.html",
    "summary": "Mayor Eric Adams defended his administration and his re-election bid on Friday amid corruption charges against some of his closest allies."
  },
  {
    "title": "New York Is a Big City. Its Graft Has Become Small-Town Stuff.",
    "link": "https://www.nytimes.com/2025/08/22/nyregion/new-york-city-corruption.html",
    "summary": "The city’s corruption once had ambition to match its soaring skyscrapers. Indictments this week described cut-rate schemes with far lower returns — and there was that cash in a potato-chip bag."
  },
  {
    "title": "The White House Wants Indiana to Redistrict. Republicans There Are Split.",
    "link": "https://www.nytimes.com/2025/08/22/us/indiana-redistricting-congress-republicans.html",
    "summary": "As President Trump asks Republican-led states to redraw congressional maps, some Indiana conservatives are pushing back. “They should leave it alone,” one legislator said."
  },
  {
    "title": "How Redistricting Wars Could Give the G.O.P. Up to 7 Seats",
    "link": "https://www.nytimes.com/2025/08/22/us/redistricting-gerrymandering-texas-california-stakes.html",
    "summary": "As a handful of states have made moves and begun discussing redrawing their maps, here’s what’s at stake."
  },
  {
    "title": "Trump Officials Demand George Mason’s President Apologize Over Diversity",
    "link": "https://www.nytimes.com/2025/08/22/us/george-mason-president-diversity-investigation.html",
    "summary": "The Education Department said an investigation had found that the public university and its president had supported diversity programs that the department views as discriminatory."
  },
  {
    "title": "Education Department Backs Away From Program for Hispanic-Serving Colleges",
    "link": "https://www.nytimes.com/2025/08/22/us/education-department-hispanic-serving-universities.html",
    "summary": "The federal program supports universities with high numbers of Latino students. Trump officials said they wouldn’t defend it against a lawsuit, which could effectively end the program."
  },
  {
    "title": "Howard University President to Step Down This Month",
    "link": "https://www.nytimes.com/2025/08/22/us/howard-university-president-resignation.html",
    "summary": "The historically Black university has faced the possibility of a Trump administration budget cut, and students were outraged over billing troubles."
  },
  {
    "title": "Is the Trump Administration Building Up to a Military Confrontation With Venezuela?",
    "link": "https://www.nytimes.com/2025/08/22/us/politics/trump-venezuela-drug-war.html",
    "summary": "A major increase in U.S. naval forces in the south Caribbean Sea has been underway since President Trump signed a directive targeting some cartels."
  },
  {
    "title": "Trump Begins Buildup of U.S. Naval Forces Outside Venezuela, but Many Remain Skeptical",
    "link": "https://www.nytimes.com/2025/08/22/world/americas/trump-venezuela-maduro-regime-change.html",
    "summary": "President Nicolás Maduro said Venezuela would not back down while facing a U.S. naval buildup. But many in the country doubt a confrontation will come at all."
  },
  {
    "title": "Amtrak’s Mardi Gras Train Returns, Joyfully, 20 Years After Katrina",
    "link": "https://www.nytimes.com/2025/08/22/us/politics/amtrak-gulf-coast-new-orleans-mobile-katrina.html",
    "summary": "Driving may be faster, but the inaugural train trips between Mobile, Ala., and New Orleans this week drew travelers eager for a different kind of adventure."
  },
  {
    "title": "Move Over, Mouse Ears: For Disney Adults, There’s a New Obsession",
    "link": "https://www.nytimes.com/2025/08/22/business/media/disney-shoulder-plush.html",
    "summary": "Tiny stuffed animals that use magnets to stay perched on your shoulder have become a must-have accessory for some theme park superfans."
  },
  {
    "title": "Trump Gets His Revenge on John Bolton. Who’s Next?",
    "link": "https://www.nytimes.com/2025/08/22/opinion/trump-john-bolton-raid.html",
    "summary": "The recent F.B.I. search of John Bolton’s home makes clear that President Trump is perverting the justice system to intimidate his critics."
  },
  {
    "title": "Why Epstein’s Furious Grip on Washington Holds",
    "link": "https://www.nytimes.com/2025/08/22/opinion/democrats-republicans-epstein.html",
    "summary": "It isn’t just members of the MAGA faithful who are feeling let down."
  },
  {
    "title": "F.B.I. Searched Home of John Bolton, a Former Trump Adviser",
    "link": "https://www.nytimes.com/2025/08/22/briefing/fbi-searched-home-of-john-bolton-a-former-trump-adviser.html",
    "summary": "Also, the Fed chair signaled that interest rates could soon come down. Here’s the latest at the end of Friday."
  },
  {
    "title": "Elon Musk’s X Agrees to Settlements With Thousands of Former Employees",
    "link": "https://www.nytimes.com/2025/08/22/technology/elon-musk-x-settlements.html",
    "summary": "The settlements are an about-face for the billionaire, whose company fought with former workers over whether it owed them severance pay."
  },
  {
    "title": "Ron Turcotte, Who Rode Secretariat to the Triple Crown, Dies at 84",
    "link": "https://www.nytimes.com/2025/08/22/sports/horse-racing/ron-turcotte-dead.html",
    "summary": "With Turcotte in the saddle, Secretariat powered to victory in the Kentucky Derby and the Preakness in 1973 and then demolished the competition in the Belmont Stakes."
  },
  {
    "title": "Erik Menendez Denied Parole: 4 Takeaways From the Hearing",
    "link": "https://www.nytimes.com/2025/08/22/us/takeaways-menendez-brothers-parole.html",
    "summary": "Lyle Menendez has his hearing Friday. Several of the concerns raised in denying parole to Erik suggest Lyle faces considerable hurdles in his own bid for release."
  },
  {
    "title": "Covid Vaccine Opponent Tapped to Lead Federal Review Team",
    "link": "https://www.nytimes.com/2025/08/22/health/covid-vaccines-rfk.html",
    "summary": "Panel members have been given a broad mandate, despite pleas from C.D.C. employees asking Robert F. Kennedy Jr. to stop spreading misinformation."
  }
]