[
  {
    "title": "Jobs Report Shows U.S. Hiring Slowed One Year Into Trump’s Second Term",
    "link": "https://www.nytimes.com/2026/01/09/us/politics/us-hiring-economy-trump-second-term.html",
    "summary": "As economists pointed to some of the president’s policies to explain the latest Labor Department data, White House aides sought to make the case for optimism in the new year."
  },
  {
    "title": "U.S. Hiring Continues at Modest Pace, but Weaknesses Are Evident",
    "link": "https://www.nytimes.com/2026/01/05/business/economy/business-economy-jobs-report-december.html",
    "summary": "The unemployment rate fell in December, but job growth across 2025 was the lowest in five years."
  },
  {
    "title": "Trump Urges Oil Companies to Speed Work in Venezuela",
    "link": "https://www.nytimes.com/2026/01/09/world/americas/trump-oil-venezuela.html",
    "summary": "The president met with executives on a day when the U.S. seized another tanker carrying Venezuelan oil."
  },
  {
    "title": "GOP Seeks Some Distance From Trump as Midterm Election Year Opens",
    "link": "https://www.nytimes.com/2026/01/09/us/politics/congress-republicans-trump-distancing.html",
    "summary": "The vote to open a war powers debate, a pair of attempted veto overrides and a split on health care suggested a greater appetite among Republicans to challenge the president."
  },
  {
    "title": "Outside Prisons in Caracas, Venezuelans Anxiously Await Release of More Political Detainees",
    "link": "https://www.nytimes.com/2026/01/09/world/americas/caracas-venezuela-prisoners-released.html",
    "summary": "Venezuela’s interim government said it would release an “important number” of imprisoned people, but only nine have been confirmed freed."
  },
  {
    "title": "E.U. and South America to Form Free-Trade Zone With 700 Million People",
    "link": "https://www.nytimes.com/2026/01/09/business/economy/european-union-mercosur-trade.html",
    "summary": "The agreement represents a push for deeper global cooperation, in contrast to the United States’ turning to coercion in its dealings with other countries."
  },
  {
    "title": "Iran Convulsed in Second Night of Nationwide Protests",
    "link": "https://www.nytimes.com/2026/01/09/world/middleeast/iran-protests.html",
    "summary": "Large marches against the government occurred despite an internet blackout and threats of a severe crackdown."
  },
  {
    "title": "A Look at Iran’s Antigovernment Protests",
    "link": "https://www.nytimes.com/video/world/middleeast/100000010627398/a-look-at-irans-antigovernment-protests.html",
    "summary": "Protests have rocked Iran in recent weeks, and the country’s supreme leader has threatened to escalate a crackdown on demonstrators. Erika Solomon, our bureau chief for Iran and Iraq, discusses what’s fueling the protests with our senior writer Katrin Bennhold."
  },
  {
    "title": "What to Know About the Protests in Iran",
    "link": "https://www.nytimes.com/2026/01/03/world/middleeast/iran-protests-inflation-currency.html",
    "summary": "Galloping inflation, a currency crisis and anger at the regime have fueled demonstrations across the country."
  },
  {
    "title": "Washington National Opera Is Leaving the Kennedy Center",
    "link": "https://www.nytimes.com/2026/01/09/arts/music/washington-national-opera-kennedy-center.html",
    "summary": "The opera, which has performed at the arts center since 1971, was concerned about declines in attendance and donations during President Trump’s second term."
  },
  {
    "title": "Trump Threatens to Take Greenland ‘the Hard Way’",
    "link": "https://www.nytimes.com/2026/01/09/world/americas/trump-greenland-annex.html",
    "summary": "The president continued to advance an imperialist vision of American foreign policy, where the U.S. can dominate neighboring countries “whether they like it or not.”"
  },
  {
    "title": "Christopher Raia to Be FBI Deputy Director After Bongino’s Departure",
    "link": "https://www.nytimes.com/2026/01/09/us/politics/fbi-deputy-director-christopher-raia.html",
    "summary": "Even as the selection of a career agent, Christopher G. Raia, leaves an unusual three-person leadership structure in place, it returns a career agent to the No. 2 post."
  },
  {
    "title": "How Our White House Photographer Finds New Angles on the Oval Office",
    "link": "https://www.nytimes.com/2026/01/09/insider/trump-interview-doug-mills-photographer.html",
    "summary": "Doug Mills, winner of three Pulitzers, sits, crawls and hoists cameras high in the air to bring viewers fresh perspectives. He was at it again this week during our marathon interview with President Trump."
  },
  {
    "title": "Federal Officials Identify Pair Shot by Border Patrol in Portland, Ore.",
    "link": "https://www.nytimes.com/2026/01/09/us/portland-immigration-shooting.html",
    "summary": "The shooting during a traffic stop, a day after the killing of a woman in Minneapolis by an ICE agent, generated angry denunciations by local officials."
  },
  {
    "title": "Minnesota Leaders Say ICE Shooting Investigation Should Include State Agents",
    "link": "https://www.nytimes.com/2026/01/09/us/ice-shooting-investigation-minnesota-agents.html",
    "summary": "Federal authorities, who have launched an immigration enforcement blitz in Minnesota, said they will re-examine thousands of refugee cases in the state."
  },
  {
    "title": "Trump Officials Reopen Thousands of Refugee Claims in Minnesota",
    "link": "https://www.nytimes.com/2026/01/09/us/politics/minnesota-refugees-dhs-trump.html",
    "summary": "The review comes as the federal government escalates its immigration enforcement in the state."
  },
  {
    "title": "In the Path of a Raging Wildfire, a Luthier’s Precious Wood",
    "link": "https://www.nytimes.com/2026/01/09/arts/music/eaton-fire-mario-miralles-violin-cello.html",
    "summary": "Mario Miralles spent decades acquiring the spruce and maple for string instruments worthy of Yo-Yo Ma and Gustavo Dudamel. Then he was forced to evacuate."
  },
  {
    "title": "With Missile Strike on Ukraine, Putin Delivers a Warning to Europe",
    "link": "https://www.nytimes.com/2026/01/09/world/europe/putin-russia-ukraine-oreshnik-europe.html",
    "summary": "A nuclear-capable missile fired into Ukraine near Poland sent a message to Europe days after its leaders agreed to postwar security guarantees, Russian analysts said."
  },
  {
    "title": "Hessy Levinsons Taft, Jewish Baby on Cover of Nazi Magazine, Dies at 91",
    "link": "https://www.nytimes.com/2026/01/09/world/europe/hessy-levinsons-taft-dead.html",
    "summary": "Without her parents’ knowledge, her portrait was entered as a prank in a contest in 1935 to represent the ideal Aryan infant — and she won."
  },
  {
    "title": "Mamdani Responds Cautiously After the Police Kill 2 People in One Night",
    "link": "https://www.nytimes.com/2026/01/09/nyregion/mamdani-nypd-shootings.html",
    "summary": "Mayor Zohran Mamdani did not call the shootings justified, but said New York Police officers were placed in “incredibly difficult and dangerous circumstances.”"
  },
  {
    "title": "Mamdani Condemns Slurs and Pro-Hamas Chant at Heated Queens Protest",
    "link": "https://www.nytimes.com/2026/01/09/nyregion/mamdani-hamas-israel-gaza-protest.html",
    "summary": "Pro-Palestinian and pro-Israel demonstrators hurled threats at each other outside an event promoting real estate sales in Jerusalem. The mayor said those actions had “no place in our city.”"
  },
  {
    "title": "Mamdani’s First Big Move to Help Renters Is Dealt a Blow by Court",
    "link": "https://www.nytimes.com/2026/01/09/nyregion/mamdani-pinnacle-apartments.html",
    "summary": "Summit Properties USA won an auction on Friday to buy more than 5,000 apartments out of bankruptcy from the Pinnacle Group despite City Hall’s efforts to intervene."
  },
  {
    "title": "Trump Is Threatening Greenland and Europe",
    "link": "https://www.nytimes.com/2026/01/09/opinion/denmark-europe-aggression.html",
    "summary": "Any attempt to seize Greenland from Denmark would fatally undermine the world’s most successful military alliance."
  },
  {
    "title": "This Is Trump’s One Small Trick to Destroy American Democracy",
    "link": "https://www.nytimes.com/2026/01/09/opinion/venezuela-maduro-trump-oil.html",
    "summary": "The president is claiming borderless license to turn on his perceived enemies, both foreign and domestic."
  },
  {
    "title": "Trump Pressures Oil Giants to Invest in Venezuela",
    "link": "https://www.nytimes.com/2026/01/09/briefing/trump-oil-venezuela-protests-iran.html",
    "summary": "Also, protests spread across Iran. Here’s the latest at the end of Friday."
  },
  {
    "title": "Supreme Court Issues First Ruling of Term but Don’t Yet Get To Tariffs",
    "link": "https://www.nytimes.com/2026/01/09/us/politics/supreme-court-docket.html",
    "summary": "Only once in the modern era have the justices taken this long to issue their first decision — and when it came, it wasn’t the hotly anticipated case on President Trump’s tariffs."
  },
  {
    "title": "Measles Cases Spike in South Carolina",
    "link": "https://www.nytimes.com/2026/01/09/well/measles-outbreak-new-cases-south-carolina.html",
    "summary": "The outbreak has now spread to more than 300 people, most of them children."
  },
  {
    "title": "Yemeni Separatists Say They Are Disbanding, but Move Is in Dispute",
    "link": "https://www.nytimes.com/2026/01/09/world/middleeast/yemeni-separatists-disband.html",
    "summary": "A delegation from the Southern Transitional Council in Riyadh announced its dissolution, but members abroad rejected the news amid fears it was not voluntary."
  },
  {
    "title": "Prosecutor Asks for Owner of Swiss Bar Hit by Deadly Fire to Be Detained",
    "link": "https://www.nytimes.com/2026/01/09/world/europe/switzerland-fire-bar-owner-arrested.html",
    "summary": "The request came after hours of questioning of the bar’s co-owners. Some 40 people died in the fire that broke out during a New Year’s celebration."
  }
]