[
  {
    "title": "Agent Who Shot Renee Good in Minneapolis Was Trained to Track and Apprehend Fugitives",
    "link": "https://www.nytimes.com/2026/01/16/us/ice-agent-minneapolis-jonathan-ross.html",
    "summary": "From Iraq to ICE, Jonathan Ross’s career reflects a 20-year government effort to reshape immigration enforcement with a military mind-set."
  },
  {
    "title": "Video Analysis of ICE Shooting Sheds Light on Contested Moments",
    "link": "https://www.nytimes.com/2026/01/15/video/ice-shooting-renee-good-minneapolis-videos.html",
    "summary": "Newly available videos and existing footage synchronized and assessed by The Times provide a frame-by-frame look at how an ICE officer ended up shooting and killing a motorist in Minneapolis."
  },
  {
    "title": "Emergency Call Transcripts Record a Crisis Unfolding in Real Time",
    "link": "https://www.nytimes.com/2026/01/16/us/911-calls-minneapolis-ice-shooting.html",
    "summary": "The killing of Renee Good by an ICE agent was instantly reported to the Minneapolis Police. The calls reflect shock, fury and confusion."
  },
  {
    "title": "Renee Good Was Concerned About ICE, a Lawyer Says, but Wasn’t Following Agents",
    "link": "https://www.nytimes.com/2026/01/16/us/renee-good-minneapolis-ice-lawyer-interview.html",
    "summary": "A lawyer for Ms. Good’s family said she and her partner had encountered agents after school drop-off. Minutes later, she was dead."
  },
  {
    "title": "U.S. Lawmakers Meet With Danish Prime Minister on Greenland",
    "link": "https://www.nytimes.com/2026/01/16/us/politics/trump-greenland-denmark-lawmakers.html",
    "summary": "Seeking to calm tensions, Republicans and Democrats affirmed that they supported Denmark’s control of Greenland as President Trump vowed to buy it or take it over."
  },
  {
    "title": "Machado Presents Trump With Nobel Peace Prize",
    "link": "https://www.nytimes.com/2026/01/15/world/americas/machado-trump-meeting-nobel-peace-prize.html",
    "summary": "The Venezuelan opposition leader’s efforts to share her award with the U.S. president have shaken some Norwegians’ faith in their signature soft-power tool."
  },
  {
    "title": "The Nobel Peace Prize Medal Has Been Sold Before for Millions",
    "link": "https://www.nytimes.com/2026/01/15/world/americas/nobel-peace-prize-sold-auctions.html",
    "summary": "The Nobel Committee has said the prize cannot be transferred, but it has been sold in a few auctions over the award’s history."
  },
  {
    "title": "Even Nicolás Maduro’s Prosecutors Are Tied Up Reviewing Epstein Files",
    "link": "https://www.nytimes.com/2026/01/16/nyregion/epstein-maduro-sdny.html",
    "summary": "The Trump Administration’s exhaustive examination of materials on the convicted sex trafficker Jeffrey Epstein is drawing resources from other cases."
  },
  {
    "title": "C.I.A. Director Meets With Venezuela’s Interim President in Caracas",
    "link": "https://www.nytimes.com/2026/01/16/us/politics/cia-director-ratcliffe-venezuela.html",
    "summary": "The high-profile visit, which could be seen as snubbing the opposition, comes nearly two weeks after the U.S. military seized President Nicolás Maduro in a raid."
  },
  {
    "title": "Trump’s Fight With Minnesota Is About More Than Immigration",
    "link": "https://www.nytimes.com/2026/01/16/magazine/minnesota-liberalism-trump-ice.html",
    "summary": "The state embodies a civic ideal that the administration in Washington wants to discredit."
  },
  {
    "title": "‘Knight of the Seven Kingdoms,’ ‘Game of Thrones’ Prequel, Explores Dunk and Egg",
    "link": "https://www.nytimes.com/2026/01/16/arts/television/knight-of-the-seven-kingdoms-dunk-and-egg.html",
    "summary": "With no dragons and no warring dynasties, HBO’s “A Knight of the Seven Kingdoms” is the first test of whether the “Thrones” formula works on a human scale."
  },
  {
    "title": "Powell, an Unlikely Foil, Takes On Trump",
    "link": "https://www.nytimes.com/2026/01/16/us/politics/powell-trump-investigation.html",
    "summary": "Jerome H. Powell, the chair of the Federal Reserve, this week tapped a groundswell of support that has been years in the making."
  },
  {
    "title": "Trump Praises Hassett, but Casts Doubt on Making Him Fed Chair",
    "link": "https://www.nytimes.com/2026/01/16/business/trump-praises-hassett-but-casts-doubt-on-making-him-fed-chair.html",
    "summary": "The blowback set off by the Justice Department’s criminal investigation into Jerome H. Powell, the chair of the central bank, has shaken up the race to replace him."
  },
  {
    "title": "Washington National Opera Finds a Stage Outside Kennedy Center Amid Trump Tensions",
    "link": "https://www.nytimes.com/2026/01/16/arts/music/washington-national-opera-kennedy-center.html",
    "summary": "Spring performances of “Treemonisha” and “The Crucible” will be held at George Washington University."
  },
  {
    "title": "Iran Protests Quelled Since Deadly Crackdown, Residents Say",
    "link": "https://www.nytimes.com/2026/01/16/world/middleeast/iran-protests-deadly-crackdown.html",
    "summary": "“There is massive disappointment and disillusionment,” one Tehran resident said. A human rights group acknowledged that demonstrations had been subdued since Sunday, with thousands of people detained."
  },
  {
    "title": "Iran Has Had Protests Before. Will This Time Be Different?",
    "link": "https://www.nytimes.com/2026/01/16/world/middleeast/iran-protests-regime-change.html",
    "summary": "Understanding the factors that can topple regimes."
  },
  {
    "title": "Michael Saylor’s Creative Bitcoin Strategy Isn’t Working",
    "link": "https://www.nytimes.com/2026/01/16/business/michael-saylor-strategy-bitcoin.html",
    "summary": "Michael Saylor’s financial alchemy thrust an ordinary software company, Strategy, into the center of the crypto frenzy. It all worked spectacularly, until now."
  },
  {
    "title": "Ted Sarandos Says Critics Just Misunderstand Netflix",
    "link": "https://www.nytimes.com/2026/01/16/business/media/ted-sarandos-netflix.html",
    "summary": "The company’s co-chief executive sat down for an extensive interview for the first time since announcing plans to buy Warner Bros. Discovery’s film and TV business."
  },
  {
    "title": "Antiwar Russians in Europe Learn That They Must Watch Their Words",
    "link": "https://www.nytimes.com/2026/01/16/world/europe/leonid-volkov-lithuania.html",
    "summary": "A backlash over a rant against Ukrainian officials has raised questions about Eastern Europe’s welcome of Russian dissidents."
  },
  {
    "title": "What Happened to London Breed, the Former San Francisco Mayor?",
    "link": "https://www.nytimes.com/2026/01/16/us/london-breed-san-francisco-mayor-job.html",
    "summary": "London Breed has said little in the year since she left office. She has thoughts on the praise that the current mayor, Daniel Lurie, has received."
  },
  {
    "title": "Virginia Poised to Redraw House Maps That Could Set Democrats Up for a Win",
    "link": "https://www.nytimes.com/2026/01/16/us/virginia-house-democrats-congressional-maps.html",
    "summary": "A vote by the state senate on Friday could send an amendment to voters that, if approved, would allow the legislature to gerrymander the state."
  },
  {
    "title": "Former Senator Kyrsten Sinema Accused of Affair With Member of Security Team",
    "link": "https://www.nytimes.com/2026/01/15/us/politics/kyrsten-sinema-affair-lawsuit.html",
    "summary": "In a lawsuit, the ex-wife of Ms. Sinema’s onetime staff member accused her of showering him with gifts and breaking up their marriage."
  },
  {
    "title": "Nurses Describe Fear on the Job as Bitter Strike Enters Fifth Day",
    "link": "https://www.nytimes.com/2026/01/16/nyregion/nyc-nurses-strike-negotiations-safety.html",
    "summary": "Both sides in the labor dispute appear poised for a protracted battle, and only one of three hospitals was negotiating with the strikers."
  },
  {
    "title": "Dear Trump, Buying Greenland Is a Bad Idea",
    "link": "https://www.nytimes.com/2026/01/16/opinion/greenland-denmark-trump-history.html",
    "summary": "Trump wants Greenland? Its previous colonizer has some thoughts."
  },
  {
    "title": "The Right Is Furious With Liberal White Women",
    "link": "https://www.nytimes.com/2026/01/16/opinion/republicans-ice-white-women.html",
    "summary": "In the MAGA imagination, white women are supposed to be helpmeets, not harpies."
  },
  {
    "title": "Where Scams Come From",
    "link": "https://www.nytimes.com/2026/01/16/briefing/where-scams-come-from.html",
    "summary": "We take a look at some remarkable reporting from Myanmar."
  },
  {
    "title": "Tell Us About Your Grand Romantic Gestures",
    "link": "https://www.nytimes.com/2026/01/16/well/family/tell-us-about-your-grand-romantic-gestures.html",
    "summary": "From the over-the-top marriage proposals to the thoughtful surprises that made a huge impact."
  },
  {
    "title": "Cold and Snow Forecast Across the East Coast This Weekend",
    "link": "https://www.nytimes.com/2026/01/16/weather/snow-cold-forecast-us-south.html",
    "summary": "Abnormally blustery temperatures this weekend could usher in snowy weather across the East. Exactly where remains uncertain, but even the Deep South is on alert."
  },
  {
    "title": "Your Tax Refund Could Be Taken if You’ve Defaulted on Student Loans: What to Know",
    "link": "https://www.nytimes.com/2026/01/16/your-money/tax-refunds-student-loans-default.html",
    "summary": "Millions of people are at risk of the government’s seizing their refunds to pay what is owed on student loans."
  },
  {
    "title": "If the Volcanic Eruption Doesn’t Scare You, the Mudflow Should",
    "link": "https://www.nytimes.com/2026/01/16/science/mount-rainier-lahar-mudflow.html",
    "summary": "Studying tree rings helped scientists pinpoint when Mount Rainier last sent a lahar down its steep slopes, which could help planners anticipate future mudflows."
  }
]