[
  {
    "title": "Senate G.O.P. Gambles Its Legacy and Political Fate on Bill",
    "link": "https://www.nytimes.com/2025/07/01/us/politics/senate-republicans-bill.html",
    "summary": "The sprawling legislation that Republicans expended extraordinary effort to muscle through the Senate was a high-stakes risk that is likely to have major consequences for the party and the country."
  },
  {
    "title": "Poorest Americans Would Be Hurt By Trump’s Big Bill",
    "link": "https://www.nytimes.com/2025/07/01/business/poor-americans-senate-legislation.html",
    "summary": "Small improvements in taxes are overshadowed by cuts to health insurance and other federal aid, resulting in a package favoring the wealthy."
  },
  {
    "title": "Paramount to Pay Trump $16 Million to Settle ‘60 Minutes’ Lawsuit",
    "link": "https://www.nytimes.com/2025/07/02/business/media/paramount-trump-60-minutes-lawsuit.html",
    "summary": "President Trump had sued over an interview with former Vice President Kamala Harris. The company needs federal approval for a multibillion-dollar sale."
  },
  {
    "title": "CBS News President to Depart Amid Network’s Tensions With Trump",
    "link": "https://www.nytimes.com/2025/05/19/business/media/cbs-60-minutes-trump-wendy-mcmahon.html",
    "summary": "Wendy McMahon, the president of CBS News and Stations, had allied herself with Bill Owens, the “60 Minutes” executive producer who recently resigned."
  },
  {
    "title": "Penn Agrees to Limit Participation of Transgender Athletes",
    "link": "https://www.nytimes.com/2025/07/01/us/penn-title-ix-transgender-swimmer-trump.html",
    "summary": "In a deal with the Trump administration, the University of Pennsylvania will not allow transgender women to participate in women’s sports."
  },
  {
    "title": "Trump Withholds Nearly $7 Billion for Schools, With Little Explanation",
    "link": "https://www.nytimes.com/2025/07/01/us/trump-education-funds.html",
    "summary": "The money, which was allocated by Congress, helps pay for after-school programs, support for students learning English and other services."
  },
  {
    "title": "On Pivotal Day for His Bill, Trump Leaves Washington for ‘Alligator Alcatraz’",
    "link": "https://www.nytimes.com/2025/07/01/us/elections/trump-bill-alligator-alcatraz.html",
    "summary": "President Trump’s visit to the migrant detention center in the Everglades was meant to highlight the issue that binds his party to him more than anything else — immigration."
  },
  {
    "title": "Social Security Backs Off Listing Living Migrants as Dead",
    "link": "https://www.nytimes.com/2025/07/01/us/politics/social-security-immigrants-dead.html",
    "summary": "Instead, the agency is flagging as “unverified” the Social Security numbers of thousands of people who lost their temporary legal status."
  },
  {
    "title": "Jury in Sean ‘Diddy’ Combs Trial Reaches Verdict on All Counts but Racketeering Conspiracy",
    "link": "https://www.nytimes.com/2025/07/01/arts/music/sean-combs-diddy-trial-partial-verdict.html",
    "summary": "The jury will keep deliberating on a racketeering conspiracy charge in the morning after saying there were “unpersuadable opinions on both sides.”"
  },
  {
    "title": "Kodak, Once the Picture of a Dying Brand, Is Having a Moment",
    "link": "https://www.nytimes.com/2025/06/30/nyregion/the-kodak-brand-gets-a-second-life.html",
    "summary": "The company’s name has become synonymous with a failure to adapt to the digital revolution. But overseas, its logo has become an unlikely retro fashion statement."
  },
  {
    "title": "Zohran Mamdani Wins N.Y.C. Mayoral Primary in Decisive 12-Point Victory",
    "link": "https://www.nytimes.com/2025/07/01/nyregion/mamdani-wins-mayor-primary-nyc.html",
    "summary": "Mr. Mamdani roundly defeated Andrew M. Cuomo in the Democratic contest, widening his primary-night lead by a significant margin once ranked-choice tabulations were run."
  },
  {
    "title": "New Yorkers Embraced Ranked-Choice Voting. Mamdani’s Win Proves It.",
    "link": "https://www.nytimes.com/2025/07/01/nyregion/ranked-choice-voting-nyc-mayor.html",
    "summary": "Here are five takeaways from New York City’s second experience with ranked-choice voting, and how it helped Zohran Mamdani secure a decisive victory."
  },
  {
    "title": "Trump Falsely Claims Mamdani Is an Illegal Immigrant and Threatens to Arrest Him",
    "link": "https://www.nytimes.com/2025/07/01/us/politics/trump-zohran-mamdani.html",
    "summary": "President Trump claimed that the New York mayoral candidate, a naturalized U.S. citizen, was “here illegally,” his latest effort to promote false conspiracy theories about political opponents."
  },
  {
    "title": "Lack of New U.S. Sanctions Allows Russia to Replenish Its War Chest",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/trump-russia-sanctions.html",
    "summary": "President Trump has issued no new restrictions on Russia this year, in effect allowing Moscow to acquire the money and materials it needs in its conflict with Ukraine."
  },
  {
    "title": "Trump Pauses Some Weapons Transfers to Ukraine",
    "link": "https://www.nytimes.com/2025/07/01/us/politics/trump-ukraine-weapons.html",
    "summary": "The White House cited Pentagon concerns that some American arms stockpiles were dwindling too low. Among the affected weapons were air defense systems, bombs, missiles and artillery rounds."
  },
  {
    "title": "Denmark Begins Drafting Women as Russian Threat Looms",
    "link": "https://www.nytimes.com/2025/07/01/world/europe/denmark-military-draft-women-russia.html",
    "summary": "The Nordic country for the first time has extended a lottery for compulsory military service to women in its latest move to expand its armed forces."
  },
  {
    "title": "Dalai Lama Tightens Grip on Reins of Succession in the Face of Chinese Pressure",
    "link": "https://www.nytimes.com/2025/07/02/world/asia/dalai-lama-successor-tibet-china.html",
    "summary": "The aging Tibetan spiritual leader is looking to prevent Beijing from taking advantage of a power vacuum that might arise after his death."
  },
  {
    "title": "Dalai Lama Succession: How the Next Tibetan Spiritual Leader Will Be Chosen",
    "link": "https://www.nytimes.com/2025/07/02/world/asia/next-dalai-lama-tibet.html",
    "summary": "The Tibetan spiritual leader may announce a succession plan intended to thwart Chinese interference."
  },
  {
    "title": "Trump Says Israel Agrees to Conditions for Gaza Cease-Fire Proposal",
    "link": "https://www.nytimes.com/2025/07/01/us/politics/trump-israel-gaza-ceasefire.html",
    "summary": "In a social media post, the president said the United States and Israel were finalizing a proposal to Hamas. The announcement comes ahead of Prime Minister Benjamin Netanyahu’s visit to Washington next week."
  },
  {
    "title": "Ali Shamkhani, Top Iran Official, Survived Israeli Strike",
    "link": "https://www.nytimes.com/2025/07/01/world/middleeast/iran-shamkhani-israel-attack.html",
    "summary": "Rear Adm. Ali Shamkhani was seen struggling to walk with a cane at a funeral procession this weekend for military commanders killed in the 12-day war."
  },
  {
    "title": "With CEQA Scaled Back, California Hopes for a Housing Boom",
    "link": "https://www.nytimes.com/2025/07/01/us/ceqa-california-housing.html",
    "summary": "After scaling back a landmark environmental law, Gov. Gavin Newsom and other state leaders are hoping for a construction boom."
  },
  {
    "title": "The Disaster That Just Passed the Senate",
    "link": "https://www.nytimes.com/2025/07/01/opinion/ezra-klein-podcast-matthew-yglesias.html",
    "summary": "Trump’s “big beautiful bill” would gut Medicaid, nutrition assistance and clean energy credits. All for what?"
  },
  {
    "title": "China Used to Emulate America. Now the Reverse Is True.",
    "link": "https://www.nytimes.com/2025/07/01/opinion/america-china-similarities-differences.html",
    "summary": "In the great dance between the two rivals, it’s getting harder to tell which of them is leading and which is following."
  },
  {
    "title": "Columbia Will Pay $9 Million to Settle Lawsuit Over U.S. News Ranking",
    "link": "https://www.nytimes.com/2025/07/01/nyregion/columbia-university-us-news-ranking.html",
    "summary": "Students said they had been overcharged for their educations as a result of incorrect data that they said the school had used to artificially inflate its ranking."
  },
  {
    "title": "Alabama Violated Constitutional Rights of Death Row Inmate, Appeals Court Rules",
    "link": "https://www.nytimes.com/2025/07/01/us/politics/death-penalty-retrial-alabama.html",
    "summary": "A federal appellate panel said that Michael Sockwell was eligible to be retried because prosecutors systematically eliminated Black potential jurors at his 1990 murder trial."
  },
  {
    "title": "The U.S. Sends Lots of Plastic Trash Overseas. Malaysia Just Said No Thanks.",
    "link": "https://www.nytimes.com/2025/07/01/climate/plastic-recycling-malaysia-import-ban.html",
    "summary": "No country receives more discarded plastic from wealthy countries, but shipments from the United States are no longer welcome."
  },
  {
    "title": "Lucy the Pig, a Celebrity on Staten Island, Can Stay at Home for Now",
    "link": "https://www.nytimes.com/2025/07/01/nyregion/lucy-pig-staten-island.html",
    "summary": "Health officials told Lucy’s owners that she would have to leave the city. After the family, the neighborhood and its political representatives protested, a temporary reprieve emerged."
  }
]