[
  {
    "title": "Trump’s Push for Election Power Raises Fears He Will ‘Subvert’ Midterms",
    "link": "https://www.nytimes.com/2026/02/25/us/politics/trump-elections-midterms.html",
    "summary": "The president appears to be undermining Americans’ faith in the outcome, at a moment when Republicans face an uphill climb to keep control of Congress."
  },
  {
    "title": "Casey Means, Surgeon General Nominee, Sidesteps Questions on Vaccines at Senate Hearing",
    "link": "https://www.nytimes.com/2026/02/25/us/politics/surgeon-general-casey-means-senate-hearing.html",
    "summary": "Dr. Casey Means, a wellness influencer, author and supporter of Health Secretary Robert F. Kennedy Jr., said that “anti-vaccine rhetoric has never been part” of her message."
  },
  {
    "title": "TSA PreCheck Is Back, but Global Entry Is Paused. What’s Going On?",
    "link": "https://www.nytimes.com/2026/02/25/travel/tsa-precheck-global-entry-2026-updates.html",
    "summary": "Blaming a partial government shutdown, officials suspended the expedited arrival program this week, but some travelers are seeing inconsistencies at airports."
  },
  {
    "title": "Epstein Files Are Missing Records About Woman Who Made Claim Against Trump",
    "link": "https://www.nytimes.com/2026/02/25/us/politics/trump-epstein-files.html",
    "summary": "Documents released by the Justice Department briefly mention a woman’s unverified accusation that Donald J. Trump assaulted her in the 1980s, when she was a minor. But several memos related to her account are not in the files."
  },
  {
    "title": "With Epstein Deposition, Hillary Clinton Is Again Answering for Bill Clinton’s Actions",
    "link": "https://www.nytimes.com/2026/02/25/us/politics/hillary-clinton-epstein-deposition.html",
    "summary": "The former first lady, senator and secretary of state had no dealings with Jeffrey Epstein but is once again under pressure to answer for the actions and relationships of her husband."
  },
  {
    "title": "Larry Summers Will Resign From Harvard After Jeffrey Epstein Revelations",
    "link": "https://www.nytimes.com/2026/02/25/us/larry-summers-resignation-harvard-epstein.html",
    "summary": "Mr. Summers, former president of the school, had stepped back from teaching after documents showed a closer relationship to Jeffrey Epstein than previously known. He will leave at the end of the academic year."
  },
  {
    "title": "Former Nebraska Sen. Bob Kerrey Resigns From Monolith Amid Epstein Emails",
    "link": "https://www.nytimes.com/2026/02/25/us/bob-kerrey-resignation-monolith-epstein.html",
    "summary": "Mr. Kerrey has left his role as chairman of the company, Monolith, after Justice Department documents showed he had met and corresponded with Jeffrey Epstein."
  },
  {
    "title": "Nvidia’s Quarterly Profit Hits $43 Billion on Strong A.I. Chip Sales",
    "link": "https://www.nytimes.com/2026/02/25/technology/nvidia-earnings.html",
    "summary": "Total profit for the fiscal year was $120 billion, the company said. Three years ago, it was just $4.4 billion."
  },
  {
    "title": "Super-Agers’ Brains Have a Special Ability, New Study Suggests",
    "link": "https://www.nytimes.com/2026/02/25/well/mind/super-agers-brain-neurons.html",
    "summary": "The findings may help explain why this group has such exceptional memory."
  },
  {
    "title": "F.B.I. Raids Home and Office of L.A.U.S.D. Chief Alberto Carvalho",
    "link": "https://www.nytimes.com/2026/02/25/us/fbi-raid-lausd-alberto-carvalho.html",
    "summary": "The investigation’s target was unclear. The school district is the nation’s second largest, and as superintendent, Alberto Carvalho has one of the highest-profile jobs in K-12 education."
  },
  {
    "title": "U.S. Will Offer Embassy Services in a West Bank Settlement for the First Time",
    "link": "https://www.nytimes.com/2026/02/25/world/middleeast/us-consular-services-israeli-settlements.html",
    "summary": "Palestinians and Israelis on the right and left all say that the move is a step toward legitimizing the Israeli settlements, which most of the world considers illegal."
  },
  {
    "title": "Writers Are Being Targeted by Scams. This Reporter Knows the Feeling.",
    "link": "https://www.nytimes.com/2026/02/25/books/review/publishing-scams.html",
    "summary": "From George Saunders to the National Book Foundation, the literary world has been besieged by fake requests. Just like me."
  },
  {
    "title": "Inside Tapalpa, the Town in Mexico Where El Mencho Made His Last Stand",
    "link": "https://www.nytimes.com/2026/02/25/world/americas/el-mencho-tapalpa-jalisco-cartel.html",
    "summary": "Times reporters visiting Tapalpa found a serene town in shock after Sunday’s raid on its outskirts left dozens dead and people fleeing. And, surprisingly, no police or military presence where the battle took place."
  },
  {
    "title": "In N.C. Senate Race, Democrats Bet Roy Cooper Can Beat Trump’s Endorsement",
    "link": "https://www.nytimes.com/2026/02/25/us/nc-senate-race-2026-roy-cooper.html",
    "summary": "The race is one of a handful of competitive Senate elections this year, but Democrats seem most confident about North Carolina, partly because their candidate, former Gov. Roy Cooper, has never been beaten."
  },
  {
    "title": "Texas Gov. Greg Abbott Spent Millions on Attack Ads Against Jasmine Crockett",
    "link": "https://www.nytimes.com/2026/02/25/us/greg-abbott-jasmine-crockett-texas-primary-ads.html",
    "summary": "Gov. Greg Abbott hopes the ads featuring the Democrat will galvanize Republican voter turnout in November."
  },
  {
    "title": "‘Tax the Rich’ Rally Draws 1,500 to Albany, but Not Mamdani or Hochul",
    "link": "https://www.nytimes.com/2026/02/25/nyregion/tax-the-rich-rally-new-york.html",
    "summary": "Busloads of New Yorkers flooded the State Capitol to press state leaders to raise taxes on corporations and high earners to help fund various initiatives."
  },
  {
    "title": "Everyone Hates This Highway. What’s the Best Way to Fix It?",
    "link": "https://www.nytimes.com/2026/02/25/nyregion/cross-bronx-expressway-nyc.html",
    "summary": "Community groups are opposing proposals to expand the decades-old Cross Bronx Expressway in favor of more limited repairs and improvements to local streets."
  },
  {
    "title": "M.T.A. Threatens to Sue Trump Over Delayed 2nd Avenue Subway Funding",
    "link": "https://www.nytimes.com/2026/02/25/nyregion/second-avenue-subway-mta.html",
    "summary": "The New York transportation authority said it would sue the Trump administration if it did not release more than $58 million in already-awarded funding by next week."
  },
  {
    "title": "45 Years After Failed Coup, Spain Declassifies Files About Why It Failed",
    "link": "https://www.nytimes.com/2026/02/25/world/europe/spain-coup-1981-files-revealed.html",
    "summary": "Ending more than four decades of conjecture, the Spanish government moved to publish documents from a long-secret investigation of a failed 1981 coup."
  },
  {
    "title": "Antonio Tejero Molina, 93, Dies; Spanish Colonel Led Failed Coup",
    "link": "https://www.nytimes.com/2026/02/25/world/europe/antonio-tejero-molina-dead.html",
    "summary": "He held Spain’s Parliament hostage for 18 hours on Feb. 23, 1981, before surrendering after it became clear that he had little support from the country’s armed forces."
  },
  {
    "title": "The Rise and Fall of a Notorious Florida Nudist Colony",
    "link": "https://www.nytimes.com/2026/02/25/realestate/florida-nudist-camp-for-sale.html",
    "summary": "The owners have put a 67-year-old nudist colony on the market, hoping a new steward can help it shed its troubled past."
  },
  {
    "title": "Ann Godoff, a Top Editor and Publisher of Best Sellers, Dies at 76",
    "link": "https://www.nytimes.com/2026/02/25/books/ann-godoff-dead.html",
    "summary": "Considered an “author’s publisher” at Random House and then Penguin, she cultivated the careers of dozens of celebrated novelists and nonfiction writers."
  },
  {
    "title": "Trump’s Fantasy State of the Union",
    "link": "https://www.nytimes.com/2026/02/25/opinion/ezra-klein-podcast-sotu-2026.html",
    "summary": "Ezra Klein and Aaron Retica react to Trump’s 2026 State of the Union speech."
  },
  {
    "title": "Trump’s Surgeon General Pick Sidesteps Questions on Vaccines",
    "link": "https://www.nytimes.com/2026/02/25/briefing/trump-surgeon-general-pick-cuba-boat-shooting.html",
    "summary": "Also, the Cuban Government says it killed four people aboard a U.S. boat. Here’s the latest at the end of Wednesday."
  },
  {
    "title": "BBC and BAFTA Say They Are Investigating After Broadcast of Racist Slur",
    "link": "https://www.nytimes.com/2026/02/25/world/europe/bbc-bafta-slur-apology-tourettes.html",
    "summary": "The awards organization and the broadcaster have ordered separate investigations into what led to airing the slur, which was shouted involuntarily during Sunday’s ceremony."
  },
  {
    "title": "How Bookbinders Helped the Nazis Track Holocaust Victims",
    "link": "https://www.nytimes.com/2026/02/24/world/europe/nazi-germany-bookbinders.html",
    "summary": "Conservation experts helped the Nazi regime inspect church and civil archives to track down people they sought to persecute, a researcher concluded."
  },
  {
    "title": "Data Shows Shift to Buyer’s Market",
    "link": "https://www.nytimes.com/2026/02/25/realestate/buyers-market-mortage-rates.html",
    "summary": "After years of bidding wars, there are now more sellers than buyers, forcing price cuts — even as high rates continue to narrow the entryway."
  },
  {
    "title": "Bird Flu Strikes California Elephant Seals for the First Time",
    "link": "https://www.nytimes.com/2026/02/25/science/bird-flu-elephant-seals.html",
    "summary": "Thirty seals, primarily weaned pups, have died since late last week, scientists said."
  }
]