[
  {
    "title": "When It Comes to Jeffrey Epstein, Trump Says He Is Ready to Defer to the Courts",
    "link": "https://www.nytimes.com/2025/07/18/us/politics/trump-epstein-letter-birthday-courts.html",
    "summary": "After months of pushing back against federal judges and the courts, the president has requested the release of Epstein-related grand jury testimony to be “subject to Court approval.”"
  },
  {
    "title": "Justice Dept. Asks Manhattan Court to Unseal Epstein Grand Jury Testimony",
    "link": "https://www.nytimes.com/2025/07/18/nyregion/trump-epstein-files-unsealing-request.html",
    "summary": "The president has been under intense political pressure from his base after Attorney General Pam Bondi withheld portions of investigative files on the disgraced financier."
  },
  {
    "title": "In Response to Epstein Letter Report, Trump Says He Doesn’t ‘Draw Pictures’",
    "link": "https://www.nytimes.com/2025/07/18/us/politics/trump-drawings-epstein.html",
    "summary": "The president disputes reporting from The Wall Street Journal that he drew a picture for Jeffrey Epstein, but as a real estate mogul, he often sketched for charity."
  },
  {
    "title": "Prisoner Swap Frees Americans in Venezuela for Migrants in El Salvador",
    "link": "https://www.nytimes.com/2025/07/18/world/americas/venezuela-us-prisoner-swap-migrants-el-salvador.html",
    "summary": "A deal freed 10 Americans and permanent U.S. residents detained in Venezuela, for more than 250 Venezuelans imprisoned in El Salvador after being expelled from the U.S."
  },
  {
    "title": "To Staff Trump’s Immigration Crackdown, ICE Entices Its Retirees",
    "link": "https://www.nytimes.com/2025/07/18/us/ice-recruit-retiree.html",
    "summary": "The administration is offering financial incentives to lure back recently departed immigration officers as it works to fill 10,000 job openings."
  },
  {
    "title": "Stephen Colbert’s ‘Late Show’ Was Losing Millions at CBS Before Cancellation",
    "link": "https://www.nytimes.com/2025/07/18/business/media/stephen-colbert-late-show-cbs.html",
    "summary": "CBS could not figure out a path to profitability in an entertainment world increasingly dominated by streaming."
  },
  {
    "title": "Lawmakers Question Whether CBS Canceled Colbert’s Show for Political Reasons",
    "link": "https://www.nytimes.com/2025/07/18/us/politics/stephen-colbert-canceled-trump-lawmakers.html",
    "summary": "Paramount, the network’s parent, recently agreed to pay President Trump $16 million to settle his lawsuit over the editing of an interview on the CBS News program “60 Minutes.”"
  },
  {
    "title": "Why Is Stephen Colbert’s ‘Late Show’ Getting Canceled?",
    "link": "https://www.nytimes.com/2025/07/18/arts/television/stephen-colbert-late-show-canceled-why.html",
    "summary": "Maybe the “Late Show” decision is purely financial. But after Paramount’s cave over “60 Minutes,” it is hard to trust."
  },
  {
    "title": "A Brief History of CBS’s Late-Night Eras",
    "link": "https://www.nytimes.com/2025/07/18/arts/television/cbs-late-night-shows-colbert-letterman.html",
    "summary": "With the hosts Merv Griffin, Pat Sajak, David Letterman and Stephen Colbert, CBS has taken many runs at late-night TV. Some were more successful than others."
  },
  {
    "title": "Rubio Restricts U.S. Criticism of Tainted Foreign Elections",
    "link": "https://www.nytimes.com/2025/07/18/us/politics/rubio-foreign-elections-cable.html",
    "summary": "A State Department cable telling officials to avoid comments on the “fairness or integrity” of most elections continues a U.S. turn away from promoting democratic values abroad."
  },
  {
    "title": "E.P.A. Says It Will Eliminate Its Scientific Research Arm",
    "link": "https://www.nytimes.com/2025/07/18/climate/epa-firings-scientific-research.html",
    "summary": "The decision comes after a Supreme Court ruling allowing the Trump administration to slash the federal work force and dismantle agencies."
  },
  {
    "title": "Gabbard Claims Obama Administration Tried to Undermine Trump in 2016",
    "link": "https://www.nytimes.com/2025/07/18/us/politics/gabbard-obama-trump-russia.html",
    "summary": "Democrats denounced a report issued by the Office of the Director of National Intelligence as politically motivated and error-ridden."
  },
  {
    "title": "White House to Release $1.3 Billion in Frozen Funds for After-School Programs",
    "link": "https://www.nytimes.com/2025/07/18/us/trump-after-school-funding.html",
    "summary": "The money will allow federally funded after-school programs to open this school year, preserving a lifeline for working parents. But other federal dollars remain on hold."
  },
  {
    "title": "Explosion at Los Angeles Training Center Kills 3 Sheriff’s Deputies",
    "link": "https://www.nytimes.com/2025/07/18/us/los-angeles-sheriff-center-explosion-deaths.html",
    "summary": "It was not immediately clear what caused the blast at the Los Angeles County Sheriff’s Department’s Biscailuz Training Academy center. No one else was injured, officials said."
  },
  {
    "title": "Mamdani Meets Jeffries in Brooklyn as He Seeks to Expand His Coalition",
    "link": "https://www.nytimes.com/2025/07/18/nyregion/zohran-mamdani-hakeem-jeffries.html",
    "summary": "No endorsement emerged from the meeting between Zohran Mamdani and Representative Hakeem Jeffries, but both said the gathering had been productive."
  },
  {
    "title": "How a Video Studio Embraced A.I. and Stormed the Internet",
    "link": "https://www.nytimes.com/2025/07/18/technology/dor-video-studio-ai.html",
    "summary": "The Dor Brothers are indie filmmakers whose viral videos are generated entirely by artificial intelligence."
  },
  {
    "title": "‘A Chorus Line’ and ‘Chicago’ at 50: Who Won?",
    "link": "https://www.nytimes.com/2025/07/18/theater/chicago-chorus-line-theater.html",
    "summary": "The slinky jailbirds and Broadway hopefuls in these two classic shows have been fighting it out since 1975."
  },
  {
    "title": "The Moves That Make ‘Chicago’ and ‘A Chorus Line’ So Special",
    "link": "https://www.nytimes.com/2025/07/18/theater/broadway-robyn-hurder-choreography-chicago.html",
    "summary": "To celebrate the shows’ golden anniversaries, the Broadway star Robyn Hurder demonstrates what makes their choreography so special."
  },
  {
    "title": "Felix Baumgartner, Skydiver Who Jumped From the Edge of Space, Dies Paragliding at 56",
    "link": "https://www.nytimes.com/2025/07/18/world/europe/felix-baumgartner-dead.html",
    "summary": "Nicknamed “Fearless Felix,” he jumped from the edge of space in 2012."
  },
  {
    "title": "Why Trump Can’t Shake Jeffrey Epstein",
    "link": "https://www.nytimes.com/2025/07/17/opinion/ezra-klein-podcast-will-sommer.html",
    "summary": "The journalist Will Sommer examines the perfect storm of the Epstein files, Trump, QAnon and MAGA."
  },
  {
    "title": "Stephen Colbert Could Never Save Us From Trump",
    "link": "https://www.nytimes.com/2025/07/18/opinion/colbert-late-show-cbs-trump.html",
    "summary": "Mocking Donald Trump will not destroy him."
  },
  {
    "title": "Trump Asked a Court to Unseal Epstein Grand Jury Testimony",
    "link": "https://www.nytimes.com/2025/07/18/briefing/trump-epstein-npr.html",
    "summary": "Also, Americans were released in a prisoner swap with Venezuela. Here’s the latest at the end of Friday."
  },
  {
    "title": "NY Agrees to Settle Ex-Cuomo Aide’s Harassment Claims for $450,000",
    "link": "https://www.nytimes.com/2025/07/18/nyregion/brittany-commisso-andrew-cuomo-settlement.html",
    "summary": "The former executive aide, Brittany Commisso, accused Andrew M. Cuomo of groping her when he was governor. The state did not admit wrongdoing."
  },
  {
    "title": "Minnesota State Senator Found Guilty in Burglary Trial",
    "link": "https://www.nytimes.com/2025/07/18/us/minnesota-lawmaker-burglary-conviction.html",
    "summary": "Nicole Mitchell, a Democrat, was charged with felonies and accused of breaking into her stepmother’s home. Her party holds a slim majority in the Minnesota Senate."
  },
  {
    "title": "Teen Charged With Murder in Killing of Paddleboarder in Maine",
    "link": "https://www.nytimes.com/2025/07/17/us/maine-arrest-paddleboarder-homicide.html",
    "summary": "Sunshine Stewart, 48, was found dead near 100 Acre Island after disappearing while paddle boarding in Union, Maine."
  }
]