[
  {
    "title": "How Keen Footwear Stays Ahead of Trump’s Shifting Tariffs",
    "link": "https://www.nytimes.com/2025/08/19/business/trump-tariffs-keen-footwear.html",
    "summary": "Keen Footwear has limited its exposure to supply chain trouble and opened a plant in Kentucky. But the trade upheaval has strained its adaptive strategy."
  },
  {
    "title": "The Rainforests Being Cleared to Build Your R.V.",
    "link": "https://www.nytimes.com/2025/08/19/world/asia/indonesia-borneo-deforestation-rv.html",
    "summary": "American demand for tropical wood that is used in motor homes, conservationists say, is accelerating the disappearance of some of the world’s largest forests."
  },
  {
    "title": "Economic Data Has Taken a Dark Turn. That Doesn’t Mean a Crash Is Near.",
    "link": "https://www.nytimes.com/2025/08/19/business/economy/us-economic-trends-unemployment-inflation.html",
    "summary": "Inflation is up and job creation down, but the U.S. economy could still pull through without too much pain."
  },
  {
    "title": "How Zelensky Made Progress With Trump",
    "link": "https://www.nytimes.com/video/world/europe/100000010348280/how-zelensky-made-progress-with-trump.html",
    "summary": "President Volodymyr Zelensky of Ukraine had a remarkably different White House visit on Monday than the ambush he walked into six months ago. Michael Schwirtz, the global intelligence correspondent for The New York Times, explains how President Zelensky courted President Trump and managed to put the ball back in Vladimir V. Putin’s court."
  },
  {
    "title": "Europe’s Leaders Headed Off Giveaway to Putin, but Emerged Without a Clear Path",
    "link": "https://www.nytimes.com/2025/08/19/world/europe/ukraine-trump-meeting-europe-leaders-war.html",
    "summary": "The leaders dropped everything to travel to Washington to ensure President Trump didn’t force a bad deal on Ukraine. A road map for peace remains elusive."
  },
  {
    "title": "‘I Want to Try and Get to Heaven’: Trump Gets Reflective on ‘Fox & Friends’",
    "link": "https://www.nytimes.com/2025/08/19/us/politics/trump-heaven.html",
    "summary": "President Trump cast his effort to broker peace in Ukraine in existential terms."
  },
  {
    "title": "He Tried to Endorse From the Pulpit. He Wound Up Without a Church.",
    "link": "https://www.nytimes.com/2025/08/19/us/politics/church-endorsements-irs-kenosha.html",
    "summary": "The I.R.S. says churches can now support candidates during services, but many denominations still forbid it. A Wisconsin pastor learned the hard way."
  },
  {
    "title": "Arkansas Housing Development Restricted to White Residents Sparks Legal Concerns",
    "link": "https://www.nytimes.com/2025/08/19/realestate/arkansas-white-housing-return-to-land.html",
    "summary": "Housing rights experts say a community restricted to white residents is illegal, but the creators believe they could win a potential challenge in court in the current political climate."
  },
  {
    "title": "An Evening With the Central Park Coyotes",
    "link": "https://www.nytimes.com/2025/08/19/nyregion/central-park-coyotes.html",
    "summary": "Romeo and Juliet are shy and graceful, leaping over fences, hunting for rodents and catching at least one Canada goose."
  },
  {
    "title": "California Republicans File Suit Seeking to Block Newsom Redistricting Plan",
    "link": "https://www.nytimes.com/2025/08/19/us/california-republicans-lawsuit-redistricting.html",
    "summary": "Republican state lawmakers argue that Democratic lawmakers violated 30-day disclosure rules in the California Constitution."
  },
  {
    "title": "Seeking Tales and Sipping Whiskey in a Shack Floating Down the Bayou",
    "link": "https://www.nytimes.com/2025/08/19/us/louisiana-boats.html",
    "summary": "The shanty boat was bound for New Orleans, but the destination mattered less than the challenges, chance encounters and lessons learned along the way."
  },
  {
    "title": "Why Did Shari Redstone Give Up Control of Paramount?",
    "link": "https://www.nytimes.com/2025/08/19/business/media/shari-redstone-paramount-trump-settlement.html",
    "summary": "The media mogul spoke at length for the first time about selling her family’s empire, Paramount’s settlement with President Trump — and getting her reputation battered along the way."
  },
  {
    "title": "The Race to Rescue PBS and NPR Stations",
    "link": "https://www.nytimes.com/2025/08/19/business/the-race-to-rescue-pbs-and-npr-stations.html",
    "summary": "The Knight Foundation and other top organizations are aiming to provide $50 million to stabilize the stations most at risk from the recent federal government funding cuts."
  },
  {
    "title": "MSNBC’s Rebrand to MS NOW Invites Bemusement and Ridicule",
    "link": "https://www.nytimes.com/2025/08/19/business/msnbc-ms-now-rebranding.html",
    "summary": "The cable TV network’s new name, MS NOW, became the subject of mockery soon after it was announced on Monday."
  },
  {
    "title": "TV Giant Nexstar Agrees to Acquire a Rival, Tegna, for $6.2 Billion",
    "link": "https://www.nytimes.com/2025/08/19/business/media/nexstar-tegna-deal.html",
    "summary": "To close the deal, Nexstar will need approval from the Federal Communications Commission, which could cement its position as the biggest provider of local TV in the U.S."
  },
  {
    "title": "Zuckerberg Again Overhauls Meta’s A.I. Efforts",
    "link": "https://www.nytimes.com/2025/08/19/technology/mark-zuckerberg-meta-ai.html",
    "summary": "Meta internally announced a new restructuring of its artificial intelligence division amid internal tensions over the technology, people with knowledge of the matter said."
  },
  {
    "title": "OpenAI’s GPT-5 Launch Causes Backlash Due to Colder Responses",
    "link": "https://www.nytimes.com/2025/08/19/business/chatgpt-gpt-5-backlash-openai.html",
    "summary": "When OpenAI released a new version of ChatGPT, people were quick to protest its colder responses. Acknowledging the emotional attachment with chatbots, the company quickly backtracked."
  },
  {
    "title": "New England Seafood With a Side of Punk, at Smithereens",
    "link": "https://www.nytimes.com/2025/08/19/dining/dining-smithereens-restaurant-review.html",
    "summary": "This quirky East Village newcomer conjures a thoughtful, sometimes dark, take on traditional coastal cooking. Also, doughnuts and Japanese city pop."
  },
  {
    "title": "The Real Meaning of the Zelensky Summit Was Not as It Appeared",
    "link": "https://www.nytimes.com/2025/08/19/opinion/ukraine-russia-war-territory.html",
    "summary": "And while we’re at it, let’s think about the phrase “land swap.”"
  },
  {
    "title": "Ask The Morning: What Do You Want to Know About K-12 Schools?",
    "link": "https://www.nytimes.com/2025/08/18/education/ask-the-morning-k12-schools.html",
    "summary": "The school year is beginning. We’ll find experts to answer your questions."
  },
  {
    "title": "Are Marathons and Extreme Running Linked to Colon Cancer?",
    "link": "https://www.nytimes.com/2025/08/19/health/running-colon-cancer.html",
    "summary": "A small, preliminary study found that marathoners were much more likely to have precancerous growths. Experts aren’t sure why."
  },
  {
    "title": "From Unstable Ground, an Old Church Rolls to a New Home",
    "link": "https://www.nytimes.com/2025/08/19/world/europe/sweden-church-kiruna-move.html",
    "summary": "Mining in Kiruna, Sweden, has jeopardized the ground below a beloved church. Thanks to a feat of engineering, it is on the move."
  },
  {
    "title": "In Maine, a Political Novice Makes a Long-Shot Bid to Oust Collins",
    "link": "https://www.nytimes.com/2025/08/19/us/politics/maine-senate-candidate-collins.html",
    "summary": "Democrats hope to recruit Governor Janet Mills to challenge the powerful Republican senator, but an oyster farmer with a working man’s pitch thinks he has a better chance."
  }
]