[
  {
    "title": "He Wrote a Biting Post About Charlie Kirk. The Fury Came Fast.",
    "link": "https://www.nytimes.com/2025/09/20/us/florida-charlie-kirk-free-speech.html",
    "summary": "Residents of Palmetto Bay, Fla., have demanded the resignation of Councilman Stephen Cody, who wrote a post mocking Charlie Kirk’s support for gun rights."
  },
  {
    "title": "With Calls for Retribution Over Kirk, Some See Rise of a ‘Woke Right’",
    "link": "https://www.nytimes.com/2025/09/19/us/charlie-kirk-free-speech-republicans.html",
    "summary": "Conservatives have pressed for consequences for those who make negative comments about Charlie Kirk. But a few on the right say they worry about limits on speech."
  },
  {
    "title": "What to Know About Jimmy Kimmel’s Show Being Suspended",
    "link": "https://www.nytimes.com/2025/09/20/business/jimmy-kimmel-show-abc-kirk-fcc.html",
    "summary": "Tension grew at ABC after Mr. Kimmel’s remarks about the Charlie Kirk killing angered conservatives."
  },
  {
    "title": "U.S. Attorney Investigating Letitia James Resigns After Trump Seeks to Oust Him",
    "link": "https://www.nytimes.com/2025/09/19/us/politics/erik-siebert-comey-letitia-james.html",
    "summary": "Erik S. Siebert had hit roadblocks investigating New York’s attorney general, Letitia James, and the former F.B.I. director James B. Comey."
  },
  {
    "title": "Pentagon Introduces New Restrictions on Reporter Access",
    "link": "https://www.nytimes.com/2025/09/20/business/media/pentagon-restrictions-reporters-hegseth-trump.html",
    "summary": "The Department of Defense will force reporters to pledge not to gather or use any information that had not been formally authorized for release, or risk losing their credential to cover the military."
  },
  {
    "title": "Trump Says U.S. Will Institute $100,000 Fee for H-1B Visas",
    "link": "https://www.nytimes.com/2025/09/19/us/politics/trump-h-1b-visas-fee.html",
    "summary": "Administration officials said the charge would help American workers. President Trump also announced the terms of a new “gold card” program."
  },
  {
    "title": "U.S. Military Buildup in Caribbean Signals Broader Campaign Against Venezuela",
    "link": "https://www.nytimes.com/2025/09/20/us/politics/trump-venezuela-military-buildup.html",
    "summary": "Trump officials say the mission aims to disrupt the drug trade. But military officials and analysts say the real goal might be driving Venezuela’s president from power."
  },
  {
    "title": "Trump Says U.S. Military Attacked a Third Suspected Drug Boat, Killing Three",
    "link": "https://www.nytimes.com/2025/09/19/us/politics/trump-boat-strike-drugs.html",
    "summary": "It was the third time this month that the president said the United States had struck a vessel in the Caribbean Sea."
  },
  {
    "title": "Can France’s Palestinian Proposal Change 75 Years of Failed Diplomacy?",
    "link": "https://www.nytimes.com/2025/09/20/world/middleeast/france-palestinian-state-peace-plan.html",
    "summary": "The French president has rallied 142 nations behind a road map for a two-state solution after the Gaza war ends. Missing from the list: Israel and the United States."
  },
  {
    "title": "What to Know About the Visa Standoff Between Trump and the United Nations",
    "link": "https://www.nytimes.com/2025/09/20/world/middleeast/visa-standoff-trump-united-nations.html",
    "summary": "The president of the Palestinian Authority won’t be able to attend the U.N. General Assembly after the Trump administration denied him a visa."
  },
  {
    "title": "Seeing Through the Reality of Meta’s Smart Glasses",
    "link": "https://www.nytimes.com/2025/09/20/technology/personaltech/meta-smart-glasses-mark-zuckerberg.html",
    "summary": "Mark Zuckerberg’s glitch-filled unveiling of computerized glasses revealed a company that may struggle to deliver on its promise for the future of computing."
  },
  {
    "title": "What Wall Street Sees in the Data Center Boom",
    "link": "https://www.nytimes.com/2025/09/20/business/dealbook/data-centers-ai.html",
    "summary": "Data center capacity has become a barometer for both the health of the tech market and the risk of an A.I. bubble."
  },
  {
    "title": "U.S. Is Losing Race to Return to Moon, Critics Say, Pointing at SpaceX",
    "link": "https://www.nytimes.com/2025/09/20/us/politics/spacex-us-moon-race.html",
    "summary": "The company’s Starship rocket, which has suffered a series of recent test explosions, is still years away from being ready for the mission, former NASA executives say."
  },
  {
    "title": "They Helped Oust a Dictator. Now the New Regime Is Coming for Them.",
    "link": "https://www.nytimes.com/2025/09/20/world/americas/nicaragua-ortega-arrests.html",
    "summary": "President Daniel Ortega of Nicaragua and his wife, who is co-president, have been arresting longtime loyalists, in an apparent quest to ensure no one outside the family rises to power."
  },
  {
    "title": "The Obscure Liberal Group Seeking to Curb Republican Down-Ballot Dominance",
    "link": "https://www.nytimes.com/2025/09/20/us/politics/pipeline-fund-democrats-local-elections.html",
    "summary": "A liberal group that was spun off from a network funded by George Soros is looking to build off 2024 victories in Florida to help elect candidates to school boards and other local offices."
  },
  {
    "title": "Hamburger Helper Sales Rise as Americans Try to Save on Food",
    "link": "https://www.nytimes.com/2025/09/20/business/hamburger-helper-food-prices.html",
    "summary": "The price of beef and other grocery items are climbing, and consumers are turning to canned meats and a 1970s staple."
  },
  {
    "title": "Jimmy Kimmel and the Rise of Corporate Censorship",
    "link": "https://www.nytimes.com/video/opinion/100000010411146/jimmy-kimmel-and-the-rise-of-corporate-censorship.html",
    "summary": "After ABC suspended Jimmy Kimmel from the airwaves, many called it censorship. The journalist Molly Jong-Fast explains that it is censorship, but not the kind you might think."
  },
  {
    "title": "Robert Redford Was Everything You Hoped He’d Be",
    "link": "https://www.nytimes.com/2025/09/20/opinion/robert-redford-death.html",
    "summary": "Redford and Newman, real movie stars with real values."
  },
  {
    "title": "Standing Date",
    "link": "https://www.nytimes.com/2025/09/20/briefing/standing-date.html",
    "summary": "A weekly dinner party sounds so enticing, but establishing a ritual can be a challenge."
  },
  {
    "title": "A Calm Before the Beer Taps Open at Oktoberfest",
    "link": "https://www.nytimes.com/2025/09/20/world/europe/germany-munich-oktoberfest.html",
    "summary": "Until the taps open at Oktoberfest, it’s a nonalcoholic mix of card games, soft drinks and waiting."
  },
  {
    "title": "Five-Alarm Fire on Brooklyn Waterfront Devastates Artists’ Warehouse",
    "link": "https://www.nytimes.com/2025/09/20/nyregion/red-hook-warehouse-fire.html",
    "summary": "A row of converted 19th-century buildings filled with artists in the 1990s and transformed Red Hook. Now the work of more than 500 artists may be lost."
  },
  {
    "title": "Gary Busey Sentenced to Two Years’ Probation for Sex Offense",
    "link": "https://www.nytimes.com/2025/09/20/nyregion/gary-busey-sentenced-to-two-years-probation-for-sex-offense.html",
    "summary": "The 81-year-old actor had admitted touching a woman’s buttocks over her clothing at a horror film convention in New Jersey in 2022."
  }
]