[
  {
    "title": "Our Photographer Describes the Scene After the Pretti Shooting",
    "link": "https://www.nytimes.com/video/us/100000010667387/our-photographer-describes-pretti-shooting-scene.html",
    "summary": "David Guttenfelder, a Times photographer based in Minneapolis, describes what he saw at the scene where Alex Jeffrey Pretti had been killed by federal agents."
  },
  {
    "title": "A Crisis of Confidence for ICE and Border Patrol as Clashes Escalate",
    "link": "https://www.nytimes.com/2026/01/26/us/politics/ice-border-patrol-trust.html",
    "summary": "Current and former officials describe growing frustration and disillusionment with the Trump administration’s approach, even as they support the goal of immigration enforcement."
  },
  {
    "title": "Minnesota Refugees Detained by ICE ‘Had Done Everything Right’",
    "link": "https://www.nytimes.com/2026/01/26/us/politics/ice-minnesota-refugees.html",
    "summary": "Dozens of refugees with valid status have been sent from Minnesota to Texas to be revetted, prompting a lawsuit. Those released have had to pay their way back."
  },
  {
    "title": "Scenes From the Winter Storm",
    "link": "https://www.nytimes.com/2026/01/24/us/winter-storm-snow-photos-videos.html",
    "summary": "Images from across much of the country illuminate snow-covered streets and preparations for worse still to come."
  },
  {
    "title": "As U.S. Warships Get Closer, Iran Ramps Up Threats to Retaliate",
    "link": "https://www.nytimes.com/2026/01/26/world/middleeast/us-warships-gulf-waters-iran-retaliation-threats.html",
    "summary": "Iran and its militia allies say they will respond aggressively in the region if attacked. A U.S. aircraft carrier and warships are approaching the region."
  },
  {
    "title": "Trump Hobbled the I.R.S. This C.E.O. Now Has to Make It Work.",
    "link": "https://www.nytimes.com/2026/01/26/us/politics/trump-irs-taxes-bisignano.html",
    "summary": "Frank Bisignano is the first chief executive of the I.R.S., where there’s hope he will end a chaotic stretch at the agency. The tax filing season, which started Monday, is his first test."
  },
  {
    "title": "Voters See a Middle-Class Lifestyle as Drifting Out of Reach, Poll Finds",
    "link": "https://www.nytimes.com/2026/01/26/us/politics/affordability-poll.html",
    "summary": "Concerns about the affordability of education, housing, health care, having a family and retirement are driving economic anxieties, a New York Times/Siena poll found."
  },
  {
    "title": "Gold Soars Beyond $5,000 as Global Tensions Grow",
    "link": "https://www.nytimes.com/2026/01/26/business/gold-prices.html",
    "summary": "The price of gold surged as investors sought shelter from geopolitical uncertainty."
  },
  {
    "title": "How One Food Critic Overcame His Negative Relationship With Alcohol and Sugary Drinks",
    "link": "https://cooking.nytimes.com/article/alcohol-free-low-sugar-drinks-diet-substitutions",
    "summary": "In the last part of a monthlong series, Pete Wells and experts suggest how to sidestep the perils of alcoholic or sugary beverages."
  },
  {
    "title": "Hamas Hands Over Body of Ran Gvili, Closing Chapter for Israel",
    "link": "https://www.nytimes.com/2026/01/26/world/middleeast/gaza-hostage-returned-israel.html",
    "summary": "The recovery of Master Sgt. Ran Gvili’s body paves the way for the next stage of the Gaza cease-fire plan, though the path forward is unclear."
  },
  {
    "title": "Israel Says It Will Reopen Gaza-Egypt Border Crossing in Days",
    "link": "https://www.nytimes.com/2026/01/26/world/middleeast/israel-gaza-egypt-rafah-crossing.html",
    "summary": "The Rafah crossing will open at the end of Israel’s search for the remains of the last captive in Gaza."
  },
  {
    "title": "The ‘R-Word’ Returns, Dismaying Those Who Fought to Oust It",
    "link": "https://www.nytimes.com/2026/01/26/us/r-word-slur-disability.html",
    "summary": "The term, long considered a slur for those with intellectual disabilities, is seeing a resurgence on social media and across the political right."
  },
  {
    "title": "In Xi’s China, Top General’s Fall Shows Precariousness of Power",
    "link": "https://www.nytimes.com/2026/01/26/world/asia/china-xi-zhang-youxia-military.html",
    "summary": "A combat veteran, Zhang Youxia was once seen as the most trusted man in Xi Jinping’s military. Now he has been accused of disloyalty to Mr. Xi."
  },
  {
    "title": "How Bad Are A.I. Delusions? We Asked People Treating Them.",
    "link": "https://www.nytimes.com/2026/01/26/us/chatgpt-delusions-psychosis.html",
    "summary": "Dozens of doctors and therapists said chatbots had led their patients to psychosis, isolation and unhealthy habits."
  },
  {
    "title": "Yann LeCun, an A.I. Pioneer, Warns the Tech ‘Herd’ Could Hit a Dead End",
    "link": "https://www.nytimes.com/2026/01/26/technology/an-ai-pioneer-warns-the-tech-herd-is-marching-into-a-dead-end.html",
    "summary": "Yann LeCun helped create the technology behind today’s chatbots. Now he says many tech companies are on the wrong path to creating intelligent machines."
  },
  {
    "title": "Elon Musk’s X Faces EU Inquiry Over Sexualized AI Images Generated by Grok",
    "link": "https://www.nytimes.com/2026/01/26/business/european-union-x-grok-ai-images-musk.html",
    "summary": "Regulators said the company’s lack of controls had led to the widespread use of deepfakes created with the chatbot Grok."
  },
  {
    "title": "Shift to Drone Fighting in Ukraine War Means No Winter Lull",
    "link": "https://www.nytimes.com/2026/01/26/world/europe/ukraine-russia-winter-snow-donetsk-dnipro.html",
    "summary": "Shifts in tactics and technology in Ukraine mean that the pace of fighting is no longer decided by whether tanks can navigate frozen fields."
  },
  {
    "title": "Russia Says Talks to End War in Ukraine Will Continue",
    "link": "https://www.nytimes.com/2026/01/26/world/europe/russia-ukraine-war-peace-talks.html",
    "summary": "Ukrainian and Russian officials left rare direct talks last weekend in a somewhat optimistic mood. But Russia may be simply stalling for time, analysts said."
  },
  {
    "title": "Gunmen Kill 11 After Soccer Match in Mexico",
    "link": "https://www.nytimes.com/2026/01/26/world/americas/mexico-shooting-salamanca-cartels.html",
    "summary": "The mass shooting occurred in an area fought over by drug cartels, just as the Mexican government has sought to show Washington that it is combating criminal groups."
  },
  {
    "title": "New Videos of the Beckham Feud Are Fake. Nobody Seems to Care.",
    "link": "https://www.nytimes.com/2026/01/26/business/media/brooklyn-beckham-victoria-feud-ai-videos-dancing.html",
    "summary": "A.I.-generated content of Victoria Beckham has spread as wedding drama has engulfed the celebrity clan and the public has clamored for receipts (even fabricated ones)."
  },
  {
    "title": "In ‘Memory of a Killer,’ Patrick Dempsey Takes the Wheel",
    "link": "https://www.nytimes.com/2026/01/26/arts/television/patrick-dempsey-memory-of-a-killer.html",
    "summary": "The actor has spent a decade dismantling his McDreamy persona from “Grey’s Anatomy.” He stars as an assassin in a new Fox thriller."
  },
  {
    "title": "‘We Are Creating the Conditions for a Catastrophe’: Three Columnists on the Shooting of Alex Pretti in Minneapolis",
    "link": "https://www.nytimes.com/2026/01/26/opinion/minneapolis-alex-pretti-ice-shooting.html",
    "summary": "On immigration raids, the shooting death of Alex Pretti and where we go from here."
  },
  {
    "title": "Why Gen Z Doesn’t Love ‘Harry Potter’",
    "link": "https://www.nytimes.com/2026/01/26/opinion/harry-potter-millenials-liberalism.html",
    "summary": "The wizarding worldview is naïve."
  },
  {
    "title": "A Showdown in Minnesota",
    "link": "https://www.nytimes.com/2026/01/26/briefing/a-showdown-in-minnesota.html",
    "summary": "We look at the death of Alex Pretti in Minneapolis."
  },
  {
    "title": "In Venezuela, Freeing the Economy, but Nothing Else",
    "link": "https://www.nytimes.com/2026/01/26/world/americas/venezuela-economy-rodriguez.html",
    "summary": "Interim leader Delcy Rodríguez is liberalizing the economy without dismantling her predecessor’s repressive apparatus, raising questions about her aims."
  },
  {
    "title": "Private Jet Crashes at Maine Airport, Killing 7",
    "link": "https://www.nytimes.com/2026/01/25/us/bangor-maine-airport-crash.html",
    "summary": "A Bombardier Challenger 600 crashed during takeoff Sunday at the Bangor airport, officials said. A crew member survived but was seriously injured."
  },
  {
    "title": "Columbia Selects University of Wisconsin Chancellor as Its President",
    "link": "https://www.nytimes.com/2026/01/25/nyregion/columbia-president-wisconsin-mnookin.html",
    "summary": "Jennifer Mnookin has led the flagship campus of the state university system since 2022. She takes the helm at Columbia after a tumultuous period."
  },
  {
    "title": "Pedro Lives in a Hospital. His Nurses Are on Strike. He Misses Them.",
    "link": "https://www.nytimes.com/2026/01/26/nyregion/nyc-nurses-strike-patients-children.html",
    "summary": "Pedro, a 2-year-old, needs a new heart and has spent months in a New York hospital. With his nurses on the picket line, replacement workers care for him."
  }
]