[
  {
    "title": "Trump Is Wasting No Time in Tearing Down the East Wing",
    "link": "https://www.nytimes.com/2025/10/22/us/politics/east-wing-white-house-demolition-trump.html",
    "summary": "President Trump initially said the ballroom construction would not dismantle parts of the White House. His officials now say it is cheaper and more structurally sound to simply demolish the East Wing."
  },
  {
    "title": "What to Know About the White House East Wing and Its History",
    "link": "https://www.nytimes.com/2025/10/22/us/politics/east-wing-white-house.html",
    "summary": "The East Wing has been a base for the first lady, an entryway for social functions and an emergency bunker."
  },
  {
    "title": "The White House Wrecking Ball",
    "link": "https://www.nytimes.com/2025/10/22/us/politics/trump-white-house-demolition.html",
    "summary": "President Trump’s demolition of the East Wing has struck a nerve in Washington and beyond."
  },
  {
    "title": "7 Takeaways From the Final N.Y.C. Mayoral Debate",
    "link": "https://www.nytimes.com/2025/10/22/nyregion/nyc-mayor-debate-takeaways.html",
    "summary": "Zohran Mamdani, Andrew M. Cuomo and Curtis Sliwa continued attacking one another, with Mr. Mamdani and Mr. Cuomo the main targets."
  },
  {
    "title": "N.Y.C. Mayoral Candidates Trade Zingers in Final Debate",
    "link": "https://www.nytimes.com/2025/10/22/nyregion/nyc-mayor-debate-zingers.html",
    "summary": "The candidates sparred over their policies, personalities and how they would deal with President Trump in the second and final debate of the mayoral campaign."
  },
  {
    "title": "Mamdani Plans to Keep Tisch as Police Commissioner if Elected NYC Mayor",
    "link": "https://www.nytimes.com/2025/10/22/nyregion/jessica-tisch-nypd-mamdani.html",
    "summary": "Zohran Mamdani’s intention to retain Jessica Tisch is likely to placate powerful New Yorkers who have lobbied Mr. Mamdani to keep her."
  },
  {
    "title": "U.S. Strikes 2nd Boat in Pacific as Antidrug Operation Expands",
    "link": "https://www.nytimes.com/2025/10/22/us/politics/trump-drug-boat-strike-colombia.html",
    "summary": "The Trump administration announced a second strike outside the Caribbean, in a campaign against what U.S. officials say are boats carrying drugs bound for the United States."
  },
  {
    "title": "Drug-Smuggling Submarines on Display at Latin American Naval Base",
    "link": "https://www.nytimes.com/2025/10/22/world/americas/drug-smuggling-submarines.html",
    "summary": "A display of confiscated vessels at a naval base in Ecuador offers a peek at why drug smuggling is so hard to stop."
  },
  {
    "title": "Misty Copeland Will Take Her Final Bow",
    "link": "https://www.nytimes.com/2025/10/22/arts/dance/misty-copeland-ballet-life-career-photos.html",
    "summary": "The famed ballerina retires from her career with the American Ballet Theater after one final performance on Wednesday night."
  },
  {
    "title": "Trump Imposes Sanctions on Russian Oil Companies as His Frustration With Putin Mounts",
    "link": "https://www.nytimes.com/2025/10/22/us/politics/trump-sanctions-russia-ukraine.html",
    "summary": "The sanctions are among the most significant measures that the United States has taken against the Russian energy sector since the beginning of the war in Ukraine."
  },
  {
    "title": "As Shutdown Drags and Trump Flexes, Congress Cedes Its Relevance",
    "link": "https://www.nytimes.com/2025/10/22/us/politics/trump-shutdown-congress-power.html",
    "summary": "“It’s like we have given up,” one Republican lawmaker said."
  },
  {
    "title": "Federal Agents Head to San Francisco Bay Area for Planned Immigration Crackdown",
    "link": "https://www.nytimes.com/2025/10/22/us/border-patrol-san-francisco-bay-area.html",
    "summary": "U.S. Customs and Border Protection agents are being sent to a U.S. Coast Guard base in Alameda, Calif., ahead of an immigration operation in the San Francisco region."
  },
  {
    "title": "Pelosi Says Police May Arrest Federal Agents Who Violate California Law",
    "link": "https://www.nytimes.com/2025/10/22/us/politics/nancy-pelosi-ice-agent-arrest.html",
    "summary": "The San Francisco district attorney said in an interview that she came up with the strategy after seeing federal agents repeatedly roughing up people in Los Angeles and Chicago."
  },
  {
    "title": "Key Louvre Camera Was Pointing Away From Thieves, Director Says",
    "link": "https://www.nytimes.com/2025/10/22/world/europe/louvre-museum-robbery-open-paris.html",
    "summary": "Laurence des Cars, the head of the Paris museum, told a Senate hearing that she had offered to resign after the stunning theft of royal jewels."
  },
  {
    "title": "For Robbers Like the Louvre Thieves, Bright Vests Actually Help Them Hide",
    "link": "https://www.nytimes.com/2025/10/22/arts/design/louvre-museum-robbery-high-visibility-vests.html",
    "summary": "Given the ubiquity of neon-colored safety jackets, criminals are using them to carry out crimes in plain sight."
  },
  {
    "title": "Three Offers in One Month: Paramount’s Secret Pursuit of Warner Bros. Discovery",
    "link": "https://www.nytimes.com/2025/10/22/business/dealbook/paramounts-secret-bids-warner-bros-discovery.html",
    "summary": "A letter from Paramount’s chief executive, David Ellison, to Warner Bros.’ board of directors reveals weeks of talks between the companies."
  },
  {
    "title": "Can a Beach Really Be Evil? Ask the Sun-Seekers in Good Sahel.",
    "link": "https://www.nytimes.com/2025/10/23/world/middleeast/egypt-good-sahel-evil-sahel.html",
    "summary": "The sea looks the same. So does the sand. But in Egypt, two beach communities not far from each other have decidedly different ideas about fun."
  },
  {
    "title": "Chinese Impersonator’s Trump Act Has Won Him Millions of Fans",
    "link": "https://www.nytimes.com/2025/10/23/world/asia/chinese-trump-impersonator.html",
    "summary": "Ryan Chen has turned an uncanny impersonation of President Trump into a social media career, and a mirror of China’s fascination with America."
  },
  {
    "title": "Samantha Eggar, Oscar-Nominated Star of ‘The Collector,’ Dies at 86",
    "link": "https://www.nytimes.com/2025/10/22/movies/samantha-eggar-dead.html",
    "summary": "She also had leading roles in “Doctor Dolittle” with Rex Harrison, “Walk, Don’t Run” with Cary Grant and “The Molly Maguires” with Sean Connery."
  },
  {
    "title": "Trump Wants the American People to Pay Him $230 Million",
    "link": "https://www.nytimes.com/2025/10/22/opinion/trump-230-million-justice-department.html",
    "summary": "Trump should pay a political price for his brazen corruption. Instead, he is telling American taxpayers to pay a price, directly to him."
  },
  {
    "title": "Trump Revives Foreign Aid, Helping Needy Billionaires",
    "link": "https://www.nytimes.com/2025/10/22/opinion/trump-aid-argentina.html",
    "summary": "As children die for want of cheap medicines, the U.S. spends billions on Argentina — thus rescuing rich investors who made bad bets."
  },
  {
    "title": "Nepal’s Gen Z Sees Little Hope at Home",
    "link": "https://www.nytimes.com/2025/10/23/world/asia/nepal-protests-migrants-gen-z.html",
    "summary": "The protests that rocked Nepal were about more than a social media ban. The economy is so dire that for many, going abroad seems the only way to build a future."
  },
  {
    "title": "Hoping to Grow in Europe, but Bogged Down by Red Tape",
    "link": "https://www.nytimes.com/2025/10/23/business/europe-start-ups-red-tape-entrepreneurship.html",
    "summary": "Start-ups are booming in the European Union, but experts say bureaucracy keeps them from expanding across borders."
  },
  {
    "title": "Cardiovascular Benefits of Wegovy Extend Beyond Weight Loss, Study Shows",
    "link": "https://www.nytimes.com/2025/10/22/well/wegovy-cardiovascular-benefits-weight-loss-study.html",
    "summary": "An analysis found that a shrinking waist size was responsible for only around a third of the cardiovascular benefits in people who took Wegovy."
  }
]