[
  {
    "title": "What’s in the Trump Policy Bill?",
    "link": "https://www.nytimes.com/2025/07/01/briefing/trump-policy-bill.html",
    "summary": "We take a closer look at some less discussed provisions."
  },
  {
    "title": "The Republicans in Congress Who Are Opting to Self-Deport From Washington",
    "link": "https://www.nytimes.com/2025/06/30/us/politics/tillis-bacon-trump-gop.html",
    "summary": "Feeling out of step with President Trump’s G.O.P., Senator Thom Tillis and Representative Don Bacon are deciding to retire."
  },
  {
    "title": "Elon Musk Promises a New Political Party if Republicans Pass Trump’s Policy Bill",
    "link": "https://www.nytimes.com/2025/06/30/us/politics/elon-musk-trump-bill-republicans.html",
    "summary": "The billionaire and former Trump adviser suggested that if the domestic policy bill passed, he would swiftly form a new “America Party” and back primary challenges to Republicans."
  },
  {
    "title": "‘Horror Show’ at Detention Facility, and the Dollar’s Big Drop",
    "link": "https://www.nytimes.com/2025/07/01/podcasts/the-headlines/migrant-detention-facility-dollar-big-drop-wnba.html",
    "summary": "Plus, three new teams for the WNBA."
  },
  {
    "title": "California Rolls Back Its Landmark Environmental Law",
    "link": "https://www.nytimes.com/2025/06/30/us/california-environment-newsom-ceqa.html",
    "summary": "Gov. Gavin Newsom and state lawmakers scaled back a law that was vilified for its role in California’s housing shortage and homelessness crisis."
  },
  {
    "title": "Under a Drone-Swarmed Sky: Surviving in Eastern Ukraine",
    "link": "https://www.nytimes.com/2025/07/01/world/europe/ukraine-russia-frontline.html",
    "summary": "Towns and troops long accustomed to merciless bombardment are adjusting to an even denser pattern of attacks."
  },
  {
    "title": "Bryan Kohberger, Suspect in Idaho Student Murders, Accepts Plea Deal",
    "link": "https://www.nytimes.com/2025/06/30/us/idaho-murders-bryan-kohberger-plea.html",
    "summary": "Bryan Kohberger, a former criminology student, is charged in the stabbing deaths of four University of Idaho students. Prosecutors said they had reached a plea agreement that avoids the death penalty."
  },
  {
    "title": "Restaurant Review: Acamaya in New Orleans",
    "link": "https://www.nytimes.com/2025/07/01/dining/acamaya-restaurant-review-new-orleans.html",
    "summary": "In her first review as our new critic, Tejal Rao visits Acamaya, where the chef Ana Castro is writing the latest chapter in the city’s rich culinary story."
  },
  {
    "title": "The Dollar Has Its Worst Start to a Year Since 1973",
    "link": "https://www.nytimes.com/2025/06/30/business/dollar-decline-trump.html",
    "summary": "It has continued to slide even as President Trump has backed down from his tariff threats and the U.S. stock market has recovered from its losses."
  },
  {
    "title": "As Debt Piles Up, Countries See Fiscal Relief as Political Leverage",
    "link": "https://www.nytimes.com/2025/07/01/business/debt-eu-africa-china.html",
    "summary": "With developing nations crushed by unaffordable borrowing and Washington on the sidelines, some leaders are brokering debt forgiveness deals."
  },
  {
    "title": "Appeals Court Weighs Trump’s Use of Alien Enemies Act for Deportations",
    "link": "https://www.nytimes.com/2025/06/30/us/politics/appeals-court-trump-alien-enemies-act-deportations.html",
    "summary": "The case is likely to be the first to reach the Supreme Court on the substantive issue of the president’s invocation of a rarely used wartime law."
  },
  {
    "title": "Bush, Obama and Bono Commend USAID Staff Members on Their Last Day",
    "link": "https://www.nytimes.com/2025/06/30/us/politics/usaid-staff-obama-bush-bono.html",
    "summary": "Two ex-presidents and a rock star thanked the outgoing workers of a doomed agency."
  },
  {
    "title": "Steve Bannon’s Battle for the Soul of MAGA",
    "link": "https://www.nytimes.com/2025/07/01/podcasts/the-daily/steve-bannon-interview-maga.html",
    "summary": "The former White House chief strategist speaks about the threats he sees to the political movement that formed around Donald J. Trump."
  },
  {
    "title": "NYC Panel Approves Rent Increases, a Key Issue for Mamdani and Adams",
    "link": "https://www.nytimes.com/2025/06/30/nyregion/nyc-mamdani-adams-rent-increase.html",
    "summary": "Mayor Eric Adams, who appointed the Rent Guidelines Board, has attacked Zohran Mamdani’s pledge to freeze the rent if he becomes mayor."
  },
  {
    "title": "What to Know About Ranked-Choice Results in the N.Y.C. Mayor’s Race",
    "link": "https://www.nytimes.com/2025/07/01/nyregion/nyc-mayor-results-ranked-choice-voting.html",
    "summary": "Since no candidate received 50 percent of the vote on Primary Day, the Board of Elections proceeded to ranked-choice tabulations, which will be released on Tuesday."
  },
  {
    "title": "New Yorkers May Vote on Curbing Council’s Power to Block New Housing",
    "link": "https://www.nytimes.com/2025/07/01/nyregion/nyc-charter-revision-housing.html",
    "summary": "The City Council can block the development of new housing. A panel created by Mayor Eric Adams wants to let voters weigh in on reducing the Council’s power."
  },
  {
    "title": "How the Hottest Place in India Survives",
    "link": "https://www.nytimes.com/2025/07/01/world/asia/india-heat.html",
    "summary": "It’s 40 degrees Celsius (104 Fahrenheit), and it’s only 10 a.m. Welcome to Sri Ganganagar."
  },
  {
    "title": "Dangerous Heat Grips Much of Europe, With More to Come",
    "link": "https://www.nytimes.com/2025/06/30/world/europe/europe-heat-wave.html",
    "summary": "A punishing heat wave broke records in southern Europe and hasn’t peaked yet in some places, prompting warnings to residents, employers and tourists to alter their habits."
  },
  {
    "title": "With Tillis Out, North Carolina’s Senate Race Will Draw Parties’ Firepower",
    "link": "https://www.nytimes.com/2025/07/01/us/politics/north-carolina-senate-tillis-cooper.html",
    "summary": "A popular former Democratic governor, Roy Cooper, is expected to announce a bid this summer. The Republicans are banking on an endorsement by President Trump to clear their field."
  },
  {
    "title": "Colin Allred Will Run Again for Senate in Texas",
    "link": "https://www.nytimes.com/2025/07/01/us/politics/colin-allred-texas-senate.html",
    "summary": "After losing to Ted Cruz last year, Mr. Allred is planning his second statewide run and looking for a stronger political climate for Democrats."
  },
  {
    "title": "The Most Stylish People of 2025, So Far",
    "link": "https://www.nytimes.com/2025/07/01/style/best-dressed-2025-so-far.html",
    "summary": "Some wore vestments, others scrubs. Some were on courts, others in court. All have shaped the look of the year."
  },
  {
    "title": "Wimbledon 2025: How the World’s Oldest Tennis Tournament is Coping with the Heat Wave",
    "link": "https://www.nytimes.com/2025/07/01/world/europe/wimbledon-heat-wave.html",
    "summary": "With 6,700 refillable water bottles, “shade mapping” and ice packs, the world’s oldest championship tennis tournament is taking Britain’s heat wave seriously."
  },
  {
    "title": "My First America",
    "link": "https://www.nytimes.com/2025/07/01/opinion/july4-john-jakes-america.html",
    "summary": "When I was a teenager, a mostly forgotten series of novels taught me U.S. history. How would they read to me now?"
  },
  {
    "title": "Trump May Get His ‘Big Beautiful Bill,’ but the G.O.P. Will Pay a Price",
    "link": "https://www.nytimes.com/2025/07/01/opinion/trump-big-bill-republicans.html",
    "summary": "And so will many voters."
  },
  {
    "title": "Prime Minister Paetongtarn Shinawatra Suspended Amid Cambodia Dispute",
    "link": "https://www.nytimes.com/2025/07/01/world/asia/thai-pm-shinawatra-suspended.html",
    "summary": "Paetongtarn Shinawatra is accused of ethical lapses in a conversation with the Cambodian leader Hun Sen and has faced calls to resign."
  },
  {
    "title": "BP, Once a Hunter in the Oil Industry, Is Now Prey. What Went Wrong?",
    "link": "https://www.nytimes.com/2025/07/01/business/bp-takeover-shell-oil-gas.html",
    "summary": "The energy giant has been weakened by years of mishaps and poor decisions, leading to rumors of a takeover that may not subside."
  },
  {
    "title": "At 91, an Idiosyncratic Judge Prepares for His Latest Big Case",
    "link": "https://www.nytimes.com/2025/06/30/nyregion/judge-frederic-block-caro-quintero.html",
    "summary": "Judge Frederic Block will oversee the prosecution of Rafael Caro Quintero, a Mexican drug lord, which could end in the death penalty. In the meantime, there’s stand-up comedy to keep him busy."
  },
  {
    "title": "Cloudflare Introduces Blocking of A.I. Scrapers By Default",
    "link": "https://www.nytimes.com/2025/07/01/technology/cloudflare-introduces-default-blocking-of-ai-data-scrapers.html",
    "summary": "The tech company’s customers can automatically block A.I. companies from exploiting their websites, it said, as it moves to protect original content online."
  }
]