[
  {
    "title": "CDC Vaccine Committee Ends Recommendation That All Newborns Receive Hepatitis B Shots",
    "link": "https://www.nytimes.com/2025/12/05/health/kennedy-vaccine-committee-vote-hepatitisb.html",
    "summary": "In a step toward Health Secretary Robert F. Kennedy Jr.’s goal of upending vaccine policy, the committee decided to delay the shots for babies of mothers who test negative for the virus, reversing longstanding guidance."
  },
  {
    "title": "PCE Report Shows Consumer Prices Rose Slightly in September",
    "link": "https://www.nytimes.com/2025/12/05/business/pce-data-inflation-consumer-prices.html",
    "summary": "The most recent Personal Consumption Expenditures index was delayed because of the government shutdown."
  },
  {
    "title": "Trump’s Approval Rating Dips as Views of His Handling of the Economy Sour",
    "link": "https://www.nytimes.com/2025/12/05/us/politics/trump-approval-rating.html",
    "summary": "The shift, while small, is notable after months of stability in President Trump’s approval rating."
  },
  {
    "title": "Netflix to Buy Warner Bros in $83 Billion Deal",
    "link": "https://www.nytimes.com/2025/12/05/business/warner-brothers-discovery-netflix.html",
    "summary": "The deal to acquire the Hollywood behemoth’s television and film studios as well as HBO Max will bulk up the world’s biggest paid streaming service."
  },
  {
    "title": "Why the Battle for Warner Bros. Discovery May Not Be Over Yet",
    "link": "https://www.nytimes.com/2025/12/05/business/dealbook/netflix-warner-bros-discovery.html",
    "summary": "Netflix struck a deal to buy one of Hollywood’s most storied studios. But a scorned rival, and the Trump administration, may put up a fight."
  },
  {
    "title": "Trump Administration Says Europe Faces ‘Civilizational Erasure’",
    "link": "https://www.nytimes.com/2025/12/05/world/europe/trump-europe.html",
    "summary": "America’s goal should be “to help Europe correct its current trajectory,” the administration said in its new National Security Strategy."
  },
  {
    "title": "Wary of Russia, German Defense Minister Pistorius Is Growing His Army",
    "link": "https://www.nytimes.com/2025/12/05/world/europe/germany-military-boris-pistorius-defense-minister.html",
    "summary": "Boris Pistorius, Germany’s defense minister, is pushing to expand its military in case tensions with Russia escalate. That’s tricky in a country where the Nazi era casts a long shadow."
  },
  {
    "title": "Second Strike Scrutiny Obscures Larger Question About Trump’s Boat Attacks",
    "link": "https://www.nytimes.com/2025/12/04/us/politics/trump-boat-attacks-killings.html",
    "summary": "Congress is focusing on two deaths in one strike. But nine other people died in that same attack, and the United States has killed 87 in all. Were any of those killings legal?"
  },
  {
    "title": "Trump Wants Maduro to Go. Here’s Who Could Replace Him in Venezuela.",
    "link": "https://www.nytimes.com/2025/12/05/world/americas/trump-maduro-venezuela-president.html",
    "summary": "Several senior Venezuelan officials and opposition politicians would have a claim to power in a transition, but all would face difficulties."
  },
  {
    "title": "Best Albums of 2025",
    "link": "https://www.nytimes.com/2025/12/05/arts/music/best-albums-2025.html",
    "summary": "The rising Korean pop outsider Effie and the Brooklyn indie-rock band Geese top our critics’ lists this year."
  },
  {
    "title": "Elon Musk Loves What Mario Nawfal Has to Say",
    "link": "https://www.nytimes.com/2025/12/05/business/media/elon-musk-mario-nawfal-x.html",
    "summary": "Mario Nawfal has a knack for getting Mr. Musk’s attention online, and for turning that into big business."
  },
  {
    "title": "Zelensky’s Government Sabotaged Oversight, Allowing Corruption in Ukraine to Fester",
    "link": "https://www.nytimes.com/2025/12/05/world/europe/ukraine-corruption-zelensky.html",
    "summary": "Ukrainian leaders blame independent advisers for failing to prevent graft. A Times investigation found that President Volodymyr Zelensky’s own administration removed guardrails."
  },
  {
    "title": "What We Know About the Arrest in the D.C. Pipe Bomb Case",
    "link": "https://www.nytimes.com/2025/12/05/us/politics/dc-pipe-bomb-arrest-suspect.html",
    "summary": "The arrest came after years of false leads and speculation over who planted the bombs near the Capitol before the Jan. 6 riot."
  },
  {
    "title": "Versace Announces Dario Vitale’s Shocking Departure",
    "link": "https://www.nytimes.com/2025/12/05/style/versace-dario-vitale-prada.html",
    "summary": "After one hit collection, the designer Dario Vitale will be leaving the brand. What’s going on?"
  },
  {
    "title": "An Alaskan Village Confronts Its Changing Climate: Rebuild or Relocate?",
    "link": "https://www.nytimes.com/2025/12/05/climate/an-alaskan-village-confronts-its-changing-climate-rebuild-or-relocate.html",
    "summary": "After a devastating storm, the people who fled a remote coastal village face an existential question."
  },
  {
    "title": "But Who Is the Snake in ‘Zootopia 2’?",
    "link": "https://www.nytimes.com/2025/12/04/business/media/zootopia-2-snake-gary-goldman.html",
    "summary": "Gary Goldman, who has battled Disney in court over the franchise, thinks the viper Gary De’Snake is based on him."
  },
  {
    "title": "Fans Are Obsessed With This Celebrity Couple. They Star in ‘Zootopia.’",
    "link": "https://www.nytimes.com/2025/12/05/movies/zootopia-fans-nick-wilde-judy-hopps.html",
    "summary": "WildeHopps, a.k.a. the fox and bunny at the heart of the franchise, has inspired a YouTube movie, TikToks, fancams and more. The obsession goes deep (and sometimes weird)."
  },
  {
    "title": "Trump’s Boat Strikes Corrode America’s Soul",
    "link": "https://www.nytimes.com/2025/12/05/opinion/trump-boat-strikes.html",
    "summary": "We need to question the strikes’ legality. But we also need to see how they fit into the Trump administration’s larger effort to change America."
  },
  {
    "title": "The One Child Policy’s Legacy: A Surplus of Single Men",
    "link": "https://www.nytimes.com/2025/12/04/opinion/china-dating-men-one-child-policy.html",
    "summary": "A decade after the end of the one-child policy, China has over 30 million so-called surplus men. Can this dating boot camp help them find love?"
  },
  {
    "title": "The Year in Lists",
    "link": "https://www.nytimes.com/2025/12/05/briefing/the-year-in-lists.html",
    "summary": "The end of year recaps can be dizzying. But they’re also full of gold."
  },
  {
    "title": "Ex-D.E.A. Agent Charged With Agreeing to Launder Millions for Cartel",
    "link": "https://www.nytimes.com/2025/12/05/nyregion/dea-agent-money-laundering-mexican-cartel.html",
    "summary": "The former agent, Paul Campo, laundered money for the Jalisco New Generation Cartel in Mexico, according to an indictment unsealed on Friday."
  },
  {
    "title": "EU Hits Elon Musk’s X With $140 Million Fine",
    "link": "https://www.nytimes.com/2025/12/05/technology/eu-elon-musk-x-140-million-fine.html",
    "summary": "The case over online transparency has become a flashpoint between the European Union and the Trump administration."
  },
  {
    "title": "How Scammers Target Older Americans With Fraudulent Medicare Calls",
    "link": "https://www.nytimes.com/2025/12/05/business/medicare-scam-calls.html",
    "summary": "Complaints about the calls have risen, and some older Americans have discovered that their Medicare accounts were already compromised."
  },
  {
    "title": "Where Is Jacob? His Mother Won’t Say, and the Police Cannot Find Him.",
    "link": "https://www.nytimes.com/2025/12/04/nyregion/brownsville-missing-child-nyc.html",
    "summary": "Jacob Pritchett, 11, has been missing for months. A judge has said his mother must remain at Rikers Island until she reveals his whereabouts."
  }
]