[
  {
    "title": "More Agents Head to Minnesota as U.S. Takes Over Shooting Investigation",
    "link": "https://www.nytimes.com/2026/01/08/us/minnesota-ice-shooting-news.html",
    "summary": "A day after an ICE agent fatally shot a 37-year-old woman in Minneapolis, the governor activated the state’s National Guard, and 100 more federal agents were also being deployed."
  },
  {
    "title": "U.S. Border Patrol Agents Shoot 2 in Portland During Traffic Stop",
    "link": "https://www.nytimes.com/2026/01/08/us/politics/federal-agents-shooting-portland.html",
    "summary": "The shooting came as Minneapolis grappled with a federal agent’s killing of a woman a day earlier, prompting calls from local leaders for an end to the Trump administration’s immigration crackdown."
  },
  {
    "title": "Trump Addresses Venezuela, Greenland and Presidential Power in New York Times Interview",
    "link": "https://www.nytimes.com/2026/01/08/us/politics/trump-interview-power-morality.html",
    "summary": "On topic after topic, President Trump made clear that he would be the arbiter of any limits to his authorities, not international law or treaties."
  },
  {
    "title": "The Next Phase of Trump’s Renovations: A New ‘Upper West Wing’",
    "link": "https://www.nytimes.com/2026/01/08/us/politics/trump-white-house-west-wing-renovation.html",
    "summary": "Besides changes to the White House, President Trump also said he planned to tear up the brick walkways in Lafayette Park and replace them with granite."
  },
  {
    "title": "The Many Faces of Trump: What We Saw When We Interviewed the President",
    "link": "https://www.nytimes.com/2026/01/08/us/politics/trump-oval-office-interview-scene.html",
    "summary": "He let reporters in on a call with Colombia’s president. He complained about Zohran Mamdani. He called JD Vance and Marco Rubio “kids.” Inside an unpredictable evening with President Trump."
  },
  {
    "title": "Senate Advances Measure to Curb Trump’s Use of Force in Venezuela",
    "link": "https://www.nytimes.com/2026/01/08/us/politics/senate-trump-venezuela-military.html",
    "summary": "A handful of Republicans joined Democrats to allow the measure to move forward, reflecting concerns in both parties about the administration’s strategy."
  },
  {
    "title": "These 5 Republicans Broke With Trump on Venezuela War Powers",
    "link": "https://www.nytimes.com/2026/01/08/us/politics/five-republicans-congress-trump-venezuela.html",
    "summary": "The Republican defectors paved the way for a debate that could expose bipartisan concern about President Trump’s actions in Venezuela. Mr. Trump called for them to lose their seats."
  },
  {
    "title": "Russia Appears to Use Nuclear-Capable Missile in Ukraine",
    "link": "https://www.nytimes.com/2026/01/08/world/europe/russia-ukraine-nuclear-capable-missile.html",
    "summary": "If confirmed, the use of the missile would be an ominous threat to Ukraine and its Western allies."
  },
  {
    "title": "Ukraine Awards Major Lithium Project to Investors With Links to Trump",
    "link": "https://www.nytimes.com/2026/01/08/world/europe/trump-lauder-ukraine-lithium.html",
    "summary": "Ronald S. Lauder, a billionaire friend of Mr. Trump, is among the investors. The move comes as the Trump administration looks for investment opportunities in Ukraine."
  },
  {
    "title": "House Passes Doomed Bill to Restore ACA Subsidies",
    "link": "https://www.nytimes.com/2026/01/08/us/politics/house-bill-aca-subsidies.html",
    "summary": "The passage of the bill was a triumph for Democrats, who drew substantial Republican backing. But it has no path forward, and an election-year compromise is a long shot."
  },
  {
    "title": "Congress Tries, but Fails, to Take a Stand for Its Own Powers",
    "link": "https://www.nytimes.com/2026/01/08/us/politics/trump-power-congress-veto.html",
    "summary": "House votes to override a pair of Trump vetoes were an unusual bid by some in the G.O.P. to assert their own branch’s prerogatives. But they fell short."
  },
  {
    "title": "Trump Urges Voters to Oust Republicans, Including Susan Collins",
    "link": "https://www.nytimes.com/2026/01/08/us/politics/trump-senate-republicans-susan-collins.html",
    "summary": "After five G.O.P. senators joined Democrats on a war powers vote, the president lashed out, including at his party’s most politically endangered senator."
  },
  {
    "title": "Dogs Build Their Vocabularies Like Toddlers",
    "link": "https://www.nytimes.com/2026/01/08/science/dogs-research-vocabulary-toys.html",
    "summary": "Eavesdropping on their owners seems to help some toy-crazy and talented pups learn more words."
  },
  {
    "title": "Iran Is Cut Off From Internet as Protests Calling for Regime Change Intensify",
    "link": "https://www.nytimes.com/2026/01/08/world/middleeast/iran-protests-internet-shutdown.html",
    "summary": "As protests swelled around the country, Iran’s internet was shut down, and the heads of its judiciary and its security services warned of a harsh response amid calls for “freedom, freedom.”"
  },
  {
    "title": "Inside Myanmar’s Gilded Capital, Empty Streets and Moldy Corners",
    "link": "https://www.nytimes.com/2026/01/09/world/asia/myanmar-capital-naypyidaw.html",
    "summary": "Myanmar’s junta created a capital to withstand an invasion. Now, the military struggles to project an image of control over a crumbling nation."
  },
  {
    "title": "Hochul and Mamdani Announce Plan to Make N.Y. Child Care Universal",
    "link": "https://www.nytimes.com/2026/01/08/nyregion/mamdani-hochul-child-care.html",
    "summary": "Gov. Kathy Hochul and Mayor Zohran Mamdani described a complex and expensive expansion of child care in New York City that would add programs for 2-year-olds."
  },
  {
    "title": "Amid Opening Sprint, Mamdani Paused to Socialize With Steven Spielberg",
    "link": "https://www.nytimes.com/2026/01/08/nyregion/steven-spielberg-zohran-mamdani-meeting.html",
    "summary": "Zohran Mamdani, the new mayor of New York, made a private visit to the billionaire film director’s Central Park West apartment this week."
  },
  {
    "title": "The Rise of the Self-Serve Blood Test",
    "link": "https://www.nytimes.com/2026/01/08/well/function-health-blood-tests.html",
    "summary": "The start-up Function will send practically anyone to a lab for extensive medical testing, no physical required. Is that a good thing?"
  },
  {
    "title": "Once Again, a Newfoundland Town Rescues Stranded Passengers",
    "link": "https://www.nytimes.com/2026/01/08/world/canada/gander-canada-airport-stranded-travelers.html",
    "summary": "After 9/11, Gander took in thousands of people whose flights were diverted. History repeated on a smaller scale this week."
  },
  {
    "title": "Former Uvalde Teacher’s Testimony Throws a Trial Into Chaos",
    "link": "https://www.nytimes.com/2026/01/08/us/uvalde-shooting-teacher-testimony-trial.html",
    "summary": "Lawyers for a former officer charged with abandoning children in the police response accused prosecutors of withholding information. A judge ruled prosecutors had erred but denied a motion for a mistrial."
  },
  {
    "title": "What Happens When No One Can Say No to Trump?",
    "link": "https://www.nytimes.com/video/opinion/100000010632349/what-happens-when-no-one-can-say-no-to-trump.html",
    "summary": "After the capture of the Venezuelan president, Nicolás Maduro, over the weekend, “Trump is setting a new course for the country where he can use the military to do just about anything he wants,” argues Times Opinion’s editor, Kathleen Kingsbury. “No one is allowed to say ‘no’ to Trump.”"
  },
  {
    "title": "I’m the Mayor of Minneapolis. Trump Is Lying to You.",
    "link": "https://www.nytimes.com/2026/01/08/opinion/minneapolis-ice-agent-shooting-trump.html",
    "summary": "This administration is making cities less safe."
  },
  {
    "title": "N.Y.P.D. Fatally Shoots Blade-Wielding Man in Hospital, Officials Say",
    "link": "https://www.nytimes.com/2026/01/08/nyregion/nypd-shooting-hospital-brooklyn.html",
    "summary": "The man had cut and then barricaded himself in a blood-spattered room with a patient and a security guard at NewYork-Presbyterian Brooklyn Methodist Hospital, the police said."
  },
  {
    "title": "NASA Will Bring I.S.S. Astronauts Home Early After Medical Issue",
    "link": "https://www.nytimes.com/2026/01/08/science/nasa-astronaut-medical-problem.html",
    "summary": "After canceling a spacewalk planned for Thursday, the space agency’s administrator said it was erring on the side of caution and bringing a crew of four home in the coming days."
  },
  {
    "title": "Families of Slain Idaho Students Sue the University the Killer Attended",
    "link": "https://www.nytimes.com/2026/01/08/us/idaho-murders-kohberger-victim-families-lawsuit.html",
    "summary": "A new lawsuit claims that Washington State University, where Bryan Kohberger was a Ph.D. student, failed to take decisive action on earlier complaints that he was stalking women."
  },
  {
    "title": "Why Cambodia Handed Over a Man Accused of Stealing Billions in Crypto Scam",
    "link": "https://www.nytimes.com/2026/01/08/world/asia/cambodia-scam-china-prince-group-chen.html",
    "summary": "Experts say the scam industry has become a pillar of Cambodia’s economy, but it is under pressure from other countries to crack down."
  }
]