[
  {
    "title": "Trump’s Call to Resume Nuclear Testing After Decades Revives a Cold War Debate",
    "link": "https://www.nytimes.com/2025/10/30/us/politics/trump-nuclear-testing-cold-war.html",
    "summary": "President Trump explained the order by saying other, unnamed nations were testing their own nuclear weapons, even though no country has tested since 2017."
  },
  {
    "title": "In China Truce on Tariffs and Rare Earths, National Security Controls Are Bargaining Chip",
    "link": "https://www.nytimes.com/2025/10/30/us/politics/china-trump-trade-security-chips-minerals.html",
    "summary": "Some analysts say Beijing won a major victory in its trade talks: Getting the U.S. to withdraw a national security measure that previously was not under discussion."
  },
  {
    "title": "What to Know About US Nuclear Weapons as Trump Threatens to Restart Testing",
    "link": "https://www.nytimes.com/2025/10/30/science/us-nuclear-weapons-atomic-bombs.html",
    "summary": "Though the country’s nuclear arsenal has undergone no explosive testing for decades, federal experts say it can reliably obliterate targets halfway around the globe."
  },
  {
    "title": "Judge Skeptical Over Trump Administration Decision to Suspend Food Stamps",
    "link": "https://www.nytimes.com/2025/10/30/us/politics/food-stamps-shutdown.html",
    "summary": "The arguments at times appeared to frustrate the judge, who promised to rule soon on a suit filed by roughly two dozen states seeking to ensure people don’t go hungry as a result of a budgetary dispute."
  },
  {
    "title": "In Louisiana, Threat of Lost SNAP Food Benefits Is Rattling the Vulnerable",
    "link": "https://www.nytimes.com/2025/10/30/us/politics/louisiana-snap-benefit-cuts.html",
    "summary": "The state has vowed to step in and provide food assistance for many who face a cut-off in federal SNAP aid. But there is still fear and anxiety about how to get by."
  },
  {
    "title": "Older New Yorkers Brace for Food Stamp Cuts: ‘I’m Just Praying’",
    "link": "https://www.nytimes.com/2025/10/30/nyregion/nyc-snap-food-stamps-shutdown.html",
    "summary": "The SNAP program is losing federal funding on Saturday. Many older people won’t be able to easily line up at food pantries or go out and get second jobs."
  },
  {
    "title": "Executions and Mass Casualties: Videos Show Horror Unfolding in Sudan",
    "link": "https://www.nytimes.com/2025/10/30/world/africa/sudan-el-fasher-atrocities-executions-video.html",
    "summary": "Evidence of atrocities emerging from the city of El Fasher stoked fears that the Sudanese region of Darfur is plunging, once again, into a cycle of genocidal violence."
  },
  {
    "title": "Trump Officials Move Into Military Residences in D.C. Area",
    "link": "https://www.nytimes.com/2025/10/30/us/politics/trump-officials-military-housing.html",
    "summary": "Defense Secretary Pete Hegseth moved into a home at Fort McNair traditionally reserved for the Army’s vice chief of staff. Secretary of State Marco Rubio and others also now live in military housing."
  },
  {
    "title": "Air Traffic Controller Staff Shortage Causes Delays in Orlando and at Other Airports",
    "link": "https://www.nytimes.com/2025/10/30/us/politics/orlando-air-traffic-control-airports-shutdown.html",
    "summary": "The F.A.A. warned that a lack of certified air traffic controllers in Orlando could cause delays throughout the East Coast."
  },
  {
    "title": "Trump Calls on Republicans to End Filibuster in Shutdown Fight",
    "link": "https://www.nytimes.com/2025/10/31/us/politics/trump-filibuster-shutdown.html",
    "summary": "The president said it was time for G.O.P. leaders to get rid of the longstanding rule requiring most Senate legislation to have 60 votes to pass."
  },
  {
    "title": "A Top Trump Official Had to Sell His Stock. He May Have Saved Millions.",
    "link": "https://www.nytimes.com/2025/10/30/us/politics/frank-bisignano-fiserv-stock-price.html",
    "summary": "Frank Bisignano, who holds top jobs at the Social Security Administration and the I.R.S., sold his stake in Fiserv before the company’s stock cratered this week."
  },
  {
    "title": "JPMorgan Alerted U.S. to Epstein Transfers Involving Wall St. Figures",
    "link": "https://www.nytimes.com/2025/10/30/business/jpmorgan-jeffrey-epstein.html",
    "summary": "After Jeffrey Epstein’s 2019 death, the bank reported more than $1 billion in potentially suspicious transactions."
  },
  {
    "title": "Prince Andrew to Be Stripped of His Royal Title",
    "link": "https://www.nytimes.com/2025/10/30/world/europe/uk-prince-andrew-title.html",
    "summary": "The extraordinary move caps his fall from grace over his ties to the convicted sexual predator Jeffrey Epstein."
  },
  {
    "title": "2 Men Die in Basement Flooding as Sudden Downpour Hits New York Area",
    "link": "https://www.nytimes.com/2025/10/30/nyregion/nyc-floods-brooklyn-basement-death.html",
    "summary": "Much of the rainfall came in an intense 20-minute period in the afternoon, officials said. A record two inches fell at LaGuardia Airport."
  },
  {
    "title": "Amid Flattened Homes, Jamaica Starts to Assess Hurricane Melissa’s Damage",
    "link": "https://www.nytimes.com/2025/10/30/us/hurricane-melissa-jamaica.html",
    "summary": "The Jamaican authorities said they were not able to confirm the death toll from the storm yet, but expected it to rise in the coming days. At least 30 people died in Haiti, officials said."
  },
  {
    "title": "A Texas Family Rode Out Hurricane Melissa at a Jamaican Beach Resort",
    "link": "https://www.nytimes.com/2025/10/30/travel/hurricane-melissa-jamaica-resort.html",
    "summary": "A Texas woman stranded in Jamaica with her family described what it was like to experience the catastrophic storm while sheltering at a Sandals resort."
  },
  {
    "title": "Jamaica Prepared a Financial Fortress for Disaster. Hurricane Melissa Will Test It.",
    "link": "https://www.nytimes.com/2025/10/30/world/americas/jamaica-hurricane-melissa-disaster-preparedness-finances.html",
    "summary": "All of Jamaica’s financial defenses — insurance, bonds and credit lines — could be deployed to recover from Hurricane Melissa. Will it be enough?"
  },
  {
    "title": "Gov. Gavin Newsom Turns California Election Into Possible 2028 Platform",
    "link": "https://www.nytimes.com/2025/10/30/us/newsom-california-proposition-50-presidential.html",
    "summary": "Gov. Gavin Newsom has attracted support for his redistricting ballot measure from voters outside of California. He could reap the benefits for a 2028 presidential run."
  },
  {
    "title": "Ohio Republicans Gain Ground in Push for More Seats in Congress",
    "link": "https://www.nytimes.com/2025/10/30/us/politics/ohio-redistricting-deal.html",
    "summary": "The map, which is expected to be approved on Friday morning by the state’s redistricting commission, improves Republicans’ odds of picking up two more seats."
  },
  {
    "title": "Apple’s iPhones Fuel Record Sales and Profit",
    "link": "https://www.nytimes.com/2025/10/30/business/apple-earnings.html",
    "summary": "The company’s revenue rose to above $100 billion in the quarter for the first time, and profit soared 86 percent."
  },
  {
    "title": "Amazon’s Profit Is Up 38% on Strong Performance",
    "link": "https://www.nytimes.com/2025/10/30/business/amazon-earnings.html",
    "summary": "After unexpectedly strong sales and profits across its consumer and cloud businesses, the tech giant said another strong quarter might be ahead."
  },
  {
    "title": "Hey, Lefties! Trump Has Stolen Your Game.",
    "link": "https://www.nytimes.com/2025/10/30/opinion/trump-conservatives-progressives.html",
    "summary": "MAGA is using left ideas to destroy the left."
  },
  {
    "title": "I Now Mispronounce You the Likely Next Mayor of New York City",
    "link": "https://www.nytimes.com/2025/10/30/opinion/mispronouncing-mamdani.html",
    "summary": "A lot of people seem to trip over Zohran Mamdani’s name. The reason may not be as simple as it seems."
  },
  {
    "title": "Democrats Condemn Trump Officials for Boat Strike Secrecy",
    "link": "https://www.nytimes.com/2025/10/30/us/politics/trump-democrats-boat-strikes.html",
    "summary": "Senator Mark Warner said the administration’s decision to hold a Republicans-only briefing on the campaign was “corrosive to our democracy.”"
  },
  {
    "title": "Thieves Steal More Than 1,000 Items From Oakland Museum of California",
    "link": "https://www.nytimes.com/2025/10/30/arts/design/museum-heist-oakland-california.html",
    "summary": "A robbery this month targeted Indigenous baskets, jewelry and other artifacts from a storage facility of the Oakland Museum of California."
  },
  {
    "title": "Sean ‘Diddy’ Combs Transferred to Federal Prison in New Jersey",
    "link": "https://www.nytimes.com/2025/10/30/arts/music/sean-combs-diddy-prison.html",
    "summary": "The music mogul was sentenced earlier this month to 50 months in prison for two counts of transportation to engage in prostitution."
  },
  {
    "title": "Marthe Gautier, 96, Dies; Had Key Role in Down Syndrome Breakthrough",
    "link": "https://www.nytimes.com/2025/10/30/health/marthe-gautier-dead.html",
    "summary": "She had to fight for recognition after a male colleague took credit for her work in identifying an extra chromosome as the cause of that genetic condition."
  }
]