[
  {
    "title": "California Rolls Back Its Landmark Environmental Law",
    "link": "https://www.nytimes.com/2025/06/30/us/california-environment-newsom-ceqa.html",
    "summary": "Gov. Gavin Newsom and state lawmakers scaled back a law that was vilified for its role in California’s housing shortage and homelessness crisis."
  },
  {
    "title": "Here Are the Republican Senators Who May Revolt on Trump’s Bill",
    "link": "https://www.nytimes.com/2025/06/30/us/politics/republican-senators-against-trump-big-bill.html",
    "summary": "Senate Republicans can afford to lose no more than three of their own votes on the bill, but two already are opposed and others remained undecided."
  },
  {
    "title": "The Republicans in Congress Who Are Opting to Self-Deport From Washington",
    "link": "https://www.nytimes.com/2025/06/30/us/politics/tillis-bacon-trump-gop.html",
    "summary": "Feeling out of step with President Trump’s G.O.P., Senator Thom Tillis and Representative Don Bacon are deciding to retire."
  },
  {
    "title": "Elon Musk Promises a New Political Party if Republicans Pass Trump’s Policy Bill",
    "link": "https://www.nytimes.com/2025/06/30/us/politics/elon-musk-trump-bill-republicans.html",
    "summary": "The billionaire and former Trump adviser suggested that if the domestic policy bill passed, he would swiftly form a new “America Party” and back primary challenges to Republicans."
  },
  {
    "title": "Bryan Kohberger, Suspect in Idaho Student Murders, Accepts Plea Deal",
    "link": "https://www.nytimes.com/2025/06/30/us/idaho-murders-bryan-kohberger-plea.html",
    "summary": "Bryan Kohberger, a former criminology student, is charged in the stabbing deaths of four University of Idaho students. Prosecutors said they had reached a plea agreement that avoids the death penalty."
  },
  {
    "title": "Idaho Murders Suspect Felt ‘No Emotion’ and ‘Little Remorse’ as a Teen",
    "link": "https://www.nytimes.com/2023/01/13/us/idaho-murders-bryan-kohberger.html",
    "summary": "Messages and online posts from the Ph.D. student now charged with four murders show that he was once detached and suicidal before he became fascinated with criminals’ minds."
  },
  {
    "title": "The Dollar Has Its Worst Start to a Year Since 1973",
    "link": "https://www.nytimes.com/2025/06/30/business/dollar-decline-trump.html",
    "summary": "It has continued to slide even as President Trump has backed down from his tariff threats and the U.S. stock market has recovered from its losses."
  },
  {
    "title": "Trump Steps Up Pressure Campaign on Powell With Handwritten Note",
    "link": "https://www.nytimes.com/2025/06/30/business/trump-powell-fed-handwritten-note.html",
    "summary": "President Trump has repeatedly attacked Jerome H. Powell, chair of the Federal Reserve, for resisting his demands for lower interest rates."
  },
  {
    "title": "Can Canada Offset Trump Tariff War by Trading More Domestically?",
    "link": "https://www.nytimes.com/2025/06/30/world/canada/canada-internal-trade-barriers.html",
    "summary": "Prime Minister Mark Carney will meet his pledge to eliminate the country’s internal trade barriers by July 1. But economists say it’s not a substitute for lost U.S. trade."
  },
  {
    "title": "‘The Bear’ Is Back, but Where’s the Beef?",
    "link": "https://www.nytimes.com/2025/06/30/arts/television/the-bear-season-4-review.html",
    "summary": "The restaurant’s business challenge in Season 4 — balancing comfort food and haute cuisine — is also a metaphor for the show’s creative issues."
  },
  {
    "title": "Appeals Court Weighs Trump’s Use of Alien Enemies Act for Deportations",
    "link": "https://www.nytimes.com/2025/06/30/us/politics/appeals-court-trump-alien-enemies-act-deportations.html",
    "summary": "The case is likely to be the first to reach the Supreme Court on the substantive issue of the president’s invocation of a rarely used wartime law."
  },
  {
    "title": "Why Trump Had So Many Supreme Court Wins",
    "link": "https://www.nytimes.com/video/us/100000010256773/why-trump-had-so-many-supreme-court-wins.html",
    "summary": "The New York Times Supreme Court reporter Adam Liptak recaps this Supreme Court term, which was defined by a disproportionate amount of emergency docket cases. Liptak explains why these cases tended to go in the Trump administration’s favor."
  },
  {
    "title": "Bush, Obama and Bono Commend USAID Staff Members on Their Last Day",
    "link": "https://www.nytimes.com/2025/06/30/us/politics/usaid-staff-obama-bush-bono.html",
    "summary": "Two ex-presidents and a rock star thanked the outgoing workers of a doomed agency."
  },
  {
    "title": "NYC Panel Approves Rent Increases, a Key Issue for Mamdani and Adams",
    "link": "https://www.nytimes.com/2025/06/30/nyregion/nyc-mamdani-adams-rent-increase.html",
    "summary": "Mayor Eric Adams, who appointed the Rent Guidelines Board, has attacked Zohran Mamdani’s pledge to freeze the rent if he becomes mayor."
  },
  {
    "title": "Landlords Say They’re Struggling. Rents Keep Going Up. What Gives?",
    "link": "https://www.nytimes.com/2025/06/18/nyregion/nyc-landlords-rent-stabilization.html",
    "summary": "New York City could soon raise rents on some of its most affordable apartments to help landlords who say they aren’t earning enough. But renters say they’re hurting, too."
  },
  {
    "title": "How the Hottest Place in India Survives",
    "link": "https://www.nytimes.com/2025/07/01/world/asia/india-heat.html",
    "summary": "It’s 40 degrees Celsius (104 Fahrenheit), and it’s only 10 a.m. Welcome to Sri Ganganagar."
  },
  {
    "title": "Dangerous Heat Grips Much of Europe, With More to Come",
    "link": "https://www.nytimes.com/2025/06/30/world/europe/europe-heat-wave.html",
    "summary": "A punishing heat wave broke records in southern Europe and hasn’t peaked yet in some places, prompting warnings to residents, employers and tourists to alter their habits."
  },
  {
    "title": "Gulf States Lead Push to Invest in New Syria",
    "link": "https://www.nytimes.com/2025/06/30/world/middleeast/gulf-states-invest-syria-iran.html",
    "summary": "The fall of the Syrian dictator Bashar al-Assad has opened a window for wealthy Gulf countries to expand their influence as the sway of Iran diminishes."
  },
  {
    "title": "Trump Lifts Sanctions on Syria, Tightening His Embrace of Its New Leader",
    "link": "https://www.nytimes.com/2025/06/30/us/politics/trump-syria-sanctions.html",
    "summary": "U.S. officials said sanctions against targets such as its central bank would end, but they would remain on Syria’s former dictator, Bashar al-Assad."
  },
  {
    "title": "Trump’s Immigration Crackdown in L.A. Upends Everyday Life for Latinos",
    "link": "https://www.nytimes.com/2025/06/30/us/latinos-los-angeles-immigration.html",
    "summary": "Anxiety over federal immigration detentions has gripped thousands of residents in the area and led many to limit the time they spend in public."
  },
  {
    "title": "A Common Assumption About Aging May Be Wrong, Study Suggests",
    "link": "https://www.nytimes.com/2025/06/30/well/live/aging-inflammation-lifespan-environment.html",
    "summary": "Experts have long pointed to inflammation as a natural part of getting older. But a new paper suggests it might be more a product of our environment."
  },
  {
    "title": "At Glastonbury, Left-Wing Politics Are Shocking Again",
    "link": "https://www.nytimes.com/2025/06/30/opinion/glastonbury-bob-vylan-israel.html",
    "summary": "Trying to stamp out anti-Israel rhetoric only lends it the frisson of forbidden truth."
  },
  {
    "title": "China Used to Emulate America. Now the Reverse Is True.",
    "link": "https://www.nytimes.com/2025/07/01/opinion/america-china-similarities-differences.html",
    "summary": "In the great dance between the two rivals, it’s getting harder to tell which of them is leading and which is following."
  },
  {
    "title": "BP, Once a Hunter in the Oil Industry, Is Now Prey. What Went Wrong?",
    "link": "https://www.nytimes.com/2025/07/01/business/bp-takeover-shell-oil-gas.html",
    "summary": "The energy giant has been weakened by years of mishaps and poor decisions, leading to rumors of a takeover that may not subside."
  },
  {
    "title": "Firefighters Battle Three Blazes East of Los Angeles",
    "link": "https://www.nytimes.com/2025/06/30/us/juniper-fire-riverside-county.html",
    "summary": "Two of the three fires in Riverside County were only 30 percent contained. An evacuation order for one of them that had affected about 5,000 residents was lifted on Monday night."
  },
  {
    "title": "How the Brooklyn Bridge Ship Disaster Unfolded",
    "link": "https://www.nytimes.com/2025/06/30/nyregion/brooklyn-mexican-naval-ship-crash-report.html",
    "summary": "An initial report from the National Transportation Safety Board described the moments before a Mexican Navy ship crashed into the Brooklyn Bridge."
  },
  {
    "title": "Idaho Shooting Suspect Identified in Deadly Ambush of Firefighters",
    "link": "https://www.nytimes.com/2025/06/30/us/wess-roley-idaho-shooting-suspect.html",
    "summary": "The authorities say that a man who fatally shot two firefighters in Idaho set a brush fire and shot at those who responded, killing two and injuring a third."
  }
]