[
  {
    "title": "Trump Escalates Tariff Threats, Showing Little Interest in New Trade Deals",
    "link": "https://www.nytimes.com/2025/07/12/business/economy/trump-tariffs-deals.html",
    "summary": "The president’s supporters portray him as a top dealmaker. But, at least for now, far more trading partners have gotten stiff tariffs than trade deals."
  },
  {
    "title": "How Luggage Maker Eagle Creek Has Survived Trump’s Trade War. So Far.",
    "link": "https://www.nytimes.com/2025/07/11/business/trump-tariffs-eagle-creek.html",
    "summary": "Eagle Creek’s experience underscores how President Trump’s chaotic approach to tariffs is having a real impact, even before the toughest levies take effect."
  },
  {
    "title": "Trump Tariff Letters: See the Latest Rates and Countries Affected",
    "link": "https://www.nytimes.com/2025/07/07/business/trump-tariffs-trade-deals-august-1.html",
    "summary": "President Trump has told more than two dozen countries that they will face tariffs of at least 20 percent on Aug. 1 if they don’t reach agreements by then."
  },
  {
    "title": "After Texas Floods, Summer Camps Reassess Safety Measures Amid Parental Concerns",
    "link": "https://www.nytimes.com/2025/07/12/us/summer-camps-safety.html",
    "summary": "Camp officials across the country said they had heard from worried parents after the Texas floods. As they try to reassure them, some camps are adding more safety procedures."
  },
  {
    "title": "After Texas Disaster, Trump Shifts His Tone on FEMA",
    "link": "https://www.nytimes.com/2025/07/11/us/politics/trump-fema-texas-flood.html",
    "summary": "Earlier this year, President Trump suggested he wanted to shutter the agency. Now, he says his aides “fixed it up in no time.”"
  },
  {
    "title": "An Army of Searchers Combs the Banks of the Guadalupe for the Missing",
    "link": "https://www.nytimes.com/2025/07/12/nyregion/an-army-of-searchers-combs-the-banks-of-the-guadalupe-for-the-missing.html",
    "summary": "Volunteers and professionals from around the country and Mexico are still searching the challenging terrain for victims of the Texas flood."
  },
  {
    "title": "What to Know About the Central Texas Floods: Death Toll, Map and More",
    "link": "https://www.nytimes.com/2025/07/07/us/texas-floods-kerr-county.html",
    "summary": "At least 129 people, including three dozen children, died in the torrential downpour. Many remain missing in the hardest-hit county."
  },
  {
    "title": "Trump’s Birthright Citizenship Ban Faces New Peril: Class Actions",
    "link": "https://www.nytimes.com/2025/07/12/us/politics/birthright-citizenship-class-action.html",
    "summary": "In last month’s decision limiting one judicial tool, universal injunctions, the court seemed to invite lower courts to use class actions as an alternative."
  },
  {
    "title": "ICE Set to Vastly Expand Its Reach With New Funds",
    "link": "https://www.nytimes.com/2025/07/12/us/politics/ice-expansion-concerns.html",
    "summary": "After the passage of President Trump’s domestic policy law, the Department of Homeland Security is poised to hire thousands of new immigration agents and double detention space."
  },
  {
    "title": "ICE Raids Scare Off L.A. Workers Rebuilding Fire-Torn Areas",
    "link": "https://www.nytimes.com/2025/07/12/us/ice-raid-altadena-palisades-rebuilding.html",
    "summary": "Immigrant workers are central to recovery efforts in neighborhoods burned in the January wildfires, but recent raids have led some to stay home."
  },
  {
    "title": "UnitedHealth’s Campaign to Quiet Critics",
    "link": "https://www.nytimes.com/2025/07/12/business/unitedhealth-insurance-criticism.html",
    "summary": "The company has invoked the murder of an executive last year to complain about coverage in news outlets, on streaming services and on social media."
  },
  {
    "title": "Our Investigation of UnitedHealth Started With a Tip",
    "link": "https://www.nytimes.com/2025/07/12/insider/unitedhealth-tip.html",
    "summary": "A reporter was familiar with the insurance giant under scrutiny and the law firm known for its attack stance. Then one hired the other."
  },
  {
    "title": "How ‘Superman’ Star David Corenswet Won the Role",
    "link": "https://www.nytimes.com/2025/07/12/movies/david-corenswet-superman.html",
    "summary": "The actor has a man-out-of-time quality that makes him surprisingly like his character. But he is hyperaware of the present expectations riding on his performance."
  },
  {
    "title": "Can ‘Superman’ Fly Above Today’s Polarized Politics?",
    "link": "https://www.nytimes.com/2025/07/11/movies/superman-politics-backlash.html",
    "summary": "The director of the reboot, James Gunn, called the superhero from the planet Krypton “an immigrant,” thrusting the summer popcorn movie into an Earthbound culture war."
  },
  {
    "title": "Texas Court Seals Records in Ken Paxton’s Divorce Case",
    "link": "https://www.nytimes.com/2025/07/12/us/texas-ag-paxton-divorce-records.html",
    "summary": "The order meant details in the case, which involves allegations of adultery, would not be public as the Texas attorney general challenges Senator John Cornyn in the 2026 primary."
  },
  {
    "title": "It’s YouTube v. Netflix as the Streaming Wars Come Down to 2",
    "link": "https://www.nytimes.com/2025/07/12/business/media/youtube-netflix-streaming.html",
    "summary": "The two giant video companies have far different strategies, but the same goal: controlling your TV set."
  },
  {
    "title": "Spend an Hour in the Dark With Bats, Cats and Naked Mole Rats",
    "link": "https://www.nytimes.com/2025/07/12/nyregion/spend-an-hour-in-the-dark-with-bats-cats-and-naked-mole-rats.html",
    "summary": "The Bronx Zoo has reopened its World of Darkness exhibit after a 16-year hiatus."
  },
  {
    "title": "Air India Plane Crash Report Says Fuel to Engines Was Cut Off",
    "link": "https://www.nytimes.com/2025/07/11/world/asia/air-india-crash-report.html",
    "summary": "A focus on the Boeing 787’s fuel switches in a preliminary assessment raised questions about the pilots’ actions, but much is still unknown about Flight 171."
  },
  {
    "title": "Timeline Details Final Seconds of Crashed Air India Flight",
    "link": "https://www.nytimes.com/2025/07/12/world/asia/air-india-crash-report-timeline.html",
    "summary": "Investigators released a preliminary account of the crash, describing how the plane struggled after its fuel supply was cut."
  },
  {
    "title": "Trump’s Cabinet of Incompetents",
    "link": "https://www.nytimes.com/2025/07/12/opinion/trump-cabinet-hegseth-bondi.html",
    "summary": "Putting talking heads in charge — not the best idea."
  },
  {
    "title": "Two Palestinians Are Killed in a West Bank Clash With Israeli Settlers",
    "link": "https://www.nytimes.com/2025/07/12/world/middleeast/palestinians-killed-by-israelis-in-west-bank.html",
    "summary": "Palestinian authorities and family members said Israeli settlers beat and killed a Palestinian-American man. Israel said the violence began when Palestinians threw stones at Israeli civilians."
  },
  {
    "title": "Grok Chatbot Mirrored X Users’ ‘Extremist Views’ in Antisemitic Posts, xAI Says",
    "link": "https://www.nytimes.com/2025/07/12/technology/x-ai-grok-antisemitism.html",
    "summary": "Elon Musk’s artificial intelligence company said its Grok chatbot had also undergone a code update that caused it to share antisemitic messages this week."
  },
  {
    "title": "Bill Dilworth, Caretaker of ‘The New York Earth Room,’ Is Dead at 70",
    "link": "https://www.nytimes.com/2025/07/12/arts/bill-dilworth-dead.html",
    "summary": "For decades, he tended a SoHo loft filled with dirt, made by the conceptual artist Walter De Maria. People made pilgrimages to see it — and Mr. Dilworth, its magnetic steward."
  },
  {
    "title": "You Saved and Saved for Retirement. Now You Need a Plan to Cash Out.",
    "link": "https://www.nytimes.com/2025/07/12/business/retirement-assets-savings.html",
    "summary": "Most people enter retirement without any idea how to manage withdrawing their savings without running out of money. Here is what you need to know."
  }
]