[
  {
    "title": "What Is the Filibuster and Why Does Trump Want It Gone?",
    "link": "https://www.nytimes.com/2025/10/31/us/politics/senate-filibuster-government-shutdown.html",
    "summary": "The Senate majority leader is unwilling to pursue the “nuclear option” to blow past a Democratic filibuster and reopen the government."
  },
  {
    "title": "As Government Shutdown Slows Air Traffic Training, These Schools Are Stepping In",
    "link": "https://www.nytimes.com/2025/10/31/us/politics/air-traffic-control-training-shutdown.html",
    "summary": "New programs cannot turn out the numbers needed to make up for the controller shortfall. But they hope to have a higher success rate than the Federal Aviation Agency’s official academy."
  },
  {
    "title": "In One Jamaican Town, Hurricane Melissa Left Behind Floodwaters and Dead Livestock",
    "link": "https://www.nytimes.com/2025/10/31/world/americas/hurricane-melissa-jamaica-flooding.html",
    "summary": "The Category 5 storm ravaged western Jamaica and drenched the small community of New River, where residents were coping with a massive clean up. At least 19 people have died nationwide, officials said."
  },
  {
    "title": "A.I. Is Making Death Threats Way More Realistic",
    "link": "https://www.nytimes.com/2025/10/31/business/media/artificial-intelligence-death-threats.html",
    "summary": "Online harassers are generating images and sounds that simulate their victims in violent situations."
  },
  {
    "title": "A.I. Spending Is Accelerating Among Tech’s Biggest Companies",
    "link": "https://www.nytimes.com/2025/10/31/technology/ai-spending-accelerating.html",
    "summary": "Despite the risk of a bubble, Google, Meta, Microsoft and Amazon plan to spend billions more on artificial intelligence than they already do."
  },
  {
    "title": "The Debate Dividing the Supreme Court’s Liberal Justices",
    "link": "https://www.nytimes.com/2025/10/31/us/politics/supreme-court-kagan-jackson-liberal-justices.html",
    "summary": "Outnumbered and facing vast stakes, Justices Kagan and Jackson are split over the best approach: investing in diplomacy inside the court or sounding the alarm outside."
  },
  {
    "title": "‘Frankenstein’ Has Always Held Up a Mirror. What Does It Show Us Now?",
    "link": "https://www.nytimes.com/2025/10/31/magazine/frankenstein-guillermo-del-toro-shelley.html",
    "summary": "In Guillermo del Toro’s new version, the answer lies in how deeply it explores the relationship between creator and created."
  },
  {
    "title": "What If You Spent Every Waking Moment Taking On Elon Musk?",
    "link": "https://www.nytimes.com/2025/10/31/business/elon-musk-aaron-greenspan-tech.html",
    "summary": "Aaron Greenspan was once a promising entrepreneur. He has spent the last two decades lobbing grenades at the country’s most powerful tech moguls."
  },
  {
    "title": "Republicans in Congress Show Signs of Angst Over Trump’s Trade War",
    "link": "https://www.nytimes.com/2025/10/31/us/politics/trump-republicans-congress-trade.html",
    "summary": "Senators opposed the president’s plan to import beef from Argentina and voted three times this week to end his power to enforce sweeping tariffs."
  },
  {
    "title": "Some of Trump’s Favorite Things on Asia Trip: A Crown and ‘Vicious’ Weapons",
    "link": "https://www.nytimes.com/2025/10/31/us/politics/trump-south-korea-china-trade.html",
    "summary": "President Trump traveled to Asia to be a statesman, a showman and a traveling salesman, depending on the audience."
  },
  {
    "title": "Coal Jobs or Climate? Trump’s Push Revives a Debate on the Navajo Nation.",
    "link": "https://www.nytimes.com/2025/10/31/business/trump-coal-jobs-navajo-nation.html",
    "summary": "As the economic engine for the region, coal offered solid work. But it has also used up water, polluted the air and raised health concerns."
  },
  {
    "title": "Are Wealth Taxes the Best Way to Tax the Ultra Rich?",
    "link": "https://www.nytimes.com/2025/10/31/business/economy/wealth-tax-france.html",
    "summary": "Plans for a wealth tax, which is dividing France, have gotten popular around the world as inequality has widened and government debt has risen."
  },
  {
    "title": "Trump Administration Seeks to Return Medical Debt to Credit Reports",
    "link": "https://www.nytimes.com/2025/10/31/your-money/medical-debt-credit-reports.html",
    "summary": "A federal rule restricting the debt’s inclusion has been canceled. Now, the consumer bureau is trying to overturn state restrictions."
  },
  {
    "title": "Interest Rates Are Falling. Why Are People Still Buying Money Market Funds?",
    "link": "https://www.nytimes.com/2025/10/31/business/interest-rates-money-markets-stocks-bonds.html",
    "summary": "The Federal Reserve’s rate cut will reduce investor returns, yet money market funds remain a good deal, our columnist says."
  },
  {
    "title": "Mamdani’s Speech About Being Muslim Resonates Beyond New York City",
    "link": "https://www.nytimes.com/2025/10/31/nyregion/mamdani-muslim-speech.html",
    "summary": "A video of a recent address by Zohran Mamdani, the Democratic mayoral candidate, has been viewed more than 25 million times."
  },
  {
    "title": "If Elected, How Might Mamdani Use Mayoral Power in Ways That Affect Israel?",
    "link": "https://www.nytimes.com/2025/10/31/nyregion/mamdani-boycott-israel.html",
    "summary": "Zohran Mamdani’s opposition to Israel’s treatment of Palestinians could influence New York City’s investments, his appointees and city policing tactics."
  },
  {
    "title": "JPMorgan Alerted U.S. to Epstein Transfers Involving Wall St. Figures",
    "link": "https://www.nytimes.com/2025/10/30/business/jpmorgan-jeffrey-epstein.html",
    "summary": "After Jeffrey Epstein’s 2019 death, the bank reported more than $1 billion in potentially suspicious transactions."
  },
  {
    "title": "Will the Unmaking of Prince Andrew Be the Making of King Charles?",
    "link": "https://www.nytimes.com/2025/10/31/world/europe/king-charles-prince-andrew.html",
    "summary": "The decision by King Charles III to strip the title of his brother Prince Andrew showed a level of accountability rarely applied to royals."
  },
  {
    "title": "What’s Next for Andrew After He Loses ‘Prince’ Title?",
    "link": "https://www.nytimes.com/2025/10/31/world/europe/prince-andrew-explainer.html",
    "summary": "King Charles III’s brother will retreat further from public life after additional damaging revelations about his ties to the sexual predator Jeffrey Epstein."
  },
  {
    "title": "A Legal Blizzard in Texas Targets Democrats and Promotes Ken Paxton",
    "link": "https://www.nytimes.com/2025/10/31/us/politics/ken-paxton.html",
    "summary": "The Texas attorney general has escalated the pace of high-profile legal actions, raising concern that his Senate campaign is influencing his law enforcement work."
  },
  {
    "title": "Virginia Advances Redistricting Plan Toward New Congressional Maps",
    "link": "https://www.nytimes.com/2025/10/31/us/virginia-redistricting.html",
    "summary": "The Democrat-controlled legislature approved an amendment that would allow redistricting next year, but the process will take months."
  },
  {
    "title": "NYC Marathon Guide 2025: The Route, Start Times and More",
    "link": "https://www.nytimes.com/2025/10/30/nyregion/2025-nyc-marathon-guide.html",
    "summary": "Everything you need to know about Sunday’s five-borough race."
  },
  {
    "title": "These Are the Best Places to Cheer for the New York City Marathon",
    "link": "https://www.nytimes.com/2025/10/30/nyregion/nyc-marathon-cheering-guide-spectators.html",
    "summary": "Here’s our guide to picking a good cheering location, whether you are following one runner’s progress or looking for a good spot to park yourself for the day."
  },
  {
    "title": "After ‘S.N.L.,’ Tim Meadows Found Success as a Second Fiddle",
    "link": "https://www.nytimes.com/2025/10/30/arts/television/tim-meadows-just-wants-to-keep-showing-up-to-be-funny.html",
    "summary": "Twenty-five years after he left “Saturday Night Live,” he is still reaching new audiences, most recently with a new CBS sitcom and a role in the DC Comics universe."
  },
  {
    "title": "The Way I Run Is the Way I Live",
    "link": "https://www.nytimes.com/2025/10/31/opinion/running-life.html",
    "summary": "There are deep connections between how I train and the way I live and work."
  },
  {
    "title": "At the Supreme Court, Liberal Justices Are Split",
    "link": "https://www.nytimes.com/2025/10/31/briefing/at-the-supreme-court-liberal-justices-are-split.html",
    "summary": "We go inside their strained relationship."
  },
  {
    "title": "Jimmy Kimmel Can’t Believe He Agrees With Marjorie Taylor Greene",
    "link": "https://www.nytimes.com/2025/10/31/arts/television/jimmy-kimmel-marjorie-taylor-greene.html",
    "summary": "“Sometimes you go so far right you come out on the other side,” Kimmel said of the congresswoman, who has clashed with fellow Republicans over health care."
  },
  {
    "title": "The Only National Parks Employee Who Tracks Leaky Oil Wells Is Out of a Job",
    "link": "https://www.nytimes.com/2025/10/31/climate/national-parks-orphan-wells.html",
    "summary": "Forrest Smith was forced to step down last month as the National Park Service’s chief petroleum engineer. He wasn’t replaced."
  },
  {
    "title": "How Saudi Arabia and Qatar Benefited From Rule Changes to Reach the World Cup",
    "link": "https://www.nytimes.com/2025/10/31/world/asia/saudi-arabia-qatar-world-cup-rules.html",
    "summary": "A soccer governing body that both countries have helped bankroll gave them extra rest and home-field advantage to set up World Cup qualification."
  },
  {
    "title": "Selma van de Perre, Dutch Jew Who Resisted Nazis, Dies at 103",
    "link": "https://www.nytimes.com/2025/10/31/world/europe/selma-van-de-perre-dead.html",
    "summary": "“It is impossible not to marvel at her steadiness and courage,” one reviewer wrote after reading her memoir."
  }
]