[
  {
    "title": "FCC Approves Skydance’s Merger With Paramount",
    "link": "https://www.nytimes.com/2025/07/24/business/media/fcc-skydance-merger-paramount.html",
    "summary": "The deal, which came under intense scrutiny by the Trump administration, was hailed by the F.C.C. chief, who welcomed “significant changes” at CBS, a unit of Paramount."
  },
  {
    "title": "‘South Park’ and Other Paramount Shows Skewer Trump After Settlement",
    "link": "https://www.nytimes.com/2025/07/24/business/media/trump-south-park-colbert-stewart.html",
    "summary": "“South Park,” Jon Stewart and Stephen Colbert have all been critical of their own company and President Trump this week."
  },
  {
    "title": "CBS News Names Tanya Simon Executive Producer for ’60 Minutes’",
    "link": "https://www.nytimes.com/2025/07/24/business/media/60-minutes-tanya-simon-cbs.html",
    "summary": "Tanya Simon, who has worked on the show for over two decades, will take over at a time of significant change for the network."
  },
  {
    "title": "Trump’s Name Is on Contributor List for Epstein Birthday Book",
    "link": "https://www.nytimes.com/2025/07/24/us/politics/trump-epstein-birthday-book.html",
    "summary": "The Times also reviewed other records of the president’s friendship with Jeffrey Epstein, including an inscription in which the future president called him “the greatest.”"
  },
  {
    "title": "How a Frantic Scouring of the Epstein Files Consumed the Justice Dept.",
    "link": "https://www.nytimes.com/2025/07/24/us/politics/epstein-files-trump-bondi-justice-department-fbi.html",
    "summary": "There was a single goal in mind: find something — anything — that could be released to the public to satisfy President Trump’s supporters."
  },
  {
    "title": "Trump Visits Federal Reserve as Campaign Against Powell Intensifies",
    "link": "https://www.nytimes.com/2025/07/24/us/politics/trump-bank-federal-reserve.html",
    "summary": "The administration has repeatedly criticized Jerome H. Powell, the chair of the central bank, for his handling of the economy and the cost of work on the institution’s headquarters."
  },
  {
    "title": "Convicted Murderer Freed by Trump in Venezuelan Prisoner Swap Is Free in U.S.",
    "link": "https://www.nytimes.com/2025/07/24/world/americas/trump-venezuela-convicted-murderer-swap.html",
    "summary": "At least some American officials knew that Dahud Hanid Ortiz had been convicted of a triple murder when he was put on the plane to the United States."
  },
  {
    "title": "Israel and the U.S. Pull Back From Cease-Fire Talks With Hamas",
    "link": "https://www.nytimes.com/2025/07/24/us/politics/israel-us-hamas-talks.html",
    "summary": "President Trump’s special envoy said that “we will now consider alternative options to bring the hostages home,” though it was not clear that negotiations had halted."
  },
  {
    "title": "Gazans Are Dying of Starvation",
    "link": "https://www.nytimes.com/2025/07/24/world/middleeast/gaza-starvation.html",
    "summary": "After 21 months of devastating conflict with Israel, Gaza’s most vulnerable civilians — the young, the old and the sick — are facing what aid groups say is impending famine."
  },
  {
    "title": "France Will Recognize Palestinian Statehood, Macron Says",
    "link": "https://www.nytimes.com/2025/07/24/world/europe/france-palestine-statehood-macron-gaza.html",
    "summary": "The announcement sets France apart from the United States and most of its close allies, and could cause friction with President Trump."
  },
  {
    "title": "Hulk Hogan, Wrestling Superstar, Is Dead at 71",
    "link": "https://www.nytimes.com/2025/07/24/sports/hulk-hogan-dead.html",
    "summary": "The charismatic wrestler helped build an entertainment on the margins into a cultural behemoth."
  },
  {
    "title": "Outside the Wrestling Ring, Hulk Hogan Fought Rocky and Endorsed Trump",
    "link": "https://www.nytimes.com/2025/07/24/arts/hulk-hogan-wrestling-movies-rocky-.html",
    "summary": "The muscular entertainer, who died at 71, broke through into pop culture and led the way for Dwayne Johnson and John Cena."
  },
  {
    "title": "Hulk Hogan: A Life in Pictures",
    "link": "https://www.nytimes.com/2025/07/24/arts/hulk-hogan-photos.html",
    "summary": "The wrestler, who died on Thursday at 71, was the face of the sport as its popularity grew, propelling him into the wider entertainment world."
  },
  {
    "title": "Ken Paxton Claimed Three Houses as His Primary Residence, Records Show",
    "link": "https://www.nytimes.com/2025/07/24/us/politics/ken-paxton-mortgage.html",
    "summary": "The attorney general of Texas, who is challenging Senator John Cornyn, could have secured favorable mortgage rates, and may have violated the law if he knowingly falsified loan documents."
  },
  {
    "title": "Texas Legislature Special Session: Democrats Attack Silent Republicans",
    "link": "https://www.nytimes.com/2025/07/24/us/politics/texas-redistricting.html",
    "summary": "President Trump wants Texas Republicans to redraw the state’s House maps to nab as many as five seats now held by Democrats. But no new maps have been publicly proposed yet."
  },
  {
    "title": "Columbia and Penn Made Trump Deals. More Universities Could Be Next.",
    "link": "https://www.nytimes.com/2025/07/24/us/trump-university-deal-penn-columbia.html",
    "summary": "Trump officials hope deals with two Ivy League schools create a template that others, including Harvard, Princeton, Brown, Cornell and Northwestern, will follow."
  },
  {
    "title": "Did Columbia’s Deal With Trump Save Its Stature or Sacrifice It?",
    "link": "https://www.nytimes.com/2025/07/24/nyregion/columbia-trump-deal-reaction.html",
    "summary": "Reactions ranged from fierce criticism to relief after the university reached a settlement over allegations that it failed to stop the harassment of Jewish students."
  },
  {
    "title": "What Happens When Your Therapist Falls Ill or Dies Unexpectedly?",
    "link": "https://www.nytimes.com/2025/07/24/health/therapist-sick-death.html",
    "summary": "Therapists are cautious about sharing personal information. When they fall ill or die unexpectedly, the shock can be shattering."
  },
  {
    "title": "Alina Habba Is Named Acting U.S. Attorney in New Jersey",
    "link": "https://www.nytimes.com/2025/07/24/nyregion/alina-habba-desiree-grace-new-jersey-us-attorney.html",
    "summary": "Ms. Habba’s tenure as interim U.S. attorney was slated to end this week, but the Trump administration’s appointment will allow her to remain the top law enforcement official in the state."
  },
  {
    "title": "Justice Kagan Urges Supreme Court to Explain Itself in Emergency Decisions",
    "link": "https://www.nytimes.com/2025/07/24/us/justice-kagan-supreme-court-emergency-decisions.html",
    "summary": "In remarks before judges and lawyers in California, the justice said she believed the court had a responsibility to share its reasoning."
  },
  {
    "title": "Supreme Court, for Now, Pauses Lower Court Decision Limiting Voting Rights Act",
    "link": "https://www.nytimes.com/2025/07/24/us/supreme-court-voting-rights-act.html",
    "summary": "The justices paused a lower court order pending a decision on whether the Supreme Court will take up the case, a major challenge to the Voting Rights Act."
  },
  {
    "title": "Chuck Mangione, Jazz Musician Known for ‘Feels So Good,’ Dies at 84",
    "link": "https://www.nytimes.com/2025/07/24/arts/music/chuck-mangione-dead.html",
    "summary": "Wearing his signature fedora, he won wide popularity and 14 Grammy nominations, winning twice, and scaled Billboard’s adult contemporary charts in the 1970s and ’80s."
  },
  {
    "title": "$17 Million Is Lost in A.T.M. Scam That Spread on TikTok, Officials Say",
    "link": "https://www.nytimes.com/2025/07/24/nyregion/nyc-atm-scam.html",
    "summary": "Payment cards for a New York City youth jobs program were used to withdraw millions of dollars over less than three days, officials said."
  },
  {
    "title": "If Trump Keeps Intimidating the Fed, He Will Pay a Price",
    "link": "https://www.nytimes.com/2025/07/24/opinion/trump-federal-reserve-powell.html",
    "summary": "When central banks are pressured by politicians into overheating the economy, everyone ends up getting burned."
  },
  {
    "title": "France Will Recognize Palestinian Statehood",
    "link": "https://www.nytimes.com/2025/07/24/briefing/france-middle-east-trump-columbia-university.html",
    "summary": "Also, Hulk Hogan died at 71. Here’s the latest at the end of Thursday."
  },
  {
    "title": "Idaho Murders Case Investigators Dispel Baseless Rumors and Theories About Bryan Kohberger",
    "link": "https://www.nytimes.com/2025/07/24/us/idaho-murders-kohberger-prosecutor-bill-thompson.html",
    "summary": "In an interview, the lead prosecutor, Bill Thompson, decried how some of the wild speculations surrounding the case made life “hell” for innocent people."
  },
  {
    "title": "Roy Black, Defense Lawyer for William Kennedy Smith and Epstein, Dies at 80",
    "link": "https://www.nytimes.com/2025/07/24/us/roy-black-dead.html",
    "summary": "With a national profile, he represented the notorious and the celebrated, helping to secure an acquittal in the Smith rape case and a lenient plea deal for Jeffrey Epstein."
  },
  {
    "title": "A Little Leaguer Was Suspended for a Bat Flip. So He Went to Court.",
    "link": "https://www.nytimes.com/2025/07/24/nyregion/little-league-bat-flip-suspension.html",
    "summary": "A New Jersey judge was asked to overturn an umpire’s interpretation of the “horseplay” rule. A chance to play in the state championship hung in the balance."
  },
  {
    "title": "Lake Tahoe Boaters Died Without Life Jackets, Review Finds",
    "link": "https://www.nytimes.com/2025/07/24/us/lake-tahoe-boat-victims.html",
    "summary": "The eight people who died in a June accident were found without flotation devices, according to a new report. The two survivors relied on the devices to stay afloat."
  }
]