[
  {
    "title": "A Family of 6 Was Swept Away in the Texas Floods. Now, Survivors Wait and Hope.",
    "link": "https://www.nytimes.com/2025/07/06/us/politics/texas-flood-family-survivors.html",
    "summary": "A woman whose mother, stepfather, aunt, uncle and cousin are among the missing confronts the unimaginable. A cousin was dragged downriver 15 miles but survived."
  },
  {
    "title": "Desperation Grows as Texas Flood Rescues Stretch Into Third Day",
    "link": "https://www.nytimes.com/2025/07/06/us/texas-floods-rescues.html",
    "summary": "Crews in helicopters and trucks, in horseback and on foot have saved hundreds of lives since the flooding began on Friday."
  },
  {
    "title": "Texas Flood Victims: What We Know",
    "link": "https://www.nytimes.com/2025/07/05/us/texas-flood-victims.html",
    "summary": "A beloved teacher, child and adult campers, camp directors and a counselor are among at least 80 people who have died in the flooding in Central Texas."
  },
  {
    "title": "Israel’s Deadly Assault on Iran Prison Incites Fury, Even Among Dissidents",
    "link": "https://www.nytimes.com/2025/07/06/world/middleeast/israel-iran-evin-prison.html",
    "summary": "The June 23 airstrikes on Evin prison, including the hospital ward, have turned it from a hated symbol of oppression into a new rallying cry against Israel, even among the Iranian regime’s domestic critics."
  },
  {
    "title": "Can Democrats Find Their Way on Immigration?",
    "link": "https://www.nytimes.com/2025/07/06/us/politics/democrats-immigration-trump.html",
    "summary": "The party’s leftward shift in the Biden administration arguably laid the groundwork for President Trump’s aggressive approach. Deciding the next move won’t be easy."
  },
  {
    "title": "Trump Says Musk Is ‘Off the Rails’ With America Party Effort",
    "link": "https://www.nytimes.com/2025/07/06/us/politics/trump-musk-america-party.html",
    "summary": "The tech billionaire’s effort to create a new political party, called the America Party, comes amid a ramped-up feud with the president over his new domestic policy law."
  },
  {
    "title": "Social Security Email Says Policy Bill Eliminates Tax on Benefits. Does It?",
    "link": "https://www.nytimes.com/2025/07/06/your-money/social-security-tax.html",
    "summary": "The Social Security Administration circulated an imprecise email about the provisions in the new law. Here’s what it actually does."
  },
  {
    "title": "Ozzy Osbourne and Black Sabbath Play Final Shows in Birmingham, England",
    "link": "https://www.nytimes.com/2025/07/06/arts/music/ozzy-osbourne-black-sabbath.html",
    "summary": "Heavy metal fans crossed continents to converge on Birmingham, England, and throw devil horns in honor of the Prince of Darkness and Black Sabbath."
  },
  {
    "title": "How Europe Got Stuck Between Xi’s China and Trump’s America",
    "link": "https://www.nytimes.com/2025/07/06/world/europe/european-union-china-tariffs.html",
    "summary": "European Union officials will spend July in talks with China. Tensions are high, hopes are low and stability is the end game."
  },
  {
    "title": "Bessent Says He Expects Trade Deals by This Week’s Deadline",
    "link": "https://www.nytimes.com/2025/07/06/business/economy/bessent-trump-trade-tariffs.html",
    "summary": "But the Treasury secretary also said that some countries working toward agreements with the United States could have until Aug. 1."
  },
  {
    "title": "Nearly Half of America’s Murderers Get Away With It",
    "link": "https://www.nytimes.com/2025/07/06/us/murder-solve-rate-louisville.html",
    "summary": "Most crimes go unsolved, emboldening criminals and potentially leading to more violence."
  },
  {
    "title": "As Drones Spot Sharks, New York Beaches Are Shut Down",
    "link": "https://www.nytimes.com/2025/07/06/nyregion/shark-sightings-new-york-beaches-drones.html",
    "summary": "Drone technology seemed to contribute to an unusual number of shark sightings along Rockaway Beach in recent days. Each time swimmers were ordered out of the ocean."
  },
  {
    "title": "Israel Is Fast Alienating the Democratic Base",
    "link": "https://www.nytimes.com/2025/07/06/opinion/zohran-mamdani-democrats-israel.html",
    "summary": "What we can learn from the New York Democratic mayoral primary."
  },
  {
    "title": "The Brooklyn Allergist’s Office That Was Once Home to a Spy",
    "link": "https://www.nytimes.com/2025/07/06/realestate/streetscapes-brooklyn-british-spy.html",
    "summary": "An antislavery spy who worked for the British in New York in the 1800s lived in a house that is now home to an allergy doctor descended from Horace Greeley."
  },
  {
    "title": "Police Officer Shot Outside Immigration Detention Facility in Texas",
    "link": "https://www.nytimes.com/2025/07/06/us/ice-detention-facility-shooting-texas.html",
    "summary": "Several armed people were taken into custody after officers responded to a report of a suspicious person outside the detention center, officials said."
  },
  {
    "title": "Carla Maxwell, Keeper of the José Limón Flame, Dies at 79",
    "link": "https://www.nytimes.com/2025/07/06/arts/dance/carla-maxwell-dead.html",
    "summary": "Her stewardship of the troupe that bears his name became a model for other dance companies, like Martha Graham’s, after their founders died."
  }
]