[
  {
    "title": "Trump Policy Bill Stalls as Johnson Works to Wear Down G.O.P. Resistance",
    "link": "https://www.nytimes.com/2025/07/03/us/politics/house-trump-bill-obbb.html",
    "summary": "After a day of paralysis, the House remained frozen in place overnight as party leaders labored to address the concerns of Republican holdouts to the party’s major policy bill."
  },
  {
    "title": "Will House Conservatives Cave Again on Trump’s Big Bill?",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/trump-conservatives-bill.html",
    "summary": "Fiscal hawks have repeatedly threatened to bring down their party’s agenda out of debt fears, only to back down after pressure from party leaders and President Trump."
  },
  {
    "title": "Inside Trump’s Charm Offensive as He Woos Holdout Republicans",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/trump-bill-holdout-republicans.html",
    "summary": "President Trump worked the phones and welcomed Republicans to the White House to cajole them into supporting his megabill. They left with signed merchandise and photos of the Oval Office."
  },
  {
    "title": "Sean ‘Diddy’ Combs Acquitted of Sex Trafficking but Found Guilty on Lesser Charges",
    "link": "https://www.nytimes.com/2025/07/02/arts/music/combs-acquitted-sex-trafficking-sean-diddy.html",
    "summary": "The music mogul was convicted of arranging for the travel of male escorts across state lines but acquitted of sex trafficking and racketeering conspiracy."
  },
  {
    "title": "Sean Combs Acquitted of Sex Trafficking but Found Guilty on Lesser Charges",
    "link": "https://www.nytimes.com/video/us/100000010263390/sean-combs-acquitted-of-sex-trafficking-but-found-guilty-on-lesser-charges.html",
    "summary": "Sean Combs, the hip-hop mogul who built a business empire around his personal brand, was convicted on Wednesday of transporting prostitutes to participate in his drug-fueled sex marathons, but acquitted of racketeering and sex trafficking, the most serious charges against him. Julia Jacobs, a New York Times culture reporter, explains the verdict."
  },
  {
    "title": "Sean ‘Diddy’ Combs’s Nine Lives",
    "link": "https://www.nytimes.com/2025/07/02/arts/music/sean-combs-diddy.html",
    "summary": "For decades, he occupied a special stripe of the celebrity stratosphere. Now the man who helped turn rap into a global concern has escaped a sex-trafficking conviction."
  },
  {
    "title": "After Sean ‘Diddy’ Combs Verdict, the Testimony of Cassie and ‘Jane’ Lingers",
    "link": "https://www.nytimes.com/2025/07/02/arts/music/sean-combs-verdict-cassie-jane-testimony.html",
    "summary": "Two of Mr. Combs’s former girlfriends gave days of harrowing testimony of abuse, but jurors weren’t convinced those experiences with escorts were sex trafficking."
  },
  {
    "title": "Justice Dept. Explores Using Criminal Charges Against Election Officials",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/justice-department-election-data.html",
    "summary": "Such a path could drastically raise the stakes for federal investigations of state or county officials, bringing the department and the threat of criminalization into the election system."
  },
  {
    "title": "Top F.D.A. Official Overrode Scientists on Covid Shots",
    "link": "https://www.nytimes.com/2025/07/02/health/fda-covid-vaccines.html",
    "summary": "Records show that a top U.S. regulator rejected the recommendations of agency experts and limited the use of Covid vaccines."
  },
  {
    "title": "C.I.A. Says Its Leaders Rushed Report on Russia Interference in 2016 Vote",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/russia-trump-2016-election.html",
    "summary": "But the new review of the earlier assessment does not dispute the conclusion that Russia favored the election of Donald J. Trump."
  },
  {
    "title": "Hit by Trump’s Tariffs, French Clothing Maker Saint James Puts Shipping on Hold",
    "link": "https://www.nytimes.com/2025/07/03/business/trump-tariffs-st-james-fashion-france.html",
    "summary": "Hit by President Trump’s tariffs, the Saint James clothing factory has put its inventory of striped shirts and sweaters intended for U.S. retailers in its warehouse in France."
  },
  {
    "title": "Somebody Explain Why Everybody Loves Phil Rosenthal",
    "link": "https://www.nytimes.com/2025/07/02/dining/somebody-feed-phil-rosenthal.html",
    "summary": "The host of “Somebody Feed Phil” and creator of “Everybody Loves Raymond” has become a global star with little more than fun-guy charm. That’s enough."
  },
  {
    "title": "Abrego Garcia Was Beaten and Tortured in El Salvador Prison, Lawyers Say",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/kilmar-abrego-garcia-el-salvador-trump-deportation.html",
    "summary": "Kilmar Armando Abrego Garcia was made to kneel overnight, denied bathroom access and confined in an overcrowded cell with bright lights and no windows, his lawyers say."
  },
  {
    "title": "Illegal Border Crossings Plunge to Lowest Level in Decades",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/border-crossings-trump.html",
    "summary": "Border Patrol agents made just over 6,000 arrests in June, according to government figures, a sign that President Trump’s hard-line immigration policies are working to keep people out."
  },
  {
    "title": "Chechnya’s Strongman Is Visibly Ailing. The Russian Region Is Bracing for Succession.",
    "link": "https://www.nytimes.com/2025/07/03/world/europe/chechnya-kadyrov-illness-succession.html",
    "summary": "Amid rampant speculation about his health, Ramzan Kadyrov, the Kremlin-allied strongman who rules the region, has been noticeably absent from view, while grooming his teenage son for the future."
  },
  {
    "title": "Pentagon Is Reviewing Which Countries Receive U.S. Weapons",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/pentagon-weapons-review.html",
    "summary": "President Trump’s decision to pause the delivery of some air defense interceptors and precision-guided munitions to Ukraine is part of a broader effort."
  },
  {
    "title": "Paramount’s Settlement With Trump Is a Humbling Moment for ’60 Minutes’",
    "link": "https://www.nytimes.com/2025/07/02/business/media/trump-paramount-cbs-60-minutes-lawsuit.html",
    "summary": "After an astonishing concession to a sitting president, the country’s most popular television news program faces the prospect of new ownership and a chilled environment for the First Amendment."
  },
  {
    "title": "Amid Warnings of Iranian Sleeper Cells, a History of Failed Plots",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/iran-threat-sleeper-cells.html",
    "summary": "For high-stakes plots like an effort to kill President Trump, Iran has turned to common criminals, raising questions about its capabilities inside the U.S."
  },
  {
    "title": "Pentagon Again Shifts Assessment of Damage to Iran’s Nuclear Program",
    "link": "https://www.nytimes.com/2025/07/02/us/politics/iran-nuclear-us-strike-trump.html",
    "summary": "The appraisal that Iran’s nuclear hopes had been set back 1 to 2 years by U.S. and Israeli bombings was the latest in a shifting series of pronouncements."
  },
  {
    "title": "John Bolton: We Need to Finish the Job in Iran",
    "link": "https://www.nytimes.com/2025/07/03/opinion/bolton-iran-nuclear.html",
    "summary": "It remains to be seen if Washington has learned enough of a lesson to destroy Iran’s remaining nuclear infrastructure."
  },
  {
    "title": "10 Ways of Making Sense of Zohran Mamdani’s Win",
    "link": "https://www.nytimes.com/2025/07/02/opinion/zohran-mamdani-democrats-trump.html",
    "summary": "New York City’s surprising primary result has ramifications for the whole country."
  },
  {
    "title": "4 Dead and 30 Missing After Ferry Sinks Near Bali",
    "link": "https://www.nytimes.com/2025/07/02/world/asia/bali-ferry-sinks-indonesia.html",
    "summary": "The ship was carrying 65 people when it sank on its way to the Indonesian resort island, a popular tourist destination."
  },
  {
    "title": "Skydiving Plane With 15 Aboard Crashes in New Jersey",
    "link": "https://www.nytimes.com/2025/07/02/nyregion/plane-crash-new-jersey-cross-keys.html",
    "summary": "The plane, a Cessna 208B, went off the end of a runway as it was taking off from a small airport in Gloucester County, according to the F.A.A. Victims were being treated at the scene, officials said."
  },
  {
    "title": "Lovebugs Swarm South Korea’s Capital, Drawing Residents’ Ire",
    "link": "https://www.nytimes.com/2025/07/03/world/asia/south-korea-seoul-lovebugs.html",
    "summary": "Municipal workers in the South Korean capital region are responding to a summer infestation by spraying water, but residents wish they would break out the poison."
  },
  {
    "title": "Third Interstellar Object, Comet 3I/ATLAS, Is Traveling Through Solar System",
    "link": "https://www.nytimes.com/2025/07/02/science/interstellar-object-a11pi3z.html",
    "summary": "3I/ATLAS, earlier known as A11pI3Z, is only the third interstellar visitor to be discovered passing through our corner of the galaxy."
  }
]