[
  {
    "title": "After Trump Reignites a Trade War Over Greenland, Europe Weighs Going All-Out",
    "link": "https://www.nytimes.com/2026/01/18/world/europe/greenland-us-trade-war.html",
    "summary": "Europe’s dependence on the United States for NATO security limits its options. Its strongest response could be retaliating with its own trade “bazooka.”"
  },
  {
    "title": "Danes Feel Betrayed and Bewildered by Trump Amid Greenland Threats",
    "link": "https://www.nytimes.com/2026/01/18/world/europe/denmark-greenland-trump.html",
    "summary": "The American president’s vow to get Greenland, the semiautonomous Danish territory, has thrown the tiny, pro-American Nordic nation into crisis."
  },
  {
    "title": "D.H.S.’s Role Questioned as Immigration Officers Flood U.S. Cities",
    "link": "https://www.nytimes.com/2026/01/18/us/dhs-cities-bush-sept-11.html",
    "summary": "The Department of Homeland Security was formed after 9/11 amid international terrorism threats. Now, its most visible targets are domestic."
  },
  {
    "title": "Inside Trump’s Deportation Machine",
    "link": "https://www.nytimes.com/video/us/politics/100000010652139/inside-trumps-deportation-machine.html",
    "summary": "Data obtained by The New York Times illustrates the differences between President Trump’s and President Biden’s approaches to deportations. Our data reporter Albert Sun describes what we found."
  },
  {
    "title": "Pentagon Tells 1,500 Troops to Prepare for Possible Deployment to Minnesota",
    "link": "https://www.nytimes.com/2026/01/18/us/politics/pentagon-troops-minnesota.html",
    "summary": "But President Trump has already backed away from a threat to invoke the Insurrection Act in response to protests against the killing of a woman by a federal immigration agent."
  },
  {
    "title": "National Anger Spills Into Target Stores, Again",
    "link": "https://www.nytimes.com/2026/01/17/business/target-immigration-minneapolis.html",
    "summary": "Videos of immigration officers dragging an employee out of a store near Minneapolis, the retailer’s hometown, set off renewed political debate after years of boycotts."
  },
  {
    "title": "The Biggest Challenge in Venezuela Is Soaring Food Prices",
    "link": "https://www.nytimes.com/2026/01/18/world/americas/venezuela-economy-food-prices.html",
    "summary": "Economic instability in Venezuela after the U.S. raid to capture its president is deepening inflation and rattling the currency, sending grocery bills soaring for millions of people."
  },
  {
    "title": "Mamdani Said He’d Make Buses Faster and Free. Now It’s This Guy’s Job.",
    "link": "https://www.nytimes.com/2026/01/18/nyregion/mike-flynn-nyc-transportation-commissioner.html",
    "summary": "Mike Flynn, a former intern who rose to the top of the agency, will be under a microscope, but far from the spotlight."
  },
  {
    "title": "Psst, Mayor Mamdani: The Upper East Side Is More Fun Than People Think",
    "link": "https://www.nytimes.com/2026/01/18/nyregion/zohran-mamdani-upper-east-side.html",
    "summary": "Beyond stuffy old money institutions and noisy sports bars, hidden gems abound."
  },
  {
    "title": "One Year of Trump. The Time to Act Is Now, While We Still Can.",
    "link": "https://www.nytimes.com/2026/01/18/opinion/trump-one-year-later.html",
    "summary": "The United States is broken, but not in every way."
  },
  {
    "title": "Martin Luther King’s Son: ‘Justice Demands Endurance’",
    "link": "https://www.nytimes.com/2026/01/18/opinion/mlk-voting-rights-act.html",
    "summary": "Martin Luther King’s son and Norm Ornstein, a leading scholar of voting rights, discuss a case that could hollow out the Voting Rights Act."
  },
  {
    "title": "Can ICE Do That?",
    "link": "https://www.nytimes.com/2026/01/18/briefing/can-ice-do-that.html",
    "summary": "Times reporters answer readers’ questions about immigration and deportation."
  },
  {
    "title": "Winter Storm Brings Snow and Cold Temps as Far South as Florida and Georgia",
    "link": "https://www.nytimes.com/2026/01/18/us/northeast-winter-snow-storm.html",
    "summary": "Snow was observed as far south as Florida as temperatures plummeted. New York City could get up to four inches of snow and up to six inches is possible in Boston."
  },
  {
    "title": "Trump Backs a Potential Primary Challenger to Bill Cassidy, a G.O.P. Senator",
    "link": "https://www.nytimes.com/2026/01/18/us/politics/trump-bill-cassidy-julia-letlow-primary-challenge-endorsement.html",
    "summary": "The president urged Representative Julia Letlow of Louisiana to run against Mr. Cassidy, in a move that is likely to further complicate his relationship with Senate Republicans."
  },
  {
    "title": "France’s Embassy in Iraq Is a Spoil of Antisemitism, Jewish Family Charges",
    "link": "https://www.nytimes.com/2026/01/18/world/middleeast/jewish-family-iraq-embassy-.html",
    "summary": "A Jewish family that fled Iraq generations ago rented its home to France for use as an embassy, but Paris long ago stopped paying it rent, after Iraq stripped Jews of property."
  }
]