[
  {
    "title": "Trump’s Second-Term Promises: What He’s Done So Far on Immigration, Trade, DEI and More",
    "link": "https://www.nytimes.com/2025/12/27/us/politics/trump-second-term-promises-actions.html",
    "summary": "President Trump has driven illegal crossings at the border to record lows, helped bring about an uneasy cease-fire in Gaza and upended the global trading system."
  },
  {
    "title": "Kennedy Center Chief Threatens Legal Action Over Canceled Christmas Concert",
    "link": "https://www.nytimes.com/2025/12/27/us/kennedy-center-concert-lawsuit.html",
    "summary": "The musician Chuck Redd called off the annual Christmas Eve performances after the Kennedy Center board added President Trump’s name to the performing arts center."
  },
  {
    "title": "Karoline Leavitt Says She’s Expecting Her Second Child",
    "link": "https://www.nytimes.com/2025/12/26/us/karoline-leavitt-pregnant-second-child.html",
    "summary": "The White House press secretary announced on Instagram that she was pregnant with a daughter who is due in May. She and her husband have a 1-year-old son."
  },
  {
    "title": "California Drops Lawsuit Over $4 Billion Federal Cut to High-Speed Rail Project",
    "link": "https://www.nytimes.com/2025/12/27/us/california-high-speed-rail-lawsuit-transportation-department.html",
    "summary": "California sued after the Trump administration cut grants for the long-planned project. The state says it will seek private investors instead."
  },
  {
    "title": "Russia Pummels Kyiv Before Trump-Zelensky Meeting",
    "link": "https://www.nytimes.com/2025/12/27/world/europe/kyiv-ukraine-russia-trump-zelensky.html",
    "summary": "President Volodymyr Zelensky of Ukraine said that the assault, which lasted nearly 10 hours, showed that Moscow was not serious about peace."
  },
  {
    "title": "This Ukrainian Soldier Spent More Than a Year on the Front Line",
    "link": "https://www.nytimes.com/2025/12/27/world/europe/ukraine-russia-frontline.html",
    "summary": "Serhii Tyschenko, a Ukrainian combat medic, spent 472 days in a bunker. His case appears to be an extreme example of a problem that has long plagued Kyiv’s military."
  },
  {
    "title": "How One Father Created an Organ Empire",
    "link": "https://www.nytimes.com/2025/12/27/us/national-kidney-registry-paired-organ-donation.html",
    "summary": "The National Kidney Registry has matched thousands of kidney donors with recipients. It has also paid millions of dollars to a company owned by its founder."
  },
  {
    "title": "New York Receives Its Heaviest Snowfall in Nearly 4 Years, Disrupting Flights",
    "link": "https://www.nytimes.com/2025/12/27/nyregion/new-york-city-snow-storm.html",
    "summary": "Central Park saw more than four inches of snow for the first time since January 2022, with higher totals outside New York City."
  },
  {
    "title": "Park Chan-wook and the Funny Thing About Stomach-Churning Horror",
    "link": "https://www.nytimes.com/2025/12/27/movies/park-chan-wook-no-other-choice-korea.html",
    "summary": "When American studios wouldn’t back his film about a laid-off manager committing gruesome murders, the director returned to Korea. Now he has a hit on his hands."
  },
  {
    "title": "I Love My Naturally Aging Face",
    "link": "https://www.nytimes.com/2025/12/27/opinion/aging-botox-cosmetic-surgery.html",
    "summary": "But when I see Demi Moore, 63, looking far younger than me at 48, I wonder if I should be figuring out a way to keep up."
  },
  {
    "title": "Good Calls",
    "link": "https://www.nytimes.com/2025/12/27/briefing/good-calls.html",
    "summary": "This week, we close out the year with your best advice of 2025."
  },
  {
    "title": "More Student Loan Borrowers Are Shedding Debts in Bankruptcy",
    "link": "https://www.nytimes.com/2025/12/27/business/student-loans-bankruptcy.html",
    "summary": "A new study suggests that distressed borrowers using a simpler bankruptcy process are succeeding — and that more people like them should try."
  },
  {
    "title": "It’s Time to Give the Ovary Some More Respect",
    "link": "https://www.nytimes.com/2025/12/27/health/eggs-ovaries-fertility-aging.html",
    "summary": "Recent research highlights that for fertility and aging, the egg may be the leading lady, but she needs her supporting cast."
  },
  {
    "title": "Saudi-Led Group in Yemen Tells Separatists to Withdraw, or Be ‘Dealt With’",
    "link": "https://www.nytimes.com/2025/12/27/world/middleeast/yemen-saudi-arabia-airstrikes.html",
    "summary": "The Saudis ramped up their rhetoric against a faction that has seized parts of Yemen in recent weeks."
  },
  {
    "title": "What Went Wrong Before Hong Kong’s Inferno",
    "link": "https://www.nytimes.com/2025/12/26/world/asia/hong-kong-apartment-fire-corruption.html",
    "summary": "Records show how government departments played down residents’ warnings about corrupt practices and substandard materials that fueled the deadly blaze."
  }
]