[
  {
    "title": "No Meals, Fainting Nurses, Dwindling Baby Formula: Starvation Haunts Gaza Hospitals",
    "link": "https://www.nytimes.com/2025/07/27/world/middleeast/gaza-hunger-doctors-nurses.html",
    "summary": "After Israeli restrictions on aid, hunger has risen across Gaza. Doctors and nurses, struggling to find food themselves, lack the resources to stem the surge."
  },
  {
    "title": "Israel Says It Has Paused Some Military Activity in Gaza as Anger Grows Over Hunger",
    "link": "https://www.nytimes.com/2025/07/27/world/middleeast/israel-gaza-aid-hunger.html",
    "summary": "Operations in parts of the enclave were put on hold to allow more aid into the enclave, the Israeli military said. It was unclear if the decision would relieve the hunger crisis."
  },
  {
    "title": "Israel Intercepts Gaza-Bound Ship of Activists and Aid",
    "link": "https://www.nytimes.com/2025/07/27/world/middleeast/israel-gaza-ship.html",
    "summary": "It was at least the third vessel blocked this year while challenging Israel’s naval blockade and seeking to deliver supplies by sea to a population facing rising starvation."
  },
  {
    "title": "What Will It Cost to Renovate Trump’s ‘Free’ Air Force One? Don’t Ask.",
    "link": "https://www.nytimes.com/2025/07/27/us/politics/air-force-one-trump-cost.html",
    "summary": "To hide the cost of renovating the plane Qatar donated to President Trump, the Air Force appears to have tucked it inside an over-budget, behind-schedule nuclear modernization program."
  },
  {
    "title": "Massie Criticizes Johnson on Recess as He Tries to Force Epstein Files Vote",
    "link": "https://www.nytimes.com/2025/07/27/us/politics/massie-johnson-house-epstein-files.html",
    "summary": "“I don’t know why it should be politically painful to be transparent,” Representative Thomas Massie, a Kentucky Republican, said on Sunday, referring to comments by Speaker Mike Johnson."
  },
  {
    "title": "The Ripple Effects of an ICE Raid on a Nebraska Meatpacking Company",
    "link": "https://www.nytimes.com/2025/07/27/us/ice-glenn-valley-foods.html",
    "summary": "Glenn Valley Foods tried to verify every hire through a federal system. After a raid, the company is wondering how it can keep going."
  },
  {
    "title": "Alpha School, AI-Driven Education Founded in Austin, Is Coming to More Cities",
    "link": "https://www.nytimes.com/2025/07/27/us/politics/ai-alpha-school-austin-texas.html",
    "summary": "At Austin’s Alpha School, students spend just two hours a day on academics, led by artificial intelligence tools. New Alpha schools are set to open in about a dozen cities this fall."
  },
  {
    "title": "Inside a Gathering of America’s Growing Home-School Movement",
    "link": "https://www.nytimes.com/2025/07/27/style/home-schooling-movement.html",
    "summary": "The pandemic supercharged interest. Now, a cultural and political emphasis on women staying at home is continuing to fuel growth."
  },
  {
    "title": "David Bars Have Had Breakout Success. Can the Protein Craze Last?",
    "link": "https://www.nytimes.com/2025/07/27/business/david-protein-bars.html",
    "summary": "The David bar’s breakout success is proof that, in our culture of optimization, one macronutrient is king. But can the protein craze last?"
  },
  {
    "title": "In Smithsonian Role, John Roberts Encounters History, Pandas and Trump",
    "link": "https://www.nytimes.com/2025/07/27/arts/smithsonian-john-roberts-trump-supreme-court.html",
    "summary": "Chief Justice John G. Roberts Jr., who serves as the institution’s chancellor, has always emphasized procedure and avoided politics. This moment could make that more difficult."
  },
  {
    "title": "Thailand-Cambodia Fighting Forces Thousands to Flee",
    "link": "https://www.nytimes.com/2025/07/27/world/asia/thailand-cambodia-border-conflict-evacuees.html",
    "summary": "The conflict is one of the deadliest clashes ever between the two countries. Thirty-four people have died, and over 165,000 have been displaced."
  },
  {
    "title": "At Trump’s Urging, Thailand and Cambodia to Meet for Cease-Fire Talks",
    "link": "https://www.nytimes.com/2025/07/26/world/asia/thailand-cambodia-conflict.html",
    "summary": "After calls by President Trump, the leaders of Cambodia and Thailand are set to meet in Malaysia on Monday to discuss a halt to the fighting."
  },
  {
    "title": "5 Money Mistakes That Can Put Retirement Farther Off",
    "link": "https://www.nytimes.com/2025/07/27/business/retirement-saving-mistakes-401k.html",
    "summary": "Even people with employee-sponsored retirement plans still find it difficult to save for the future when faced with present-day desires."
  },
  {
    "title": "A Boston Suburb Removed Italian Flag Colors From a Street. Residents Rebelled.",
    "link": "https://www.nytimes.com/2025/07/27/us/italy-street-newton-massachusetts.html",
    "summary": "Newton, Mass., replaced a street’s red, white and green centerline with standard yellow stripes, citing traffic safety concerns, weeks before an annual Italian American festival."
  },
  {
    "title": "Tom Lehrer, Musical Satirist With a Dark Streak, Dies at 97",
    "link": "https://www.nytimes.com/2025/07/27/arts/music/tom-lehrer-dead.html",
    "summary": "A mathematician by training, he acquired a devoted following with songs that set sardonic lyrics to music that was often maddeningly cheerful."
  },
  {
    "title": "The Raw Power of Repentance",
    "link": "https://www.nytimes.com/2025/07/27/opinion/the-bear-carmy-jeremy-allen-white.html",
    "summary": "“The Bear” asks the question, how do we live together when someone always seems to be going too far?"
  },
  {
    "title": "The Protein Boom",
    "link": "https://www.nytimes.com/2025/07/27/briefing/the-protein-boom.html",
    "summary": "Protein is remaking the food economy. How much do you really need?"
  },
  {
    "title": "11 People Injured in Stabbing at a Michigan Walmart, Officials Say",
    "link": "https://www.nytimes.com/2025/07/26/us/stabbing-traverse-city-walmart.html",
    "summary": "One person was in custody after what the authorities said was a random attack at a store near Traverse City, Mich."
  },
  {
    "title": "Raymond Saunders, Painter Who Rejected Racial Pigeonholes, Dies at 90",
    "link": "https://www.nytimes.com/2025/07/27/arts/raymond-saunders-dead.html",
    "summary": "Widely admired if long underrecognized for his collage-based art, he died only days after the closing of his first retrospective at a major museum, in his native Pittsburgh."
  },
  {
    "title": "Smoke From Canadian Wildfires Wafts Over New York City",
    "link": "https://www.nytimes.com/2025/07/27/nyregion/new-york-air-quality-canada-wildfires.html",
    "summary": "Officials warned young children and those with respiratory illnesses to take precautions. For weeks, smoke from Canadian wildfires has been drifting across the border."
  }
]