[
  {
    "title": "With Comey Indictment, Trump Sets Retribution Precedent That Could Haunt His Allies",
    "link": "https://www.nytimes.com/2025/09/28/us/politics/trump-comey-retribution-precedent.html",
    "summary": "President Trump’s retribution campaign risks ushering in a cycle of retaliation in which each new administration takes aim at the last one."
  },
  {
    "title": "Trump Raises Possibility of Inquiry Into Wray, Another Former F.B.I. Director",
    "link": "https://www.nytimes.com/2025/09/28/us/politics/trump-wray-fbi.html",
    "summary": "In a phone interview with NBC, Mr. Trump said an investigation of Christopher Wray could be underway, days after the Justice Department’s indictment of James B. Comey."
  },
  {
    "title": "Trump to Meet With Congressional Leaders as Shutdown Deadline Looms",
    "link": "https://www.nytimes.com/2025/09/28/us/politics/schumer-jeffries-trump-shutdown.html",
    "summary": "Lawmakers face a Tuesday deadline to fund the government, which will require them to agree on a spending measure that can win at least 60 votes in the Senate."
  },
  {
    "title": "What We Know About the Suspect in the Michigan Church Shooting",
    "link": "https://www.nytimes.com/2025/09/28/us/what-we-know-suspect-michigan-church-shooting.html",
    "summary": "The suspect, a 40-year-old man, was killed during the attack, officials said."
  },
  {
    "title": "The Michigan Attack Targeted a Latter-day Saint Church",
    "link": "https://www.nytimes.com/2025/09/28/us/latter-day-saints-church-grand-blanc-township.html",
    "summary": "The building in Grand Blanc Township served a congregation of about 150 members. And that number was growing, according to a frequent visitor."
  },
  {
    "title": "Eric Adams Abandons Re-election Bid for Mayor of New York City",
    "link": "https://www.nytimes.com/2025/09/28/nyregion/adams-mayor-drops-out.html",
    "summary": "Mayor Adams’s campaign was left foundering after repeated scandals, a federal indictment and his courtship of President Trump."
  },
  {
    "title": "Swaggering, Scandalous, Strange: There Will Never Be Another Eric Adams",
    "link": "https://www.nytimes.com/2025/09/28/nyregion/eric-adams-profile-personality.html",
    "summary": "The quotable, luxury-loving, perpetually mysterious mayor took New Yorkers on a wild and unpredictable ride."
  },
  {
    "title": "13 Moments That Have Defined Eric Adams’s Political Career",
    "link": "https://www.nytimes.com/2025/09/28/nyregion/eric-adams-resignation-political-career.html",
    "summary": "Mr. Adams served in the New York State Senate and as Brooklyn borough president before becoming mayor of New York City in 2022. Ethical questions have followed him along the way."
  },
  {
    "title": "What the Public Memory of Charlie Kirk Revealed",
    "link": "https://www.nytimes.com/2025/09/28/magazine/charlie-kirk-rhetoric.html",
    "summary": "For those who felt denigrated by his rhetoric, the bipartisan tributes to him as a champion of free speech augured something dangerous: the mainstreaming of formerly extremist views."
  },
  {
    "title": "Bad Bunny Will Headline Super Bowl Halftime Show",
    "link": "https://www.nytimes.com/2025/09/28/arts/music/bad-bunny-super-bowl-halftime.html",
    "summary": "The Latin superstar known for hits including “MIA,” “I Like It” and “Me Porto Bonito” will perform in February in Santa Clara, Calif."
  },
  {
    "title": "Venezuela, America and the Specter of Regime Change",
    "link": "https://www.nytimes.com/2025/09/28/world/venezuela-trump-comey-russia-ukraine-drones.html",
    "summary": "In this first edition of The World newsletter, we explore why a president who campaigned against “foreign wars” is sending warships to Venezuela."
  },
  {
    "title": "Q&A: Our New Global Newsletter Host on Creating an ‘Antidote to the Overwhelm’",
    "link": "https://www.nytimes.com/2025/09/28/world/new-newsletter-host-qanda.html",
    "summary": "Katrin Bennhold is the host of The World, a New York Times newsletter for readers around the globe. It launches this week."
  },
  {
    "title": "Missing From a U.N. Meeting on Helping Refugees? The Refugees.",
    "link": "https://www.nytimes.com/2025/09/29/world/asia/rohingya-refugees-un-general-assembly.html",
    "summary": "World leaders will discuss how to assist the Rohingya in the world’s largest refugee settlement. But no one living there is attending the conference at the United Nations."
  },
  {
    "title": "Moldova’s Pivotal Election Expected to End in Victory for Pro-Europeans",
    "link": "https://www.nytimes.com/2025/09/28/world/europe/moldova-election-russia.html",
    "summary": "The party of President Maia Sandu appeared poised to keep its majority in Parliament, in a vote widely seen as a showdown between Europe and Russia."
  },
  {
    "title": "The World’s 50 Best Restaurants in North America",
    "link": "https://www.nytimes.com/2025/09/26/dining/worlds-50-best-restaurants-north-america.html",
    "summary": "No. 1 on the new ranking is Atomix, a refined Korean tasting-menu spot in New York. But other picks reflect a surprising turn to the casual."
  },
  {
    "title": "I Beat the Anthropic A.I. Chatbot That Stole My Book",
    "link": "https://www.nytimes.com/2025/09/29/opinion/anthropic-chatbot-lawsuit-books.html",
    "summary": "A.I. feels like a runaway train. But we don’t have to let it run over us."
  },
  {
    "title": "Ta-Nehisi Coates on Bridging Gaps vs. Drawing Lines",
    "link": "https://www.nytimes.com/2025/09/28/opinion/ezra-klein-podcast-ta-nehisi-coates.html",
    "summary": "The writer Ta-Nehisi Coates joins Ezra Klein on the show to discuss how the left should think about the work of politics and persuasion in this moment."
  },
  {
    "title": "Stowaway Found Dead in Wheel Well of American Airlines Jet, Police Say",
    "link": "https://www.nytimes.com/2025/09/28/us/american-airlines-stowaway-dead-charlotte.html",
    "summary": "The body was found on Sunday at Charlotte Douglas International Airport in the landing gear compartment of a plane that had recently arrived from Europe, the police said."
  },
  {
    "title": "Viv Prince, Rock’s Original Madman Drummer, Is Dead at 84",
    "link": "https://www.nytimes.com/2025/09/28/arts/music/viv-prince-dead.html",
    "summary": "A drummer for the 1960s British band the Pretty Things, “the high priest of lunacy” set a high bar for fiery performances and offstage misbehavior."
  }
]