[
  {
    "title": "Trapped Between U.S. and China, South Korea Feels Trade War’s Pressure",
    "link": "https://www.nytimes.com/2025/10/27/business/south-korea-trump-tariffs.html",
    "summary": "A preliminary tariff deal with President Trump called for a large investment in the United States, while China has warned Seoul not to side with Washington."
  },
  {
    "title": "Why Trump’s Asia Visit Is Consequential",
    "link": "https://www.nytimes.com/video/world/asia/100000010477965/why-trumps-asia-visit-is-consequential.html",
    "summary": "President Trump has embarked on a six-day diplomatic tour of Asia, testing his role as a statesman and negotiator as he pursues a trade deal with China. Erica L. Green, the White House correspondent for The New York Times, explains what’s at stake."
  },
  {
    "title": "Japan’s New Prime Minister Has an Advantage in Winning Over Trump",
    "link": "https://www.nytimes.com/2025/10/26/world/asia/japan-trump-takaichi.html",
    "summary": "As Sanae Takaichi seeks reassurance from President Trump on trade and security, she will likely play up her ties to Shinzo Abe, a mutual friend."
  },
  {
    "title": "Step by Step, How China Seized Control of Critical Minerals",
    "link": "https://www.nytimes.com/2025/10/27/business/china-rare-earth-export-controls.html",
    "summary": "China’s far-reaching rules already affect manufacturers of semiconductors, cars and many other products. They will soon become much broader."
  },
  {
    "title": "How Politics Is Changing the Way History Is Taught",
    "link": "https://www.nytimes.com/2025/10/27/us/history-lessons-ethnic-studies-retreat.html",
    "summary": "History lessons are being wiped from the internet, and California is retreating from ethnic studies, as education swings away from curriculums that are seen as too progressive."
  },
  {
    "title": "Trump Says a Recent M.R.I. Scan Was ‘Perfect,’ and He’d ‘Love’ a Third Term",
    "link": "https://www.nytimes.com/2025/10/27/us/politics/trump-mri-third-term.html",
    "summary": "President Trump made the comments on the second day of his trip to Asia. The Constitution limits presidents to two terms, but Mr. Trump has suggested he might try to circumvent it."
  },
  {
    "title": "Will Trump’s Tariffs Survive Supreme Court’s ‘Major Questions’ Test?",
    "link": "https://www.nytimes.com/2025/10/27/us/politics/trump-tariffs-supreme-courts-major-questions-doctrine.html",
    "summary": "The justices used the doctrine, a judicially created method of reading statutes, to thwart several major Biden programs."
  },
  {
    "title": "A West Texas Children’s Clinic Where Vaccine Suspicion Is Encouraged",
    "link": "https://www.nytimes.com/2025/10/27/us/politics/antivax-clinic-texas.html",
    "summary": "Parents who come to Pia Habersang’s practice in Amarillo shun vaccinations, with the encouragement of the clinic’s nurse practitioner; the health secretary, Robert F. Kennedy Jr.; and President Trump."
  },
  {
    "title": "Vaccine Skepticism Comes Come for Pet Owners",
    "link": "https://www.nytimes.com/2025/10/27/science/vaccines-pets-dogs-cats.html",
    "summary": "Anti-vaccine sentiment is spilling over into veterinary medicine, making some owners hesitant to vaccinate their pets, even for fatal diseases like rabies."
  },
  {
    "title": "Jeremy Allen White and the Anxiety of Playing Springsteen",
    "link": "https://www.nytimes.com/2025/10/26/movies/jeremy-allen-white-springsteen-deliver-me-from-nowhere.html",
    "summary": "The star never imagined he’d be performing as the Boss in front of the Boss. But the head-spinning nature of the role has paid off."
  },
  {
    "title": "As New Yorkers Flood Early Voting Sites, Undecideds Become Prized Target",
    "link": "https://www.nytimes.com/2025/10/27/nyregion/early-voting-mayors-race-mamdani-cuomo-sliwa.html",
    "summary": "Zohran Mamdani, the front-runner for mayor of New York City, has built his lead in part by relying on a huge ground-game operation."
  },
  {
    "title": "Javier Milei’s Party Triumphs in Argentina Midterm Election",
    "link": "https://www.nytimes.com/2025/10/26/world/americas/argentina-election-javier-milei.html",
    "summary": "The result, which gives Mr. Milei enough legislative support to keep his vetoes from being overturned, showed that many voters still back the president’s libertarian experiment."
  },
  {
    "title": "Jack Carr Knows His Way Around a Battlefield, and a Military Thriller",
    "link": "https://www.nytimes.com/2025/10/27/books/review/jack-carr-terminal-list-cry-havoc.html",
    "summary": "His gritty novels have spawned a cottage industry and become a rallying point for fellow veterans. “Cry Havoc” is the latest."
  },
  {
    "title": "Lawsuit Plunges New York Into the National Gerrymandering Fight",
    "link": "https://www.nytimes.com/2025/10/27/nyregion/new-york-state-redistricting-lawsuit.html",
    "summary": "A suit filed by an election law firm contends that the state’s 11th Congressional District, represented by a Republican, is drawn in a way that disenfranchises Black and Latino voters."
  },
  {
    "title": "Indiana Governor Calls Special Session on Redistricting to Benefit Republicans",
    "link": "https://www.nytimes.com/2025/10/27/us/indiana-redistricting-special-session.html",
    "summary": "Indiana is the latest state to consider redrawing its House district boundaries, though it was not clear whether Republicans had enough votes in the legislature to pass a new map."
  },
  {
    "title": "Virginia Democrats to Begin Redistricting Votes in Latest Battle for Congress",
    "link": "https://www.nytimes.com/2025/10/27/us/virginia-redistricting-vote.html",
    "summary": "State lawmakers are convening to take a vote that would allow redistricting before next year’s midterms, though the process would take months."
  },
  {
    "title": "In Shift in Relationship With Netanyahu, Trump Says ‘I Will Decide’ What Is Right for Israel",
    "link": "https://www.nytimes.com/2025/10/27/world/middleeast/trump-netanyahu-relationship.html",
    "summary": "Since an Israel-Hamas cease-fire deal came into effect, the U.S. effort to sustain it appears to have constrained Prime Minister Benjamin Netanyahu."
  },
  {
    "title": "How the Firebombing of His Home Changed Josh Shapiro",
    "link": "https://www.nytimes.com/2025/10/27/us/politics/josh-shapiro-political-violence.html",
    "summary": "In an interview, the Pennsylvania governor offered his most detailed accounting yet of the April attack — and how he’s grappling with its aftermath."
  },
  {
    "title": "Why Attacks on Spanberger Don’t Seem to Stick in Va. Governor’s Race",
    "link": "https://www.nytimes.com/2025/10/27/us/politics/virginia-governors-race.html",
    "summary": "Abigail Spanberger, the Democratic nominee, has a commanding lead in polls. Her Republican rival, Winsome Earle-Sears, has focused on a texting scandal involving the Democrat running for attorney general."
  },
  {
    "title": "John Dickerson, Anchor and Correspondent, to Leave CBS News",
    "link": "https://www.nytimes.com/2025/10/27/business/john-dickerson-cbs-news-exit.html",
    "summary": "He is a veteran anchor with a long family legacy at CBS, and his exit presages a series of changes expected at the broadcast news division."
  },
  {
    "title": "Taylor Sheridan Signs Deal With NBCUniversal",
    "link": "https://www.nytimes.com/2025/10/27/business/media/taylor-sheridan-nbc-universal-paramount.html",
    "summary": "Mr. Sheridan, a prolific TV producer, will leave Paramount when his contract expires, according to two people with knowledge of the decision."
  },
  {
    "title": "The Insidious Joviality of Nigel Farage",
    "link": "https://www.nytimes.com/2025/10/27/opinion/nigel-farage-britain-reform.html",
    "summary": "His rise is both a symptom and a cause of the newly febrile mood in Britain."
  },
  {
    "title": "Being Latino in the United States Should Not Be a Crime",
    "link": "https://www.nytimes.com/2025/10/27/opinion/immigration-enforcement-latino-discrimination.html",
    "summary": "Trump’s immigration tactics violate both the law and human decency."
  },
  {
    "title": "Is A.I. a Bubble?",
    "link": "https://www.nytimes.com/2025/10/27/briefing/is-ai-a-bubble.html",
    "summary": "We explain the fears on Wall Street."
  },
  {
    "title": "Saudi Arabia, Rich With Oil, Wants to Be Known as the A.I. Exporter",
    "link": "https://www.nytimes.com/2025/10/27/technology/saudi-arabia-ai-exporter.html",
    "summary": "The kingdom is pouring money into data centers and working with U.S. and Chinese tech giants, landing its A.I. ambitions in the middle of a geopolitical tussle for tech power."
  },
  {
    "title": "Inside Calgary’s Fight Over Fluoride in the Water",
    "link": "https://www.nytimes.com/2025/10/27/world/canada/canada-calgary-fluoride-water.html",
    "summary": "A contentious vote over the return of fluoride to Calgary’s water was supposed to settle a decades-long debate. But the battle on both sides remains as polarized as ever."
  },
  {
    "title": "Anthony Jackson, Master of the Electric Bass, Is Dead at 73",
    "link": "https://www.nytimes.com/2025/10/27/arts/music/anthony-jackson-dead.html",
    "summary": "Besides his work with pop stars and jazz greats, he is credited with helping to invent the six-string contrabass guitar."
  },
  {
    "title": "Diphtheria, a Once Vanquished Killer of Children, Is Resurgent",
    "link": "https://www.nytimes.com/2025/10/27/health/diptheria-somalia-vaccines.html",
    "summary": "A Somali hospital ward packed with gasping children shows how war, climate and mistrust of vaccines is fueling the disease’s return."
  }
]