[
  {
    "title": "Trump Is Briefed on Options for Striking Iran as Protests Continue",
    "link": "https://www.nytimes.com/2026/01/10/us/politics/trump-iran-strikes.html",
    "summary": "The president has said he will be “hitting them very hard” if Iranian leaders kill protesters amid widespread demonstrations calling for wholesale changes in the country."
  },
  {
    "title": "Inside Iran’s Protests: How a Plunging Currency Set Off Wide Unrest",
    "link": "https://www.nytimes.com/2026/01/10/world/europe/iran-protests-economy-currency-collapse.html",
    "summary": "In a serious challenge to Iran’s authoritarian government, angry protests have spread from the markets and universities of major cities to the impoverished towns in the hinterland."
  },
  {
    "title": "Why Are Iranians Protesting? What to Know About the Unrest.",
    "link": "https://www.nytimes.com/article/iran-protests-inflation-currency.html",
    "summary": "Demonstrations that began as outrage at the state of the economy have spread to cities across the country, amid an escalating crackdown by the authorities."
  },
  {
    "title": "FBI’s Inquiry Into Minneapolis ICE Shooting Faces Doubts After White House’s Remarks",
    "link": "https://www.nytimes.com/2026/01/10/us/politics/trump-ice-shooting-response-minneapolis.html",
    "summary": "Ex-law enforcement officials said the administration’s declarations that the killing was justified elicited questions about the F.B.I.’s willingness to scrutinize the agent who fatally shot an unarmed activist."
  },
  {
    "title": "New Cellphone Video Shows ICE Agent’s Perspective Before Minneapolis Shooting",
    "link": "https://www.nytimes.com/2026/01/09/us/ice-agent-video-minneapolis-shooting.html",
    "summary": "The Department of Homeland Security posted a clip of the video on social media and said it was taken by the agent, who killed a 37-year-old woman in the shooting."
  },
  {
    "title": "Disinformation in Minneapolis Shooting Points at People Who Were Not Involved",
    "link": "https://www.nytimes.com/2026/01/10/us/disinformation-minneapolis-shooting-ice.html",
    "summary": "Within hours of an ICE officer shooting and killing a woman, social media users misidentified the agent who fired as Steve Grove."
  },
  {
    "title": "A ‘Ticklish Subject’: Trump’s Words on Immigration Often Collide and Contradict",
    "link": "https://www.nytimes.com/2026/01/10/us/politics/a-ticklish-subject-trumps-words-on-immigration-often-collide-and-contradict.html",
    "summary": "In an interview with The New York Times, President Trump made a point of keeping distance from certain hard-line immigration policies, even as he continues to demonize and shut out immigrants."
  },
  {
    "title": "U.S. Launches Major Strikes on Islamic State Targets in Syria",
    "link": "https://www.nytimes.com/2026/01/10/us/politics/us-strikes-islamic-state-syria.html",
    "summary": "The airstrikes followed an even larger attack in December to avenge the killing of three Americans last year."
  },
  {
    "title": "Trump Eyes Greenland, and Europe Figures Its Best Bet Is a Negotiation",
    "link": "https://www.nytimes.com/2026/01/10/world/europe/trump-greenland-europe.html",
    "summary": "European officials were stunned that President Trump restated his desire for Greenland after a yearlong effort to dissuade him, according to diplomats and others."
  },
  {
    "title": "How Our White House Photographer Finds New Angles on the Oval Office",
    "link": "https://www.nytimes.com/2026/01/09/insider/trump-interview-doug-mills-photographer.html",
    "summary": "Doug Mills, winner of three Pulitzers, sits, crawls and hoists cameras high in the air to bring viewers fresh perspectives. He was at it again this week during our marathon interview with President Trump."
  },
  {
    "title": "How Delcy Rodríguez, Venezuela’s Leader, Became Vital to Trump’s Plans for the Country",
    "link": "https://www.nytimes.com/2026/01/10/world/americas/delcy-rodriguez-venezuela-economy-trump.html",
    "summary": "Delcy Rodríguez, a guerrilla’s daughter, started out as a provocateur. She pivoted to revive a ravaged economy, making her vital to U.S. plans to run Venezuela."
  },
  {
    "title": "Machado Offered Trump Her Nobel, but Prize Institute Says It’s Not Allowed",
    "link": "https://www.nytimes.com/2026/01/10/world/americas/trump-nobel-peace-prize-maria-machado.html",
    "summary": "After María Corina Machado, Venezuela’s opposition leader, offered her Nobel Peace Prize to President Trump, the Norwegian Nobel Institute said it cannot be “transferred to others.”"
  },
  {
    "title": "Bob Weir, Guitarist and Founding Member of The Grateful Dead, Dies at 78",
    "link": "https://www.nytimes.com/2026/01/10/obituaries/bob-weir-dead-grateful-dead.html",
    "summary": "His songwriting and rhythm guitar playing helped shape the San Francisco band’s sound as it emerged to become an American institution."
  },
  {
    "title": "Golden Globes 2026: What to Expect From Sunday’s Awards Ceremony",
    "link": "https://www.nytimes.com/2026/01/10/movies/golden-globes-what-to-expect.html",
    "summary": "Keep an eye on “One Battle After Another,” which is likely to dominate, and on the speeches. A particularly memorable one could be an Oscar lifeline."
  },
  {
    "title": "Neon, an Indie Studio With an International Bent, Tops Globes Nominations",
    "link": "https://www.nytimes.com/2026/01/10/business/media/neon-golden-globes.html",
    "summary": "Neon scored more film nominations at the Golden Globes than any other studio this year with a slate of six non-English language films."
  },
  {
    "title": "The ‘Attention Economy’ Is a Lie",
    "link": "https://www.nytimes.com/2026/01/10/opinion/attention-world-war-2-technology-nazis.html",
    "summary": "It started in a laboratory. No one could have predicted where it would end."
  },
  {
    "title": "Trump Is ‘Chest-Beating’ Over a Retreat",
    "link": "https://www.nytimes.com/2026/01/10/opinion/trump-donroe-doctrine-ice-minneapolis-venezuela.html",
    "summary": "The round table convenes to discuss the start to Trump’s 2026, from Greenland to Minnesota and Venezuela."
  },
  {
    "title": "Brian Heywood Is Bankrolling Conservative Ballot Measures in Washington",
    "link": "https://www.nytimes.com/2026/01/09/us/politics/ballot-measures-washington-state-wealthy.html",
    "summary": "Brian Heywood, a Seattle-area hedge fund founder, has spent millions to put conservative initiatives in front of Washington lawmakers and voters. Next up: parental rights and transgender athletes."
  },
  {
    "title": "Six Dead in Mississippi Shooting; Suspect in Custody, Clay County Sheriff Says",
    "link": "https://www.nytimes.com/2026/01/10/us/shooting-west-point-mississippi.html",
    "summary": "The authorities in Clay County, Miss., arrested a 24-year-old man after a 7-year-old girl and five more people were killed."
  },
  {
    "title": "Monkeys Are on the Loose in St. Louis, City Officials Say",
    "link": "https://www.nytimes.com/2026/01/10/us/monkeys-loose-st-louis.html",
    "summary": "As many as four vervet monkeys were spotted in a neighborhood in North St. Louis on Thursday, city officials said. No one knows how they got there."
  },
  {
    "title": "Paul Haggis Reaches $2 Million Settlement After 2022 Rape Verdict",
    "link": "https://www.nytimes.com/2026/01/10/movies/paul-haggis-rape-settlement.html",
    "summary": "A judge had ordered the Oscar-winning filmmaker to pay at least $7.5 million to a former film-industry publicist after a civil jury found him liable for raping her."
  }
]