[
  {
    "title": "A Potential Strike on Iran Tests Trump’s Propensity to Play to Both Sides",
    "link": "https://www.nytimes.com/2025/06/20/us/politics/iran-trump-both-sides.html",
    "summary": "President Trump has excelled at letting supporters hear what they want to hear. But Iran has upended that strategy."
  },
  {
    "title": "Mahmoud Khalil Is Released on Bail After Federal Judge’s Order",
    "link": "https://www.nytimes.com/2025/06/20/nyregion/mahmoud-khalil-release-order.html",
    "summary": "Mr. Khalil, a Columbia graduate and legal permanent resident, had been held in Louisiana for over three months. The judge found reason to believe it was retaliation for his pro-Palestinian speech."
  },
  {
    "title": "Where Trump and Newsom’s Fight Over the California National Guard Stands",
    "link": "https://www.nytimes.com/2025/06/20/us/trump-california-la-national-guard.html",
    "summary": "A volley of court rulings has made the legal path unclear in a case challenging President Trump’s use of troops in Los Angeles. For now, the president has retained control of the state militia."
  },
  {
    "title": "Judge Blocks Trump’s Tying of Transportation Funds to Immigration Enforcement",
    "link": "https://www.nytimes.com/2025/06/20/us/politics/trump-transportation-funds-immigration-states.html",
    "summary": "Attorneys general in 20 states, most led by Democrats, had sued the administration. Similar suits have been filed over funding for other programs."
  },
  {
    "title": "How Trump Treats Black History Differently Than Other Parts of America’s Past",
    "link": "https://www.nytimes.com/2025/06/20/us/politics/trump-black-history-federal-holidays.html",
    "summary": "Since taking office in January, President Trump has tried to reframe the country’s past involving racism and discrimination by de-emphasizing that history or at times denying that it happened."
  },
  {
    "title": "Putin Does Not Rule Out Capturing Key Ukrainian City",
    "link": "https://www.nytimes.com/2025/06/20/world/europe/russia-putin-ukraine.html",
    "summary": "Moscow has hoped to mend relations with the United States while continuing to wage war in Ukraine, but Mr. Putin’s insistence on pushing his offensive has come at a diplomatic cost."
  },
  {
    "title": "Barbra Streisand on the Duets That Define Her: ‘I Like Drama’",
    "link": "https://www.nytimes.com/2025/06/20/arts/music/barbra-streisand-the-secret-of-life-partners-volume-two-interview.html",
    "summary": "With a new album due next week that pairs her with Paul McCartney, Bob Dylan, Laufey, Sam Smith and more, the singer looks back at her prized collaborations."
  },
  {
    "title": "You Only Get Married a Few Times. Why Not Go All Out?",
    "link": "https://www.nytimes.com/2025/06/20/style/jeff-bezos-lauren-sanchez-second-weddings.html",
    "summary": "As the Jeff Bezos-Lauren Sánchez nuptials approach, a look at how second weddings went from low-key to lavish."
  },
  {
    "title": "Anne Burrell Memorial Service Attended by Food Network Stars",
    "link": "https://www.nytimes.com/2025/06/20/dining/anne-burrell-memorial-service.html",
    "summary": "The Food Network chef, who died Tuesday at 55, was remembered in a star-studded service that sent her off with a singalong."
  },
  {
    "title": "Anne Burrell’s Death Is Under Investigation as a Possible Drug Overdose",
    "link": "https://www.nytimes.com/2025/06/20/dining/anne-burrell-overdose-death-investigation.html",
    "summary": "The city’s medical examiner has not determined a cause, but an internal police document says the TV chef was found surrounded by pills."
  },
  {
    "title": "How Vera Rubin Telescope Scientists Will Deal With 60 Million Billion Bytes of Imagery",
    "link": "https://www.nytimes.com/2025/06/20/science/vera-rubin-telescope-data.html",
    "summary": "The Vera C. Rubin Observatory will make the study of stars and galaxies more like the big data-sorting exercises of contemporary genetics and particle physics."
  },
  {
    "title": "Taco Bell’s Crunchwrap Supreme, an Unlikely Muse for Chefs, Turns 20",
    "link": "https://www.nytimes.com/2025/06/20/dining/taco-bell-crunchwrap-supreme.html",
    "summary": "Twenty years after its debut, Taco Bell’s Crunchwrap Supreme has inspired a legion of dupes with its endlessly adaptable format."
  },
  {
    "title": "Gratitude, Not Envy, Can Save America",
    "link": "https://www.nytimes.com/2025/06/20/opinion/grateful-thanks-america-envy.html",
    "summary": "Americans experience massive amounts of envy. It has led us to think we lack something, even as our prosperity soars."
  },
  {
    "title": "Candidates’ Shift on Crime Turned the New York Mayor’s Race Upside Down",
    "link": "https://www.nytimes.com/2025/06/20/opinion/new-york-mayor-election-police.html",
    "summary": "With “defund the police” still in New Yorkers’ ears, getting traction in the mayor’s race was complicated."
  },
  {
    "title": "Negotiations With Iran Failed to Yield a Breakthrough",
    "link": "https://www.nytimes.com/2025/06/20/briefing/negotiations-with-iran-failed-to-yield-a-breakthrough.html",
    "summary": "Also, temperatures are soaring across the U.S. Here’s the latest at the end of Friday."
  },
  {
    "title": "People With Severe Diabetes Are Cured in Small Trial of New Drug",
    "link": "https://www.nytimes.com/2025/06/20/health/diabetes-cure-insulin-stem-cell.html",
    "summary": "Most in a small group of patients receiving a stem cell-based infusion no longer needed insulin, but the drug may not suit those with more manageable type 1 diabetes."
  },
  {
    "title": "Pilot Tried To Avoid Turtle in Deadly North Carolina Plane Crash",
    "link": "https://www.nytimes.com/2025/06/20/us/turtle-plane-crash-north-carolina.html",
    "summary": "One other person on board was killed in the June 3 crash in North Carolina and another passenger was severely injured."
  },
  {
    "title": "Lou Christie, ‘Lightnin’ Strikes’ Pop Crooner, Is Dead at 82",
    "link": "https://www.nytimes.com/2025/06/20/arts/music/lou-christie-dead.html",
    "summary": "A late-1960s throwback to the days of clean-cut teen idols — he called himself “the missing link” — he rode his gymnastic vocal range to a string of hits."
  },
  {
    "title": "Buzzy Publisher Started by TikTok’s Owner Abruptly Shuts Down",
    "link": "https://www.nytimes.com/2025/06/20/books/review/bytedance-tiktok-publisher-shuts-down.html",
    "summary": "8th Note Press informed writers and agents that it is abruptly shutting down and returning publication rights to authors."
  }
]