[
  {
    "title": "Prosecutors Began Investigating Renee Good’s Killing. Washington Told Them to Stop.",
    "link": "https://www.nytimes.com/2026/02/07/us/renee-good-investigation-minnesota-trump.html",
    "summary": "Federal prosecutors had a warrant to collect evidence from Ms. Good’s vehicle, but Trump administration leaders said to drop it. About a dozen prosecutors have departed, leaving the Minnesota U.S. attorney’s office in turmoil."
  },
  {
    "title": "Binance Gives Trump Family’s Crypto Firm a Leg Up",
    "link": "https://www.nytimes.com/2026/02/07/business/binance-trump-crypto.html",
    "summary": "Ties between the exchange and the president’s company, World Liberty Financial, have only strengthened since the president pardoned Binance’s founder, Changpeng Zhao."
  },
  {
    "title": "Trump Declines to Apologize for Posting Racist Video Portraying Obamas as Apes",
    "link": "https://www.nytimes.com/2026/02/06/us/politics/trump-obamas-video-apes-truth-social.html",
    "summary": "The video clip that President Trump posted in a late-night flurry of social media activity caused an unusually strong and public outcry from members of his own party."
  },
  {
    "title": "Why Trump’s Calls to ‘Nationalize’ Voting Have Raised Midterm Fears",
    "link": "https://www.nytimes.com/article/trumps-nationalize-voting-elections-midterms-explainer.html",
    "summary": "The president has escalated his language as his administration takes steps to involve itself more in election matters."
  },
  {
    "title": "Mexican Cartels Overwhelm Police With Ammunition Made for the U.S. Military",
    "link": "https://www.nytimes.com/2026/02/07/us/lake-city-army-ammunition-plant-missouri-mexico.html",
    "summary": "Drug syndicates have used .50-caliber ammunition, produced at a plant owned by the U.S. Army and then smuggled across the border, in attacks on Mexican civilians and police."
  },
  {
    "title": "Lindsey Vonn Aims to Become the Oldest Alpine Olympic Medalist, Despite Ruptured A.C.L.",
    "link": "https://www.nytimes.com/2026/02/07/us/lindsey-vonn-ski-winter-olympics-2026.html",
    "summary": "The 41-year-old American aims to complete her comeback by racing in the women’s Olympic downhill on Sunday despite rupturing her left A.C.L. a week ago."
  },
  {
    "title": "Super Bowl Halftime Is the World’s Biggest Stage. He Designs It.",
    "link": "https://www.nytimes.com/2026/02/07/arts/music/super-bowl-halftime-stage-designer.html",
    "summary": "From Prince’s giant symbol to Kendrick Lamar’s streetlamps, the set production designer Bruce Rodgers “makes the impossible possible.”"
  },
  {
    "title": "The 2026 Super Bowl Ads (So Far), Ranked",
    "link": "https://www.nytimes.com/2026/02/06/arts/television/super-bowl-ads-ranked-2026.html",
    "summary": "Here is our critic’s survey of this year’s Super Bowl commercials, from best to worst to A.I."
  },
  {
    "title": "What’s Up With This Big Freeze? Some Scientists See Climate Change Link",
    "link": "https://www.nytimes.com/2026/02/07/climate/cold-weather-climate-change.html",
    "summary": "A warming Arctic can stretch the polar vortex, a high-altitude air ribbon, one says. The “wobble” can disrupt the jet stream, causing extreme cold in the East."
  },
  {
    "title": "What to Know About the Cold Snap in NYC This Weekend",
    "link": "https://www.nytimes.com/2026/02/07/nyregion/nyc-weather-extreme-cold-warning.html",
    "summary": "Cold-weary New Yorkers will get hit by another blast of frigid weather. Here’s what to expect, and what the city is doing to protect the vulnerable."
  },
  {
    "title": "The President’s Personal Spy Chief",
    "link": "https://www.nytimes.com/video/opinion/100000010694134/the-presidents-personal-spy-chief.html",
    "summary": "From joining an F.B.I. search of an election center to allegedly suppressing a whistleblower complaint, Tulsi Gabbard, the director of national intelligence, is eroding the independence of our intelligence community, argues Times Opinion’s editor, Kathleen Kingsbury."
  },
  {
    "title": "Trump’s Obama Derangement Syndrome",
    "link": "https://www.nytimes.com/2026/02/07/opinion/trump-obama-apes-post-video.html",
    "summary": "The president shows, once again, that he shouldn’t be anywhere near the Oval."
  },
  {
    "title": "Vanity Fair",
    "link": "https://www.nytimes.com/2026/02/07/briefing/vanity-fair.html",
    "summary": "Behind the scenes at the Westminster Dog Show, the entrants were affectionate. Or at least they acted like it."
  },
  {
    "title": "Pelosi to Endorse Jack Schlossberg, Again Backing a Kennedy for Congress",
    "link": "https://www.nytimes.com/2026/02/07/us/politics/pelosi-endorse-schlossberg-kennedy.html",
    "summary": "The former speaker, a prodigious fund-raiser and shrewd campaign strategist, seldom intervenes in primaries but has made an exception for a Kennedy before."
  },
  {
    "title": "Trump Reverts to Diplomacy With Iran, but the Road Is Narrow",
    "link": "https://www.nytimes.com/2026/02/07/world/europe/iran-us-trump-diplomacy.html",
    "summary": "Iran is skilled at prolonging negotiations over its nuclear program, and seems to be hoping President Trump is out for a quick win, rather than a prolonged regional war."
  },
  {
    "title": "Nithya Raman Announces She Will Run for Los Angeles Mayor",
    "link": "https://www.nytimes.com/2026/02/07/us/nithya-raman-los-angeles-mayor.html",
    "summary": "Nithya Raman, who has been compared to Mayor Zohran Mamdani of New York, presents a significant challenge to the incumbent, Mayor Karen Bass."
  },
  {
    "title": "A Mosque Bombing Undercuts Pakistan’s Bid for Security",
    "link": "https://www.nytimes.com/2026/02/07/world/asia/pakistan-mosque-bombing.html",
    "summary": "Pakistan has made headway against the Islamic State and other militants, but a bloody suicide attack showed how fragile its progress has been."
  }
]