[
  {
    "title": "Trump and Xi Ease Off the Trade War, but New Nuclear Threat Brings a Chill",
    "link": "https://www.nytimes.com/2025/10/30/us/politics/trump-xi-trade-meeting.html",
    "summary": "The two leaders reached an agreement on fentanyl, some tariffs and rare earths, at least for a year. But even as the global trade picture cleared a little, Mr. Trump spurred new worries about nuclear proliferation."
  },
  {
    "title": "Trump Threatens to Resume Nuclear Weapons Testing, Minutes Before Xi Meeting",
    "link": "https://www.nytimes.com/2025/10/29/us/politics/trump-nuclear-weapons-testing.html",
    "summary": "Just minutes before he was scheduled to meet President Xi Jinping of China, the president threatened on social media to resume nuclear testing “on an equal basis” with other countries."
  },
  {
    "title": "How Xi Walked Away From Trump Trade Talks Looking Stronger",
    "link": "https://www.nytimes.com/2025/10/30/world/asia/china-trump-xi-trade.html",
    "summary": "By withholding soybean purchases and rare-earth exports, China extracted relief from U.S. tariffs and delayed export controls, without conceding much in return."
  },
  {
    "title": "Trump Threatens to Resume Nuclear Tests, and Nvidia Crosses $5 Trillion",
    "link": "https://www.nytimes.com/2025/10/30/podcasts/the-headlines/trump-nuclear-testing-xi-jinping-nvidia.html",
    "summary": "Plus, goodbye to “milk chocolate”?"
  },
  {
    "title": "Andrew Cuomo, Scraping and Scrambling, Is Still Running as Andrew Cuomo",
    "link": "https://www.nytimes.com/2025/10/30/nyregion/andrew-cuomo-campaign.html",
    "summary": "The former governor, a distant second in most polls of the New York City mayor’s race, is working harder to attract voters and remind them who he is."
  },
  {
    "title": "Where Mamdani Found the Blueprints to Run for Mayor",
    "link": "https://www.nytimes.com/2025/10/30/nyregion/zohran-mamdani-howeowners.html",
    "summary": "Before Zohran Mamdani became a state legislator, he helped South Asian New Yorkers who were in danger of losing their homes because of tax liens and job losses."
  },
  {
    "title": "Bloomberg Gives $1.5 Million to Pro-Cuomo Super PAC",
    "link": "https://www.nytimes.com/2025/10/29/nyregion/bloomberg-cuomo-super-pac.html",
    "summary": "Michael R. Bloomberg, the former New York City mayor, had stayed out of the race since backing former Gov. Andrew M. Cuomo’s failed Democratic primary campaign."
  },
  {
    "title": "Centrist Party Ties Dutch Election as Far-Right Party Loses Seats",
    "link": "https://www.nytimes.com/2025/10/30/world/europe/dutch-elections-geert-wilders-rob-jetten.html",
    "summary": "The outcome was a major win for the political center and a big defeat for the far-right party of Geert Wilders, who faced a significant setback in an election he forced."
  },
  {
    "title": "Wilders’s Far-Right Party Faces Rebuke in the Netherlands",
    "link": "https://www.nytimes.com/2025/10/30/world/europe/netherlands-election-parliament-wilders.html",
    "summary": "Geert Wilders suffered a loss of support as a center-left party staged major gains, an election result that could offer lessons for Europe’s far right."
  },
  {
    "title": "Inside the Louvre Jewel Heist That Shocked the World",
    "link": "https://www.nytimes.com/2025/10/30/world/europe/inside-louvre-jewel-heist.html",
    "summary": "More than a week after thieves made off with treasures from the Louvre, a picture is emerging of a seemingly well-planned burglary that exploited security lapses at the museum and outpaced the police."
  },
  {
    "title": "French Police Arrest 5 More in Louvre Jewel Heist Investigation",
    "link": "https://www.nytimes.com/2025/10/30/world/europe/louvre-heist-arrests-paris.html",
    "summary": "The authorities have detained seven suspects in total, but have not recovered the stolen jewels."
  },
  {
    "title": "Trump’s Search for Eternity: Heaven? Maybe Not, He Says. Monuments? Absolutely.",
    "link": "https://www.nytimes.com/2025/10/30/us/politics/trump-heaven-legacy.html",
    "summary": "After a lifetime of scandal, the president expresses doubt that he will be admitted to paradise. But he appears increasingly intent on finding other paths to eternity."
  },
  {
    "title": "U.S. Military Kills Four More People Accused of Smuggling Drugs on Boats",
    "link": "https://www.nytimes.com/2025/10/29/us/politics/military-drug-boat-strikes.html",
    "summary": "Defense Secretary Pete Hegseth said the latest strike took place on Wednesday in the eastern Pacific. It came two days after the deadliest set of strikes in the weekslong campaign in Latin America."
  },
  {
    "title": "A Month Without Data Muddles the Economic Picture",
    "link": "https://www.nytimes.com/2025/10/30/business/a-month-without-data-muddles-the-economic-picture.html",
    "summary": "Tariffs and uncertainty were already making the economy hard to read. The loss of government data during the shutdown has made the situation much worse."
  },
  {
    "title": "Syria’s Rocky Transition Brings New Waves of Displacement",
    "link": "https://www.nytimes.com/2025/10/30/world/middleeast/syria-civil-war-displacement.html",
    "summary": "More than 400,000 Syrians have been displaced in the year since the civil war ended, according to the United Nations, driven by a mix of sectarian violence, acts of revenge and property disputes."
  },
  {
    "title": "Have Halloween Decorations Become Too Scary?",
    "link": "https://www.nytimes.com/2025/10/29/style/halloween-decorations-scary.html",
    "summary": "The skeletons are taller, the witches seem to be more lifelike and the blood and gore is more plentiful."
  },
  {
    "title": "Candy Companies Are Quietly Cutting Down on Cocoa to Save Money",
    "link": "https://www.nytimes.com/2025/10/30/climate/candy-chocolate-cocoa-prices-climate-change.html",
    "summary": "As climate change has helped push cocoa prices higher, companies are changing candy recipes in subtle ways."
  },
  {
    "title": "New York Survived Its 1975 Crisis. Will Trump Push It Back to the Brink?",
    "link": "https://www.nytimes.com/2025/10/30/nyregion/ford-nyc-financial-crisis-trump.html",
    "summary": "The Daily News headline “Ford to City: Drop Dead” stunned the city at a time of budgetary peril. New York’s finances are far stronger today, but antagonism from Washington poses a fresh risk."
  },
  {
    "title": "50 Years Ago, My Father Wrote the Headline ‘Ford to City: Drop Dead’",
    "link": "https://www.nytimes.com/2025/10/30/nyregion/william-brink-gerald-ford-headline.html",
    "summary": "It’s rare that a headline outlasts the person who wrote it. But long after my father’s death, “Ford to City: Drop Dead” still reverberates."
  },
  {
    "title": "Karine Jean-Pierre and a Book Tour Most Authors Would Not Dream Of",
    "link": "https://www.nytimes.com/2025/10/29/us/politics/karine-jean-pierre-book.html",
    "summary": "The Biden White House press secretary seems to be everywhere promoting her memoir, including an “absolute train wreck’’ of an interview with The New Yorker."
  },
  {
    "title": "From Gaza to New York’s Mayoral Race, Jewish Identity Splits Over Israel’s Future",
    "link": "https://www.nytimes.com/2025/10/30/style/israel-gaza-war-jewish-left-zionism.html",
    "summary": "After two years of war, political shifts and deep family divisions, new institutions are emerging."
  },
  {
    "title": "Harlem’s Remarkable New Studio Museum Redefines 125th Street",
    "link": "https://www.nytimes.com/2025/10/30/arts/design/studio-museum-harlem-adjaye.html",
    "summary": "After seven years and $160 million, the museum has an uplifting home on a street that has always been a barometer of Harlem’s fortunes and aspirations."
  },
  {
    "title": "There Are So Many Ways to Shut Down a Country",
    "link": "https://www.nytimes.com/2025/10/30/opinion/election-day-government-shutdown.html",
    "summary": "The moderate vs. progressive debate will not be solved on Tuesday."
  },
  {
    "title": "What Palantir Sees",
    "link": "https://www.nytimes.com/2025/10/30/opinion/palantir-shyam-sankar-military.html",
    "summary": "The tech company’s C.T.O. on surveillance, A.I. and the future of war."
  },
  {
    "title": "Trump and Xi Agree to a Yearlong Trade Truce",
    "link": "https://www.nytimes.com/2025/10/30/us/trump-and-xi-agree-to-a-yearlong-trade-truce.html",
    "summary": "The deal rolls back many tariffs and retaliatory measures."
  },
  {
    "title": "Late Night Shades South Korea for Giving Trump a Crown",
    "link": "https://www.nytimes.com/2025/10/30/arts/television/late-night-south-korea-trump-crown.html",
    "summary": "Desi Lydic called the president’s reception “a ‘yes, king’ rally for Trump.”"
  },
  {
    "title": "What New Jersey Could Reveal About the Future of the Hispanic Vote",
    "link": "https://www.nytimes.com/2025/10/30/us/politics/republicans-hispanics-new-jersey.html",
    "summary": "An off-year governor’s race will test the durability of the gains President Trump made in 2024, when the state’s majority-Hispanic townships all swung in his direction."
  },
  {
    "title": "Why the Price of Electricity Is Spiking Around the Country",
    "link": "https://www.nytimes.com/2025/10/30/climate/electricity-prices.html",
    "summary": "Not all states have gotten hit equally hard. The reasons are complex."
  },
  {
    "title": "California Animal Rights Activist Convicted in Chicken Theft",
    "link": "https://www.nytimes.com/2025/10/29/us/animal-rights-activist-convicted-sonoma-chickens.html",
    "summary": "Zoe Rosenberg, a California animal rights activist, was found guilty of conspiracy and trespassing for taking four chickens from a poultry plant."
  }
]