[
  {
    "title": "Ukraine, U.S. Will Meet About Trump’s Peace Plan to End War With Russia",
    "link": "https://www.nytimes.com/2025/11/23/world/europe/ukraine-switzerland-russia-peace-talks.html",
    "summary": "President Trump lashed out at Ukraine even as the talks on his peace proposal were still taking place, accusing the country’s leadership of being ungrateful for American support."
  },
  {
    "title": "Zelensky Is Under Pressure from Trump and Domestically",
    "link": "https://www.nytimes.com/2025/11/23/world/europe/ukraine-zelensky-war-russia.html",
    "summary": "Over nearly four years of wartime leadership, analysts say the Ukrainian leader has repeatedly played weak hands wisely. A U.S. peace plan may be his biggest test."
  },
  {
    "title": "Rubio Insists U.S. Authored the Ukraine Peace Plan",
    "link": "https://www.nytimes.com/2025/11/23/us/politics/rubio-us-author-ukraine-peace-plan.html",
    "summary": "The comment from Secretary of State Marco Rubio came after a group of U.S. lawmakers claimed that he said the plan was a Russian initiative, not an American proposal."
  },
  {
    "title": "Patel Under Scrutiny for Use of SWAT Teams to Protect His Girlfriend",
    "link": "https://www.nytimes.com/2025/11/23/us/politics/kash-patel-girlfriend-fbi-protection.html",
    "summary": "The F.B.I. director’s travel on government jets has contributed to growing questions inside the administration about whether he is using taxpayer-funded resources inappropriately."
  },
  {
    "title": "As Trump’s Inquisitors Face Scrutiny, a Divisive Figure Could Play a New Role",
    "link": "https://www.nytimes.com/2025/11/23/us/politics/trump-florida-cannon-grand-jury.html",
    "summary": "The prosecutor running an inquiry into those who investigated President Trump has established a grand jury under Judge Aileen M. Cannon, whose scuttling of the documents case made her a White House favorite."
  },
  {
    "title": "Mamdani’s Meeting With Trump Scrambled the MAGA-Sphere",
    "link": "https://www.nytimes.com/2025/11/23/style/mamdani-trump-reactions-fuentes-bannon.html",
    "summary": "Prominent conservative influencers had different interpretations as they processed the meeting on podcasts and in social media posts."
  },
  {
    "title": "Can the World Move On Without the U.S.? G20 Leaders Gave It a Shot.",
    "link": "https://www.nytimes.com/2025/11/23/world/africa/g20-united-states.html",
    "summary": "With the United States boycotting the summit, other nations sought to strike new deals, and some took a tougher tone with President Trump."
  },
  {
    "title": "Why Republicans Are Fighting About the Nazis",
    "link": "https://www.nytimes.com/2025/11/23/us/politics/republicans-antisemitism-carlson-fuentes-trump.html",
    "summary": "Tensions over right-wing antisemitism have burst to the forefront of Republican politics, and show signs of becoming a fierce point of contention in the midterms and beyond."
  },
  {
    "title": "F.B.I. Letters Send Shivers Through California’s Political Inner Circle",
    "link": "https://www.nytimes.com/2025/11/23/us/california-fbi-state-capitol-corruption.html",
    "summary": "The indictment of Gov. Gavin Newsom’s former chief of staff shocked many power players in California. Now, some wonder how far the investigation will spread."
  },
  {
    "title": "What OpenAI Did When ChatGPT Users Lost Touch With Reality",
    "link": "https://www.nytimes.com/2025/11/23/technology/openai-chatgpt-users-risks.html",
    "summary": "In tweaking its chatbot to appeal to more people, OpenAI made it riskier for some of them. Now the company has made its chatbot safer. Will that undermine its quest for growth?"
  },
  {
    "title": "Best Thanksgiving Dessert Recipes | Thanksgiving 2025 | NYT Cooking",
    "link": "https://cooking.nytimes.com/article/best-thanksgiving-desserts",
    "summary": "You’ll find the perfect recipe among these 27 holiday favorites. All the classics are here: pies, tarts, cakes and more just in time for the big celebration."
  },
  {
    "title": "One Undocumented Worker Used a Stolen Identity. Two Men Paid the Price.",
    "link": "https://www.nytimes.com/2025/11/23/us/undocumented-worker-stolen-identity-dan-kluver.html",
    "summary": "Thousands of undocumented workers rely on fraudulent Social Security numbers. One of them belonged to Dan Kluver."
  },
  {
    "title": "Denmark Offers Lessons as Europe Toughens Up on Immigration",
    "link": "https://www.nytimes.com/2025/11/23/world/europe/denmark-immigration-uk.html",
    "summary": "Like other European leaders, British Labour politicians are borrowing from Denmark’s restrictive asylum policy. One of its architects cautions that “balance” is necessary."
  },
  {
    "title": "How Parents Talk to Kids About Money, Privilege and Inequality",
    "link": "https://www.nytimes.com/2025/11/23/business/parents-kids-social-inequality.html",
    "summary": "Some parents turn to books or family movie nights to facilitate discussions. But they admit they don’t have all the answers."
  },
  {
    "title": "Tatiana Schlossberg, John F. Kennedy’s Granddaughter, Reveals Terminal Cancer Diagnosis",
    "link": "https://www.nytimes.com/2025/11/22/us/tatiana-schlossberg-kennedy-cancer.html",
    "summary": "Tatiana Schlossberg, a daughter of Caroline Kennedy, revealed a terminal cancer diagnosis in an essay published on the anniversary of her grandfather’s assassination."
  },
  {
    "title": "Why That Whitney Houston Drum Beat Is So Addictive, Yet Hard to Match",
    "link": "https://www.nytimes.com/2025/11/23/style/whitney-houston-drum-challenge.html",
    "summary": "People online have been trying to nail the drumbeat before the final chorus of “I Will Always Love You.” It’s harder than it looks."
  },
  {
    "title": "Trump Has Put the Military in an Impossible Situation",
    "link": "https://www.nytimes.com/2025/11/23/opinion/trump-illegal-war.html",
    "summary": "Who should take responsibility for the president’s undeclared war in the Caribbean?"
  },
  {
    "title": "How the Elite Behave When No One Is Watching: Inside the Epstein Emails",
    "link": "https://www.nytimes.com/2025/11/23/opinion/meaning-epstein-emails.html",
    "summary": "This power elite was already used to ignoring the powerless. Redeeming a disgraced sex offender was a logical next step."
  },
  {
    "title": "How a Sabotaged Ankle Monitor Ended Bolsonaro’s House Arrest",
    "link": "https://www.nytimes.com/2025/11/23/world/americas/jair-bolsonaro-ankle-monitor-brazil.html",
    "summary": "Shortly before he was expected to start serving a 27-year sentence, Brazil’s former president took a soldering iron to his tracking device."
  },
  {
    "title": "Israel Military Commanders Punished Over Hamas Attack Mistakes",
    "link": "https://www.nytimes.com/2025/11/23/world/middleeast/israel-punishes-commanders-hamas-attack.html",
    "summary": "About a dozen people were told they face dismissal or discipline for mistakes tied to the deadly Hamas-led attack that set off the war in Gaza."
  },
  {
    "title": "Donald Glover Says He Had a Stroke That Prompted Him to Cancel His Tour in 2024",
    "link": "https://www.nytimes.com/2025/11/23/arts/music/donald-glover-childish-gambino-stroke.html",
    "summary": "The rapper and actor, who performed in Los Angeles on Saturday, said doctors had also discovered a hole in his heart, prompting him to cancel his world tour."
  },
  {
    "title": "Former News Anchor Sentenced to 10 Years in Prison for Pandemic Fraud",
    "link": "https://www.nytimes.com/2025/11/23/us/phoenix-news-anchor-covid-fraud.html",
    "summary": "The former anchor, Stephanie Hockridge, who once worked for a Phoenix station, participated in an elaborate scheme that illegally obtained more than $63 million."
  }
]