[
  {
    "title": "Read the Texts Between Trump and Norway’s Prime Minister",
    "link": "https://www.nytimes.com/2026/01/19/us/politics/trump-norway-prime-minister-texts-greenland.html",
    "summary": "In the exchange on Sunday, Norway’s leader sought to “de-escalate” the growing conflict over Greenland and Mr. Trump’s latest tariff threat."
  },
  {
    "title": "Trump Has an Offramp on Greenland. He Doesn’t Seem to Want It.",
    "link": "https://www.nytimes.com/2026/01/19/us/politics/trump-greenland-nato.html",
    "summary": "The strategic importance of Greenland is growing, and NATO has underinvested in Arctic security. But President Trump, intent on ownership, is rebuffing deals with Europe to solve the problem."
  },
  {
    "title": "Survivors of Deadly Train Crash in Spain Describe Hellish Scenes",
    "link": "https://www.nytimes.com/2026/01/19/world/europe/spain-train-crash-survivors.html",
    "summary": "Photographs show a tangled mess of metal, wires and broken glass at the scene of the crash, which killed at least 39 people."
  },
  {
    "title": "What We Know About the Deadly High-Speed Train Crash in Spain",
    "link": "https://www.nytimes.com/2026/01/18/world/europe/what-we-know-spain-train-crash.html",
    "summary": "Sunday’s train crash in the southern region of Andalucía was the deadliest in Spain since at least 2013."
  },
  {
    "title": "Valentino Garavani, Regal Designer and Fashion’s ‘Last Emperor,’ Dies at 93",
    "link": "https://www.nytimes.com/2026/01/19/style/valentino-garavani-dead.html",
    "summary": "Valentino, as he was called, created one of the most durable and fashionable labels and became an equal of his high society customers."
  },
  {
    "title": "La Dolce Vita, the Valentino Way",
    "link": "https://www.nytimes.com/2025/06/12/style/valentino-book-grand-italian-epic.html",
    "summary": "Archival photographs, fashion layouts and anecdotes from celebrity clients: A new book is devoted to all things Valentino."
  },
  {
    "title": "Trump’s Trade Negotiator Says Response to Court Loss Would Be Immediate",
    "link": "https://www.nytimes.com/2026/01/19/us/politics/trump-tariffs-supreme-court-greer-trade.html",
    "summary": "If the Supreme Court rules against its tariffs, the Trump administration would begin replacing them immediately, said Jamieson Greer, the United States Trade Representative."
  },
  {
    "title": "‘An Unbelievable Mess’: Artists Are Stymied by Trump Travel Bans",
    "link": "https://www.nytimes.com/2026/01/19/arts/music/trump-visas-touring-musicians.html",
    "summary": "Musicians, theater groups and others from overseas are facing visa challenges and rising costs, posing a looming crisis for the performing arts sector."
  },
  {
    "title": "Search of Reporter’s Home Tests Law With Roots in a Campus Paper’s Suit",
    "link": "https://www.nytimes.com/2026/01/19/us/politics/washington-post-search-press-freedom.html",
    "summary": "The Stanford Daily lost a 1978 Supreme Court case over the search of its newsroom. But a bipartisan backlash prompted a federal law protecting journalists."
  },
  {
    "title": "Want to Eat Healthier? Listen to Your Hunger.",
    "link": "https://cooking.nytimes.com/article/to-tune-out-food-noise-our-critic-listened-to-his-hunger",
    "summary": "In the third part of a monthlong series, Pete Wells and experts say a healthier diet begins with understanding what drives your eating, and slowing down."
  },
  {
    "title": "Splits Emerge Among Venezuelans as Revolutionary Dream Fades",
    "link": "https://www.nytimes.com/2026/01/19/world/americas/venezuela-chavismo-us.html",
    "summary": "Supporters of former president Hugo Chávez, the anti-American socialist, are struggling to come to terms with their government’s pact with Washington."
  },
  {
    "title": "What to Know About Hezbollah’s Ties to Venezuela",
    "link": "https://www.nytimes.com/2026/01/19/world/americas/hezbollah-venezuela-ties.html",
    "summary": "U.S. authorities have accused Hezbollah of complicity in drug trafficking and money laundering schemes in Venezuela."
  },
  {
    "title": "Inside Minnesota Hospitals, ICE Agents Unnerve Staff",
    "link": "https://www.nytimes.com/2026/01/19/us/minnesota-hospitals-ice-agents.html",
    "summary": "As federal agents swarm the Twin Cities, their presence has also grown in medical centers. Health care workers are pushing back."
  },
  {
    "title": "Before Urban Raids, Border Patrol Tested Tactics in California Farm Country",
    "link": "https://www.nytimes.com/2026/01/19/us/border-patrol-tactics-rural-california.html",
    "summary": "Just before President Trump took office, Border Patrol agents led by Gregory Bovino arrested immigrants in Kern County using the same playbook later seen in places like Chicago and Minneapolis. Then a federal judge ordered them to stop."
  },
  {
    "title": "Prominent Catholic Clerics Denounce U.S. Foreign Policy",
    "link": "https://www.nytimes.com/2026/01/19/us/catholics-trump-archbishops.html",
    "summary": "Citing recent events in Venezuela, Ukraine and Greenland, three cardinals said their statement was inspired by Pope Leo."
  },
  {
    "title": "No Country Has Ever Been Held Responsible for Genocide. Can This Lawyer Change That?",
    "link": "https://www.nytimes.com/2026/01/19/magazine/genocide-trial-human-right-international-law.html",
    "summary": "Philippe Sands, one of the world’s pre-eminent human rights attorneys, is arguing the case against Myanmar at The Hague."
  },
  {
    "title": "A Look Through a Century of Times Reporting From Antarctica",
    "link": "https://www.nytimes.com/2026/01/19/climate/new-york-times-antarctica.html",
    "summary": "Generations of Times journalists have journeyed there with scientists. Their coverage traces humankind’s changing relationship with the most mysterious continent."
  },
  {
    "title": "Elon Musk Spends $10 Million to Help Nate Morris in Kentucky Senate Race",
    "link": "https://www.nytimes.com/2026/01/19/us/politics/elon-musk-nate-morris-kentucky-senate-mitch-mcconnell.html",
    "summary": "Elon Musk, the world’s richest person, backed Nate Morris, a Republican businessman, in the primary race to succeed Senator Mitch McConnell in Kentucky."
  },
  {
    "title": "In a State Notorious for Scandal, Corruption Fighters Are Targeted",
    "link": "https://www.nytimes.com/2026/01/19/nyregion/new-jersey-corruption-andy-kim-matt-platkin.html",
    "summary": "An anonymous negative ad campaign has been aimed at New Jersey’s departing attorney general. “It’s a warning to others,” one political scientist said."
  },
  {
    "title": "China’s Birthrate Plunges to Lowest Level Since 1949",
    "link": "https://www.nytimes.com/2026/01/18/business/china-population-data.html",
    "summary": "China’s population fell for a fourth straight year and its birthrate tumbled as policymakers failed to slow a demographic crisis."
  },
  {
    "title": "Real Estate Crash Weighs on China’s Economic Growth",
    "link": "https://www.nytimes.com/2026/01/18/business/china-gdp-economy.html",
    "summary": "Falling apartment prices have erased the savings of millions of Chinese households, but exports lifted the economy to 5 percent growth last year."
  },
  {
    "title": "Could Mamdani’s Child Care Plan Encourage a Baby Boomlet in New York?",
    "link": "https://www.nytimes.com/2026/01/19/nyregion/mamdani-free-child-care-plan-nyc.html",
    "summary": "Some New Yorkers hope that raising a child in the city could become more affordable thanks to Mayor Zohran Mamdani’s plans for free child care and preschool."
  },
  {
    "title": "‘Masquerade’ Reimagined ‘Phantom,’ and the Fans Are Flocking",
    "link": "https://www.nytimes.com/2026/01/19/theater/phantom-of-the-opera-masquerade.html",
    "summary": "An immersive adaptation of Andrew Lloyd Webber’s musical has seen some people return a dozen times since it began performances last summer."
  },
  {
    "title": "There’s a reason Trump Is Targeting Minneapolis",
    "link": "https://www.nytimes.com/2026/01/19/opinion/trump-minneapolis-ice.html",
    "summary": "Minneapolis stands in defiance to Trump’s dark vision of America."
  },
  {
    "title": "I’m the Secretary General of the Council of Europe. This Is Something I Thought I’d Never Have to Write.",
    "link": "https://www.nytimes.com/2026/01/19/opinion/greenland-trump-europe.html",
    "summary": "International law is either universal or meaningless. Greenland will show which one we choose."
  },
  {
    "title": "Has the U.S. Lost Measles Elimination Status?",
    "link": "https://www.nytimes.com/2026/01/19/well/year-anniversary-measles-outbreak-elimination-status.html",
    "summary": "It’s unclear whether the United States can keep its designation as a country that officially eliminated the disease."
  },
  {
    "title": "At the Center of Trump’s Vision for Rebuilding Ukraine: BlackRock",
    "link": "https://www.nytimes.com/2026/01/19/world/europe/ukraine-reconstruction-blackrock.html",
    "summary": "The world’s largest asset manager has been enlisted to help build Ukraine’s recovery plan. Some fear it is part of a Trump administration effort to steer the effort toward American business interests."
  },
  {
    "title": "The Rise of Prediction Markets",
    "link": "https://www.nytimes.com/2026/01/19/technology/polymarket-kalshi-prediction-markets.html",
    "summary": "Billions of dollars are trading hands on sites like Polymarket and Kalshi, where people bet on everything from Taylor Swift’s wedding date to election outcomes."
  },
  {
    "title": "Prominent Architecture Firm Is Accused of Illegally Ousting Employees",
    "link": "https://www.nytimes.com/2026/01/19/business/snohetta-nlrb-complaint.html",
    "summary": "A federal labor regulator says the firm, Snohetta, laid off eight employees in retaliation for trying to unionize."
  }
]