[
  {
    "title": "John Bolton Inquiry Eyes Emails Obtained by Foreign Government",
    "link": "https://www.nytimes.com/2025/08/27/us/politics/bolton-trump-emails-fbi-investigation.html",
    "summary": "It is not clear what country intercepted Mr. Bolton’s private emails, but the investigation into President Trump’s former national security adviser picked up momentum under the Biden administration."
  },
  {
    "title": "Trump and Advisers, Including Kushner, Meet on Gaza’s Future",
    "link": "https://www.nytimes.com/2025/08/27/us/politics/trump-gaza-israel-hamas-ceasefire.html",
    "summary": "The meeting focused on the postwar future of the Gaza Strip, where Mr. Trump has mused about removing Palestinian residents and setting up a luxury resort."
  },
  {
    "title": "Abrego Garcia Requests Asylum in the United States",
    "link": "https://www.nytimes.com/2025/08/27/us/politics/abrego-garcia-asylum.html",
    "summary": "The request is another possible path for the Salvadoran man, who has already been deported and returned by the Trump administration, to remain in the country."
  },
  {
    "title": "Minneapolis Suspect Knew Her Target, but Motive Is a Mystery",
    "link": "https://www.nytimes.com/2025/08/27/us/minneapolis-school-shooting-suspect-gunman.html",
    "summary": "The shooter who attacked a Catholic school on Wednesday posted social media videos and writings that betrayed a litany of grievances and obsessions."
  },
  {
    "title": "Nvidia Earnings Show Sales Jump Amid Strong Demand for A.I. Chips",
    "link": "https://www.nytimes.com/2025/08/27/technology/nvidia-earnings-ai-chips.html",
    "summary": "The chipmaker, now the most valuable public company in the world, said strong demand for its chips should continue this quarter."
  },
  {
    "title": "Trump’s Push to Fire Lisa Cook Puts Fed Independence on Trial",
    "link": "https://www.nytimes.com/2025/08/27/us/politics/supreme-court-fed-trump.html",
    "summary": "The Supreme Court has said the Federal Reserve Board’s independence warrants protection. President Trump’s effort to fire a member will test that commitment."
  },
  {
    "title": "Longest-Running Rafiki Says Goodbye to ‘The Lion King’",
    "link": "https://www.nytimes.com/2025/08/27/theater/tshidi-manye-lion-king-rafiki.html",
    "summary": "After more than 9,000 performances as the shaman in the Broadway show, Tshidi Manye prepares to hang up her mandrill costume."
  },
  {
    "title": "Trump, With Tariffs and Threats, Tries to Strong-Arm Nations to Retreat on Climate Goals",
    "link": "https://www.nytimes.com/2025/08/27/climate/trump-international-pressure-climate-oil.html",
    "summary": "The president has made no secret of his distaste for wind and solar in America. Now he’s taking his fossil fuel agenda overseas."
  },
  {
    "title": "A Casualty of Trump’s Tariffs: India’s Nascent Solar Industry",
    "link": "https://www.nytimes.com/2025/08/27/climate/india-solar-panels-tariff-exports.html",
    "summary": "The full weight of a 50 percent tariff on Indian goods took effect this week, undercutting one of the country’s most promising markets for solar exports."
  },
  {
    "title": "Trump’s D.C. Law Enforcement Takeover Has Black Parents on Edge",
    "link": "https://www.nytimes.com/2025/08/27/us/black-parents-washington-dc-crackdown-federal-law-enforcement.html",
    "summary": "The deployment of federal agents and National Guard troops has caused some Black parents to return to the days of “the talk” about policing that they had hoped was no longer needed to keep their children safe."
  },
  {
    "title": "After Threats, Mayors of Blue Cities Seek United Front Against Trump",
    "link": "https://www.nytimes.com/2025/08/27/us/politics/democrats-mayors-cities-trump-crime.html",
    "summary": "“An attack on one of us is an attack on all of us,” said Mayor Justin Bibb of Cleveland, who led a private strategy call on Wednesday."
  },
  {
    "title": "In Trump’s 2nd Term, More Incarcerations, Less Talk of Reform",
    "link": "https://www.nytimes.com/2025/08/27/us/politics/trump-criminal-justice.html",
    "summary": "The president is signaling a tough-on-crime message for the midterms next year."
  },
  {
    "title": "FDA Approves Updated Covid Vaccines With New Restrictions",
    "link": "https://www.nytimes.com/2025/08/27/health/fda-covid-vaccines-rfk-jr.html",
    "summary": "The agency’s fall recommendations underscore the goals of Health Secretary Robert F. Kennedy Jr. to limit access to the vaccines, which he has long opposed."
  },
  {
    "title": "What to Know About Covid Vaccines This Fall",
    "link": "https://www.nytimes.com/2025/08/27/well/covid-vaccines-guidelines-fall-2025.html",
    "summary": "The F.D.A. introduced new rules. Here’s what to know."
  },
  {
    "title": "Riley Gaines Finished 5th. Now She Believes Victory Is in Her Grasp.",
    "link": "https://www.nytimes.com/2025/08/27/us/riley-gaines-trans-athletes.html",
    "summary": "The former college swimmer has used her race against Lia Thomas, a trans athlete, to propel her career as an influential, and unsparing, activist."
  },
  {
    "title": "Why Ukraine Is Allowing More Young Men to Leave the Country",
    "link": "https://www.nytimes.com/2025/08/27/world/europe/young-ukrainians-18-22-leave.html",
    "summary": "For three years of war, the country has banned young men from leaving the country once they turn 18, prompting an exodus of teenage boys. Now it is raising that age limit to 23."
  },
  {
    "title": "With Fuzzy Racket Bag, Venus Williams Highlights ERL and Other American Labels",
    "link": "https://www.nytimes.com/2025/08/27/style/venus-williams-fuzzy-bag-erl.html",
    "summary": "In her return at the U.S. Open, Ms. Williams decided to highlight labels based in the United States. Her shearling racket bag was hard to miss."
  },
  {
    "title": "Travis Kelce and Taylor Swift Are Engaged. Kansas City Is Enchanted.",
    "link": "https://www.nytimes.com/2025/08/27/us/taylor-swift-travis-kelce-engaged-kansas-city.html",
    "summary": "Chiefs fans have been cheering on their star football player’s romance with the pop star for two years. They have the T-shirts, earrings and baked goods to prove it."
  },
  {
    "title": "Taylor Swift and Travis Kelce Got Engaged. So Did They.",
    "link": "https://www.nytimes.com/2025/08/27/us/taylor-swift-travis-kelce-engagement-couples.html",
    "summary": "Sure, one couple stole the spotlight on Tuesday. But other couples who also got engaged had their own news to share — though some were more thrilled by the frenzy than others."
  },
  {
    "title": "Trump Is Building His Own Paramilitary Force",
    "link": "https://www.nytimes.com/2025/08/27/opinion/ezra-klein-podcast-radley-balko.html",
    "summary": "The journalist Radley Balko explains the mechanisms Trump is using to create a personal army."
  },
  {
    "title": "The Rise of the Democratic National Security Mom",
    "link": "https://www.nytimes.com/2025/08/27/opinion/spanberger-sherrill-women-governor-virginia-new-jersey.html",
    "summary": "The Democratic Party is counting on a new type of leader to counteract Trump."
  },
  {
    "title": "Has Your Family Argued About Housing and Inheritance?",
    "link": "https://www.nytimes.com/2025/08/27/magazine/housing-inheritance-submissions.html",
    "summary": "We want to hear from you for a New York Times Magazine feature about how much of America’s family wealth is tied up in parents’ homes."
  },
  {
    "title": "Airbnb’s Joe Gebbia is Trump’s Chief Design Officer. Some Peers Are Skeptical.",
    "link": "https://www.nytimes.com/2025/08/27/style/joe-gebbia-trump-design-officer-airbnb.html",
    "summary": "Joe Gebbia wants to make government services more “satisfying.” Some peers in the design industry are skeptical."
  },
  {
    "title": "Southwest Monsoon Brings Dust Storms and Rain",
    "link": "https://www.nytimes.com/2025/08/27/weather/monsoon-dust-storm-arizona-burning-man.html",
    "summary": "The season for strong storms came late. This week, it has led to travel delays, a snarled start to Burning Man and a recharged waterfall in Yosemite."
  },
  {
    "title": "Pat Moore, a Model Turned Institution at P.J. Clarke’s, Dies at 89",
    "link": "https://www.nytimes.com/2025/08/27/dining/pat-moore-dead.html",
    "summary": "She went from fashion shoots to becoming a familiar server at that venerable Manhattan saloon for some 45 years. She dated two of her more famous customers, Tony Bennett and Frank Sinatra."
  },
  {
    "title": "New N.Y.C. Food Standards Could Spell Doom for Chicken Nuggets",
    "link": "https://www.nytimes.com/2025/08/27/nyregion/nyc-food-standards-chicken-nuggets.html",
    "summary": "The standards prohibit processed meat and limit the use of artificial sweeteners in meals served by nearly a dozen city agencies, including the Department of Education."
  }
]