[
  {
    "title": "Russia’s Far East Suffers Some Damage From Earthquake and Tsunami",
    "link": "https://www.nytimes.com/2025/07/30/world/asia/russia-far-east-earthquake.html",
    "summary": "Regional authorities in one region declared an emergency after a tsunami hit the Kuril Islands, and the Kamchatka Peninsula was watching for volcanic activity."
  },
  {
    "title": "Tsunami Warning Issued for Northern California",
    "link": "https://www.nytimes.com/2025/07/30/us/tsunami-warning-california.html",
    "summary": "Waves were reported along a wide swath of the Northern California coast, including in San Francisco. The rest of the state was under a lesser tsunami advisory."
  },
  {
    "title": "8.8-Magnitude Earthquake Off Russia Could Be One of the Largest on Record",
    "link": "https://www.nytimes.com/2025/07/29/world/asia/earthquake-russia-record.html",
    "summary": "It is the most powerful quake since the 2011 earthquake off the coast of Japan that triggered a 50-foot tsunami and the nuclear disaster at Fukushima."
  },
  {
    "title": "Tsunami Reaches U.S., and Trump’s Former Lawyer Confirmed as Judge",
    "link": "https://www.nytimes.com/2025/07/30/podcasts/the-headlines/tsunami-hawaii-trump-judge-bove.html",
    "summary": "Plus, how people are helping discover new species with their phones."
  },
  {
    "title": "How Conservative Christians Cracked the Johnson Amendment",
    "link": "https://www.nytimes.com/2025/07/30/us/johnson-amendment-church-free-speech.html",
    "summary": "The I.R.S. recently said that churches could endorse candidates from the pulpit, a shift from a longstanding interpretation of American nonprofit law."
  },
  {
    "title": "An Evening at the Office, and Four Lives Ended by Gunfire",
    "link": "https://www.nytimes.com/2025/07/30/nyregion/park-avenue-shooting-victims.html",
    "summary": "A police officer. A security guard. An executive. An associate. They were remembered for their “light,” for their passion and commitment."
  },
  {
    "title": "Midtown Manhattan Becomes America’s Stage for Acts of Violence",
    "link": "https://www.nytimes.com/2025/07/30/nyregion/midtown-manhattan-violence.html",
    "summary": "A small part of the nation’s largest city has drawn people bent on killing to draw attention to their causes. The man who shot four people at a Park Avenue office tower was the latest."
  },
  {
    "title": "Even New York’s Strict Gun Laws Couldn’t Prevent the Midtown Shooting",
    "link": "https://www.nytimes.com/2025/07/29/nyregion/new-york-gun-laws-shooting.html",
    "summary": "New York City has some of the toughest gun laws in the nation. But Monday’s mass shooting showed their limits, security experts said."
  },
  {
    "title": "The Familiar Suicide and Final Wish of the N.Y.C. Gunman",
    "link": "https://www.nytimes.com/2025/07/29/us/nfl-cte-suicides-violence.html",
    "summary": "Shane Tamura is not the first former football player to shoot himself in the chest and request that his brain be examined."
  },
  {
    "title": "Trump’s Tax Bill Expands Farm Subsidies. Not All Farmers Will Benefit.",
    "link": "https://www.nytimes.com/2025/07/30/us/trump-tax-policy-bill-farmers.html",
    "summary": "A $60 billion boost to farm subsidies will be a lifeline to some. But the way the funding will be distributed could worsen disparities between farms in an industry already struggling with consolidation."
  },
  {
    "title": "What to Watch at the Federal Reserve’s July Meeting",
    "link": "https://www.nytimes.com/2025/07/30/business/fed-meeting-july-what-to-watch.html",
    "summary": "The U.S. central bank is widely expected to hold interest rates steady for a fifth straight meeting despite badgering from President Trump to lower borrowing costs."
  },
  {
    "title": "Here Are the Best Rides at Universal’s New Epic Universe Theme Park in Orlando",
    "link": "https://www.nytimes.com/2025/07/30/travel/universal-epic-universe-orlando-rides.html",
    "summary": "A roller coaster aficionado tested all the rides at the new Universal theme park in Orlando and ranks them, from must-dos to mehs in a ride-by-ride guide."
  },
  {
    "title": "Senate, Rejecting Whistle-Blower Alarms, Confirms Bove to Appeals Court",
    "link": "https://www.nytimes.com/2025/07/29/us/politics/emil-bove-confirmed-appeals-judge.html",
    "summary": "The Trump loyalist was narrowly approved as Republicans brushed aside concerns about his conduct as a senior Justice Department official."
  },
  {
    "title": "Senate Democrats Try to Force Release of Epstein Files With Little-Known Law",
    "link": "https://www.nytimes.com/2025/07/30/us/politics/democrats-trump-epstein-files.html",
    "summary": "The move is part of an effort by Democrats to draw Senate Republicans into the debate over the release of the Epstein files, which has bitterly divided the House G.O.P. and wrought havoc in that chamber."
  },
  {
    "title": "Booker Accuses Democrats of Being ‘Complicit’ With Trump in Heated Exchange",
    "link": "https://www.nytimes.com/2025/07/29/us/politics/cory-booker-democrats-trump-senate.html",
    "summary": "When a pair of Democrats sought to win quick approval of a bipartisan package of policing legislation, a third rose to object, saying the party must take every opportunity to challenge President Trump."
  },
  {
    "title": "‘Anybody but Mamdani’: 5 Groups Emerge to Raise Millions in Attack Funds",
    "link": "https://www.nytimes.com/2025/07/30/nyregion/mamdani-opposition-donors-mayor.html",
    "summary": "Real estate titans and financiers are forming super PACs to try to defeat Zohran Mamdani. Some organizers say that they won’t succeed unless Mayor Eric Adams or former Gov. Andrew Cuomo drops out."
  },
  {
    "title": "Mayoral Candidates Navigate a Mass Shooting That Has Rattled New York",
    "link": "https://www.nytimes.com/2025/07/29/nyregion/mamdani-uganda-shooting-park-avenue.html",
    "summary": "Zohran Mamdani, the Democratic nominee for mayor, was in Uganda when the shooting took place, while the incumbent mayor, Eric Adams, sought to project an image of crisis manager."
  },
  {
    "title": "Ozzy Osbourne’s Coffin Will Be Taken Through His Hometown’s Streets Before Funeral",
    "link": "https://www.nytimes.com/2025/07/30/arts/music/ozzy-osbourne-funeral-procession-birmingham.html",
    "summary": "On Wednesday, a cortege took the singer’s coffin through the streets of his hometown, Birmingham, England."
  },
  {
    "title": "Brazil’s President Lula Voices Frustration With Trump Amid Tariff Battle",
    "link": "https://www.nytimes.com/2025/07/30/world/americas/brazil-president-lula-trump-tariffs.html",
    "summary": "Faced with threats of 50 percent tariffs and demands to end a criminal case, President Luiz Inácio Lula da Silva said he wouldn’t take orders from President Trump."
  },
  {
    "title": "In Conversation with Brazil’s President Lula",
    "link": "https://www.nytimes.com/video/world/americas/100000010309751/in-conversation-with-brazils-president-lula.html",
    "summary": "In an interview with Jack Nicas of The New York Times, President Luiz Inácio Lula da Silva rejected President Trump’s demands for Brazil. Here’s how the United States and Brazil reached this point."
  },
  {
    "title": "President Lula on His Feud With Trump, Brazil’s Tariff Strategy and More",
    "link": "https://www.nytimes.com/2025/07/30/world/americas/brazil-president-lula-trump-feud-tariffs.html",
    "summary": "President Luiz Inácio Lula da Silva issued a fierce rejection of President Trump’s demands for Brazil, but said he was ready for dialogue."
  },
  {
    "title": "How a Chinese Brand Reshaped Hong Kong’s Food Delivery Scene",
    "link": "https://www.nytimes.com/2025/07/30/business/meituan-keeta-deliveroo-hong-kong.html",
    "summary": "Meituan, the Chinese food delivery giant, tested its global expansion in Hong Kong, where its Keeta service displaced a rival before moving to other markets."
  },
  {
    "title": "Palm Beach Billionaires Battle for Oceanfront Land",
    "link": "https://www.nytimes.com/2025/07/30/style/palm-beach-billionaires-battle-for-oceanfront-land.html",
    "summary": "Before building the beachfront homes of their dreams, the superrich keep tearing down perfectly good mansions."
  },
  {
    "title": "They Saw Their Neighbors Taken Away by ICE. Then They Made a Plan.",
    "link": "https://www.nytimes.com/2025/07/30/opinion/ice-immigration-protest-resistance.html",
    "summary": "The movement against ICE in Los Angeles — one that is starting to take root across the country — demonstrates a shift from symbolic protest to direct action."
  },
  {
    "title": "This Is the Moment Democrats Have Been Talking About for Years",
    "link": "https://www.nytimes.com/2025/07/30/opinion/antonio-delgado-kathy-hochul-democrats.html",
    "summary": "This is the moment Democrats have been talking about for years."
  },
  {
    "title": "Football’s Brain Injuries",
    "link": "https://www.nytimes.com/2025/07/30/briefing/footballs-brain-injuries.html",
    "summary": "We explain what we know about the disease after the shooting in Manhattan."
  },
  {
    "title": "Colbert Mocks Presidential Memo About Religious Conversions at Work",
    "link": "https://www.nytimes.com/2025/07/30/arts/television/colbert-trump-memo-religion-workplace.html",
    "summary": "Despite the Trump administration’s support for proselytizing at the office, Stephen Colbert doesn’t think it’s a good idea."
  },
  {
    "title": "Thailand and Cambodia Stepped Back From War, but Their Temple Fight Remains",
    "link": "https://www.nytimes.com/2025/07/30/world/asia/thailand-cambodia-temples.html",
    "summary": "Intense nationalism and disputed history — and maps — stoke the neighbors’ hostilities. Even a surge of international diplomacy has brought little hope of a lasting peace."
  },
  {
    "title": "Federal Investigators Set to Begin Hearings on D.C. Plane Crash",
    "link": "https://www.nytimes.com/2025/07/30/us/politics/ntsb-hearings-dc-plane-crash.html",
    "summary": "The National Transportation Safety Board is also expected to release a trove of documents related to the fatal midair collision in January between an Army helicopter and a regional jet at Reagan National Airport."
  },
  {
    "title": "In Massachusetts, a Work Stoppage Forces Judges to Dismiss Criminal Cases",
    "link": "https://www.nytimes.com/2025/07/30/us/massachusetts-public-defender-lawyers-criminal-cases.html",
    "summary": "Seeking higher pay, lawyers for indigent defendants won’t take new clients. As a result, judges must dismiss cases against people accused of crimes who lack lawyers."
  },
  {
    "title": "NISAR, a NASA-India Collaboration,  Will Study Earth With Radar. Here’s How to Watch the Launch.",
    "link": "https://www.nytimes.com/2025/07/29/science/nisar-nasa-india.html",
    "summary": "A new Earth-observing satellite, built by NASA and India’s space agency, will be sent into orbit on Wednesday."
  }
]