[
  {
    "title": "Kennedy Center Board Moves to Rename It the Trump-Kennedy Center",
    "link": "https://www.nytimes.com/2025/12/18/us/politics/trump-kennedy-center-name.html",
    "summary": "The board for the John F. Kennedy Center for the Performing Arts announced that it would now be named the Trump-Kennedy Center, although a formal change may have to be approved by Congress."
  },
  {
    "title": "Once Again, Health Care Proves to Be a Bitter Political Pill for G.O.P.",
    "link": "https://www.nytimes.com/2025/12/18/us/politics/health-care-gop.html",
    "summary": "The inability to find a credible counter to the Affordable Care Act has long bedeviled Republicans and cost them at the polls. It’s threatening to do so again next year."
  },
  {
    "title": "Trump Moves to End Gender-Related Care for Minors, Threatening Hospitals That Offer It",
    "link": "https://www.nytimes.com/2025/12/18/health/trump-gender-affirming-care-funding.html",
    "summary": "Proposed new rules would punish the hospitals by pulling all federal financing. Advocates say lawsuits will follow."
  },
  {
    "title": "‘Don’s Best Friend’: How Epstein and Trump Bonded Over the Pursuit of Women",
    "link": "https://www.nytimes.com/2025/12/18/us/jeffrey-epstein-donald-trump.html",
    "summary": "The president has tried to minimize their friendship, but documents and interviews reveal an intense and complicated relationship. Chasing women was a game of ego and dominance. Female bodies were currency."
  },
  {
    "title": "The Junior Congressman Who’s Pushing Republicans on Epstein",
    "link": "https://www.nytimes.com/2025/12/18/us/politics/robert-garcia-epstein.html",
    "summary": "The top Democrat on the Oversight Committee, Representative Robert Garcia has brought aggressive tactics and reality-show flair to investigating Jeffrey Epstein’s ties to President Trump."
  },
  {
    "title": "Rob Reiner Family Tragedy Strikes a Nerve for Families Fighting Addiction",
    "link": "https://www.nytimes.com/2025/12/18/us/rob-reiner-family-murder-addiction.html",
    "summary": "Nick Reiner, charged with murdering his parents, Rob and Michele Singer Reiner, spent much of his life battling drug addiction, an affliction that millions of Americans face."
  },
  {
    "title": "After Rob Reiner’s ‘North’ Flopped, He Proved He Could Take Criticism With Humor",
    "link": "https://www.nytimes.com/2025/12/18/arts/rob-reiner-north-movie.html",
    "summary": "Roger Ebert said he “hated, hated, hated, hated, hated” Reiner’s 1994 film “North.” The director took it in stride."
  },
  {
    "title": "TikTok Signs Agreements With Investors in Step Toward Avoiding a U.S. Ban",
    "link": "https://www.nytimes.com/2025/12/18/business/media/tiktok-deal-agreements-us-investors.html",
    "summary": "The Chinese-owned video app formalized commitments from the software giant Oracle and two investment firms as part of a deal to keep TikTok operating in the United States."
  },
  {
    "title": "Trump Media to Merge With TAE Technologies, a Nuclear Fusion Firm, in a $6 Billion Deal",
    "link": "https://www.nytimes.com/2025/12/18/business/trump-media-tae-technologies-fusion-power-deal.html",
    "summary": "Trump Media & Technology Group, the social media and crypto company part owned by President Trump, said it would help develop a “utility-scale fusion power plant.”"
  },
  {
    "title": "The Woman in the Coldplay Concert Kiss Cam Video Is Ready to Talk",
    "link": "https://www.nytimes.com/2025/12/18/style/coldplay-concert-couple-kiss-cam-woman.html",
    "summary": "Kristin Cabot was caught on camera with her boss at a concert. The video went viral. Soon she was drowning in the vitriol of strangers."
  },
  {
    "title": "Mamdani Appointee Resigns After Decade-Old Antisemitic Posts Re-emerge",
    "link": "https://www.nytimes.com/2025/12/18/nyregion/mamdani-resigns-antisemitic-da-costa.html",
    "summary": "Catherine Almonte Da Costa resigned from her just-announced post as Mayor-elect Zohran Mamdani’s director of appointments after the Anti-Defamation League resurfaced the comments."
  },
  {
    "title": "N.Y.C. Subway Crime Is Down, Hochul Says, Rebutting Trump Officials",
    "link": "https://www.nytimes.com/2025/12/18/nyregion/nyc-subway-mta-safety-low-crime.html",
    "summary": "Gov. Kathy Hochul said the state would spend another $77 million on police patrols in the subway, acknowledging that felony assaults remain stubbornly high."
  },
  {
    "title": "They Thought They Had ‘Made It.’ Now They Can’t Afford Food.",
    "link": "https://www.nytimes.com/2025/12/18/nyregion/nyc-food-budgets.html",
    "summary": "New Yorkers in the so-called “missing middle,” who may make too much for food benefits, say it’s still hard to find enough money for groceries."
  },
  {
    "title": "James Cameron Tempers His Temper and Channels His Inner Na’vi",
    "link": "https://www.nytimes.com/2025/12/14/style/james-cameron-tempers-his-temper-and-channels-his-inner-navi.html",
    "summary": "Years after his Titanic tantrums, the “Avatar” director has “mellowed,” says Sigourney Weaver. He calls it “marinating.”"
  },
  {
    "title": "Confirm or Deny: James Cameron Edition",
    "link": "https://www.nytimes.com/2025/12/14/style/confirm-or-deny-james-cameron-edition.html",
    "summary": "The box office king sits for a lightning-round interview."
  },
  {
    "title": "‘Avatar: Fire and Ash’ Review: By Land, by Water, by Air!",
    "link": "https://www.nytimes.com/2025/12/18/movies/avatar-fire-and-ash-review.html",
    "summary": "For the franchise’s third movie, James Cameron throws in new creatures, new landscapes, melodramatic plot lines and big battle sequences. It’s a lot."
  },
  {
    "title": "The D.N.C. Is Scrapping Its Report on What Went Wrong in 2024",
    "link": "https://www.nytimes.com/2025/12/18/us/politics/dnc-2024-autopsy-democrats-ken-martin.html",
    "summary": "Ken Martin, the Democratic National Committee chairman, ordered the autopsy months ago but is now said to believe that its release would be counterproductive for the party."
  },
  {
    "title": "Trump Relies on Distortions to Support His Pressure Campaign on Venezuela",
    "link": "https://www.nytimes.com/2025/12/18/us/trump-venezuela-false-claims-misinformation.html",
    "summary": "The president has a long record of making false or misleading statements. But the sheer density of them in his administration’s boat attacks and Venezuela pressure campaign is exceptional."
  },
  {
    "title": "Palo Alto Confronts Billionaires Over Their Housing Compounds",
    "link": "https://www.nytimes.com/2025/12/18/us/palo-alto-billionaire-compound-law.html",
    "summary": "The Silicon Valley college town has changed drastically as Mark Zuckerberg, Larry Page and other tech founders have scooped up multiple properties."
  },
  {
    "title": "Cardinal Timothy Dolan Tapped the Power of the New York Pulpit",
    "link": "https://www.nytimes.com/2025/12/18/us/cardinal-timothy-dolan-archbishop-catholicism.html",
    "summary": "From St. Patrick’s Cathedral to the White House to Fox News, he comfortably inhabited many spheres of influence."
  },
  {
    "title": "Pope Leo Appoints Bishop Ronald Hicks to Succeed Timothy Dolan",
    "link": "https://www.nytimes.com/2025/12/18/us/bishop-ronald-hicks-cardinal-timothy-dolan-archbishop-new-york.html",
    "summary": "The appointment of Bishop Ronald A. Hicks is expected to bring a markedly different leadership style to New York’s archdiocese."
  },
  {
    "title": "James B. Hunt Jr., North Carolina Governor Who Kept State Blue, Dies at 88",
    "link": "https://www.nytimes.com/2025/12/18/us/politics/james-b-hunt-jr-dead.html",
    "summary": "During his 16 years in office, he earned national acclaim for his focus on education. But losing his bid for the Senate in 1984 cost him a shot at the presidency."
  },
  {
    "title": "Obama Supported It. The Left in Canada and Norway Do. Why Don’t Democrats?",
    "link": "https://www.nytimes.com/2025/12/18/opinion/democrats-liberals-oil-gas-industry.html",
    "summary": "Liberals should reconcile with America’s oil and gas industry."
  },
  {
    "title": "Justin Trudeau and Katy Perry Are Worth Rooting For",
    "link": "https://www.nytimes.com/2025/12/18/opinion/justin-trudeau-katy-perry-couple.html",
    "summary": "As a politician, Justin Trudeau was an excellent celebrity. And the rest of the world could learn a useful lesson from how he wielded his star power."
  },
  {
    "title": "The U.S. Moves to End Gender-Related Care for Minors",
    "link": "https://www.nytimes.com/2025/12/18/briefing/trump-gender-related-treatments-brown-shooting-investigation.html",
    "summary": "Also, authorities search for a person of interest in the Brown shooting. Here’s the latest at the end of Thursday."
  },
  {
    "title": "Zelensky Appeals to E.U. Leaders for Frozen Russian Funds to Fight War",
    "link": "https://www.nytimes.com/2025/12/18/world/europe/ukraine-zelensky-russia-putin.html",
    "summary": "President Volodymyr Zelensky said in Brussels, where the leaders had gathered, that without the money, his country would have to reduce its drone production significantly."
  },
  {
    "title": "Wyoming Cowboys Are Breaking Down Barriers, Literally",
    "link": "https://www.nytimes.com/2025/12/09/climate/wyoming-virtual-fences-livestock.html",
    "summary": "GPS collars on cattle are letting ranchers remove fences in the West. That’s good for wildlife and for the land."
  },
  {
    "title": "Marjorie Taylor Greene, Donald Trump Jr. and More Conservative Figures Announce Their Engagements",
    "link": "https://www.nytimes.com/2025/12/17/style/conservatives-engagements-marjorie-taylor-greene-trump-jr.html",
    "summary": "Several prominent conservative figures have announced that they are engaged this week, news often celebrated by President Trump."
  },
  {
    "title": "Jelly Roll Is Pardoned for Previous Robbery and Drug Convictions",
    "link": "https://www.nytimes.com/2025/12/18/arts/music/jelly-roll-pardon-tennessee.html",
    "summary": "The clemency decision by Gov. Bill Lee of Tennessee could make it easier for the country star to travel internationally."
  }
]