[
  {
    "title": "How a Top Secret SEAL Team 6 Mission Into North Korea Fell Apart",
    "link": "https://www.nytimes.com/2025/09/05/us/navy-seal-north-korea-trump-2019.html",
    "summary": "The 2019 operation, greenlit by President Trump, sought a strategic edge. It left unarmed North Koreans dead."
  },
  {
    "title": "A Failed Top Secret Mission in North Korea, and a Government Shutdown Deadline",
    "link": "https://www.nytimes.com/2025/09/05/podcasts/the-headlines/department-of-war-government-shutdown.html",
    "summary": "Plus, your Friday news quiz."
  },
  {
    "title": "Mounting Deportations Meet Slow Hiring in a ‘Curious Kind of Balance’",
    "link": "https://www.nytimes.com/2025/09/05/business/economy/jobs-immigration-deportations-hiring.html",
    "summary": "An influx of immigrants helped ease worker shortages, and now their expulsion is helping to mask the country’s weakening demand for labor."
  },
  {
    "title": "Is Jobs Data Still Reliable? Why Economists Say Yes.",
    "link": "https://www.nytimes.com/2025/09/05/business/jobs-data-reliability.html",
    "summary": "President Trump’s decision to fire the head of the Bureau of Labor Statistics has prompted questions about political interference."
  },
  {
    "title": "Trump to Sign Order Renaming the Defense Department as the Department of War",
    "link": "https://www.nytimes.com/2025/09/04/us/politics/trump-department-of-war-defense.html",
    "summary": "The president is turning back the clock to the name the agency held until shortly after World War II."
  },
  {
    "title": "Trump Will Rename the Defense Department the Department of War: What to Know",
    "link": "https://www.nytimes.com/article/trump-defense-department-war-rename.html",
    "summary": "The president has said the name “just sounded better” than Defense Department, a name that has been in use since 1949."
  },
  {
    "title": "Melania Trump Has a Warning for Humanity: ‘The Robots Are Here’",
    "link": "https://www.nytimes.com/2025/09/04/us/politics/melania-trump-robots-humanity.html",
    "summary": "The first lady has shown herself to be captivated by the wonders and dangers and opportunities of modern technologies."
  },
  {
    "title": "Elon Musk Could Become First Trillionaire Under New Tesla Pay Package",
    "link": "https://www.nytimes.com/2025/09/05/business/elon-musk-tesla-pay-trillionaire.html",
    "summary": "Tesla’s board unveiled a compensation package for the chief executive that could be worth $900 billion if he meets ambitious targets."
  },
  {
    "title": "The Doctors Are Real, but the Sales Pitches Are Frauds",
    "link": "https://www.nytimes.com/2025/09/05/technology/ai-doctor-scams.html",
    "summary": "Scammers are using A.I. tools to make it look as if medical professionals are promoting dubious health care products."
  },
  {
    "title": "AI Influencers Like Lil’ Miquela and Mia Zelu Are Redefining Fame",
    "link": "https://www.nytimes.com/2025/09/03/style/ai-influencers-lil-miquela-mia-zelu.html",
    "summary": "Influencers like Lil’ Miquela and Mia Zelu have millions of followers and generate serious income, despite being created with artificial intelligence."
  },
  {
    "title": "5 Takeaways From RFK Jr.’s Senate Hearing",
    "link": "https://www.nytimes.com/2025/09/04/health/rfk-jr-senate-hearing-takeaways.html",
    "summary": "During often tense exchanges, Health Secretary Robert F. Kennedy Jr. defended his positions on Covid vaccines, the Centers for Disease Control and Prevention and autism."
  },
  {
    "title": "Senators Unleash on R.F.K. Jr.",
    "link": "https://www.nytimes.com/2025/09/05/podcasts/the-daily/rfk-jr-senate-vaccine-policy.html",
    "summary": "Health Secretary Robert F. Kennedy Jr.  faced questions after a tumultuous few weeks."
  },
  {
    "title": "Hochul to Sign Order to Get Around U.S. Limits on Covid Vaccine",
    "link": "https://www.nytimes.com/2025/09/04/nyregion/covid-vaccine-hochul-new-york.html",
    "summary": "Gov. Kathy Hochul of New York plans to authorize pharmacists to provide the vaccine to almost anyone who wants it without a prescription."
  },
  {
    "title": "Why Hamas Refuses to Give Up Fighting",
    "link": "https://www.nytimes.com/2025/09/05/world/middleeast/gaza-hamas-surrender-israel.html",
    "summary": "Analysts say that despite its vast losses in Gaza, Hamas believes it can hold out for a deal that ensures its survival."
  },
  {
    "title": "Israel Now Controls Almost Half of Gaza City, Military Says",
    "link": "https://www.nytimes.com/2025/09/05/world/middleeast/gaza-city-takeover.html",
    "summary": "Hundreds of thousands of civilians are sheltering in the city as Israel’s planned takeover looms, with the potential to worsen the humanitarian crisis."
  },
  {
    "title": "With Trump and Ukraine, Europe’s Leaders Are Playing a Long Game",
    "link": "https://www.nytimes.com/2025/09/05/world/europe/europe-ukraine-trump-war-putin.html",
    "summary": "Leaders on the continent are trying to show the U.S. president that they are serious about laying the groundwork to end the war — and that President Vladimir V. Putin of Russia is not."
  },
  {
    "title": "Western Troops in Ukraine Before a Peace Deal Would Be ‘Targets’, Putin Says",
    "link": "https://www.nytimes.com/2025/09/05/world/europe/russia-ukraine-putin-western-troops.html",
    "summary": "The Russian leader made the threat a day after European leaders said they were willing to deploy forces on the ground to secure an agreement to end the war."
  },
  {
    "title": "Trump Administration to End Security Programs Protecting European Allies From Russia",
    "link": "https://www.nytimes.com/2025/09/04/us/politics/trump-europe-russia-security.html",
    "summary": "Ending the longstanding program is expected to impact hundreds of millions of dollars that have gone toward countries that border Russia."
  },
  {
    "title": "‘Something Is Wrong With My Brain’: A Police Officer’s Descent",
    "link": "https://www.nytimes.com/2025/09/05/us/cte-police.html",
    "summary": "Brent Simpson is the first police officer known to have C.T.E. He showed signs of the disease in the last few years of his life."
  },
  {
    "title": "Donors Push Mamdani to Maximum Fund-Raising Cap in Mayor’s Race",
    "link": "https://www.nytimes.com/2025/09/05/nyregion/mamdani-donations-mayor-money.html",
    "summary": "Zohran Mamdani’s campaign says it has hit the $8 million spending cap, a sign of the Democrat’s support especially among small-dollar donors in New York City."
  },
  {
    "title": "Adams Considers Dropping Out of Race After Secret Meeting in Florida",
    "link": "https://www.nytimes.com/2025/09/04/nyregion/adams-trump-job-quits.html",
    "summary": "Mayor Eric Adams of New York City has told confidants that he would consider abandoning his re-election bid. President Trump said he favored a “one on one” mayoral race."
  },
  {
    "title": "The Trump Administration Wants to Switch Off Climate Satellites",
    "link": "https://www.nytimes.com/2025/09/05/climate/trump-climate-satellites.html",
    "summary": "The Trump administration wants to switch off and possibly destroy the climate-monitoring technology."
  },
  {
    "title": "Carlo Acutis, a Saint for the Modern Age",
    "link": "https://www.nytimes.com/2025/09/05/world/europe/vatican-carlo-acutis-sainthood.html",
    "summary": "Nicknamed God’s influencer, Carlo, who died at age 15, used technology to express his religious beliefs. The church sees him as a way to connect to the young."
  },
  {
    "title": "The Luckiest Gas Station in America",
    "link": "https://www.nytimes.com/2025/09/05/us/lottery-tickets-california-gas-station.html",
    "summary": "A Syrian immigrant in Southern California beat the odds — twice — and now some Powerball players see an ineffable magic at work in his store."
  },
  {
    "title": "Trump’s Lonely Trade Crusade",
    "link": "https://www.nytimes.com/2025/09/05/opinion/trump-tariffs-international-reaction.html",
    "summary": "A sign of the folly of Trump’s trade policy is that it has inspired no apparent envy among other nations."
  },
  {
    "title": "Why I Am Not a Liberal",
    "link": "https://www.nytimes.com/2025/09/05/opinion/liberal-conservative-left-right-politics.html",
    "summary": "I don’t think the left grasps reality in all its fullness."
  },
  {
    "title": "A Nighttime Raid",
    "link": "https://www.nytimes.com/2025/09/05/briefing/a-nighttime-raid.html",
    "summary": "An investigation details a previously undisclosed U.S. operation to intercept the North Korean leader’s communications."
  },
  {
    "title": "Stephen Colbert Sounds the Alarm on ‘Death by Florida’",
    "link": "https://www.nytimes.com/2025/09/05/arts/television/stephen-colbert-florida-vaccines.html",
    "summary": "He said that Florida’s decision to stop vaccine mandates would affect not just schoolchildren but also “America’s most vulnerable population: Disney adults.”"
  },
  {
    "title": "Questions Focus on Cable in Lisbon Funicular Crash",
    "link": "https://www.nytimes.com/2025/09/05/world/europe/portugal-lisbon-funicular-crash.html",
    "summary": "Images of recovery efforts in the accident, which killed 16 people on Wednesday, appeared to show damage to a cable connecting the funicular’s two cars."
  },
  {
    "title": "Angela Rayner, UK Deputy Prime Minister, Resigns After Underpaying Tax",
    "link": "https://www.nytimes.com/2025/09/05/world/europe/angela-rayner-resigns-uk-starmer-tax.html",
    "summary": "In a blow to Prime Minister Keir Starmer, Ms. Rayner said she would step down after an independent ethics adviser’s investigation."
  },
  {
    "title": "Justice Amy Coney Barrett Argues Her Own Case, and the Court’s, in New Book",
    "link": "https://www.nytimes.com/2025/09/04/us/politics/justice-barrett-explaining-law.html",
    "summary": "In a new book, Justice Amy Coney Barrett asks for faith in the Supreme Court but reveals very little."
  },
  {
    "title": "French Winemaker Gets Prison for Selling Fake Champagne",
    "link": "https://www.nytimes.com/2025/09/05/world/europe/france-fake-champagne-sentence.html",
    "summary": "Didier Chopin, 56, was accused of passing off wine made with carbonated grapes from Spain and other regions in France as Champagne."
  }
]