[
  {
    "title": "Trump Fired America’s Economic Data Collector. History Shows the Perils.",
    "link": "https://www.nytimes.com/2025/08/03/business/trump-bls-firing-economic-reports.html",
    "summary": "Economists say unbiased data is essential for policymaking, and for democracy."
  },
  {
    "title": "Trump Fires Official Over Jobs Report, Echoing an Authoritarian Playbook",
    "link": "https://www.nytimes.com/2025/08/03/us/politics/trump-bls-jobs-facts.html",
    "summary": "In firing the head of the agency that collects employment statistics, the president underscored his tendency to suppress facts he doesn’t like and promote his own version of reality."
  },
  {
    "title": "Experts Raise Concerns Over Trump’s White House Ballroom Renovation Plans",
    "link": "https://www.nytimes.com/2025/08/03/us/politics/trump-white-house-ballroom-renovations-concerns.html",
    "summary": "President Trump plans to build a $200 million ballroom off the East Wing “long before” the end of his term in 2029."
  },
  {
    "title": "Trump’s Tariffs Are Making Money. That May Make Them Hard to Quit.",
    "link": "https://www.nytimes.com/2025/08/03/business/trump-tariffs-how-much-money-debt.html",
    "summary": "The tariffs are a substantial new source of revenue for the federal government. The budget may start to depend on it."
  },
  {
    "title": "OPEC Plus Will Increase Oil Output",
    "link": "https://www.nytimes.com/2025/08/03/business/opec-plus-oil-output.html",
    "summary": "Eight producers, led by Saudi Arabia, will continue boosting production despite forecasts that supply will soon exceed demand."
  },
  {
    "title": "U.S. and Israeli Officials Float Idea of ‘All or Nothing’ Gaza Deal",
    "link": "https://www.nytimes.com/2025/08/03/world/middleeast/israel-gaza-hamas-ceasefire.html",
    "summary": "The apparent shift in tone comes as cease-fire negotiations have hit a wall and pressure is mounting on Israel over the hunger crisis in Gaza. But Israel and Hamas remain far apart on the terms of any deal."
  },
  {
    "title": "Sykes-Picot, the 109-Year-Old Pact That Looms Over French and British Moves to Recognize a Palestinian State",
    "link": "https://www.nytimes.com/2025/08/03/world/middleeast/britan-france-palestine-sykes-picot-agreement.html",
    "summary": "The Sykes-Picot Agreement was a secret treaty Britain and France signed more than a century ago. Many consider it to have seeded a legacy of strife in the Middle East."
  },
  {
    "title": "How Trump Is Transforming the U.S. Government’s Environmental Role",
    "link": "https://www.nytimes.com/2025/08/03/climate/trump-epa-endangerment-finding-climate-change.html",
    "summary": "The E.P.A. said this week it would revoke its own ability to fight climate change. It’s the latest move in an extraordinary pivot away from science-based protections."
  },
  {
    "title": "Trump Will Slow, but May Not Stop, the Rise of Electric Vehicles",
    "link": "https://www.nytimes.com/2025/08/03/business/trump-electric-vehicles.html",
    "summary": "President Trump and Republicans in Congress are eliminating federal incentives to buy electric vehicles, but carmakers need to keep selling and investing in them."
  },
  {
    "title": "A Former American Soldier Finds a Home in Mexican Wrestling",
    "link": "https://www.nytimes.com/2025/08/03/world/americas/mexico-lucha-libre-flip-gordon.html",
    "summary": "Flip Gordon was uneasy about being a lucha libre wrestler dressed in a U.S. military uniform. Booed at first, he is now a fan favorite."
  },
  {
    "title": "A Cancer Patient Chose Assisted Death. That Wasn’t the Last Hard Choice.",
    "link": "https://www.nytimes.com/2025/08/03/health/maid-medical-assistance-dying-colombia.html",
    "summary": "Tatiana Andia knew Colombia would permit her a medically assisted death. She took her country with her on the journey to dying."
  },
  {
    "title": "Billionaire Behind Miami Immigration and Deportation Ads Steps Forward",
    "link": "https://www.nytimes.com/2025/08/03/us/immigration-ads-florida-michael-b-fernandez.html",
    "summary": "“Deporting immigrants is cruel,” some of the ads against Cuban Americans in Congress read. Michael B. Fernández wanted to “wake up” Miami’s conscience."
  },
  {
    "title": "A City in Kansas Is Suing Over a Planned ICE Detention Center",
    "link": "https://www.nytimes.com/2025/08/03/us/leavenworth-kansas-prison-immigration-detention-ice-trump.html",
    "summary": "Leavenworth, Kan., was forged by the corrections industry, but residents are divided over plans for a privately operated immigration detention site in town."
  },
  {
    "title": "Victims Named in Montana Bar Shooting as Manhunt Stretches On",
    "link": "https://www.nytimes.com/2025/08/03/us/montana-owl-bar-shooting-victims-manhunt.html",
    "summary": "Those killed on Friday were a bartender and three patrons, ranging in age from 59 to 74, the authorities said. The suspect fled into the nearby foothills."
  },
  {
    "title": "What We Know About the Montana Bar Shooting",
    "link": "https://www.nytimes.com/2025/08/03/us/montana-search-anaconda-bar-shooting.html",
    "summary": "Four people were killed in the attack inside the Owl Bar in Anaconda, Mont. The authorities are still searching for the suspect, an Army veteran who lived nearby."
  },
  {
    "title": "How Campus Reform, a Tiny Conservative News Outlet, Pioneered the Attack on Colleges",
    "link": "https://www.nytimes.com/2025/08/03/us/campus-reform-college-protests-antisemitism-zachary-marschall.html",
    "summary": "Campus Reform was founded years ago to expose what it calls leftist bias on college campuses. The online site’s cause has gone from fringe to mainstream."
  },
  {
    "title": "When Bloodshed and Chaos Arrived at 345 Park Avenue",
    "link": "https://www.nytimes.com/2025/08/03/nyregion/park-avenue-shooting-manhattan.html",
    "summary": "On a steamy Monday evening, no one inside the Manhattan office building noticed the dark BMW pull up outside. The driver entered the lobby with a rifle in his hand."
  },
  {
    "title": "Curtis Sliwa Wants to Be Mayor. He’s Taking Off His Beret to Prove It.",
    "link": "https://www.nytimes.com/2025/08/03/nyregion/sliwa-beret-mayor-republican.html",
    "summary": "The Guardian Angels founder and Republican nominee for mayor has long been a New York curiosity. Can he become a serious contender?"
  },
  {
    "title": "America’s Airport Lounges Are Crowded and Crummy",
    "link": "https://www.nytimes.com/2025/08/03/opinion/airport-lounge-travel-credit-card.html",
    "summary": "Airport lounges have never been more popular — and not worth the hassle."
  },
  {
    "title": "Influencer Missionaries",
    "link": "https://www.nytimes.com/2025/08/03/briefing/christian-influencers.html",
    "summary": "Christianity has a branding problem — but influencers are helping, one vertical video at a time."
  },
  {
    "title": "No Passports, No Study Abroad: China Limits Public Employees’ Travel",
    "link": "https://www.nytimes.com/2025/08/03/world/asia/china-passports-civil-servants.html",
    "summary": "Even low-level government employees like elementary school teachers and nurses have been ordered to hand in their passports, to enforce “discipline.”"
  },
  {
    "title": "Long-Dormant Russian Volcano Erupts for the First Time in Centuries",
    "link": "https://www.nytimes.com/2025/08/03/world/europe/russia-volcano-eruption.html",
    "summary": "The eruption of the Krasheninnikov volcano on Sunday in Russia’s Far East came after a series of seismic events this past week on the Kamchatka peninsula."
  },
  {
    "title": "Putin Widens Effort to Control Russia’s Internet",
    "link": "https://www.nytimes.com/2025/08/03/world/europe/russia-putin-internet.html",
    "summary": "The introduction of a state-approved messaging app has raised fears that Russia could be preparing to block WhatsApp and Telegram."
  },
  {
    "title": "In Battle for House, Democrats Are Calling Up Military Recruits",
    "link": "https://www.nytimes.com/2025/08/03/us/politics/democrats-house-midterms-veterans.html",
    "summary": "Aware of its deeply unpopular national brand, the Democratic Party is turning to an unusually large crop of veterans to help it retake the House next year."
  }
]