[
  {
    "title": "How Jared Kushner, a Self-Described ‘Deal Guy,’ Helped Broker a Gaza Breakthrough",
    "link": "https://www.nytimes.com/2025/10/09/us/politics/jared-kushner-gaza-deal.html",
    "summary": "Trained in New York City real estate, the president’s son-in-law had a single goal: Get to a yes first, and hash out the details later. “It’s just different being deal guys — just a different sport,” he said."
  },
  {
    "title": "Who Are the Hostages Believed Alive in Gaza?",
    "link": "https://www.nytimes.com/2025/10/09/world/middleeast/hostages-profiles.html",
    "summary": "Israel says 20 living hostages are held by Hamas, set for release in a prisoner exchange together with the remains of those who died. Here’s what we know about them."
  },
  {
    "title": "Trump Has His Eyes on a Nobel Peace Prize. Will He Get It?",
    "link": "https://www.nytimes.com/2025/10/09/us/politics/trump-nobel-peace-prize.html",
    "summary": "President Trump has coveted the prize for years. The winner will be unveiled 48 hours after President Trump announced a breakthrough in the Israel-Hamas war."
  },
  {
    "title": "Big Investors Await Windfall From Trump’s Argentina Bailout",
    "link": "https://www.nytimes.com/2025/10/09/us/politics/argentina-bailout-investors.html",
    "summary": "The United States finalized a $20 billion lifeline for Argentina that will benefit Treasury Secretary Scott Bessent’s allies."
  },
  {
    "title": "Trump Baselessly Claims He ‘Took the Freedom of Speech Away’ From Flag Burners",
    "link": "https://www.nytimes.com/2025/10/09/us/politics/trump-freedom-of-speech-flag-burning.html",
    "summary": "The president said he had made flag burning a crime punishable by a year in prison. But such a claim contradicts both Supreme Court precedent and the text of an executive order he signed."
  },
  {
    "title": "Democratic Alarm Over an Unbound Trump Fuels Shutdown Standoff",
    "link": "https://www.nytimes.com/2025/10/09/us/politics/democrats-shutdown-trump-administration.html",
    "summary": "The threat of rising Obamacare premiums has been Democrats’ main focus in the public debate, but the president’s defiance of laws, norms and congressional constraints has helped hold them together in opposition."
  },
  {
    "title": "Government Shutdown Scrambles Some Home Sales in Flood Zones",
    "link": "https://www.nytimes.com/2025/10/09/realestate/flood-insurance-government-shutdown.html",
    "summary": "When the government shut down, so did the federal flood insurance program, forcing some buyers into the costly private market."
  },
  {
    "title": "Who Can Afford Three Kids in New York City?",
    "link": "https://www.nytimes.com/2025/10/09/nyregion/who-can-afford-three-kids-in-new-york-city.html",
    "summary": "The number of city households with three or more children has dropped by nearly 17 percent over the past decade as families struggle with the cost of child care and rent."
  },
  {
    "title": "New York City: Where Street Parking Is Free, but Comes at a Cost",
    "link": "https://www.nytimes.com/2025/10/09/nyregion/new-york-city-parking-alternate-side.html",
    "summary": "After a TikTok video of a woman charging to “car sit” gained attention, New Yorkers were reminded that the price of street parking is rarely paid at a meter."
  },
  {
    "title": "Mamdani Maintains 13-Point Lead as Cuomo Gains Ground After Adams’s Exit",
    "link": "https://www.nytimes.com/2025/10/09/nyregion/mayor-poll-nyc-quinnipiac.html",
    "summary": "While former Gov. Andrew M. Cuomo benefited from Mayor Eric Adams’s departure, Zohran Mamdani still enjoyed a sizable lead in the Quinnipiac University poll."
  },
  {
    "title": "A Mystery C.E.O. and Billions in Sales: Is China Buying Banned Nvidia Chips?",
    "link": "https://www.nytimes.com/2025/10/09/technology/nvidia-chips-china-megaspeed.html",
    "summary": "An executive of a Singaporean firm called Megaspeed socialized with Nvidia’s Jensen Huang. Now the company is being scrutinized by U.S. officials for its ties to China."
  },
  {
    "title": "Intel’s Big Bet: Inside the Chipmaker’s Make-or-Break Factory",
    "link": "https://www.nytimes.com/2025/10/09/technology/intel-chip-factory-fab52.html",
    "summary": "The centerpiece of the company’s comeback hopes is a multibillion-dollar facility in the Arizona desert. Will it draw new customers?"
  },
  {
    "title": "Thomas Pynchon Saw Where We Were Headed. How Does “Shadow Ticket” Hold Up?",
    "link": "https://www.nytimes.com/2025/10/09/magazine/thomas-pynchon-shadow-ticket.html",
    "summary": "The novelist anticipated our bizarre present. How does his latest book hold up in an age of eroding reality?"
  },
  {
    "title": "Nobel Prizes This Year Offer Three Cheers for Slow Science",
    "link": "https://www.nytimes.com/2025/10/09/science/nobel-prizes-science-basic-research.html",
    "summary": "The scientific Nobels announced this week — in Physiology or Medicine, Physics and Chemistry — honored achievements rooted in fundamental research from decades ago."
  },
  {
    "title": "Laszlo Krasznahorkai Is Awarded Nobel Prize in Literature",
    "link": "https://www.nytimes.com/2025/10/09/books/laszlo-krasznahorkai-nobel-prize-in-literature.html",
    "summary": "​The prize committee said the Hungarian writer’s work “reaffirms the power of art.”"
  },
  {
    "title": "Modi Rosenfeld Is Gay. He’s Religious. His Comedy Career Is Booming.",
    "link": "https://www.nytimes.com/2025/10/09/style/gay-jewish-comedian-modi-rosenfeld.html",
    "summary": "Mordechi Rosenfeld, known as Modi, already has the synagogue crowd. Now he wants the “Goyim, gays and theys,” too."
  },
  {
    "title": "Why Arguments About Free Speech Don’t Apply to the Riyadh Comedy Festival",
    "link": "https://www.nytimes.com/2025/10/09/arts/television/riyadh-comedy-festival-free-speech.html",
    "summary": "Bill Burr, Dave Chappelle and others have framed their participation as a matter of open expression. Yet they’re maddeningly vague about how much dissent is possible in Saudi Arabia."
  },
  {
    "title": "Katie Porter Goes Viral for ‘Unhappy’ TV Interview in California Governor’s Race",
    "link": "https://www.nytimes.com/2025/10/08/us/katie-porter-interview-ca-governors-race.html",
    "summary": "The former Democratic congresswoman, known for her own grilling of executives on Capitol Hill, threatened to abandon an interview after she was asked several follow-up questions."
  },
  {
    "title": "In N.J. Governor’s Race, Energy Costs Have Become a Central Issue",
    "link": "https://www.nytimes.com/2025/10/09/business/new-jersey-electricity-prices-governor-election.html",
    "summary": "Energy costs have become a central issue in the governor’s race between Jack Ciattarelli, the Republican, and Representative Mikie Sherrill, the Democrat."
  },
  {
    "title": "Why Many Students in Thailand Can’t Let Their Hair Down",
    "link": "https://www.nytimes.com/2025/10/09/world/asia/thailand-school-students-haircuts.html",
    "summary": "For decades, Thai students have been subjected to unwanted haircuts in class. Many of them carry the humiliating memory into adulthood."
  },
  {
    "title": "Democrats Are Increasing Inequality",
    "link": "https://www.nytimes.com/2025/10/09/opinion/democrats-education-failure.html",
    "summary": "When it comes to education policy, Republicans are now kicking Democrats in the butt."
  },
  {
    "title": "These Are the 10 Old Television Series Every Kid Needs to Watch",
    "link": "https://www.nytimes.com/2025/10/09/opinion/television-series-parenting-kids-old.html",
    "summary": "Here’s the list of ancient shows I inflict on my daughters. What’s yours?"
  },
  {
    "title": "The Gaza Cease-Fire Is Beginning to Take Shape",
    "link": "https://www.nytimes.com/2025/10/09/briefing/gaza-deal-letitia-james-charges.html",
    "summary": "Also, New York’s attorney general was indicted. Here’s the latest at the end of Thursday."
  },
  {
    "title": "Who is Jonathan Rinderknecht? What We Know About The Palisades Fire Arrest",
    "link": "https://www.nytimes.com/2025/10/08/us/palisades-fire-arrest-jonathan-rinderknecht.html",
    "summary": "More details are emerging about Jonathan Rinderknecht, 29, who was accused of starting a small blaze in January that later rekindled and grew into the fire that devastated Pacific Palisades."
  },
  {
    "title": "Ruth Weiss, Who Chronicled Apartheid After Fleeing the Nazis, Dies at 101",
    "link": "https://www.nytimes.com/2025/10/09/books/ruth-weiss-dead.html",
    "summary": "Her life and work were shaped by confronting injustice in South Africa and Germany. “Blacks under apartheid — Jews under the swastika. Was it all that different?” she asked."
  },
  {
    "title": "Judge Dismisses Drake’s Lawsuit Over Kendrick Lamar’s ‘Not Like Us’",
    "link": "https://www.nytimes.com/2025/10/09/arts/music/drake-kendrick-lamar-not-like-us-lawsuit-dismissed.html",
    "summary": "The Canadian rapper sued for defamation and harassment, and accused the record company behind both artists of boosting his rival."
  },
  {
    "title": "Crypto Investor Known as ‘Bitcoin Jesus’ Reaches Deal With Prosecutors",
    "link": "https://www.nytimes.com/2025/10/09/technology/roger-ver-bitcoin-justice-department-deal.html",
    "summary": "In the Trump administration’s latest example of dialing back cryptocurrency enforcement, Roger Ver agreed to pay about $48 million to end a tax fraud case."
  }
]