[
  {
    "title": "Trump Says U.S. Oversight of Venezuela Could Last for Years",
    "link": "https://www.nytimes.com/2026/01/08/us/politics/trump-interview-venezuela.html",
    "summary": "In a wide-ranging interview with The New York Times on Wednesday, President Trump said “only time will tell” when it comes to how long the United States aims to control the country."
  },
  {
    "title": "An Oval Office Viewing",
    "link": "https://www.nytimes.com/2026/01/08/briefing/an-oval-office-viewing.html",
    "summary": "During an interview with our reporters, President Trump discussed a video of an ICE agent fatally shooting a woman in Minneapolis."
  },
  {
    "title": "Venezuela Announces the Release of Political Prisoners",
    "link": "https://www.nytimes.com/2026/01/08/world/americas/venezuela-release-political-prisoners.html",
    "summary": "The release, which was expected to happen later on Thursday, offers the first gesture of conciliation under an interim government, even as arrests and crackdowns continue."
  },
  {
    "title": "Colombia’s President Feared a U.S. Attack. Then Trump Called.",
    "link": "https://www.nytimes.com/2026/01/08/world/americas/colombia-petro-trump-venezuela.html",
    "summary": "The conversation appeared to defuse a crisis that erupted after President Trump said military action against Colombia “sounds good.” President Gustavo Petro spoke to The New York Times just before the call."
  },
  {
    "title": "Rubio Says He’ll Discuss Greenland With Danish Officials Next Week",
    "link": "https://www.nytimes.com/2026/01/08/world/americas/us-greenland-trump-denmark-rubio-meeting.html",
    "summary": "Secretary of State Marco Rubio told reporters he would speak with the officials after days of mounting threats from the Trump administration to take Greenland, a semiautonomous Danish territory."
  },
  {
    "title": "Minn. Officials Say They’re Being Blocked From Investigating Fatal ICE Shooting",
    "link": "https://www.nytimes.com/2026/01/08/us/minnesota-ice-shooting-news.html",
    "summary": "Federal officers fired tear gas to disperse early-morning protesters as outrage mounted in Minneapolis over the killing of a 37-year-old woman in her vehicle."
  },
  {
    "title": "Trump Administration Deploying More Border Patrol Agents to Minnesota",
    "link": "https://www.nytimes.com/2026/01/08/us/politics/border-patrol-minnesota-trump.html",
    "summary": "More than 100 agents will be redirected from other cities after the fatal shooting of a woman in Minneapolis by an ICE officer."
  },
  {
    "title": "We Pressed Trump on His Conclusion About the ICE Shooting in Minneapolis. Here’s What He Said.",
    "link": "https://www.nytimes.com/2026/01/08/us/politics/trump-minnesota-ice-shooting-video.html",
    "summary": "The exchange was a glimpse into the president’s reflexive defense of his federal crackdown on immigration."
  },
  {
    "title": "Minnesota’s Dispute With Trump Administration Boils Over After ICE Shooting",
    "link": "https://www.nytimes.com/2026/01/07/us/minnesota-shooting-trump-walz-frey.html",
    "summary": "The contradicting accounts of the ICE shooting in Minneapolis from the federal government and officials in Minnesota were the latest episode in a dispute that has been building for weeks."
  },
  {
    "title": "U.S. Trade Deficit Fell to Lowest Level Since 2009 as Tariffs Reshape Trade",
    "link": "https://www.nytimes.com/2026/01/08/business/economy/us-trade-deficit-tariffs.html",
    "summary": "The monthly trade deficit continued to shrink in October after President Trump imposed sweeping tariffs on imports, the latest data showed."
  },
  {
    "title": "The Smithsonian Faces New Pressure to Submit to Trump’s Will",
    "link": "https://www.nytimes.com/2026/01/08/arts/design/smithsonian-trump-pressure.html",
    "summary": "The institution, long regarded as independent, is facing a White House deadline to hand over records about its content and will see turnover that could reshape its governing board."
  },
  {
    "title": "Prosecutors Said to Pursue New Investigation of Letitia James",
    "link": "https://www.nytimes.com/2026/01/08/us/politics/letitia-james-trump-justice-department.html",
    "summary": "The New York attorney general’s longtime hairdresser has come under scrutiny as the Justice Department’s efforts to charge Ms. James on other fronts falter."
  },
  {
    "title": "Judge Bars U.S. Attorney in Albany From Inquiry Into Letitia James",
    "link": "https://www.nytimes.com/2026/01/08/nyregion/albany-us-attorney-letitia-james.html",
    "summary": "Ms. James, New York’s attorney general, had been seeking to block a Justice Department investigation into her office by challenging the legitimacy of the U.S. attorney, John A. Sarcone III."
  },
  {
    "title": "Gov. Gavin Newsom to Criticize Trump in State of the State Address",
    "link": "https://www.nytimes.com/2026/01/08/us/newsom-california-state-of-the-state-speech.html",
    "summary": "Gov. Gavin Newsom will portray his state as “a beacon” of democracy in a State of the State address that suggests national ambitions."
  },
  {
    "title": "Josh Shapiro Begins a Re-election Bid That Carries Implications for 2028",
    "link": "https://www.nytimes.com/2026/01/08/us/politics/josh-shapiro-pennsylvania-governor-2028.html",
    "summary": "The Pennsylvania governor starts out as a clear favorite, but Republicans are trying to make him sweat."
  },
  {
    "title": "Dav Pilkey, the Man Behind ‘Dog Man,’ Aims to Please",
    "link": "https://www.nytimes.com/2026/01/08/books/review/dog-man-captain-underpants-dav-pilkey.html",
    "summary": "“I’m writing for the kid I used to be,” says Dav Pilkey, who defied expectations to create three blockbuster graphic-novel series."
  },
  {
    "title": "Brown Shooting Suspect’s Descent from Brilliant Friend to Angry Loner",
    "link": "https://www.nytimes.com/2026/01/08/us/brown-shooting-suspect-claudio-valente-portugal.html",
    "summary": "After Claudio Neves Valente was accused of killing two Brown students and a M.I.T. professor, former classmates recalled how he yearned to go to M.I.T. himself and failed, adding to his growing list of resentments."
  },
  {
    "title": "How One Death Underscores the Suicide Risk for Construction Workers",
    "link": "https://www.nytimes.com/2026/01/08/realestate/construction-industry-suicides.html",
    "summary": "The death of TJ Kimball was a private tragedy that underscores a widespread risk in the stressful field."
  },
  {
    "title": "Apple’s John Ternus Could Be Tim Cook’s Successor as CEO",
    "link": "https://www.nytimes.com/2026/01/08/technology/apple-ceo-tim-cook-john-ternus.html",
    "summary": "John Ternus, a low-profile but influential executive at Apple, could be next in line to replace the company’s longtime chief executive, Tim Cook, if he steps aside."
  },
  {
    "title": "The Scientists Making Antacids for the Sea to Help Counter Global Warming",
    "link": "https://www.nytimes.com/2026/01/08/magazine/ocean-acidification-carbon-geoengineering.html",
    "summary": "The world’s oceans are becoming dangerously acidic. A controversial proposal would raise the pH — by mixing chemicals into the water."
  },
  {
    "title": "Mamdani Hosts Influencer Summit, Sidestepping Traditional Media",
    "link": "https://www.nytimes.com/2026/01/07/business/media/zohran-mamdani-social-media-creators.html",
    "summary": "A friendly summit at New York’s City Hall with digital content creators and social media stars symbolized the new mayor’s attitude toward the changing news media."
  },
  {
    "title": "Hochul and Mamdani to Announce Road Map to Expand Child Care",
    "link": "https://www.nytimes.com/2026/01/08/nyregion/mamdani-hochul-child-care.html",
    "summary": "Gov. Kathy Hochul will appear with Mayor Zohran Mamdani to lay out a plan to expand free and subsidized child care in New York, which had been a central focus of his campaign."
  },
  {
    "title": "Can Claire Valdez, a Mamdani Ally, Become New York’s Next Socialist in Congress?",
    "link": "https://www.nytimes.com/2026/01/08/nyregion/claire-valdez-congress-mamdani.html",
    "summary": "Claire Valdez, a New York assemblywoman, will face the Brooklyn borough president in a Democratic primary race to replace Representative Nydia Velázquez."
  },
  {
    "title": "A Housing Boom Transformed This City. Mamdani Is Taking Notes.",
    "link": "https://www.nytimes.com/2026/01/08/nyregion/jersey-city-housing.html",
    "summary": "Mayor Zohran Mamdani is eyeing Jersey City, N.J., for ideas as he looks to address New York’s housing crisis. For residents, the surge in development has been a mixed blessing."
  },
  {
    "title": "Kennedy Is Telling Americans How to Eat. It’s Not Crazy Advice.",
    "link": "https://www.nytimes.com/2026/01/08/opinion/dietary-guidelines-protein.html",
    "summary": "Newly released dietary guidelines emphasize protein and full-fat dairy."
  },
  {
    "title": "My Grandfather Sexually Abused Countless Children. Could He Have Been Stopped?",
    "link": "https://www.nytimes.com/2026/01/08/opinion/child-sexual-abuse-prevention.html",
    "summary": "We spend billions of dollars on punishing child sexual abusers and far less on prevention. It’s not stopping the problem. We must rethink our approach."
  },
  {
    "title": "NASA May Return Early From International Space Station After Medical Issue",
    "link": "https://www.nytimes.com/2026/01/08/science/space/nasa-astronaut-medical-problem.html",
    "summary": "NASA said it canceled a spacewalk planned for Thursday after an astronaut had an undisclosed medical issue on the International Space Station."
  },
  {
    "title": "Minimum Wage Rises in Some States as Workers Struggle With Basic Costs",
    "link": "https://www.nytimes.com/2026/01/08/us/minimum-wage-increases.html",
    "summary": "This year, for the first time, more Americans will earn a minimum wage of $15 per hour or higher than will earn the federal minimum of $7.25 per hour."
  },
  {
    "title": "U.S Disasters Cost U.S. More Than $100 Billion in 2025",
    "link": "https://www.nytimes.com/2026/01/08/climate/us-disaster-damage-costs-2025.html",
    "summary": "A record-setting 21 thunderstorm events each caused at least $1 billion in damages, a sign that more people and property are in harm’s way."
  },
  {
    "title": "A Major Springlike Storm Is on the Move. Here’s What to Expect.",
    "link": "https://www.nytimes.com/2026/01/08/weather/storm-us-forecast-tornado-rain.html",
    "summary": "The next few days will bring the type of potentially dangerous weather more often found in March or April."
  }
]