[
  {
    "title": "Private Employers Cut Jobs in November, in Latest Sign of a Slowdown",
    "link": "https://www.nytimes.com/2025/12/03/business/jobs-adp-economy.html",
    "summary": "Data from ADP, a payroll processor, is getting added attention because of delays in official statistics caused by the government shutdown."
  },
  {
    "title": "Fed Pick Puts Pressure on Bessent to Deliver for Trump",
    "link": "https://www.nytimes.com/2025/12/03/us/politics/fed-chair-bessent-hassett.html",
    "summary": "Treasury Secretary Scott Bessent, who is leading the search for the next Federal Reserve chair, could face President Trump’s wrath if the person chosen does not quickly lower interest rates."
  },
  {
    "title": "Shoppers Turn to Discounts and Debt, but Not Just for Holidays",
    "link": "https://www.nytimes.com/2025/12/03/business/holiday-shop-deals.html",
    "summary": "Consumers are focusing on value and financing purchases to complete their shopping lists."
  },
  {
    "title": "Ahead of Tariff Ruling, Businesses Race to Secure Refunds",
    "link": "https://www.nytimes.com/2025/12/03/business/supreme-court-tariff-ruling-refunds.html",
    "summary": "The Supreme Court has not yet ruled on the legality of President Trump’s sweeping tariffs, but some companies aren’t waiting to try to secure a speedy and substantial payout."
  },
  {
    "title": "Trump’s Pardon of Honduran Ex-President Erases Top Loyalist’s Triumph",
    "link": "https://www.nytimes.com/2025/12/03/nyregion/bove-trump-honduras-pardon.html",
    "summary": "Emil Bove III’s work as a prosecutor, before he was a Trump lawyer and official, helped lead to the conviction of the former Honduran leader whom President Trump freed this week."
  },
  {
    "title": "Epstein Files Reveal Private Home Photos in Latest Release by Democrats",
    "link": "https://www.nytimes.com/2025/12/03/us/politics/epstein-island-home.html",
    "summary": "In publicizing the photos and videos, Democrats in Congress appeared to be intensifying pressure on the Justice Department to release its files on the Epstein case."
  },
  {
    "title": "Bitcoin’s Predicted Sky-High Prices Have Not Panned Out",
    "link": "https://www.nytimes.com/2025/12/03/technology/cryptocurrencies-tumble-trump-rally.html",
    "summary": "Bitcoin has plunged more than 30 percent and Ether is down around 40 percent in recent months, as gains from President Trump’s pro-crypto policies evaporated."
  },
  {
    "title": "Trump Administration Begins Immigration Operation in New Orleans",
    "link": "https://www.nytimes.com/2025/12/03/us/border-patrol-new-orleans-immigration.html",
    "summary": "It is unclear how long the effort will last in Louisiana, where the Republican governor has welcomed the agents with open arms even as immigrant communities fear what might come."
  },
  {
    "title": "Police in a Louisiana City Welcome a Federal Crackdown. Immigrants Are in Hiding.",
    "link": "https://www.nytimes.com/2025/12/03/us/kenner-louisiana-border-patrol-immigration.html",
    "summary": "Kenner, a suburb of New Orleans, has been transformed by an infusion of newcomers. Immigrants there have been on edge all year, particularly in recent weeks."
  },
  {
    "title": "On Trump’s Insults, Somalia’s Prime Minister Says ‘It’s Better Not to Respond’",
    "link": "https://www.nytimes.com/2025/12/03/world/africa/trump-somalia-garbage-reaction-immigrant.html",
    "summary": "President Trump referred to Somali immigrants as “garbage” during a White House meeting on Tuesday."
  },
  {
    "title": "Best Movies of 2025",
    "link": "https://www.nytimes.com/2025/12/02/movies/best-movies-2025.html",
    "summary": "Our film critics rank their 10 favorites of the year."
  },
  {
    "title": "The Oscar Best Picture Race Has 5 Sure Bets. What About the Rest?",
    "link": "https://www.nytimes.com/2025/12/03/movies/best-picture-oscar-sinners-one-battle-after-another.html",
    "summary": "“One Battle After Another,” “Sinners,” “Hamnet,” “Marty Supreme” and “Sentimental Value” are almost certain to be nominated. After that, it’s anyone’s guess."
  },
  {
    "title": "How William Hendrix Became Part of a Racist, Antisemitic Group Chat for Young Republicans",
    "link": "https://www.nytimes.com/2025/12/03/us/politics/william-hendrix-kansas-republicans.html",
    "summary": "William Hendrix wanted a life in politics. He found it, with the Young Republicans."
  },
  {
    "title": "Weak Spots Are Few for Russia in Ukraine Peace Talks",
    "link": "https://www.nytimes.com/2025/12/03/world/europe/russia-putin-ukraine-peace-deal.html",
    "summary": "Economic and military pressures could force Russia’s hand. Its economy is strained but not enough to do that, analysts say. And President Vladimir V. Putin says Russia is winning the war."
  },
  {
    "title": "Europe Wants to Get the Word Out: Russia Is to Blame for Sabotage",
    "link": "https://www.nytimes.com/2025/12/03/world/europe/europe-russia-hybrid-attacks.html",
    "summary": "Officials are accusing Russia of smaller-scale assaults. President Vladimir V. Putin sought to turn the tables, saying that if Europe were to start a war, Russia is ready."
  },
  {
    "title": "Hong Kong’s Response to Deadly Fire Shows China’s Play Book in Action",
    "link": "https://www.nytimes.com/2025/12/03/business/hong-kong-fire-china.html",
    "summary": "In a sign of China’s role in the city, officials have tried to stamp out calls for accountability over a catastrophe that killed at least 159 people."
  },
  {
    "title": "A Devastating Fire Has Fueled a National Security Crackdown in Hong Kong",
    "link": "https://www.nytimes.com/2025/12/03/world/asia/hong-kong-fire-national-security-arrests.html",
    "summary": "The authorities quickly arrested critics demanding accountability, signaling an expansive use of the security law to silence dissent over nonpolitical tragedies."
  },
  {
    "title": "The G.O.P. Continues to Slip",
    "link": "https://www.nytimes.com/2025/12/02/upshot/election-tennessee-republicans-democrats.html",
    "summary": "Almost every election night this year has gone poorly for Republicans — a familiar position for the party that occupies the White House."
  },
  {
    "title": "Liberal Group to Air Ads Attacking Democrats for Confirming Trump Judges",
    "link": "https://www.nytimes.com/2025/12/03/us/politics/demand-justice-attacks-senate-democrats.html",
    "summary": "The three being targeted are Senators John Fetterman, Maggie Hassan and Angus King, an independent who caucuses with Democrats. None are up for re-election next year."
  },
  {
    "title": "Israel Says a Gaza Border Will Reopen, but Only for Palestinians to Leave",
    "link": "https://www.nytimes.com/2025/12/03/world/middleeast/israel-rafah-crossing-gaza-ceasefire.html",
    "summary": "Israel had agreed to open the Rafah crossing as part of the October cease-fire deal with Hamas but kept it closed. Egypt denied that the border would reopen soon."
  },
  {
    "title": "With Tensions Rising, Israel and Lebanon Expand Cease-Fire Talks",
    "link": "https://www.nytimes.com/2025/12/03/world/middleeast/israel-lebanon-talks-ceasefire.html",
    "summary": "Diplomats from both countries joined a military-led committee overseeing a year-old truce as fears mounted of a renewed Israeli offensive against Hezbollah."
  },
  {
    "title": "A Sidewalk Encounter Between 2 Longtime Neighbors Ends in a Death",
    "link": "https://www.nytimes.com/2025/12/02/nyregion/homicide-west-village-seniors-neighbors.html",
    "summary": "Dean Whetzel, 82, had known Dana Escoffier, 79, for decades. When Mr. Whetzel bumped into him near their Village apartments, Mr. Escoffier shoved him, the police said, and he fell to the ground."
  },
  {
    "title": "Inside the Museum-Style Home of Michael Ovitz, an A-List Collector",
    "link": "https://www.nytimes.com/2025/12/02/arts/design/michael-ovitz-home-art-collection.html",
    "summary": "He is best known as a former Hollywood power broker, but Ovitz has filled his Beverly Hills home with a collection that shows how serious he is about art."
  },
  {
    "title": "Spotify Wrapped Isn’t the Only App Quantifying Our Social Lives",
    "link": "https://www.nytimes.com/2025/12/03/style/spotify-wrapped-2025-year-in-review.html",
    "summary": "The music streaming service is no longer the only company quantifying our social lives."
  },
  {
    "title": "Centrists Were Supposed to Save Europe. Instead, They’re Condemning It to Horrors.",
    "link": "https://www.nytimes.com/2025/12/03/opinion/europe-britain-france-germany-centrist.html",
    "summary": "Centrist governments are failing badly in Europe’s leading economies, setting the stage for a far-right sweep."
  },
  {
    "title": "Lily Allen’s West End Girl Midlife Crisis Is Inspiring",
    "link": "https://www.nytimes.com/2025/12/03/opinion/lily-allen-david-harbour-west-end-girl.html",
    "summary": "A singer’s almost totally relatable look at the woes of aging."
  },
  {
    "title": "Inside Venezuela",
    "link": "https://www.nytimes.com/2025/12/03/briefing/inside-venezuela.html",
    "summary": "We explain how President Nicolás Maduro is responding to threats from the Trump administration."
  },
  {
    "title": "People Are Uploading Their Medical Records to A.I. Chatbots",
    "link": "https://www.nytimes.com/2025/12/03/well/medical-records-chatbots.html",
    "summary": "Despite privacy risks and inaccuracy concerns, people are feeding blood test results, doctor’s notes and surgical reports into ChatGPT and the like."
  },
  {
    "title": "Sterile Neutrino Prediction Muddled by Latest Experiments",
    "link": "https://www.nytimes.com/2025/12/03/science/sterile-neutrinos-particle-physics.html",
    "summary": "Two papers challenged the existence of theorized particles called sterile neutrinos that might account for mysteries like the cosmos’s dark matter."
  },
  {
    "title": "Visiting Turkey and Lebanon, Pope Leo Echoed Francis’s Message, Not His Style",
    "link": "https://www.nytimes.com/2025/12/03/world/europe/pope-leo-first-trip-francis-turkey-lebanon.html",
    "summary": "Traveling through the Mideast, Leo XIV channeled many of his predecessor’s messages. Leo’s deliberate manner differed from Francis."
  },
  {
    "title": "Nature Retracts Study Predicting Catastrophic Climate Toll",
    "link": "https://www.nytimes.com/2025/12/03/business/economy/study-climate-damage-retracted.html",
    "summary": "While growing evidence shows that carbon emissions are harming the economy, the journal Nature found that an outlier paper had deep flaws."
  }
]