[
  {
    "title": "Tiffany Trump’s Family Cruised the Mediterranean on an Oil Mogul's Yacht",
    "link": "https://www.nytimes.com/2025/09/18/world/europe/tiffany-trump-yacht-oil.html",
    "summary": "The vacation, amid diplomatic talks on oil industry expansion, is a measure of how hard it is to tell where the interests of government end and those of the Trump family begin."
  },
  {
    "title": "How Tiffany Trump’s Instagram Posts Led Us to an Oil Magnate’s Megayacht",
    "link": "https://www.nytimes.com/2025/09/18/world/europe/tiffany-trumps-instagram-posts-oil-billionaire.html",
    "summary": "Photographs left a trail of clues showing Ms. Trump and her husband, Michael Boulos, vacationing on luxury vessels owned by billionaires."
  },
  {
    "title": "How Tiffany Trump’s Husband Benefited From Proximity to Power",
    "link": "https://www.nytimes.com/2025/08/21/world/europe/michael-boulos-tiffany-trump-business-deals.html",
    "summary": "A Times investigation found that Michael Boulos and his family benefited financially from proximity to his in-laws for years."
  },
  {
    "title": "Jimmy Kimmel Pulled Off Air ‘Indefinitely,’ and Former C.D.C. Head Issues Warning",
    "link": "https://www.nytimes.com/2025/09/18/podcasts/the-headlines/jimmy-kimmel-cdc-head-hearing.html",
    "summary": "Plus, smart glasses and even smarter headphones."
  },
  {
    "title": "ABC Pulls Jimmy Kimmel Off Air for Charlie Kirk Comments After F.C.C. Pressure",
    "link": "https://www.nytimes.com/2025/09/17/business/media/abc-jimmy-kimmel.html",
    "summary": "Mr. Kimmel faced criticism from the chairman of the Federal Communications Commission for remarks about the politics of the man who is accused of killing Mr. Kirk, the conservative activist."
  },
  {
    "title": "Who Is Brendan Carr, the F.C.C. Chair Who Played a Role In Jimmy Kimmel’s Suspension?",
    "link": "https://www.nytimes.com/2025/09/18/technology/brendan-carr-fcc-jimmy-kimmel.html",
    "summary": "The chairman of the F.C.C., who is in the spotlight for his comments that may have led to the suspension of late night TV show host Jimmy Kimmel, has long criticized the media for perceived bias."
  },
  {
    "title": "Trump Hails Kimmel Suspension After Criticizing UK on Free Speech",
    "link": "https://www.nytimes.com/2025/09/18/world/europe/trump-kimmel-suspension-uk-free-speech.html",
    "summary": "President Trump has accused Britain of mounting a crackdown on political expression. But he welcomed the ABC network’s suspension of Jimmy Kimmel."
  },
  {
    "title": "Reactions to ABC’s Pulling of ‘Kimmel’ Reflect America’s Partisan Divide",
    "link": "https://www.nytimes.com/2025/09/17/arts/television/jimmy-kimmel-pulled-reactions.html",
    "summary": "Fans and liberals expressed anger while conservatives hailed ABC’s decision to pull Jimmy Kimmel’s late-night show off the air after comments about the killing of Charlie Kirk."
  },
  {
    "title": "Behind Castle Walls, the Rich and Powerful Celebrate Trump",
    "link": "https://www.nytimes.com/2025/09/17/world/europe/trump-uk-state-visit-banquet-royals.html",
    "summary": "The seating chart at the state dinner for President Trump was a cross-section of the rich and the powerful hoping to get on his good side."
  },
  {
    "title": "Melania Trump, in Windsor, Takes Royal Refuge in Fashion",
    "link": "https://www.nytimes.com/2025/09/17/style/melania-trump-state-visit-fashion.html",
    "summary": "A floor-length Burberry trench, an eye-obscuring hat and a yellow gown made quite a statement during the Trumps’ state visit to Britain."
  },
  {
    "title": "Nvidia to Buy $5 Billion Stake in Intel, Giving Rival a Lifeline",
    "link": "https://www.nytimes.com/2025/09/18/business/nvidia-intel-stake.html",
    "summary": "The deal between the chipmakers, whose fortunes have diverged sharply, includes plans to collaborate on technology to power artificial intelligence."
  },
  {
    "title": "Apple’s New AirPods Offer Impressive Language Translation",
    "link": "https://www.nytimes.com/2025/09/18/technology/personaltech/new-airpods-language-translation-feature.html",
    "summary": "The technology is one of the strongest examples yet of how artificial intelligence can be used in a seamless, practical way to improve people’s lives."
  },
  {
    "title": "Meta Unveils Smart Glasses With Apps and an Artificial Intelligence Assistant",
    "link": "https://www.nytimes.com/2025/09/17/technology/personaltech/meta-smart-glasses-ai.html",
    "summary": "At its annual developer conference on Wednesday, Meta showed several new smart glasses, which have been a surprise hit for the company."
  },
  {
    "title": "Questions Are Raised About Vaccine Panel’s Reliability as Policy Review Gets Underway",
    "link": "https://www.nytimes.com/2025/09/17/health/kennedy-acip-insurers-cassidy.html",
    "summary": "Senator Bill Cassidy warned against any new restrictions, and insurers suggested they would still cover routine vaccinations even if a C.D.C. panel tried to limit them."
  },
  {
    "title": "5 Takeaways From Ousted C.D.C. Director’s Hearing",
    "link": "https://www.nytimes.com/2025/09/17/health/susan-monarez-cdc-hearing-takeaways.html",
    "summary": "Susan Monarez, the head of the public health agency for barely a month, repeatedly told senators that Health Secretary Robert F. Kennedy Jr. was ignoring science in undercutting vaccines."
  },
  {
    "title": "Hepatitis B Vaccine, Once a Public Health Win, Is Under Threat From RFK Jr.",
    "link": "https://www.nytimes.com/2025/09/16/well/hepatitis-b-vaccine-rfk-jr.html",
    "summary": "Rates of the disease have fallen since 1991, when a vaccine committee recommended all newborns receive the shot."
  },
  {
    "title": "The Road",
    "link": "https://www.nytimes.com/2025/09/18/world/middleeast/gaza-city-evacuation.html",
    "summary": "A single image captures the desperation of Palestinians in Gaza City who have once again grabbed what belongings they could and fled the fighting."
  },
  {
    "title": "Rifts Grow Between Netanyahu and His Security Chiefs",
    "link": "https://www.nytimes.com/2025/09/18/world/middleeast/israel-netanyahu-military-gaza.html",
    "summary": "As Israel expands its war in Gaza, decision-making has become increasingly concentrated in the hands of one person: Prime Minister Benjamin Netanyahu."
  },
  {
    "title": "A New Rate-Cut Cycle Could Be Fuel on the Stock Market Fire",
    "link": "https://www.nytimes.com/2025/09/18/business/stocks-fed-rate-cut.html",
    "summary": "But with the market already booming and the Federal Reserve under presidential pressure, a new cycle of lower rates could pour fuel onto a fire, our columnist says."
  },
  {
    "title": "3 Police Officers Are Killed in Shooting in Southern Pennsylvania",
    "link": "https://www.nytimes.com/2025/09/17/us/york-pa-officers-shot.html",
    "summary": "Two other officers were injured in the shooting in York County, and the person who fired on the officers was also dead, officials said."
  },
  {
    "title": "Robert Redford and His Beloved Utah Canyon",
    "link": "https://www.nytimes.com/2025/09/18/us/robert-redford-utah.html",
    "summary": "The actor, who died on Tuesday at 89, spent much of his life working to preserve the serene natural beauty of Utah, even as his Sundance Film Festival brought Hollywood glamour to the state."
  },
  {
    "title": "‘The Twilight Zone’ Gave a Glimpse of Robert Redford’s Gifts",
    "link": "https://www.nytimes.com/2025/09/17/arts/television/robert-redford-the-twilight-zone.html",
    "summary": "In a memorable 1962 episode of “The Twilight Zone,” the actor, still in his early 20s, played the most charming emissary of the afterlife imaginable."
  },
  {
    "title": "How More Railroads Could Cut Pollution and Lighten Traffic",
    "link": "https://www.nytimes.com/2025/09/18/business/railroads-trucks-shipping.html",
    "summary": "The public would feel many benefits if rail companies grabbed business back from trucking, but doing so will be tough."
  },
  {
    "title": "‘No One Should Be Very Confident’: Four Economists Dissect Trump and the Economy",
    "link": "https://www.nytimes.com/2025/09/18/opinion/fed-rate-cut-miran-cook-powell.html",
    "summary": "The rate cut was the least of it."
  },
  {
    "title": "Ezra Klein Is Worried — but Not About a Radicalized Left",
    "link": "https://www.nytimes.com/2025/09/18/opinion/interesting-times-ross-douthat-ezra-klein.html",
    "summary": "‘They’re failing and rethinking nothing.’"
  },
  {
    "title": "The Hottest New Defense Against Drones? Lasers",
    "link": "https://www.nytimes.com/2025/09/18/world/europe/drones-laser-weapons.html",
    "summary": "Cheaper than advanced air defenses and more versatile than low-tech options, lasers have become a popular choice for nations worried about drone attacks."
  },
  {
    "title": "Amid Republican Crackdown on D.C., City Leaders to Testify",
    "link": "https://www.nytimes.com/2025/09/18/us/dc-leaders-testify.html",
    "summary": "Washington’s mayor and other local officials will be grilled by members of a House committee seeking to expand federal control over the city."
  },
  {
    "title": "What to Know About the North American Summit Taking Place Without the U.S.",
    "link": "https://www.nytimes.com/2025/09/18/world/americas/canada-mexico-us-carney-sheinbaum-trump.html",
    "summary": "The leaders of Canada and Mexico will sit down to discuss how to work around their unpredictable neighbor."
  },
  {
    "title": "From Home Run Balls to Signed Hats, Why Do We Love Chasing Freebies?",
    "link": "https://www.nytimes.com/2025/09/18/sports/sports-fans-violence-behavior-psychology.html",
    "summary": "Sports events and concerts offer more opportunities than ever to reach for free keepsakes. But several recent episodes raise a question: Is fan behavior getting worse as a result?"
  }
]