[
  {
    "title": "For Trump, Domestic Adversaries Are Not Just Wrong, They Are ‘Evil’",
    "link": "https://www.nytimes.com/2025/07/16/us/politics/trump-political-enemies-evil.html",
    "summary": "The president’s vilification of political opponents and journalists seeds the ground for threats of prosecution, imprisonment and deportation unlike any modern president has made."
  },
  {
    "title": "Supreme Court Keeps Ruling in Trump’s Favor, but Doesn’t Say Why",
    "link": "https://www.nytimes.com/2025/07/16/us/politics/supreme-courts-shadow-docket.html",
    "summary": "In a series of terse, unsigned orders, the court has often been giving the green light to President Trump’s agenda without a murmur of explanation."
  },
  {
    "title": "Trump Has Penned Letter To Fire Fed Chair Jerome Powell",
    "link": "https://www.nytimes.com/2025/07/16/us/politics/trump-powell-firing-letter.html",
    "summary": "The president waved a copy of a draft letter firing Jerome H. Powell at a meeting in the Oval Office with House Republicans. It remains to be seen whether he follows through with his threat."
  },
  {
    "title": "The Economy Seems Healthy. Were the Warnings About Tariffs Overblown?",
    "link": "https://www.nytimes.com/2025/07/16/business/tariffs-recession-economists.html",
    "summary": "Economists say it will take time for the effects of trade policies to show up in economic data — but acknowledge they aren’t sure how long."
  },
  {
    "title": "Trump Announces ‘Great Deal’ on Trade With Indonesia",
    "link": "https://www.nytimes.com/2025/07/16/business/economy/indonesia-trump-tariff-trade-agreement.html",
    "summary": "President Trump said the agreement would partly walk back some of the steep tariffs he threatened on the country last week. Indonesia’s president called Mr. Trump a “tough negotiator.”"
  },
  {
    "title": "Goldman Sachs Sets Series of Records on Tariff Swings",
    "link": "https://www.nytimes.com/2025/07/16/business/goldman-sachs-bank-of-america-morgan-stanley.html",
    "summary": "Goldman and other investment banks are feeding off a Trump boom."
  },
  {
    "title": "E.U. Rushes to Negotiate a U.S. Trade Deal Before Trump’s Tariff Deadline",
    "link": "https://www.nytimes.com/2025/07/16/us/politics/european-union-trump-tariffs.html",
    "summary": "The European Union is racing to clinch an agreement with the Americans before tariffs kick in on Aug. 1, even as President Trump has signaled he is in no rush."
  },
  {
    "title": "Ex-Commissioner Sues, Saying Adams Ran N.Y.P.D. as a Criminal Enterprise",
    "link": "https://www.nytimes.com/2025/07/16/nyregion/nypd-lawsuit-rico-donlon-eric-adams.html",
    "summary": "Thomas G. Donlon, who served only weeks as police commissioner, said in a lawsuit that New York City’s mayor and top department officials had manipulated the system for personal and political gain."
  },
  {
    "title": "Ari Aster, Hollywood’s Master of Dread, Is Afraid of Everything",
    "link": "https://www.nytimes.com/2025/07/16/magazine/ari-aster-eddington-film.html",
    "summary": "The man behind some of the 21st century’s most unsettling films takes his own anxiety and puts it onscreen."
  },
  {
    "title": "Israel Strikes Syria’s Capital, Sending Warning to Government",
    "link": "https://www.nytimes.com/2025/07/16/world/middleeast/israel-syria-damascus-strikes.html",
    "summary": "Israel threatened to escalate attacks on Syrian government forces unless they withdrew from Sweida, a southern province dominated by the country’s Druse minority."
  },
  {
    "title": "At Least 20 Killed in Stampede Outside a Gaza Aid Site",
    "link": "https://www.nytimes.com/2025/07/16/world/middleeast/gaza-aid-site-stampede-ghf.html",
    "summary": "There were conflicting accounts from Palestinian and aid officials over what happened at the food distribution hub run by the Israeli-backed Gaza Humanitarian Foundation."
  },
  {
    "title": "Mike Huckabee Visits Netanyahu’s Trial in Israel",
    "link": "https://www.nytimes.com/2025/07/16/world/middleeast/mike-huckabee-ambassador-netanyahu-trial-israel.html",
    "summary": "A highly unusual appearance from Mike Huckabee comes as President Trump has called for the long-running legal case to be canceled."
  },
  {
    "title": "Is This Restaurant the Only Thing Democrats and Republicans Agree On?",
    "link": "https://www.nytimes.com/2025/07/16/dining/ama-restaurant-washington-dc-maha.html",
    "summary": "In polarized Washington, Ama is drawing leaders from both camps with an anti-additive menu and a vow to bar all manner of toxicity."
  },
  {
    "title": "Migration Fears Turn Europe’s Borderless Dreams Into Traffic Nightmares",
    "link": "https://www.nytimes.com/2025/07/16/world/europe/europe-border-checks-immigration.html",
    "summary": "Germany’s new government imposed border checks to demonstrate toughness on migration, though crossings started slowing years ago."
  },
  {
    "title": "Christopher Reeve to David Corenswet: The Actors Who Played Superman",
    "link": "https://www.nytimes.com/2025/07/16/movies/superman-actors-christopher-reeve-david-corenswet.html",
    "summary": "There’s more than one way to play the most classic of superheroes. Here’s how six actors have approached the role."
  },
  {
    "title": "Why We Mistake the Wholesomeness of Gen Z for Conservatism",
    "link": "https://www.nytimes.com/2025/07/16/opinion/gen-z-wholesome-conservative.html",
    "summary": "Their moderation has been misread."
  },
  {
    "title": "Trump’s Plans to Put Emil Bove on the Supreme Court",
    "link": "https://www.nytimes.com/2025/07/16/opinion/emil-bove-trump-loyalty.html",
    "summary": "Trump wants his people calling the shots. And Bove has proved, above all, that he belongs to the president."
  },
  {
    "title": "Flood Season",
    "link": "https://www.nytimes.com/2025/07/16/briefing/flooding-northeast-risk.html",
    "summary": "We look at recent flooding — and explain what you can do to stay safe."
  },
  {
    "title": "Nvidia C.E.O. Treads Carefully in Beijing",
    "link": "https://www.nytimes.com/2025/07/16/business/nvidia-jensen-huang-beijing.html",
    "summary": "Jensen Huang, the chipmaker’s chief executive, is trying to balance his company’s interests as the United States and China compete for supremacy in artificial intelligence."
  },
  {
    "title": "Nicknames, Notes and a Waddle: How Colorado Fought a Bank Robbery Surge",
    "link": "https://www.nytimes.com/2025/07/16/us/bank-robberies-nicknames-colorado.html",
    "summary": "Colorado led the country in bank robberies, per capita, for three years starting in 2021. Law enforcement officials found innovative ways to crack the crime wave."
  },
  {
    "title": "Steve Benson, Provocative Editorial Cartoonist, Dies at 71",
    "link": "https://www.nytimes.com/2025/07/16/business/media/steve-benson-dead.html",
    "summary": "He won a Pulitzer Prize in 1993, and was a finalist four times while at The Arizona Republic. Some of his work rankled his own Mormon community."
  }
]