[
  {
    "title": "Trump Puts On a Show, Casting Democrats as the Villains",
    "link": "https://www.nytimes.com/2026/02/25/us/politics/trump-state-of-the-union-speech.html",
    "summary": "On the defensive over the economy and with the midterms approaching, President Trump made clear that his political strategy is to paint Democrats as unpatriotic and ‘crazy.’"
  },
  {
    "title": "‘Stand Up’: With One Maneuver, Trump Tries to Box In Democrats",
    "link": "https://www.nytimes.com/2026/02/25/us/politics/trump-state-of-the-union-scene.html",
    "summary": "President Trump turned his State of the Union address into full-blown political theater, handing out medals to war veterans and tossing the spotlight to ice hockey players."
  },
  {
    "title": "6 Takeaways From Trump’s State of the Union",
    "link": "https://www.nytimes.com/2026/02/25/us/politics/trump-state-of-the-union-takeaways.html",
    "summary": "In an address that was heavy on theatrics, President Trump lashed out at Democrats as “crazy” and unpatriotic."
  },
  {
    "title": "Key Moments from Trump’s State of the Union, and a $1 Million Reward in the Guthrie Case",
    "link": "https://www.nytimes.com/2026/02/25/podcasts/the-headlines/trump-state-of-the-union-guthrie-case.html",
    "summary": "Plus, how kids are getting around phone-free classroom rules."
  },
  {
    "title": "Inside Nicolás Maduro’s Last Days as Venezuela’s Leader",
    "link": "https://www.nytimes.com/2026/02/25/world/americas/maduro-venezuela-us-capture-trump.html",
    "summary": "The Venezuelan leader overestimated his strength and misread his exchange with President Trump in the decisive weeks before his capture by U.S. forces."
  },
  {
    "title": "Thanks, Ukrainians Say, but Please Stop Calling Us Resilient",
    "link": "https://www.nytimes.com/2026/02/25/world/europe/ukrainian-war-resilience.html",
    "summary": "Ukraine must project strength to secure continued Western support. But its people want the world to know they are not superhuman."
  },
  {
    "title": "Ukraine Wants to Join the E.U. to Secure Peace. Here’s What to Know.",
    "link": "https://www.nytimes.com/2026/02/25/world/europe/ukraine-european-union-membership.html",
    "summary": "Negotiators agree that joining the bloc is critical to Kyiv’s future. But obstacles abound, and compromises might forever change how the union works."
  },
  {
    "title": "Casey Means, Critic of Mainstream Medicine, May Become Nation’s Top Doctor",
    "link": "https://www.nytimes.com/2026/02/25/well/casey-means-surgeon-general.html",
    "summary": "Dr. Means, a wellness influencer and President Trump’s nominee for surgeon general, will appear before a Senate committee Wednesday."
  },
  {
    "title": "Hunters and Veterans Are Fighting Trump’s Pick to Oversee Public Lands",
    "link": "https://www.nytimes.com/2026/02/25/climate/hunters-and-veterans-are-fighting-trumps-pick-to-oversee-public-lands.html",
    "summary": "Steve Pearce, President Trump’s nominee to lead the Bureau of Land Management, is set to face a Senate hearing on Wednesday."
  },
  {
    "title": "Court Rules Against Justice Dept. Search of Reporter’s Computers",
    "link": "https://www.nytimes.com/2026/02/24/business/media/washington-post-reporter-search-ruling.html",
    "summary": "The judge said the court itself would search the devices, which were seized from a Washington Post reporter’s home last month."
  },
  {
    "title": "Delroy Lindo on ‘Sinners,’ the Oscars and the Power of Affirmation",
    "link": "https://www.nytimes.com/2026/02/25/movies/delroy-lindo-sinners-oscar-nominations.html",
    "summary": "In a career of standout performances and dispiriting lows, Lindo, 73, has held firm to his goal: “I want to be respected for my work.”"
  },
  {
    "title": "International Oscar Favorites Are Offering a Complicated New View of America",
    "link": "https://www.nytimes.com/2026/02/25/magazine/international-oscar-favorites-are-offering-a-complicated-new-view-of-america.html",
    "summary": "The Oscars has become friendlier to non-English language movies. And the movies seem aware of their American audiences."
  },
  {
    "title": "In Windsor, Some See Family Drama in the Andrew Accusations",
    "link": "https://www.nytimes.com/2026/02/25/world/europe/windsor-reaction-prince-andrew.html",
    "summary": "“Her children have let her down,” said one woman, referring to Queen Elizabeth II. Andrew Mountbatten-Windsor’s fall from grace drew strong reactions from some. Others said they just did not care."
  },
  {
    "title": "Leader of Columbia Brain Institute Quits Over Friendship With Epstein",
    "link": "https://www.nytimes.com/2026/02/25/nyregion/columbia-nobel-winner-epstein-resigns.html",
    "summary": "The Nobel laureate Richard Axel is not accused of wrongdoing but called his association with Jeffrey Epstein a “serious error in judgment.”"
  },
  {
    "title": "Can A.I. Detection Tools Really Spot Fake Images and Videos?",
    "link": "https://www.nytimes.com/2026/02/25/technology/ai-detection-generated-photos-video.html",
    "summary": "Artificial intelligence detectors are increasingly used to check the veracity of content online. We ran more than 1,000 tests and found several strengths and plenty of weaknesses."
  },
  {
    "title": "Bleak Research Report Stokes A.I. Debate on Wall St.",
    "link": "https://www.nytimes.com/2026/02/25/business/citrini-ai-stock-market.html",
    "summary": "In a widely circulated note, Citrini Research painted a dire picture of job losses and stock market sell-offs, though many analysts and economists questioned its conclusions."
  },
  {
    "title": "How Mamdani Learned From the First Snowstorm and Prepared for the Second",
    "link": "https://www.nytimes.com/2026/02/25/nyregion/mamdani-nyc-snow.html",
    "summary": "As the forecast rapidly worsened, Mayor Zohran Mamdani urged his staff to implement new policies and emphasized the need to communicate aggressively about the snow."
  },
  {
    "title": "Mamdani’s New Social Services Chief Worked to Reduce Street Homelessness",
    "link": "https://www.nytimes.com/2026/02/25/nyregion/social-services-homeless-dalton.html",
    "summary": "Mayor Zohran Mamdani selected Erin Dalton, a public official in the Pittsburgh area, to head New York City’s Department of Social Services."
  },
  {
    "title": "Online Accusations in Guthrie Abduction Leave One Family ‘Scared Numb’",
    "link": "https://www.nytimes.com/2026/02/25/us/nancy-guthrie-true-crime-accusations.html",
    "summary": "A fifth-grade teacher and his principal wife hid in their bedroom as dozens of people who believed he might be a kidnapper appeared on their suburban street."
  },
  {
    "title": "Yondr Pouches, a Solution to School Phone Bans, Are No Match for Teens",
    "link": "https://www.nytimes.com/2026/02/25/style/yondr-pouch-school-phone-ban.html",
    "summary": "In some schools, Yondr, a pouch marketed to keep kids off devices, has proved no match for actual children."
  },
  {
    "title": "Futsal Phenom in Afghanistan Is a Hero the Taliban Didn’t Expect",
    "link": "https://www.nytimes.com/2026/02/25/world/asia/afghanistan-futsal-alireza-ahmadi.html",
    "summary": "A triumph in indoor soccer has turned Alireza Ahmadi, 17, and other players from the Hazara minority, long marginalized in Afghanistan, into national heroes."
  },
  {
    "title": "Abu Dhabi’s State Oil Company Looks Beyond Oil",
    "link": "https://www.nytimes.com/2026/02/25/business/abu-dhabi-oil-energy.html",
    "summary": "Having reshaped the company, Sultan Ahmed Al Jaber wants to expand internationally, particularly in natural gas, chemicals and renewables."
  },
  {
    "title": "Best and Worst Moments From Trump’s State of the Union Address",
    "link": "https://www.nytimes.com/2026/02/25/opinion/trump-state-of-the-union-best-worst.html",
    "summary": "Nine Opinion writers weigh in on the speech."
  },
  {
    "title": "Jimmy Kimmel Goes Live After a Super Long State of the Union",
    "link": "https://www.nytimes.com/2026/02/25/arts/television/jimmy-kimmel-state-union.html",
    "summary": "“I can’t believe America missed an all-new ‘Will Trent’ for this one,” he joked."
  },
  {
    "title": "A New York City Diner That Served Blind Residents Has Closed Its Doors",
    "link": "https://www.nytimes.com/2026/02/25/nyregion/malibu-diner-nyc-blind-community.html",
    "summary": "When Malibu Diner in Chelsea shut down on Sunday night, it ended a unique breakfast program for older people in the city."
  },
  {
    "title": "Susan Leeman, 95, Dies; Explored How the Brain Influences the Body",
    "link": "https://www.nytimes.com/2026/02/24/science/susan-e-leeman-dead.html",
    "summary": "In an era of overt sexism in the sciences, she made two major discoveries, including identifying a chemical signal in the brain linked to chronic pain and migraines."
  },
  {
    "title": "Judge Dismisses Minnesota Gun Case as Prosecutors Struggle With Resignations",
    "link": "https://www.nytimes.com/2026/02/24/us/minnesota-gun-case-dismissed.html",
    "summary": "A judge took the unusual step of dropping the case over a speedy trial violation by the U.S. attorney’s office in Minnesota, which has been flooded with immigration-related cases."
  },
  {
    "title": "Pentagon Gives Anthropic an Ultimatum Over the Company’s A.I. Model",
    "link": "https://www.nytimes.com/2026/02/24/us/politics/pentagon-anthropic.html",
    "summary": "Anthropic insists on limits on how its technology is used and could be labeled a supply chain risk if it fails to accept the military’s demands."
  }
]