[
  {
    "title": "New Epstein Emails Alleged Trump Knew of His Conduct",
    "link": "https://www.nytimes.com/2025/11/12/us/politics/trump-epstein-emails.html",
    "summary": "In a message obtained by Congress, the convicted sex offender Jeffrey Epstein wrote that Donald J. Trump spent hours at his house with one of Mr. Epstein’s victims."
  },
  {
    "title": "By Not Funding Food Stamps, Trump Risks Lasting Damage to Safety Net",
    "link": "https://www.nytimes.com/2025/11/12/us/politics/trump-food-stamps-safety-net.html",
    "summary": "For the poorest Americans, the expected end to the longest shutdown in history has left doubt and anxiety around the benefits known as SNAP."
  },
  {
    "title": "What to Know About SNAP, America’s Main Food Aid Program",
    "link": "https://www.nytimes.com/2025/11/12/us/politics/snap-food-aid-government-shutdown.html",
    "summary": "The shutdown brought the scale of the federal food aid program into focus and raised questions about how such a rich country could have so many people on nutrition assistance."
  },
  {
    "title": "Atlanta Fed President to Step Down in February",
    "link": "https://www.nytimes.com/2025/11/12/business/bostic-atlanta-fed-president.html",
    "summary": "The departure of Raphael W. Bostic, who has served in the role since 2017, would create a new vacancy at the central bank."
  },
  {
    "title": "The I.R.S. Tried to Stop This Tax Dodge. Scott Bessent Used It Anyway.",
    "link": "https://www.nytimes.com/2025/11/12/us/politics/scott-bessent-irs-loophole.html",
    "summary": "Like many on Wall Street, Treasury Secretary Scott Bessent used a limited partnership to avoid Medicare taxes. Unlike the others, he’s now overseeing the I.R.S."
  },
  {
    "title": "Missing at U.N.’s Climate Meeting: American Executives",
    "link": "https://www.nytimes.com/2025/11/12/business/un-climate-corporate-executives.html",
    "summary": "Many business leaders are skipping the annual United Nations climate summit in Belém, Brazil, or are attending events in other cities."
  },
  {
    "title": "There’s a New Forecast for Peak Oil Demand. It’s Increasingly Cloudy.",
    "link": "https://www.nytimes.com/2025/11/12/climate/iea-fossil-fuel-forecast.html",
    "summary": "The International Energy Agency once projected that oil and gas demand could level off by 2030. Now it’s backing off, sort of."
  },
  {
    "title": "Blood and Tears as Spain’s Troubled Bullfighting Star Hangs Up His Cape",
    "link": "https://www.nytimes.com/2025/11/12/world/europe/spain-bullfighting-morante-camacho.html",
    "summary": "José Antonio Morante Camacho says he has fought his last bull. Fans appreciated his artistry but also his honesty about his struggles with mental illness."
  },
  {
    "title": "He Died at a School for Disabled People. Decades Later, His Brother Sought Answers.",
    "link": "https://www.nytimes.com/2025/11/12/us/fernald-state-school-disabled-people.html",
    "summary": "John Scott was rarely spoken of in his family after he was placed in an institution. After a half-century, his youngest brother set out to learn who he was and what happened to him."
  },
  {
    "title": "Xi’s Military Purges Show Unease About China’s Nuclear Forces",
    "link": "https://www.nytimes.com/2025/11/12/world/asia/xi-trump-military-purges.html",
    "summary": "The shake-up in China’s armed forces comes as both Beijing and Washington are pushing through major changes in their country’s militaries, in different ways."
  },
  {
    "title": "Jack Schlossberg, Scion of the Kennedy Family, Gives Politics a Try",
    "link": "https://www.nytimes.com/2025/11/11/style/jack-schlossberg-congress-kennedy-family.html",
    "summary": "As he prepares a congressional run, J.F.K.’s grandson admits, “I’m not for everybody.”"
  },
  {
    "title": "Jack Schlossberg, Kennedy Heir, to Seek Nadler’s N.Y. Congressional Seat",
    "link": "https://www.nytimes.com/2025/11/11/nyregion/jack-schlossberg-congress-run.html",
    "summary": "Mr. Schlossberg, the son of Caroline Kennedy, said the Democratic Party needed someone who could stand up to President Trump and his allies."
  },
  {
    "title": "Michelle Obama’s New Book Is a Historical Document Dressed Up as a Coffee-Table Tome",
    "link": "https://www.nytimes.com/2025/11/12/style/michelle-obama-the-look.html",
    "summary": "“The Look” should be studied by generations to come, not because of what it reveals about fashion, but politics."
  },
  {
    "title": "Pakistan’s Army Chief Is Granted Sweeping Authority Over All Military Branches",
    "link": "https://www.nytimes.com/2025/11/12/world/asia/pakistan-army-chief-power.html",
    "summary": "A constitutional amendment in the nuclear-armed country extends the chief’s power over all the military and brings Pakistan’s highest court under tighter political control."
  },
  {
    "title": "Deadly Blasts in India and Pakistan Set Region on Edge",
    "link": "https://www.nytimes.com/2025/11/12/world/asia/india-pakistan-explosions.html",
    "summary": "The rare explosions in the country’s capitals have not been directly linked, but there are fears the governments will blame each other after their previous military conflict alarmed the world."
  },
  {
    "title": "Israel Reopens Gaza Aid Route It Had Closed for Months",
    "link": "https://www.nytimes.com/2025/11/12/world/middleeast/israel-gaza-zikim-crossing-aid.html",
    "summary": "The cease-fire with Hamas has blunted the hunger faced by Gazans during the war. But aid agencies say Israeli restrictions are still hobbling their work."
  },
  {
    "title": "Israel’s president says Trump asked him to pardon Netanyahu, who has not been convicted.",
    "link": "https://www.nytimes.com/live/2025/11/12/us/trump-government-shutdown-news/israels-president-says-trump-asked-him-to-pardon-netanyahu-who-has-not-been-convicted",
    "summary": ""
  },
  {
    "title": "What Are Antidepressants Doing to Teen Sexual Development",
    "link": "https://www.nytimes.com/2025/11/12/magazine/antidepressants-ssris-teen-sexual-side-effects.html",
    "summary": "Research on adults who take S.S.R.I.s shows they tamp down sexual desire. Why aren’t we studying what that could mean for adolescents who take them?"
  },
  {
    "title": "What to Know About Teen Sexual Development and S.S.R.I.s",
    "link": "https://www.nytimes.com/2025/11/12/magazine/what-to-know-teen-sexual-development-ssris.html",
    "summary": "There is basically no research that looks at the impact of antidepressants on emerging sexuality. Here are the key things we do know."
  },
  {
    "title": "Who Pays When A.I. Is Wrong?",
    "link": "https://www.nytimes.com/2025/11/12/business/media/ai-defamation-libel-slander.html",
    "summary": "New court cases seek to define content created by artificial intelligence as defamatory — a novel concept that has captivated some legal experts."
  },
  {
    "title": "At the Cybathlon, May the Best Brain-Computer Interface Win",
    "link": "https://www.nytimes.com/2025/11/12/science/brain-implants-technology-disability.html",
    "summary": "Every four years at the Cybathlon, teams of researchers and technology “pilots” compete to see whose brain-computer interface holds the most promise."
  },
  {
    "title": "Tim Kaine on Why He Voted to End the Government Shutdown",
    "link": "https://www.nytimes.com/2025/11/12/opinion/tim-kaine-shutdown-vote.html",
    "summary": "Extending the government shutdown would not have worked."
  },
  {
    "title": "Abortion Has Remained Mostly Accessible. That May Soon Change.",
    "link": "https://www.nytimes.com/2025/11/12/opinion/abortion-pills.html",
    "summary": "American women need the freedom to determine the course of their own lives."
  },
  {
    "title": "Dale Romans Enters Kentucky Senate Race as Democrats’ Latest Long Shot",
    "link": "https://www.nytimes.com/2025/11/12/us/politics/dale-romans-senate-kentucky-democrats.html",
    "summary": "Dale Romans, pitching himself as an independent-minded Democrat in the mold of Joe Manchin, will try to win a seat for the party in the deep-red state."
  },
  {
    "title": "Northern Lights Bring Dazzling Views to Northeast U.S. and Across Canada, With More Possible Tonight",
    "link": "https://www.nytimes.com/2025/11/12/science/space/northern-lights-photos-geomagnetic-storm.html",
    "summary": "After a colorful display overnight, the northern U.S., parts of Canada and Britain could see the aurora Wednesday night."
  },
  {
    "title": "Scientists Grow More Hopeful About Ending a Global Organ Shortage",
    "link": "https://www.nytimes.com/2025/11/12/health/pig-organs-transplants.html",
    "summary": "At an international conference, researchers at the forefront of animal-human transplantation compared notes and allowed themselves the first real optimism in decades."
  },
  {
    "title": "Kim Kardashian’s Skims Is Worth an Extra Billion Dollars",
    "link": "https://www.nytimes.com/2025/11/12/business/dealbook/kim-kardashian-skims-fundraising-billion.html",
    "summary": "The apparel giant is now valued at $5 billion after a new fund-raising round, as it continues to grow its business."
  }
]