[
  {
    "title": "China Is Getting Much of What It Wants From the U.S., Including Chips",
    "link": "https://www.nytimes.com/2025/12/12/world/asia/nvidia-china-trump-security-japan.html",
    "summary": "For China, President Trump’s moves to loosen chip controls, soften U.S. rhetoric and stay silent on tensions with Japan amount to a rare string of strategic gains."
  },
  {
    "title": "Historic Shift Underway in China’s Economy as Investment Slump Deepens",
    "link": "https://www.nytimes.com/2025/12/12/business/china-investment-economy.html",
    "summary": "Investment in manufacturing, infrastructure and property is expected to fall this year, a remarkable turn for an economy whose growth reshaped the world."
  },
  {
    "title": "Republicans Defy Trump in Indiana, and Hundreds Quarantined in Measles Outbreak",
    "link": "https://www.nytimes.com/2025/12/12/podcasts/the-headlines/indiana-republicans-trump-measles-outbreak.html",
    "summary": "Plus, the Friday news quiz."
  },
  {
    "title": "Indiana Senate Republicans Reject Trump’s Redistricting Effort",
    "link": "https://www.nytimes.com/2025/12/11/us/indiana-senate-redistricting-republicans.html",
    "summary": "Republicans hold an overwhelming majority in the Indiana Senate, but more than a dozen of them defied the president’s wishes, voting against a map aimed at adding Republicans in Congress."
  },
  {
    "title": "Key Takeaways After Indiana Lawmakers Defy Trump’s Redistricting Push",
    "link": "https://www.nytimes.com/2025/12/11/us/politics/indiana-trump-redistricting-takeaways.html",
    "summary": "President Trump’s failure to ram through a Republican-friendly House map was a new sign that his iron grip on the party has slipped, and was likely to reverberate nationally."
  },
  {
    "title": "Republicans Undercut Johnson, Circumventing Him to Force Votes",
    "link": "https://www.nytimes.com/2025/12/11/us/politics/republicans-undercut-speaker-johnson.html",
    "summary": "The speaker has repeatedly lost his grip on the House floor thanks to a once rare parliamentary maneuver that G.O.P. members are increasingly using to force action on legislation."
  },
  {
    "title": "U.S. Issues New Sanctions Targeting Maduro’s Family and the Oil Sector",
    "link": "https://www.nytimes.com/2025/12/11/us/politics/maduro-oil-sanctions-venezuela-tanker.html",
    "summary": "The United States is escalating its pressure campaign on Venezuela’s leader, Nicolás Maduro, after seizing an oil tanker off the coast."
  },
  {
    "title": "Troops Involved in Boat Strikes Face a ‘Moral Injury’ Risk, Experts Say",
    "link": "https://www.nytimes.com/2025/12/12/us/troops-involved-in-boat-strikes-face-a-moral-injury-risk-experts-say.html",
    "summary": "Troops who play a part in deadly missions that they see as wrong or unjustified may suffer deep psychological harm as a result, research has shown."
  },
  {
    "title": "What to Know About Trump’s Seizure of an Oil Tanker Near Venezuela",
    "link": "https://www.nytimes.com/2025/12/11/us/politics/trump-venezuela-tanker.html",
    "summary": "The tanker was headed eastward and had recently carried Iranian oil. The seizure is an escalation in President Trump’s military pressure campaign against Venezuela’s leader, Nicolás Maduro."
  },
  {
    "title": "Trump Moves to Stop States From Regulating AI With a New Executive Order",
    "link": "https://www.nytimes.com/2025/12/11/technology/ai-trump-executive-order.html",
    "summary": "The order would create one federal regulatory framework for artificial intelligence, President Trump told reporters in the Oval Office."
  },
  {
    "title": "Kids Rarely Read Whole Books Anymore. Even in English Class.",
    "link": "https://www.nytimes.com/2025/12/12/us/high-school-english-teachers-assigning-books.html",
    "summary": "When teachers do assign whole books, they often choose from a stagnant list of classics."
  },
  {
    "title": "Paramount Says Money Is No Object. Warner Bros. Isn’t Convinced.",
    "link": "https://www.nytimes.com/2025/12/12/business/paramount-warner-bros-netflix-deal.html",
    "summary": "Larry Ellison is backstopping Paramount’s bid for Warner Brothers, but Warner Brothers is concerned that the billionaire has not provided a personal guarantee to pay."
  },
  {
    "title": "100,000 in Washington State Ordered to Evacuate as Rivers Rise",
    "link": "https://www.nytimes.com/2025/12/11/weather/washington-flooding-rain-atmospheric-river.html",
    "summary": "Days of heavy rain pushed waterways to record flood levels in a mountainous region north of Seattle. “Do not wait,” local officials warned residents, urging them to seek higher ground."
  },
  {
    "title": "Harold Hamm, Oklahoma Oil Tycoon, Allies With Trump to Reshape U.S. Energy",
    "link": "https://www.nytimes.com/2025/12/12/business/energy-environment/trump-harold-hamm-oil-gas.html",
    "summary": "Harold Hamm, an Oklahoma oil tycoon, has played a central role in reshaping energy policy by allying himself with President Trump."
  },
  {
    "title": "Mamdani Will Be New York City’s First Soccer-Mad Mayor",
    "link": "https://www.nytimes.com/2025/12/12/nyregion/mamdani-soccer-talking-headers-brooklyn.html",
    "summary": "Zohran Mamdani isn’t just a superfan. Until recently, he was a key player on the Talking Headers, a rec-league team where he was known as Z."
  },
  {
    "title": "Thailand Says Trump Call About Cambodia Conflict Is Set for Friday",
    "link": "https://www.nytimes.com/2025/12/12/world/asia/thailand-cambodia-trump-call.html",
    "summary": "President Trump’s planned intervention comes as the hostilities entered their fifth day and appeared to escalate, and while Thailand moves toward early elections."
  },
  {
    "title": "Review of Medical Cannabis Use Finds Little Evidence of Benefit",
    "link": "https://www.nytimes.com/2025/12/12/health/medical-cannabis-benefits.html",
    "summary": "Researchers found a chasm between the health reasons for which the public seeks out cannabis and what gold-standard science actually shows about its effectiveness."
  },
  {
    "title": "Our Book Critics on Their Year in Reading",
    "link": "https://www.nytimes.com/2025/12/12/books/review/book-critics-2025.html",
    "summary": "Alexandra Jacobs, Jennifer Szalai and Dwight Garner look back at the books that, as Jacobs writes, “bonked me on the head this year.”"
  },
  {
    "title": "Does Paramount’s David Ellison Know What He’s Doing?",
    "link": "https://www.nytimes.com/2025/12/12/opinion/david-ellison-paramount-warner-trump.html",
    "summary": "David Ellison is cozying up to Trump in his effort to save Hollywood. It’s a risky strategy for our democracy."
  },
  {
    "title": "Why Is It So Hard to Build Big Things?",
    "link": "https://www.nytimes.com/2025/12/12/briefing/why-is-it-so-hard-to-build-big-things.html",
    "summary": "Today we look at the state of American inertia."
  },
  {
    "title": "Jimmy Kimmel Takes a Swipe at Trump’s ‘Gold Card’",
    "link": "https://www.nytimes.com/2025/12/12/arts/television/jimmy-kimmel-trump-gold-card.html",
    "summary": "The new visa for rich foreigners had Kimmel rethinking the Statue of Liberty’s inscription: “Never mind your poor and tired. Give us a million bucks — you’re in.”"
  },
  {
    "title": "Reddit Sues Australian Government to Block Social Media Ban",
    "link": "https://www.nytimes.com/2025/12/11/world/asia/reddit-lawsuit-australia-social-media-ban.html",
    "summary": "The company said the new law, which makes it illegal for children under 16 to have social media accounts, infringes on children’s rights."
  },
  {
    "title": "King Charles to Speak About His Cancer in Televised Message",
    "link": "https://www.nytimes.com/2025/12/12/world/europe/king-charles-cancer-update.html",
    "summary": "A video of the king discussing his “recovery journey” will air on Channel 4 on Friday. He was diagnosed with an unspecified type of cancer last year."
  },
  {
    "title": "D.L. Coburn, Playwright With a Solo Hit, ‘The Gin Game,’ Dies at 87",
    "link": "https://www.nytimes.com/2025/12/11/theater/dl-coburn-dead.html",
    "summary": "His two-character work won a Pulitzer Prize and had a long Broadway run, but he never replicated its success and struggled to get his later work staged."
  }
]