[
  {
    "title": "Senate Passes Defense Policy Bill, Clearing It for Trump",
    "link": "https://www.nytimes.com/2025/12/17/us/politics/senate-defense-bill-trump-military.html",
    "summary": "The legislation authorizes $900 billion for the Pentagon, provides a pay raise for troops, and has some measures to reassert congressional oversight."
  },
  {
    "title": "Appeals Court Allows National Guard to Remain in D.C., for Now",
    "link": "https://www.nytimes.com/2025/12/17/us/politics/appeals-court-washington-national-guard.html",
    "summary": "A three-judge panel voted unanimously to allow troops to stay in the capital for the duration of the appeal, citing the city’s unique legal status."
  },
  {
    "title": "National Center for Atmospheric Research to Be Dismantled, Trump Administration Says",
    "link": "https://www.nytimes.com/2025/12/17/climate/national-center-for-atmospheric-research-trump.html",
    "summary": "Russell Vought, the White House budget director, called the laboratory a source of “climate alarmism.”"
  },
  {
    "title": "Trump Dangles Cash Payments to Assuage Affordability Concerns",
    "link": "https://www.nytimes.com/2025/12/17/us/politics/trump-cash-payments.html",
    "summary": "With tariffs unpopular and prices still high, the White House has teased the promise of tariff rebates and large tax refunds next year."
  },
  {
    "title": "What Trump’s Embrace of Crypto Has Unleashed",
    "link": "https://www.nytimes.com/2025/12/17/technology/trump-crypto-unleashed.html",
    "summary": "A boundary-pushing array of new crypto ventures have reached the stock market, enticing investors and leading to more risk taking."
  },
  {
    "title": "Heating Costs Expected to Rise 9.2% This Winter",
    "link": "https://www.nytimes.com/2025/12/17/business/energy-environment/winter-heating-costs-increase.html",
    "summary": "Colder weather and rising electricity and fuel costs will lead to a big jump in costs for individuals, according to estimates from a group representing state energy officials."
  },
  {
    "title": "New Details Emerge About How Rob and Michele Reiner Were Found",
    "link": "https://www.nytimes.com/2025/12/16/us/reiner-family-rob-nick-michele.html",
    "summary": "A person close to the family provided a detailed account of what occurred in the Reiner house after a massage therapist received no response at the gate."
  },
  {
    "title": "Warner Bros. Urges Shareholders to Reject Paramount Takeover Bid, Saying Ellisons ‘Misled’ Them",
    "link": "https://www.nytimes.com/2025/12/17/business/media/warner-bros-paramount-takeover-netflix.html",
    "summary": "The claim was made as part of Warner Bros. Discovery’s dismissal of Paramount’s hostile takeover offer."
  },
  {
    "title": "The 25 Most Notable Movies of 2025: ‘KPop Demon Hunters,’ ‘Roofman’ and More",
    "link": "https://www.nytimes.com/2025/12/17/movies/best-movies-2025-kpop-demon-hunters-roofman.html",
    "summary": "We polled film experts in the newsroom. These are the titles that stuck with us this year."
  },
  {
    "title": "Tankers Under Sanction Are Only a Subset of Fleet Moving Venezuelan Oil",
    "link": "https://www.nytimes.com/2025/12/17/us/politics/tankers-sanctions-venezuela-oil.html",
    "summary": "The scope of President Trump’s blockade against ships carrying oil from Venezuela was not clear on Wednesday."
  },
  {
    "title": "Trump Revised Chevron’s Venezuela Deal. Maduro’s Oil Trader Profited.",
    "link": "https://www.nytimes.com/2025/12/17/world/americas/trump-chevron-venezuela-oil.html",
    "summary": "A firm controlled by a businessman tied to a seized tanker carrying Venezuelan oil has sold millions of barrels from a Chevron-operated oil field."
  },
  {
    "title": "How the Rhinelander Trial Scandalized the Jazz Age",
    "link": "https://www.nytimes.com/2025/12/17/magazine/rhinelander-trial-interracial-marriage.html",
    "summary": "Rhinelander v. Rhinelander was one of the most scandalous trials of the Jazz Age. 100 years later, it reads as a tragedy about the country’s original sin."
  },
  {
    "title": "Suspect in Bondi Beach Killings Is Charged With Murder and Terrorism",
    "link": "https://www.nytimes.com/2025/12/17/world/asia/australia-bondi-beach-shooting.html",
    "summary": "The Australian authorities said the 24-year-old man, who had been shot by the police, woke from a coma on Tuesday afternoon."
  },
  {
    "title": "Bondi Beach Shooting Is a Reminder of ISIS’s Power to Inspire Attacks",
    "link": "https://www.nytimes.com/2025/12/17/world/europe/islamic-state-attacks-australia.html",
    "summary": "ISIS is too weakened to seize territory, experts said, but its ability to churn out propaganda aimed at provoking violence against the West persists."
  },
  {
    "title": "Brown University Students Were Prepping for an Exam. Then, a Gunman at the Classroom Door.",
    "link": "https://www.nytimes.com/2025/12/17/us/exam-review-brown-shooting.html",
    "summary": "For the students in the Brown University review session, concerns about grades and questions about economic concepts would be forgotten in an instant."
  },
  {
    "title": "One Way the Brown University Shooting Was Unusual: The Gunman Escaped",
    "link": "https://www.nytimes.com/2025/12/17/us/brown-attack-manhunt-gunman-escaped.html",
    "summary": "It is rare for a gunman in a high-profile shooting to get away, and many are apprehended within days. The authorities shared grainy video and begged for tips as the search stretched into its fourth day."
  },
  {
    "title": "Harvard Secretly Investigates Students Over Larry Summers Video on Epstein",
    "link": "https://www.nytimes.com/2025/12/17/us/harvard-investigates-students-larry-summers-video-epstein.html",
    "summary": "The students face discipline for recording Mr. Summers, the former Harvard president, discussing his ties to Jeffrey Epstein in a Harvard class."
  },
  {
    "title": "With Rights and Resources Uncertain, They’re Seeking Sterilization",
    "link": "https://www.nytimes.com/2025/12/17/well/family/sterilization-tubal-ligation-younger-women.html",
    "summary": "More young, child-free women are pursuing the permanent form of contraception."
  },
  {
    "title": "The Secret Trial of the General Who Refused to Attack Tiananmen Square",
    "link": "https://www.nytimes.com/2025/12/17/world/asia/china-general-tiananmen-square.html",
    "summary": "In 1989, Gen. Xu Qinxian defied orders to crush the pro-democracy protests in Beijing. Now, leaked video from his court-martial is on YouTube."
  },
  {
    "title": "Beloved Objects Cherished By Those We Lost in 2025",
    "link": "https://www.nytimes.com/2025/12/17/magazine/objects-they-loved-2025.html",
    "summary": "Metal crosses, a recliner, a blue wedding suit: the most cherished belongings of Ozzy Osbourne, Brian Wilson, Kitty Dukakis and others."
  },
  {
    "title": "What Is an American?",
    "link": "https://www.nytimes.com/2025/12/17/opinion/republican-identity-divide.html",
    "summary": "If the post-Trump G.O.P. makes the same mistake the Democrats did with their identitarian fringe, Republicans will meet a similar fate."
  },
  {
    "title": "Anti-Vaccine Influencers Are Only Getting Stronger",
    "link": "https://www.nytimes.com/2025/12/17/opinion/anti-vaccine-influencers.html",
    "summary": "I was wrong about how to push back."
  },
  {
    "title": "Mr. Robot Will See You Now",
    "link": "https://www.nytimes.com/2025/12/17/briefing/mr-robot-will-see-you-now.html",
    "summary": "We look at the promise and peril of robots that look like humans."
  },
  {
    "title": "Oscars Reach Deal With YouTube",
    "link": "https://www.nytimes.com/2025/12/17/business/media/oscars-youtube.html",
    "summary": "The Academy of Motion Picture Arts and Sciences said that it had reached a deal with YouTube for exclusive rights to the show starting in 2029."
  },
  {
    "title": "Greenpeace’s Fight With Pipeline Giant Exposes a Legal Loophole",
    "link": "https://www.nytimes.com/2025/12/17/climate/greenpeaces-fight-with-pipeline-giant-exposes-a-legal-loophole.html",
    "summary": "A court filing by a group with deep ties to the pipeline company Energy Transfer raises questions about the growing use of amicus briefs in litigation."
  },
  {
    "title": "Gil Gerard, Star of ‘Buck Rogers,’ Dies at 82",
    "link": "https://www.nytimes.com/2025/12/17/arts/gil-gerard-buck-rogers-dead.html",
    "summary": "He was best known for playing the title character in “Buck Rogers in the 25th Century,” which ran on NBC from 1979 to 1981."
  },
  {
    "title": "On British Roads, Chinese Cars Are Racing Ahead",
    "link": "https://www.nytimes.com/2025/12/17/business/britain-china-cars-byd.html",
    "summary": "BYD, Chery and other Chinese automakers are winning over drivers in Britain, where tariffs are low and buyers are open to new brands."
  }
]