[
  {
    "title": "Trump Says Kennedy Center Will Close for 2-Year Reconstruction Project",
    "link": "https://www.nytimes.com/2026/02/01/us/politics/trump-kennedy-center.html",
    "summary": "The president’s announcement came after the center has been rocked by cancellations and boycotts by performers, contributors and audience members."
  },
  {
    "title": "U.A.E. Firm Quietly Took Stake in the Trump Family’s Crypto Company",
    "link": "https://www.nytimes.com/2026/02/01/us/politics/trump-crypto-uae-world-liberty.html",
    "summary": "The $500 million agreement raises new concerns about the propriety of the president negotiating foreign policy with his own business partners."
  },
  {
    "title": "‘Melania’ Arrives With Strong Box Office Showing for a Documentary",
    "link": "https://www.nytimes.com/2026/01/31/business/melania-documentary-box-office.html",
    "summary": "Amazon backed up the Brink’s trucks for the vanity film, resulting in weekend ticket sales of about $7 million in North America, enough for third place."
  },
  {
    "title": "Judge Who Ruled Against Trump Administration Cleared of Justice Dept. Complaint",
    "link": "https://www.nytimes.com/2026/02/01/us/politics/judge-boasberg-ethics-complaint-trump.html",
    "summary": "Trump allies have called for Judge James E. Boasberg to be investigated and impeached after decisions that questioned the administration’s respect for the rule of law."
  },
  {
    "title": "Move Fast, but Obey the Rules: China’s Vision for Dominating A.I.",
    "link": "https://www.nytimes.com/2026/02/02/business/china-ai-regulations.html",
    "summary": "Beijing wants to lead the world in developing cutting-edge artificial intelligence, but it also wants companies to adhere to an increasingly complex set of rules."
  },
  {
    "title": "Can Tom Homan De-escalate ICE Tensions in Minnesota?",
    "link": "https://www.nytimes.com/2026/02/01/us/politics/tom-homan-minnesota-ice.html",
    "summary": "The White House border czar wants to focus more on getting immigrants already in jails. He’ll have to persuade Democrats to do it."
  },
  {
    "title": "Federal Courts Undercut Trump’s Mass Deportation Campaign",
    "link": "https://www.nytimes.com/2026/02/01/us/habeas-corpus-detainee-immigrant-trump-federal-courts.html",
    "summary": "A policy intended to keep immigrants detained indefinitely has led to a deluge of lawsuits, overwhelming some federal courts and resulting in many releases."
  },
  {
    "title": "How Alex Pretti’s Death Became a National Tipping Point",
    "link": "https://www.nytimes.com/2026/02/01/us/alex-pretti-minneapolis.html",
    "summary": "Several factors converged to force a remarkable shift in the federal government’s aggressive efforts in Minnesota."
  },
  {
    "title": "How Trump Appears in the Epstein Files",
    "link": "https://www.nytimes.com/2026/02/01/us/trump-epstein-files.html",
    "summary": "The New York Times found more than 5,300 files with references to Mr. Trump and related terms. They include salacious and unverified claims, as well as documents that had already been made public."
  },
  {
    "title": "The Government Published Dozens of Nude Photos in the Epstein Files",
    "link": "https://www.nytimes.com/2026/02/01/us/nude-photos-epstein-files.html",
    "summary": "The photos, which showed young women or possibly teenagers with their faces visible, were largely removed after The New York Times began notifying the Justice Department."
  },
  {
    "title": "2026 Grammys Takeaways: Bad Bunny and Kendrick Lamar Take Top Awards",
    "link": "https://www.nytimes.com/2026/02/01/arts/music/grammy-awards-2026-takeaways.html",
    "summary": "On a night marked by explicit political statements, Bad Bunny became the first Spanish-language artist to win the ceremony’s top prize, while Kendrick Lamar is now the winningest rapper in Grammy history."
  },
  {
    "title": "Unforgettable Grammys 2026 Looks: Chappell Roan, Sabrina Carpenter, Bad Bunny",
    "link": "https://www.nytimes.com/2026/02/01/style/grammys-red-carpet-2026.html",
    "summary": "Feathered gowns, sequined suits, freed nipples and more."
  },
  {
    "title": "Grammys 2026 Winners List: Bad Bunny, Kendrick Lamar, Olivia Dean and More",
    "link": "https://www.nytimes.com/2026/02/01/arts/music/grammys-winners-list-2026.html",
    "summary": "A complete rundown of the artists, albums, songs and videos that took home trophies at the 68th annual awards."
  },
  {
    "title": "Kehlani, Justin Bieber and More Wear ‘ICE Out’ Pins and Support Immigrants at Grammys",
    "link": "https://www.nytimes.com/2026/02/01/arts/music/grammys-ice-immigration-kehlani.html",
    "summary": "Bad Bunny joined Gloria Estefan, Shaboozey, Kehlani and others in speaking up for communities that are being targeted by ICE across the United States."
  },
  {
    "title": "Squeezed Between Trump and China, India Looks for Faraway Friendships",
    "link": "https://www.nytimes.com/2026/02/02/business/india-trump-china-trade-deals.html",
    "summary": "India is overcoming its aversion to free-trade deals to cozy up with Canada and other middle powers."
  },
  {
    "title": "The Secret Egyptian Air Base Powering Sudan’s Drone War",
    "link": "https://www.nytimes.com/2026/02/01/world/africa/egypt-sudan-drones.html",
    "summary": "The covert base offers new evidence of how the Sudanese conflict is morphing into a theater for high-tech warfare, driven by foreign interests."
  },
  {
    "title": "N.Y. Republican in Swing District Gets Rowdy Reception at Town Hall",
    "link": "https://www.nytimes.com/2026/02/01/nyregion/mike-lawler-ny-town-hall.html",
    "summary": "Representative Mike Lawler, who has promised to hold several town halls as he seeks re-election, was repeatedly heckled by audience members in Rockland County."
  },
  {
    "title": "Democratic Upset in Deep Red Texas District Rattles Republicans",
    "link": "https://www.nytimes.com/2026/02/01/us/democratic-upset-texas-district-republicans.html",
    "summary": "A Democrat won a state legislative special election in a district that President Trump carried by 17 percentage points, unnerving Republicans in Texas and beyond."
  },
  {
    "title": "Fear and Anger Grow as Thousands Remain Without Power in the South",
    "link": "https://www.nytimes.com/2026/02/01/us/storm-power-outages-tennessee-mississippi-louisiana.html",
    "summary": "More than 30 people have died across three Southern states in connection with last week’s storm, and thousands remain without power."
  },
  {
    "title": "A ‘Historic’ Snowfall Hits the Carolinas",
    "link": "https://www.nytimes.com/2026/02/01/us/snowfall-north-south-carolina.html",
    "summary": "Blanketed beaches. Frozen suburbs. Football fields buried in snow. Everywhere in the region, people felt the storm, which caused two deaths."
  },
  {
    "title": "How a Village in Italy Became a Slice of Caracas",
    "link": "https://www.nytimes.com/2026/02/02/world/americas/italy-marina-di-camerota-venezuela-migrants.html",
    "summary": "Generations of migrants from a village on the coast of southern Italy found a better life in Venezuela. Many came back and turned their town into a mini-Caracas."
  },
  {
    "title": "Physician Assistants Want a New Name and More Power. Not Everyone Is Happy.",
    "link": "https://www.nytimes.com/2026/01/31/upshot/physician-assistants-doctors-role.html",
    "summary": "How increased responsibilities and a push to be called “physician associates” are raising tensions with doctors."
  },
  {
    "title": "Physician Assistants Are Everywhere. Should You See One?",
    "link": "https://www.nytimes.com/2026/01/31/well/physician-assistants-doctors.html",
    "summary": "They wear white coats and do many things a doctor would do — and their numbers are increasing rapidly."
  },
  {
    "title": "My Patient Was Dying. His Wife Would Not Accept It.",
    "link": "https://www.nytimes.com/2026/02/01/opinion/hospital-doctors-difficult-patients.html",
    "summary": "How doctors can better navigate difficult patients and families."
  },
  {
    "title": "Trump Has Overwhelmed Himself",
    "link": "https://www.nytimes.com/2026/02/01/opinion/trump-minneapolis-power-muzzle-velocity.html",
    "summary": "This is a presidency that is, by any measure, failing."
  },
  {
    "title": "Laura Fernández Wins Costa Rican Presidency",
    "link": "https://www.nytimes.com/2026/02/01/world/americas/costa-rica-election-fernandez.html",
    "summary": "Laura Fernández’s victory was driven by a crisis in which Costa Rica’s reputation for peace has been tarred by record-breaking violence."
  },
  {
    "title": "Oscar-Nominated Screenwriter Arrested in Iran for Criticizing Regime",
    "link": "https://www.nytimes.com/2026/02/01/world/middleeast/iran-mehdi-mahmoudian-arrest.html",
    "summary": "Mehdi Mahmoudian, co-writer of “It Was Just an Accident,” was one of several people detained after signing a letter objecting to the crackdown on protests."
  },
  {
    "title": "Man and Dog Found Dead Inside Mobile Veterinary Van in Queens",
    "link": "https://www.nytimes.com/2026/02/01/nyregion/man-dog-dead-van-queens.html",
    "summary": "A second man was found unconscious outside the van. The police are investigating whether the deaths were caused by carbon monoxide from a generator."
  },
  {
    "title": "Hazing Death in Arizona Leads to Charges for 3 Fraternity Leaders",
    "link": "https://www.nytimes.com/2026/02/01/us/arizona-fraternity-members-charges-death.html",
    "summary": "Three 20-year-old students in Delta Tau Delta at Northern Arizona University were arrested on Saturday. The fraternity has been suspended."
  }
]