[
  {
    "title": "Trump to Pardon Juan Orlando Hernández, Honduran Ex-Leader Convicted in Drug Case",
    "link": "https://www.nytimes.com/2025/11/28/world/americas/trump-pardon-honduras-hernandez.html",
    "summary": "Juan Orlando Hernández was accused of receiving millions in bribes and partnering with cocaine traffickers. He was convicted in Manhattan in 2024 and sentenced to 45 years in prison."
  },
  {
    "title": "Northwestern Agrees to Deal With Trump Administration",
    "link": "https://www.nytimes.com/2025/11/28/us/politics/northwestern-deal-trump-administration.html",
    "summary": "The university will pay $75 million to regain its research funding and end investigations, the second highest payment by a school facing pressure from the administration."
  },
  {
    "title": "Trump Spoke by Phone Last Week With Maduro, Venezuela’s Leader",
    "link": "https://www.nytimes.com/2025/11/28/us/politics/trump-spoke-by-phone-last-week-with-maduro-venezuelas-leader.html",
    "summary": "They discussed a possible meeting between the two of them, but nothing has been scheduled, and the administration continues to increase the military pressure on Venezuela."
  },
  {
    "title": "State Department Boosts Resources to Process Business Visas for South Koreans",
    "link": "https://www.nytimes.com/2025/11/29/us/politics/state-dept-south-korea-visas.html",
    "summary": "The Trump administration has been trying to repair the damage from the detention of hundreds of South Koreans in an immigration raid in Georgia."
  },
  {
    "title": "Two West Virginia Communities Bound Together by Grief",
    "link": "https://www.nytimes.com/2025/11/28/us/national-guard-shooting-west-virginia.html",
    "summary": "Red ribbons adorned one city, while blue ribbons hung in another town — all to honor the National Guard members who were attacked in Washington this week."
  },
  {
    "title": "Trump Pauses All Asylum Applications and Halts Visas for Afghans",
    "link": "https://www.nytimes.com/2025/11/28/us/politics/trump-affirmative-asylum.html",
    "summary": "They were the latest restrictive changes to the immigration system after this week’s shooting of two National Guard members."
  },
  {
    "title": "Trump’s Response to Shooting Shows Intensified Anti-Migrant Stance",
    "link": "https://www.nytimes.com/2025/11/28/us/politics/trumps-response-to-shooting-shows-intensified-anti-migrant-stance.html",
    "summary": "The president is furiously demanding limits on migration and attacking ethnic groups as he steps up his efforts to equate immigration with crime and economic distress."
  },
  {
    "title": "‘My Baby Girl Has Passed to Glory,’ Says Father of Guard Soldier Killed in D.C. Shooting",
    "link": "https://www.nytimes.com/2025/11/28/us/politics/dc-shooting-victims-beckstrom-wolfe.html",
    "summary": "Specialist Sarah Beckstrom, who died on Thursday, was not initially excited to go to Washington, but had grown to enjoy the city. Staff Sgt. Andrew Wolfe remained in critical condition on Friday."
  },
  {
    "title": "Officials Had Been Warned for Over a Year Before Hong Kong Fire",
    "link": "https://www.nytimes.com/2025/11/28/world/asia/hong-kong-fire-officials-warned.html",
    "summary": "Residents of Wang Fuk Court apartments had raised concerns about flammable foam panels and scaffold netting, but the government did not take decisive action."
  },
  {
    "title": "A Hong Kong Fire Survivor’s Escape, in His Own Words",
    "link": "https://www.nytimes.com/2025/11/28/world/asia/hong-kong-fire-survivor-escape-story.html",
    "summary": "In his own words, William Li, a resident of the Hong Kong apartment complex that became an inferno, recounted how he and two neighbors survived until help arrived."
  },
  {
    "title": "South Africans Were Promised Job, but Ended Up ‘Going to War’ for Russia",
    "link": "https://www.nytimes.com/2025/11/29/world/africa/south-africa-russia-ukraine-fighters-zuma.html",
    "summary": "The South African government is investigating how more than a dozen men unwittingly ended up on the front line in Russia’s war on Ukraine."
  },
  {
    "title": "Andriy Yermak, Zelensky’s Chief of Staff, Resigns",
    "link": "https://www.nytimes.com/2025/11/28/world/europe/zelensky-yermak-resigns-ukraine-corruption-scandal.html",
    "summary": "Andriy Yermak, President Volodymyr Zelensky’s chief of staff and top peace negotiator, became the highest-ranking casualty of an investigation into a vast kickback scheme."
  },
  {
    "title": "A Different Type of Dementia Is Changing What’s Known About Cognitive Decline",
    "link": "https://www.nytimes.com/2025/11/28/health/late-dementia-alzheimers.html",
    "summary": "On its own, LATE dementia is less severe than Alzheimer’s, but in combination, it makes Alzheimer’s symptoms worse, scientists say."
  },
  {
    "title": "Seattle’s Gas Works Park Seen As A Public Nuisance After a Death",
    "link": "https://www.nytimes.com/2025/11/28/us/politics/gas-works-park-teen-death.html",
    "summary": "For years, architects and design experts have resisted safety changes at Seattle’s Gas Works Park, but after a teenager died there this summer, his parents want it declared a public nuisance."
  },
  {
    "title": "How the Snowbird Ski Resort in Utah Readies the Slopes",
    "link": "https://www.nytimes.com/2025/11/28/travel/snowbird-ski-resort-utah-mountain-preparations.html",
    "summary": "Before skiers and riders and hit the slopes, a team works from dusk to dawn to prepare the mountain. We went behind the scenes to see how they do it."
  },
  {
    "title": "Where Hundreds of Undocumented Migrants Have Died in Custody",
    "link": "https://www.nytimes.com/2025/11/29/world/asia/where-hundreds-of-undocumented-migrants-have-died-in-custody.html",
    "summary": "Malaysia launched a “year of enforcement” in response to a surge in undocumented migrants, many of them from Myanmar. Some faced nightmarish fates."
  },
  {
    "title": "Parts of Southern Ontario Pummeled by Snow Squalls and Heavy Winds",
    "link": "https://www.nytimes.com/2025/11/28/weather/snow-ontario-quebec-forecast.html",
    "summary": "More localized bands of squalls were expected to form, with up to two feet of snow possible in some areas, according to Canada’s forecast agency."
  },
  {
    "title": "Winter Storm in Northern U.S. Expected to Snarl Post-Thanksgiving Travel",
    "link": "https://www.nytimes.com/2025/11/27/weather/winter-storm-thanksgiving-travel.html",
    "summary": "Forecasters say a winter storm could disrupt travel, bringing up to two feet of snow across parts of the Midwest through the holiday weekend."
  },
  {
    "title": "‘Hamnet’ Reimagines Shakespeare for the TikTok Generation",
    "link": "https://www.nytimes.com/2025/11/28/opinion/hamnet-shakespeare-adaptation-fiction.html",
    "summary": "Our love of his plays have led to a centuries-long fascination with the writer. So why does each new fictional iteration get his life so wrong?"
  },
  {
    "title": "Goodbye, Price Tags. Hello Dynamic Pricing.",
    "link": "https://www.nytimes.com/2025/11/28/opinion/dynamic-pricing-algorithms.html",
    "summary": "Shopping has always been a game. And now it’s being rigged against you."
  },
  {
    "title": "Late Rally Pushes Stocks Back Near Record High",
    "link": "https://www.nytimes.com/2025/11/28/business/stock-markets-november-sp500.html",
    "summary": "A midmonth stumble, driven by worries about the frenzy around artificial intelligence, was reversed as investors inched back into stocks this week."
  },
  {
    "title": "Israeli Forces Kill Two Palestinians in West Bank After They Appear to Surrender, Video Shows",
    "link": "https://www.nytimes.com/2025/11/28/world/middleeast/israel-west-bank-shooting-palestinians-video.html",
    "summary": "The Israeli authorities said they were investigating the shooting, which came amid days of extensive military operations in the West Bank."
  },
  {
    "title": "Rebel Nuns Can Live in Old Abbey, if They Give Up Social Media",
    "link": "https://www.nytimes.com/2025/11/28/world/europe/austria-nuns-abbot-escape-senior-home.html",
    "summary": "After the octogenarian nuns refused to return to their senior center, the abbot has finally folded. But he has some conditions."
  }
]