[
  {
    "title": "Rubio Fleshes Out Trump’s Case That Iran Nuclear Capacity Was Eliminated",
    "link": "https://www.nytimes.com/2025/06/25/us/politics/iran-nuclear-program-damage-rubio.html",
    "summary": "Secretary of State Marco Rubio said U.S. strikes had destroyed a facility that is key to producing a nuclear weapon. He railed against a less optimistic U.S. intelligence report."
  },
  {
    "title": "Iran’s Attack on a U.S. Base in Qatar Is a Nightmare Come True for Gulf States",
    "link": "https://www.nytimes.com/2025/06/25/world/middleeast/gulf-states-iran-attack-us-qatar-base.html",
    "summary": "The countries have long worried about being sucked into regional war as they juggle relations with Washington, their security guarantor, while seeking to improve ties with Tehran."
  },
  {
    "title": "Trump’s Name Could Adorn Tel Aviv Hotel, Becoming a Symbol or a Target",
    "link": "https://www.nytimes.com/2025/06/25/us/politics/israel-hotel-trump-destination-target.html",
    "summary": "The Trump Organization’s preliminary talks this spring about affixing its brand to a tower near a recent missile strike highlight the complexities of its international deal-making."
  },
  {
    "title": "A New Political Star Emerges Out of a Fractured Democratic Party",
    "link": "https://www.nytimes.com/2025/06/25/nyregion/democratic-party-zohran-mamdani.html",
    "summary": "The emergence of Zohran Mamdani, a democratic socialist, is likely to divide national Democrats, who are already torn about what the party should stand for."
  },
  {
    "title": "Inside the Global Deal-Making Behind Trump’s Mass Deportations",
    "link": "https://www.nytimes.com/2025/06/25/us/politics/trump-immigrants-deportations.html",
    "summary": "The administration is pushing nations around the world, including ones at war, to take people expelled by the U.S. government who are not citizens of those countries."
  },
  {
    "title": "Rep. LaMonica McIver Pleads Not Guilty to Assault at Migrant Detention Center",
    "link": "https://www.nytimes.com/2025/06/25/nyregion/lamonica-mciver-newark-ice-not-guilty.html",
    "summary": "Representative LaMonica McIver was caught up in an onrush outside a troubled Newark immigration facility where, weeks later, four detainees escaped."
  },
  {
    "title": "NATO Agrees to Boost Military Spending as Trump Praises Allies, but Criticizes Spain",
    "link": "https://www.nytimes.com/2025/06/25/us/politics/nato-gdp-defense-spending-trump.html",
    "summary": "President Trump has pressed allies to spend more on defense. Leaders agreed that “allies” — but not “all allies” — would meet the objective."
  },
  {
    "title": "Trump Says He May Send Additional Patriot Systems to Ukraine",
    "link": "https://www.nytimes.com/2025/06/25/us/politics/trump-ukraine-patriot-missiles-zelensky.html",
    "summary": "The president met with President Volodymyr Zelensky of Ukraine but neither the White House nor Mr. Zelensky offered any details about their encounter."
  },
  {
    "title": "U.K. Says It’s Buying 12 Jets That Can Carry Nuclear Weapons",
    "link": "https://www.nytimes.com/2025/06/25/world/europe/uk-nato-f35-nuclear-jets.html",
    "summary": "The decision means that Britain’s air force will have a nuclear role for the first time since the end of the Cold War."
  },
  {
    "title": "RFK Jr. Accuses Gavi, Global Vaccine Agency, of Ignoring Science",
    "link": "https://www.nytimes.com/2025/06/25/health/kennedy-vaccines-gavi.html",
    "summary": "Robert F. Kennedy Jr. claimed that the agency, Gavi, had “ignored the science” in immunizing children around the world."
  },
  {
    "title": "RFK Jr.’s Handpicked Vaccine Advisers Are Set to Meet for the First Time",
    "link": "https://www.nytimes.com/2025/06/25/health/vaccines-cdc-acip-kennedy.html",
    "summary": "The panel will revisit the hepatitis B shot given at birth, among others. The former head of an anti-vaccine group has been hired as a special employee at H.H.S."
  },
  {
    "title": "Online and IRL, Trump Offers a Window Into His Psyche",
    "link": "https://www.nytimes.com/2025/06/24/us/politics/online-trump-transparency-complications.html",
    "summary": "Other countries used to need spies to discern the thinking of American presidents. Now they just need a Truth Social account."
  },
  {
    "title": "Inside a Last-Ditch Battle to Save (or Kill) Clean-Energy Tax Credits",
    "link": "https://www.nytimes.com/2025/06/25/climate/trump-bill-clean-energy-tax-credits.html",
    "summary": "Supporters of tax breaks for wind and solar are fighting to retain them in the G.O.P. tax bill. They’re facing a conservative effort to kill them entirely."
  },
  {
    "title": "Why Did the Novel-Reading Man Disappear?",
    "link": "https://www.nytimes.com/2025/06/25/style/fiction-books-men-reading.html",
    "summary": "Men are leaving fiction reading behind. Some people want to change that."
  },
  {
    "title": "Usha Vance’s New Life in Trump’s Washington",
    "link": "https://www.nytimes.com/2025/06/25/us/politics/usha-vance.html",
    "summary": "Old friends are bewildered by the turn taken by the second lady, a onetime Democrat and former litigator for a San Francisco firm. Others say she’s happy in the role."
  },
  {
    "title": "The Weapon That Terrorizes Ukrainians by Night",
    "link": "https://www.nytimes.com/2025/06/25/magazine/ukraine-russia-war-drone-shahed-iran.html",
    "summary": "How Russia’s terrifying long-range drone program has brought about a deadly new phase in the war."
  },
  {
    "title": "In Alabama, a Social Media Influencer Really Gets Wild",
    "link": "https://www.nytimes.com/2025/06/24/climate/alabama-influencer-native-plants.html",
    "summary": "Kyle Lybarger built a loyal following online by talking about native plants and why biodiversity matters."
  },
  {
    "title": "Video Shows Engine Sparks as Plane Returns to Las Vegas Airport Just After Takeoff",
    "link": "https://www.nytimes.com/2025/06/25/us/american-airlines-flight-engine-issue.html",
    "summary": "The crew of an American Airlines flight from Las Vegas to Charlotte, N.C., reported an engine issue."
  },
  {
    "title": "With Bezos Wedding, Venice Braces for Love in the Time of Tech Billionaires",
    "link": "https://www.nytimes.com/2025/06/25/world/europe/venice-jeff-bezos-lauren-sanchez-wedding.html",
    "summary": "The celebration of Jeff Bezos and Lauren Sánchez has divided a city that centuries ago set the standard for opulence."
  },
  {
    "title": "ICE Will See You Now",
    "link": "https://www.nytimes.com/2025/06/25/opinion/trump-ice-arrests-los-angeles.html",
    "summary": "It won’t be easy to get rid of authoritarian habits of mind."
  },
  {
    "title": "Times Readers Open Up About the Real Cost of Motherhood",
    "link": "https://www.nytimes.com/2025/06/25/opinion/motherhood-penalty-career.html",
    "summary": "What’s the real cost of motherhood? Here’s what our readers said."
  },
  {
    "title": "A Primary and a Heat Wave",
    "link": "https://www.nytimes.com/2025/06/25/briefing/a-primary-and-a-heat-wave.html",
    "summary": "We’re covering the upset in New York City and the weather."
  },
  {
    "title": "Late Night Is Taken Aback by Trump’s Potty Mouth",
    "link": "https://www.nytimes.com/2025/06/25/arts/television/late-night-trump-profanity.html",
    "summary": "Seth Meyers said that even with “zero standards of expectations for Trump,” he was shocked to see the president use profanity on the White House lawn."
  },
  {
    "title": "Extreme Heat Continues for Many on Wednesday, but Relief Is Near",
    "link": "https://www.nytimes.com/2025/06/25/weather/us-heat-wave-forecast-wednesday.html",
    "summary": "After days of record-breaking heat, some cooling is expected in the Eastern United States starting Thursday."
  },
  {
    "title": "U.S. Textile Makers, Feeling Forgotten by Trump, Hope Boom Days Are Ahead",
    "link": "https://www.nytimes.com/2025/06/25/business/textile-manufacturing-trump-tariffs.html",
    "summary": "The Trump administration faces hard choices in determining what industries to protect as it uses tariffs to construct an industrial policy."
  },
  {
    "title": "The Washington Post Will Ask Some Sources to Annotate Its Stories",
    "link": "https://www.nytimes.com/2025/06/25/business/washington-post-annotations-comments.html",
    "summary": "The program, called From the Source, will start with articles from the publication’s climate team. It could provide readers with more viewpoints but would also require moderation and vetting."
  },
  {
    "title": "Taco Trucks Feed Workers After the Palisades Fire",
    "link": "https://www.nytimes.com/2025/06/25/dining/taco-trucks-palisades-fires-california.html",
    "summary": "A huddle of trucks has become the most reliable place for cleanup crews and contractors to find lunch."
  }
]