[
  {
    "title": "Trump’s Search for Powell’s Replacement Adds to Cacophony Around Interest Rate Decision",
    "link": "https://www.nytimes.com/2025/12/10/business/fed-chair-powell-trump-replacement.html",
    "summary": "The end of Jerome Powell’s term as Fed chair will give President Trump his biggest opportunity yet to reshape the central bank."
  },
  {
    "title": "Republicans Are Fighting With One Another in Deep-Red Indiana. Here’s Why.",
    "link": "https://www.nytimes.com/2025/12/10/us/indiana-redistricting-trump-republicans.html",
    "summary": "Some Republicans in the Indiana Senate have resisted a new congressional map despite lobbying from the White House and threats of political consequences."
  },
  {
    "title": "Democrats Make a Fresh Push to Win State Legislatures",
    "link": "https://www.nytimes.com/2025/12/10/us/politics/democrats-state-legislatures.html",
    "summary": "The arm of the party that focuses on statehouses is targeting hundreds of seats and more than 40 chambers, according to a strategy memo, reflecting Democrats’ new optimism."
  },
  {
    "title": "Democrats Press to Expand House Map, Targeting 5 New G.O.P. Seats",
    "link": "https://www.nytimes.com/2025/12/10/us/politics/democrats-target-5-new-house-seats.html",
    "summary": "Four of the additions are for districts where President Trump won handily, but Democrats are feeling emboldened by election outcomes this fall."
  },
  {
    "title": "Inside the Pentagon’s Scramble to Deal With Boat Strike Survivors",
    "link": "https://www.nytimes.com/2025/12/09/us/politics/pentagon-boat-strike-survivors.html",
    "summary": "Officials initially weighed sending survivors of U.S. attacks on boats suspected of drug smuggling to a notorious prison in El Salvador, to keep them away from American courts."
  },
  {
    "title": "A History of U.S. Military Action in Latin America",
    "link": "https://www.nytimes.com/2025/12/09/us/politics/military-history-latin-america-strikes.html",
    "summary": "The United States’ history in the region includes several about-faces, contradictions and missteps."
  },
  {
    "title": "Venezuela’s Nobel Peace Prize Winner Says She Will Appear in Oslo After Missing Ceremony",
    "link": "https://www.nytimes.com/2025/12/10/world/europe/machado-nobel-venezuela-ceremony.html",
    "summary": "María Corina Machado, the Venezuelan opposition leader, said she was on her way to Norway after living in hiding in her country, where officials have threatened her with arrest."
  },
  {
    "title": "Trump Administration Rules Threaten Nobel Prizes Won by Immigrants",
    "link": "https://www.nytimes.com/2025/12/10/science/nobel-prize-immigrants-science.html",
    "summary": "As three immigrants claim Nobel Prizes in science for the United States this year, experts warn that immigration crackdowns could undo American innovation."
  },
  {
    "title": "Judi Jupiter, a 76-Year-Old Social Media Star, Is Gen Z at Heart",
    "link": "https://www.nytimes.com/2025/12/10/style/judi-jupiter-gen-z-photographer.html",
    "summary": "In the 1970s, she photographed Andy Warhol and Debbie Harry on wild nights at Studio 54. Now she’s chronicling a new generation."
  },
  {
    "title": "Judge Grants Request to Unseal Jeffrey Epstein Grand Jury Records",
    "link": "https://www.nytimes.com/2025/12/10/nyregion/jeffrey-epstein-grand-jury-unsealed.html",
    "summary": "The ruling could lead to the most expansive look yet at the federal investigation of the convicted sex offender Jeffrey Epstein."
  },
  {
    "title": "Netflix and Paramount Battle for Warner Bros. — Have We Seen This Show Before?",
    "link": "https://www.nytimes.com/2025/12/09/business/media/netflix-paramount-warner-bros-barry-diller.html",
    "summary": "The tug of war for Warner Bros. Discovery echoes an earlier clash of media titans."
  },
  {
    "title": "Trump’s Interest in Warner Bros. Deal Weighs On Justice Department",
    "link": "https://www.nytimes.com/2025/12/10/technology/warner-bros-deal-justice-department-gail-slater.html",
    "summary": "President Trump’s unusual decision to involve himself in the government’s review of the deal puts his antitrust chief in an awkward position."
  },
  {
    "title": "Tony Dokoupil Is Named Anchor of ‘CBS Evening News’",
    "link": "https://www.nytimes.com/2025/12/10/business/tony-dokoupil-cbs-evening-news.html",
    "summary": "He replaces John Dickerson and Maurice DuBois in one of the most high-profile decisions of Bari Weiss’s early tenure as the network’s editor in chief."
  },
  {
    "title": "The Conservative Overhaul of the University of Texas Is Underway",
    "link": "https://www.nytimes.com/2025/12/10/us/university-of-texas-republicans-academic-freedom-faculty.html",
    "summary": "The school has been brought to heel by conservative critics of higher education. It is part of a broader transformation at the state’s universities."
  },
  {
    "title": "The Challenges to Europe’s Security Go Beyond Trump’s Lack of Support",
    "link": "https://www.nytimes.com/2025/12/10/world/europe/europe-security-russia-us.html",
    "summary": "Europeans find themselves stranded between hostile powers, Russia and the United States, with key decisions looming over the future of Ukraine."
  },
  {
    "title": "This Arkansas City Shows How to Slash Emissions and Save Money, Too",
    "link": "https://www.nytimes.com/2025/12/09/climate/fayetteville-arkansas-climate-plan.html",
    "summary": "In the Ozarks, the growing college town of Fayetteville, Ark., is using clean energy to power city facilities and embracing nature-based solutions to climate threats."
  },
  {
    "title": "16 Best Theater Moments of 2025",
    "link": "https://www.nytimes.com/2025/12/10/theater/best-theater-moments-broadway-2025.html",
    "summary": "Lea Michele’s star turn in “Chess.” Kara Young as an 8-year-old. A 12-minute monologue delivered from a cloud. These are our favorite scenes from this year."
  },
  {
    "title": "Sophie Kinsella, ‘Confessions of a Shopaholic’ Author, Dies at 55",
    "link": "https://www.nytimes.com/2025/12/10/books/sophie-kinsella-dead-madeleine-wickham.html",
    "summary": "Writing under a pseudonym, Madeleine Wickham cultivated an international following for her series centered on a young woman addicted to shopping."
  },
  {
    "title": "She Was Diagnosed With Brain Cancer, Then Wrote a Rom-Com About It",
    "link": "https://www.nytimes.com/2024/10/03/books/what-does-it-feel-like-sophie-kinsella.html",
    "summary": "Sophie Kinsella, the author of “Confessions of a Shopaholic,” packs love, laughter and a harrowing real-life health ordeal into a 133-page novella."
  },
  {
    "title": "M. Gessen and Michelle Goldberg on How to Resist",
    "link": "https://www.nytimes.com/2025/12/09/opinion/resisting-unethical-politics.html",
    "summary": "Through their reporting, the columnists share how regular citizens stand up to governments they oppose."
  },
  {
    "title": "50 States, 50 Fixes",
    "link": "https://www.nytimes.com/2025/12/10/briefing/50-states-50-fixes.html",
    "summary": "We look at climate solutions across the country."
  },
  {
    "title": "Does the Job of C.E.O. or Private Investor Come First? Intel’s Chief Is Juggling That Question.",
    "link": "https://www.nytimes.com/2025/12/10/technology/lip-bu-tan-intel-ceo-investor.html",
    "summary": "Lip-Bu Tan, who was appointed chief executive of Intel in March, is also a longtime venture capitalist. His dual roles have caused some consternation."
  },
  {
    "title": "A New Governor Inherits a Misconduct Investigation Into the State Police",
    "link": "https://www.nytimes.com/2025/12/10/nyregion/mikie-sherrill-new-jersey-state-police-investigation.html",
    "summary": "A prolonged slowdown in traffic enforcement by New Jersey troopers coincided with an uptick in fatal crashes. The pattern remains under investigation as Mikie Sherrill prepares to take office."
  },
  {
    "title": "Meta’s New A.I. Superstars Are Chafing Against the Rest of the Company",
    "link": "https://www.nytimes.com/2025/12/10/technology/meta-ai-tbd-lab-friction.html",
    "summary": "An us-versus-them mentality has emerged between Meta’s top artificial intelligence team and longtime lieutenants to Mark Zuckerberg."
  },
  {
    "title": "A Cinnabon Worker Was Fired for a Racist Slur. Her Supporters Have Raised $130,000.",
    "link": "https://www.nytimes.com/2025/12/10/us/cinnabon-fired-worker-video-racial-slur.html",
    "summary": "On a video that went viral, the worker, who is white, can be seen calling two Black customers an epithet. The campaign to give her money echoes the reaction to a similar incident this year."
  }
]