[
  {
    "title": "Iran Plans to Execute Erfan Soltani as Trump Threatens ‘Strong Action’",
    "link": "https://www.nytimes.com/2026/01/14/world/middleeast/iran-protests-soltani-execution-trump.html",
    "summary": "Rights groups and relatives said Iran planned to put an antigovernment protester to death for the first time during the latest wave of unrest in the country."
  },
  {
    "title": "U.S. Moves Some Personnel From Qatar Air Base as Trump Weighs Military Response to Iran",
    "link": "https://www.nytimes.com/2026/01/14/us/politics/us-base-qatar-iran.html",
    "summary": "Nonessential personnel are being removed from Udeid Air Base in Qatar, the main U.S. air operations hub in the region, as President Trump weighs a military response to Iran’s crackdown on protests."
  },
  {
    "title": "Iran’s Leaders May Survive Protests. But Anger Will Likely Persist.",
    "link": "https://www.nytimes.com/2026/01/14/world/middleeast/iran-protests-government.html",
    "summary": "Its security forces have brutally defended the Islamic Republic, but the protests show that many Iranians consider it stagnant and ideologically hollow."
  },
  {
    "title": "Why Greenland Matters for a Warming World",
    "link": "https://www.nytimes.com/2026/01/14/world/europe/greenland-climate.html",
    "summary": "The fate of the world’s largest island has outsize importance for billions of people on the planet, because as the climate warms, Greenland is losing ice. That has consequences."
  },
  {
    "title": "‘We’re Not Stupid’: What Greenlanders Would Say to Trump",
    "link": "https://www.nytimes.com/2026/01/14/world/americas/greenland-fear-trump-us-takeover.html",
    "summary": "A visit to Greenland reveals a swirl of feelings as people nervously await talks with the Trump administration about the island’s future."
  },
  {
    "title": "Trump’s Threats to Greenland Raise Serious Questions for NATO",
    "link": "https://www.nytimes.com/2026/01/14/world/europe/trump-greenland-nato.html",
    "summary": "The treaty that created NATO did not contemplate an attack by one ally on another. A seizure of Greenland by President Trump would test the endurance of the mutual-defense pact."
  },
  {
    "title": "How ICE Crackdowns Set Off a Resistance in American Cities",
    "link": "https://www.nytimes.com/2026/01/14/us/ice-protests-activism.html",
    "summary": "In Minneapolis and other cities where federal agents have led immigration crackdowns, residents have formed loose networks to track and protest them."
  },
  {
    "title": "ICE Arrested Dozens of Refugees in Minnesota and Sent Them to Texas, Lawyers Say",
    "link": "https://www.nytimes.com/2026/01/13/us/ice-arrests-refugees-minnesota.html",
    "summary": "The refugees, many of them from Somalia, had passed security screenings before coming to the United States. The Trump administration has vowed to “re-examine thousands of refugee cases.”"
  },
  {
    "title": "F.B.I. Searches Home of Washington Post Journalist in a Leak Investigation",
    "link": "https://www.nytimes.com/2026/01/14/us/politics/fbi-washington-post-journalist.html",
    "summary": "It is exceedingly rare, even in investigations of the unauthorized disclosure of classified information, for federal agents to search a reporter’s home."
  },
  {
    "title": "Initial Review Finds No Widespread Illegal Voting by Migrants, Puncturing a Trump Claim",
    "link": "https://www.nytimes.com/2026/01/14/us/politics/noncitizen-voters-save-tool.html",
    "summary": "Republican election officials welcome the review, which relies on a federal verification tool, but they say they have not discovered a major problem when it comes to noncitizen voters."
  },
  {
    "title": "An Emboldened Trump Makes Big Bets in Venezuela, Iran and Beyond",
    "link": "https://www.nytimes.com/2026/01/14/us/politics/trump-venezuela-iran-greenland.html",
    "summary": "President Trump has left himself plenty of room for maximal intervention. But there are a host of potential wild cards, each with risks for the president."
  },
  {
    "title": "Supreme Court Sides With Conservative Congressman in Illinois Election Rules Challenge",
    "link": "https://www.nytimes.com/2026/01/14/us/politics/supreme-court-illinois-mail-ballot-rules.html",
    "summary": "The question in the case was not a mail-in ballot rule itself but whether political candidates have the right to challenge the rules governing the vote count in their election."
  },
  {
    "title": "Jodie Foster: An American Oscar-Winner in Paris",
    "link": "https://www.nytimes.com/2026/01/14/movies/jodie-foster-interview-a-private-life.html",
    "summary": "In “A Private Life,” the actress takes on her first solo lead role in which she speaks fluent French, but her French connection goes all the way back to childhood."
  },
  {
    "title": "U.S. Refiners to Profit as Trump Asserts Control Over Venezuelan Oil",
    "link": "https://www.nytimes.com/2026/01/14/business/energy-environment/refineries-trump-venezuela-oil.html",
    "summary": "The companies that turn oil into gasoline and diesel are likely to benefit more, right away, than the businesses that pump oil out of the ground."
  },
  {
    "title": "Venezuela Envoy to Visit U.S. for First Official Trip in Years",
    "link": "https://www.nytimes.com/2026/01/14/world/americas/venezuela-diplomat-us-visit-washington.html",
    "summary": "Félix Plasencia, an envoy of the interim government, will travel to the United States on the day the opposition leader María Corina Machado is to meet President Trump."
  },
  {
    "title": "Venezuela Announced the Release of Political Prisoners. Families Are Still Waiting.",
    "link": "https://www.nytimes.com/2026/01/14/world/americas/venezuela-politicial-prisoners-release.html",
    "summary": "Hundreds of families are hoping their loved ones will be freed by the Venezuelan government, which has said little about who would be released or when."
  },
  {
    "title": "Can the American Oboe Sing Again?",
    "link": "https://www.nytimes.com/2026/01/14/arts/music/oboe-laubin-jim-phelan.html",
    "summary": "Building the instrument is hard enough. Turning a profit is a killer. But Jim Phelan is bent on reviving one of the great names in classical music."
  },
  {
    "title": "Tony Dokoupil’s Road Trip on CBS News Hits a Rough Patch",
    "link": "https://www.nytimes.com/2026/01/14/arts/television/cbs-news-tony-dokoupil.html",
    "summary": "A stretch of big news revealed growing pains for CBS’s new evening anchor and problems with its Bari Weiss-era philosophy."
  },
  {
    "title": "Where Did All the American-Born Roofers Go?",
    "link": "https://www.nytimes.com/2026/01/14/upshot/home-construction-roofers-immigration.html",
    "summary": "The real story of how immigrant labor came to define the construction industry."
  },
  {
    "title": "Chuck Schumer Calls His Shot",
    "link": "https://www.nytimes.com/2026/01/14/us/politics/chuck-schumer-senate-map-democrats.html",
    "summary": "After securing strong recruits on a tough Senate map, the Democratic leader is not only predicting an upset 2026 victory, but also naming the states he thinks his party can flip."
  },
  {
    "title": "Trial to Begin for N.Y.P.D. Sergeant Who Threw Cooler at Fleeing Man",
    "link": "https://www.nytimes.com/2026/01/14/nyregion/erik-duran-eric-duprey-cooler.html",
    "summary": "Erik Duran, who fatally struck the man, Eric Duprey, as he fled on a motorbike in 2023, faces charges of manslaughter, assault and criminally negligent homicide."
  },
  {
    "title": "Harper Lee Expanded on Her View of the South in Letters to a Friend",
    "link": "https://www.nytimes.com/2026/01/14/arts/harper-lee-letters-opinions-civil-rights-movement.html",
    "summary": "In decades of correspondence, the author gave her friend, JoBeth McDaniel, a mix of opinions, advice on writing and insight into the impact of the Civil Rights movement."
  },
  {
    "title": "Mary Peltola Puts Alaska in Play for Democrats",
    "link": "https://www.nytimes.com/2026/01/14/opinion/politics/alaska-mary-peltola-senate.html",
    "summary": "Mary Peltola’s entry into the Alaska Senate race is a building block in an electoral strategy Democrats have been working on for months."
  },
  {
    "title": "Minneapolis’s Limit",
    "link": "https://www.nytimes.com/2026/01/14/briefing/minneapolis-limit.html",
    "summary": "We look at how the actions of federal agents in Minneapolis are impacting life in the city."
  },
  {
    "title": "Do You Have Questions About the New Dietary Guidelines?",
    "link": "https://www.nytimes.com/2026/01/13/well/eat/dietary-guidelines-questions.html",
    "summary": "We want to help you understand the changes."
  },
  {
    "title": "Lung Cancer Stigma Keeps People From Care",
    "link": "https://www.nytimes.com/2026/01/14/well/lung-cancer-stigma.html",
    "summary": "The disease is the rare cancer met with accusations, not sympathy."
  },
  {
    "title": "Jim McBride Dies at 78; Brought Honky-Tonk Back to Country Music",
    "link": "https://www.nytimes.com/2026/01/14/arts/music/jim-mcbride-dead.html",
    "summary": "He was best known for his long-running collaboration with Alan Jackson and their signature hit, “Chattahoochee.”"
  },
  {
    "title": "Banks Ready Battle Plans to Save Their Credit Card Businesses",
    "link": "https://www.nytimes.com/2026/01/14/business/dealbook/banks-credit-cards-trump.html",
    "summary": "“Everything’s on the table,” an executive at JPMorgan Chase said, as the industry seeks to head off President Trump’s effort to cap interest rates."
  },
  {
    "title": "The Swedish Start-Up Aiming to Conquer America’s Full-Body-Scan Craze",
    "link": "https://www.nytimes.com/2026/01/14/business/dealbook/neko-health-expansion.html",
    "summary": "Neko Health, backed by the Spotify founder Daniel Ek, plans to open in New York this spring."
  }
]