[
  {
    "title": "Trump Escalates Tensions With European Allies With Greenland and Gaza Efforts",
    "link": "https://www.nytimes.com/2026/01/20/us/politics/trump-europe-tensions-greenland.html",
    "summary": "President Trump’s bellicose demands about Greenland and participation in his “board of peace” are deepening worries about the fate of the trans-Atlantic alliance."
  },
  {
    "title": "Stocks Post Biggest Drop in Months as Tensions Over Greenland Mount",
    "link": "https://www.nytimes.com/2026/01/20/business/stocks-trump-greenland-tariffs.html",
    "summary": "The S&amp;P 500 dropped over 2 percent on Tuesday, its biggest decline since October."
  },
  {
    "title": "Some Republicans Begin to Echo Trump’s Case to Acquire Greenland",
    "link": "https://www.nytimes.com/2026/01/20/us/politics/republicans-trump-greenland.html",
    "summary": "While the party remains split as President Trump presses to “take” Greenland, some in his party are publicly embracing his reasoning for wanting to control the territory."
  },
  {
    "title": "C.I.A.’s New Focus on Latin America Reflected in Raid to Seize Maduro",
    "link": "https://www.nytimes.com/2026/01/20/us/politics/cia-operation-venezuela.html",
    "summary": "A senior U.S. official declined to confirm the specific operations in Venezuela, but said a covert team provided real-time support for the military."
  },
  {
    "title": "Comer Rejects Clinton Interview on Epstein, Setting Up Contempt Vote",
    "link": "https://www.nytimes.com/2026/01/20/us/politics/comer-clinton-interview-epstein.html",
    "summary": "The Republican chairman of the Oversight Committee refused an offer to interview the former president under oath, rejecting terms he said were unreasonable."
  },
  {
    "title": "University of Pennsylvania Rebukes Trump Administration for Demanding Information About Jewish Staff",
    "link": "https://www.nytimes.com/2026/01/20/us/university-of-pennsylvania-trump-jewish-staff.html",
    "summary": "The federal government has sued the University of Pennsylvania for information on its Jewish employees. The university said the request recalls a “frightening” history."
  },
  {
    "title": "California Republicans Ask Supreme Court to Block New Congressional Map",
    "link": "https://www.nytimes.com/2026/01/20/us/politics/california-supreme-court-congressional-map.html",
    "summary": "Republicans asked the justices to step in after a federal court rejected their claims that the state’s new congressional map violated the Constitution."
  },
  {
    "title": "Trump’s First Year Could Have Lasting Economic Consequences",
    "link": "https://www.nytimes.com/2026/01/20/business/trump-first-year-economy.html",
    "summary": "President Trump’s policies have so far done little to change the overall state of the American economy, but economists warn they will ultimately weaken the United States."
  },
  {
    "title": "One Year In, Searching for a Strategy Behind Trump’s Unpredictability",
    "link": "https://www.nytimes.com/2026/01/20/us/politics/trump-one-year-unpredicatability.html",
    "summary": "One great truth of Trump II so far is that nobody has any idea what tomorrow holds."
  },
  {
    "title": "Scientists Set Up Camp on Thwaites Glacier in Antarctica",
    "link": "https://www.nytimes.com/2026/01/20/climate/antarctica-camping-thwaites-glacier.html",
    "summary": "Low clouds have lifted long enough for helicopters to ferry scientists and their gear to a fast-melting glacier on the edge of Antarctica."
  },
  {
    "title": "Despite Drastic Financial Steps, Met Opera Turns to Layoffs and Cuts",
    "link": "https://www.nytimes.com/2026/01/20/arts/music/met-opera-budget-cuts.html",
    "summary": "The largest performing arts organization in the country will lay off workers, cut salaries and reduce its offerings. It may also sell its Chagall murals that are valued at $55 million."
  },
  {
    "title": "Photographer Discovers Train Part That Could Hold Key to Spain Train Crash",
    "link": "https://www.nytimes.com/2026/01/20/world/europe/spain-missing-part-undercarriage-key-investigation.html",
    "summary": "Officials said they had located a previously unreported train undercarriage near the site of a deadly train crash in Spain. Experts said the finding could help investigators."
  },
  {
    "title": "Another Train Crash in Spain Kills 1 and Hurts 37, Officials Say",
    "link": "https://www.nytimes.com/2026/01/20/world/europe/train-crash-catalonia-spain.html",
    "summary": "Train service in the Catalonia region will be suspended until it is safe to resume rail traffic, the local operator said."
  },
  {
    "title": "Mississippi Temple Says There Is More to Its Story Than Facing Hate",
    "link": "https://www.nytimes.com/2026/01/20/us/mississippi-beth-israel-temple-judaism.html",
    "summary": "An arson attack at a synagogue in Mississippi was a reminder of the threat Jews face, but also of the strength of a small community forged over generations."
  },
  {
    "title": "Prosecutors Subpoena Minnesota Democrats as Part of Federal Inquiry",
    "link": "https://www.nytimes.com/2026/01/20/us/politics/subpoena-minnesota-democrats-immigration.html",
    "summary": "The move is a significant expansion of the Justice Department’s investigation into the state’s leaders, including Gov. Tim Walz and Mayor Jacob Frey of Minneapolis."
  },
  {
    "title": "Minnesota Police Leaders Criticize Federal Tactics in ICE Surge",
    "link": "https://www.nytimes.com/2026/01/20/us/ice-minnesota-police-axel-henry.html",
    "summary": "Gregory Bovino, a senior Border Patrol official, said agents were operating lawfully and were “focused on individuals who pose a serious threat to this community.”"
  },
  {
    "title": "We’re Still Talking About Bernie Goetz After All These Years",
    "link": "https://www.nytimes.com/2026/01/20/books/review/bernie-goetz-subway-heather-ann-thompson-elliot-williams.html",
    "summary": "Two new books return to the ’80s-era saga of Bernie Goetz to consider the 21st-century intersections of race, crime and sensationalism."
  },
  {
    "title": "Valentino Defined the Way ‘Rich’ Once Looked",
    "link": "https://www.nytimes.com/2026/01/20/style/valentino-designer-fashion-era.html",
    "summary": "The death of the designer Valentino marks the end of an era, not just in fashion but in dressing the part."
  },
  {
    "title": "With Greenland, Trumpism Is Doomed Without Restraint",
    "link": "https://www.nytimes.com/2026/01/20/opinion/greenland-trump.html",
    "summary": "The president needs counterforces to save him from himself."
  },
  {
    "title": "Trump Mocks European Leaders Before Meeting With Them",
    "link": "https://www.nytimes.com/2026/01/20/briefing/trump-europe-leaders-davos-spain-train-crash.html",
    "summary": "Also, fewer people are jumping off the Golden Gate Bridge. Here’s the latest at the end of Tuesday."
  },
  {
    "title": "Tips for Cooking With New Scaled Recipes on NYT Cooking",
    "link": "https://cooking.nytimes.com/article/nyt-cooking-scaled-recipes",
    "summary": "NYT Cooking’s new automatic feature can instantly scale a recipe up or down — follow these tips (and your instincts) to make the most of it."
  },
  {
    "title": "Los Angeles School Desegregation Policy Hurts White Students, Lawsuit Says",
    "link": "https://www.nytimes.com/2026/01/20/us/los-angeles-schools-desegregation-lawsuit.html",
    "summary": "Schools with more white children miss out on smaller class sizes and other benefits, the lawsuit says. The policy dates back to desegregation efforts in the 1970s."
  },
  {
    "title": "Forecasters Warn of a Major Storm Brewing for the South",
    "link": "https://www.nytimes.com/2026/01/20/weather/winter-cold-ice-snow-forecast-storm.html",
    "summary": "One meteorologist warns that “the main ingredients” are fitting into place for a disruptive winter storm later this week."
  },
  {
    "title": "On Day 1, Mikie Sherrill Focuses on Utility Costs and Children’s Safety",
    "link": "https://www.nytimes.com/2026/01/20/nyregion/mikie-sherrill-executive-orders-new-jersey.html",
    "summary": "The new governor of New Jersey signed six executive orders after taking office on Tuesday. They matched the priorities she campaigned on last year."
  }
]