[
  {
    "title": "How Trump Decided to Strike Iran",
    "link": "https://www.nytimes.com/2025/06/22/us/politics/trump-iran-decision-strikes.html",
    "summary": "When Israel began its assault on Iran, President Trump kept his distance. But within days he was on a path that led to an extensive bombing mission aided by political and military ruses."
  },
  {
    "title": "Trump’s Risky Gamble on Attacking Iran",
    "link": "https://www.nytimes.com/video/us/politics/100000010243288/trumps-risky-gamble-on-attacking-iran.html",
    "summary": "With his strikes on Iran, President Trump is betting that the United States can repel any retaliation, and that the U.S. has destroyed the regime’s chances of reconstituting Iran’s nuclear program. David Sanger, the White House and national security correspondent for The New York Times, explains the risk."
  },
  {
    "title": "Officials Concede They Don’t Know the Fate of Iran’s Uranium Stockpile",
    "link": "https://www.nytimes.com/2025/06/22/us/politics/iran-uranium-stockpile-whereabouts.html",
    "summary": "Both Vice President JD Vance and Rafael Grossi, the head of the International Atomic Energy Agency, acknowledged questions about the whereabouts of Iran’s stockpile of near-bomb-grade nuclear material."
  },
  {
    "title": "Missteps, Confusion and ‘Viral Waste’: The 14 Days That Doomed U.S.A.I.D.",
    "link": "https://www.nytimes.com/2025/06/22/us/politics/usaid-cuts-doge.html",
    "summary": "The rapid dismantling of the global aid agency remains one of the most consequential outcomes of President Trump’s efforts to overhaul the federal government, showing his willingness to tear down institutions in defiance of the courts."
  },
  {
    "title": "G.O.P. Can’t Include Limits on Trump Lawsuits in Megabill, Senate Parliamentarian Rules",
    "link": "https://www.nytimes.com/2025/06/22/us/politics/republicans-trump-lawsuits-senate-parliamentarian.html",
    "summary": "The Senate parliamentarian rejected a measure in Republicans’ domestic policy bill that could limit lawsuits seeking to block presidential orders."
  },
  {
    "title": "Mahmoud Khalil Discusses 3-Month Detention in First Interview Since Release",
    "link": "https://www.nytimes.com/2025/06/22/nyregion/mahmoud-khalil-interview-trump.html",
    "summary": "The Columbia graduate and pro-Palestinian activist returned to New York after more than three months in detention. The Trump administration is seeking to deport him."
  },
  {
    "title": "Judge Orders Abrego Garcia Released on Smuggling Charges Before Trial",
    "link": "https://www.nytimes.com/2025/06/22/us/politics/abrego-garcia-bail-smuggling-charges.html",
    "summary": "The order to release Kilmar Armando Abrego Garcia from criminal custody as he awaits trial was a rebuke to the Trump administration. But he is likely to remain in immigration custody."
  },
  {
    "title": "3 Dead in Central New York After Severe Storms Lash the Area",
    "link": "https://www.nytimes.com/2025/06/22/nyregion/ny-storm-flood-deaths.html",
    "summary": "Three people, including 6-year-old sisters, were killed after trees fell on homes during severe weather that struck early on Sunday, officials said."
  },
  {
    "title": "Dangerous Heat Wave Expands Over Central and Eastern United States",
    "link": "https://www.nytimes.com/2025/06/22/weather/heat-wave-temperatures.html",
    "summary": "A multiday heat wave is bringing high temperatures and health risks from the Midwest to the Northeast, prompting warnings and emergency measures."
  },
  {
    "title": "Revisiting the Hunt: First-Time Buyers Share What Went Wrong and Right",
    "link": "https://www.nytimes.com/2025/06/21/realestate/the-hunt-first-time-homeowners.html",
    "summary": "Being a new homeowner comes with a steep learning curve, especially in New York City."
  },
  {
    "title": "Palm Beach, Never Richer, Is a Draw for Young MAGA. Locals Aren’t Pleased.",
    "link": "https://www.nytimes.com/2025/06/22/business/palm-beach-trump-maga.html",
    "summary": "Donald Trump’s presidency has turned this Florida island into the nightlife headquarters of MAGA, but the town’s old guard — much of it Republican — doesn’t love the new vibe."
  },
  {
    "title": "Bill Clinton Endorses Andrew Cuomo for NYC Mayor",
    "link": "https://www.nytimes.com/2025/06/22/nyregion/bill-clinton-endorse-cuomo-mayor.html",
    "summary": "The former president’s endorsement came as Letitia James, the state attorney general who supports Andrew M. Cuomo’s mayoral rivals, criticized the former governor over harassment allegations."
  },
  {
    "title": "An Actor, a Bookseller and a Chef Walk Into a Voting Booth",
    "link": "https://www.nytimes.com/2025/06/22/nyregion/celebrity-ballots-mayor-nyc.html",
    "summary": "We asked scores of well-known New Yorkers from a broad spectrum of the city to give us their ranked-choice ballots for mayor. Here’s what some told us."
  },
  {
    "title": "How the Attacks on Iran Are Part of a Much Bigger Global Struggle",
    "link": "https://www.nytimes.com/2025/06/22/opinion/iran-israel-attack-global-struggle.html",
    "summary": "Putin and the ayatollahs want the same kind of world."
  },
  {
    "title": "How Iran Might Strike Back",
    "link": "https://www.nytimes.com/2025/06/22/opinion/iran-nuclear-strike-israel-war.html",
    "summary": "Among the most likely options are asymmetric or terrorist attacks, although the time frame is impossible to gauge."
  },
  {
    "title": "Syria Church Bombing Kills at Least 20 in Damascus",
    "link": "https://www.nytimes.com/2025/06/22/world/middleeast/damascus-church-bombing.html",
    "summary": "The attack on a Greek Orthodox service made clear the challenges facing Syria’s new government in a country long pitted by sectarian divides."
  },
  {
    "title": "Vera Rubin Scientists Reveal Telescope’s First Images",
    "link": "https://www.nytimes.com/2025/06/23/science/vera-rubin-scientists-reveal-telescopes-first-images.html",
    "summary": "Scenes from nebulas in the Milky Way and a cluster of galaxies are a teaser of how the observatory will transform astronomy, with more imagery expected later on Monday."
  },
  {
    "title": "Fred Smith, Billionaire Founder of FedEx, Is Dead at 80",
    "link": "https://www.nytimes.com/2025/06/22/obituaries/fred-smith-billionaire-founder-of-fedex-is-dead-at-80.html",
    "summary": "His vision for how to ship packages overnight led to not just a new company, but also a new sector of the world economy and a now-familiar English verb."
  },
  {
    "title": "With ‘Elio,’ Pixar Has Its Worst Box Office Opening Ever",
    "link": "https://www.nytimes.com/2025/06/22/business/elio-pixar-box-office.html",
    "summary": "The original space adventure sold about $21 million in tickets at domestic theaters from Thursday night through Sunday, putting new pressure on the once-unstoppable studio."
  }
]