[
  {
    "title": "Trump Threatens Tariffs on Countries Aligned With BRICS Nations",
    "link": "https://www.nytimes.com/2025/07/07/us/politics/trump-brics-nations-tariffs.html",
    "summary": "President Trump said nations that support the group’s “Anti-American policies” would face an additional 10 percent tariff. He did not elaborate."
  },
  {
    "title": "Canada Shipping Natural Gas to Asia as It Looks Beyond the US for Trade",
    "link": "https://www.nytimes.com/2025/07/07/world/canada/natural-gas-asia-us-trade.html",
    "summary": "A tanker is headed to South Korea with a first shipment of liquefied natural gas from Canada, which hopes to reduce its export reliance on its neighbor."
  },
  {
    "title": "A Desperate Search for Survivors of the Central Texas Floods Presses Ahead",
    "link": "https://www.nytimes.com/2025/07/07/us/central-texas-flood-search.html",
    "summary": "Officials, emergency crews and volunteers in Central Texas were holding out hope for finding survivors of the flash flooding, as the death toll climbed."
  },
  {
    "title": "Officials Feared Flood Risk to Youth Camps but Rejected Warning System",
    "link": "https://www.nytimes.com/2025/07/06/us/texas-flood-warnings-sirens.html",
    "summary": "Kerr County had discussed buying such things as water gauges and sirens after previous flood disasters. But as with many rural Texas counties, cost was an issue."
  },
  {
    "title": "What’s at Stake as Netanyahu and Trump Meet in Washington",
    "link": "https://www.nytimes.com/2025/07/07/world/middleeast/trump-netanyahu-washington.html",
    "summary": "With the fighting in Iran over, President Trump is considering whether to pursue a new nuclear agreement with Tehran. He is also urging a new cease-fire deal to end the fighting in Gaza."
  },
  {
    "title": "Where Do Israel-Hamas Cease-Fire Negotiations Stand?",
    "link": "https://www.nytimes.com/article/israel-hamas-ceasefire-negotiations.html",
    "summary": "Hamas wants a guarantee that negotiations will lead to a permanent end to the Gaza war."
  },
  {
    "title": "How Trump’s Cuts Hurt Kansas Farmers, From Food Aid to Dog Chow",
    "link": "https://www.nytimes.com/2025/07/07/us/politics/trump-farmers.html",
    "summary": "Kansans created Food for Peace, for 70 years a font of rural income and pride. Now at least one grain broker is trying to sell grain that once fed the world as dog food."
  },
  {
    "title": "Medical Societies Sue Kennedy and H.H.S. Over Vaccine Advice",
    "link": "https://www.nytimes.com/2025/07/07/health/vaccines-kennedy-lawsuit.html",
    "summary": "New restrictions on Covid shots run counter to scientific evidence, the groups said."
  },
  {
    "title": "Trial Over Free Speech on Campus, and Trump’s Student Crackdown, Begins",
    "link": "https://www.nytimes.com/2025/07/07/us/politics/trump-trial-free-speech-student-crackdowns.html",
    "summary": "The case challenges the Trump administration’s targeting of noncitizen student activists for arrest and deportation on First Amendment grounds."
  },
  {
    "title": "How a Show About Truly Terrible People Became the Defining American Sitcom",
    "link": "https://www.nytimes.com/2025/07/07/magazine/always-sunny-in-philadelphia.html",
    "summary": "Over the last 20 years, television has changed, but the malignant narcissists of “It’s Always Sunny in Philadelphia” have not."
  },
  {
    "title": "Will A.I. Replace New Hires or Middle Managers?",
    "link": "https://www.nytimes.com/2025/07/07/business/ai-job-cuts.html",
    "summary": "Amid layoffs at Microsoft and other large tech companies, experts are debating whose jobs are most likely to be spared."
  },
  {
    "title": "Your Job Interviewer Is Not a Person. It’s A.I.",
    "link": "https://www.nytimes.com/2025/07/07/technology/ai-job-interviews.html",
    "summary": "You thought artificial intelligence was coming for your job? First, it’s coming for your job interviewer."
  },
  {
    "title": "Ukrainian Troops Struggle to Hold the Line on the Eastern Front",
    "link": "https://www.nytimes.com/2025/07/07/world/europe/ukraine-war-russia-donetsk.html",
    "summary": "Kyiv is defending Kostiantynivka from Russian drone attacks. The embattled city is a gateway to Ukraine’s last major defense in the Donetsk region."
  },
  {
    "title": "Russian Minister Who Had Led Region Later Invaded by Ukraine Is Found Dead",
    "link": "https://www.nytimes.com/2025/07/07/world/europe/russia-official-dead.html",
    "summary": "Roman V. Starovoyt, the transport minister, had governed Russia’s western Kursk region before Ukrainian forces invaded in 2024 and occupied part of the territory."
  },
  {
    "title": "Ukraine Turns to Fishing Nets to Catch Russian Drones",
    "link": "https://www.nytimes.com/2025/07/07/world/europe/ukraine-russia-drones-nets.html",
    "summary": "With their dense mesh, the nets can tangle drone propellers. It’s a simple but effective countermeasure that reflects how low-tech means can blunt high-tech weapons in the war."
  },
  {
    "title": "Tesla Stock Dives as Elon Musk Plans New Political Party",
    "link": "https://www.nytimes.com/2025/07/07/business/tesla-stock-elon-musk-america-party.html",
    "summary": "Mr. Musk’s involvement in politics was once seen by investors as a benefit to Tesla. Not anymore."
  },
  {
    "title": "Trump Says Musk Is ‘Off the Rails’ With New Political Party Effort",
    "link": "https://www.nytimes.com/2025/07/06/us/politics/trump-musk-america-party.html",
    "summary": "The tech billionaire’s effort to create a new political party, called the America Party, comes amid a ramped-up feud with the president over his new domestic policy law."
  },
  {
    "title": "Erin Patterson Is Found Guilty of Murder in Australia Mushroom Poisoning Case",
    "link": "https://www.nytimes.com/2025/07/07/world/australia/mushroom-poisoning-trial-verdict.html",
    "summary": "Three people died in 2023 after eating beef Wellington made by Erin Patterson, whose subsequent trial gripped the country."
  },
  {
    "title": "The Ruthless Ambition of Stephen Miller",
    "link": "https://www.nytimes.com/2025/07/07/opinion/stephen-miller.html",
    "summary": "The most powerful man in the West Wing is getting what he wants. Is Trump?"
  },
  {
    "title": "You Don’t Have to Be a Doctor to Understand This",
    "link": "https://www.nytimes.com/2025/07/07/opinion/moral-argument-global-health.html",
    "summary": "The moral argument for global health is the strongest we have."
  },
  {
    "title": "Your Questions, Answered",
    "link": "https://www.nytimes.com/2025/07/07/briefing/your-questions-answered.html",
    "summary": "We address your queries about the news."
  },
  {
    "title": "Man Who Opened Fire on Texas Border Patrol Building Is Fatally Shot",
    "link": "https://www.nytimes.com/2025/07/07/us/mcallen-airport-shooter-border-patrol.html",
    "summary": "The man opened fire on the building in McAllen, Texas, on Monday. A border patrol employee and two officers were injured, federal officials said."
  },
  {
    "title": "Iran Carries Out Mass Expulsion of Afghan Refugees",
    "link": "https://www.nytimes.com/2025/07/07/world/middleeast/iran-afghan-refugees-deportations.html",
    "summary": "About 800,000 people have been deported to Afghanistan, a desperately poor country, under an Iranian campaign that accelerated sharply in June."
  },
  {
    "title": "What Happens When Most of the Adults in Boys’ Lives Are Women",
    "link": "https://www.nytimes.com/2025/07/05/upshot/boys-men-mentors.html",
    "summary": "Jobs working with children are largely done by women, leaving many boys, especially in low-income areas, with few men as role models."
  },
  {
    "title": "South African Police’s Frequent Use of Torture Echoes Apartheid’s Brutality",
    "link": "https://www.nytimes.com/2025/07/07/world/africa/south-africa-torture-police-tubing.html",
    "summary": "A government led by freedom fighters who helped to liberate the country more than 30 years ago is now overseeing a police force accused of staggering abuses."
  }
]