[
  {
    "title": "Patrick Schiltz, an Ethicist, Is the Minnesota Judge Blasting ICE",
    "link": "https://www.nytimes.com/2026/01/29/us/politics/minnesota-judge-patrick-schiltz.html",
    "summary": "Judge Patrick Schiltz, an appointee of George W. Bush, became an unlikely critic of the Trump administration’s tactics in Minnesota."
  },
  {
    "title": "How Battlefield Tech Was Used in Minneapolis",
    "link": "https://www.nytimes.com/video/us/100000010669560/how-battlefield-tech-was-used-in-minneapolis.html",
    "summary": "Our reporter Thomas Gibbons-Neff, who deployed twice to Afghanistan as a Marine and later was our Kabul bureau chief, looks at the battlefield technology used for an immigration arrest at a home in Minneapolis."
  },
  {
    "title": "Collins Took Credit for ICE Leaving Maine. Her Democratic Opponents Pounced.",
    "link": "https://www.nytimes.com/2026/01/29/us/ice-maine-susan-collins.html",
    "summary": "Political maneuvering by the Democrats hoping to unseat Senator Susan Collins shifted into high gear with the news that ICE had ended its surge there."
  },
  {
    "title": "Venezuelan Lawmakers Approve Sweeping Overhaul of Oil Sector",
    "link": "https://www.nytimes.com/2026/01/29/world/americas/venezuela-new-law-oil-foreign-companies.html",
    "summary": "Bowing to Trump administration pressure, the new legislation improves conditions for foreign oil companies and opens the way to slash the taxes they pay."
  },
  {
    "title": "Trump Warns Iran With Military Muscle, but Risks a Regional War",
    "link": "https://www.nytimes.com/2026/01/29/world/europe/trump-iran-threats.html",
    "summary": "Iran’s Islamic Republic, weakened by airstrikes in June and huge popular unrest, warns that it will strike back hard if attacked by the United States. This time, Iran may mean it."
  },
  {
    "title": "How Trump’s 2020 Election Claims Have Been Debunked Again and Again",
    "link": "https://www.nytimes.com/2026/01/29/us/politics/trump-2020-election-claims-fact-check.html",
    "summary": "The Trump administration has recently escalated its efforts to prove widespread voter fraud in 2020. Election officials and top Republicans have repeatedly said these claims are baseless."
  },
  {
    "title": "Appeals Court Upholds TPS Protections for Venezuelans in the U.S.",
    "link": "https://www.nytimes.com/2026/01/29/us/tps-protections-venezuelan-immigrants-trump.html",
    "summary": "The Trump administration has sought to end Temporary Protected Status for more than a million people from troubled nations. About 600,000 are from Venezuela."
  },
  {
    "title": "Trump Says He Only Appeared to Nod Off in Last Cabinet Meeting Because It Was ‘Boring’",
    "link": "https://www.nytimes.com/2026/01/29/us/politics/donald-trump-cabinet-meeting-asleep.html",
    "summary": "Mr. Trump’s allies have strenuously insisted that he was alert and attentive at the meeting last month. The president said he had only closed his eyes."
  },
  {
    "title": "Kennedy Overhauls Federal Autism Panel in His Own Image",
    "link": "https://www.nytimes.com/2026/01/29/health/autism-panel-kennedy-iacc.html",
    "summary": "The new panel, which advises the government on research and service priorities for people with autism, includes many members who have argued that vaccines cause the disorder."
  },
  {
    "title": "‘Melania,’ the Documentary, Premieres in Washington",
    "link": "https://www.nytimes.com/live/2026/01/29/us/trump-news#section-941664149",
    "summary": "Amazon paid Melania Trump’s production company $40 million for the film and $35 million to promote it, a sum that critics said was an effort to curry favor with the administration."
  },
  {
    "title": "Melania Trump Documentary Premiere: Who Turned Up to the Kennedy Center",
    "link": "https://www.nytimes.com/2026/01/29/style/melania-trump-movie-kennedy-center-premiere.html",
    "summary": "Top White House officials streamed into the Kennedy Center on Thursday to see Amazon’s new documentary about the first lady, Melania Trump."
  },
  {
    "title": "Saks Fifth Avenue Bankruptcy Revives Debate Over the Future of Department Stores",
    "link": "https://www.nytimes.com/2026/01/29/style/saks-bankruptcy-department-store-shopping.html",
    "summary": "Saks Fifth Avenue’s bankruptcy filing has revived debates about how these once celebrated shopping emporiums can regain their luster."
  },
  {
    "title": "U.S. Trade Deficit Widens Despite Trump’s Tariffs",
    "link": "https://www.nytimes.com/2026/01/29/business/us-trade-deficit-tariffs.html",
    "summary": "The monthly trade deficit and imports rebounded in November after shrinking significantly in prior months, new data show."
  },
  {
    "title": "Trump’s Trade Policies Sort Manufacturers Into Winners and Losers",
    "link": "https://www.nytimes.com/2026/01/29/business/economy/manufacturing-factories-tariffs.html",
    "summary": "Tariffs have protected some companies, but more often they’ve hit the parts and materials many factories need to make finished goods."
  },
  {
    "title": "Canada Signs Auto Deal With South Korea, Moving Further from the U.S.",
    "link": "https://www.nytimes.com/2026/01/29/world/canada/canada-south-korea-auto-deal-tariffs.html",
    "summary": "The agreement, while scarce on details, is the latest step by Prime Minister Mark Carney to reduce Canada’s reliance on trade with the U.S."
  },
  {
    "title": "She Protested a Book Ban. Oklahoma Revoked Her Teacher’s License.",
    "link": "https://www.nytimes.com/2026/01/29/us/summer-boismier-oklahoma-book-ban-protest.html",
    "summary": "Summer Boismier, a high school English teacher in Oklahoma,  lost her teaching license after she protested a book ban. Now she is fighting to return to the classroom."
  },
  {
    "title": "Trump Says Putin Agreed to a Weeklong Pause in Attacks Amid Extreme Cold",
    "link": "https://www.nytimes.com/2026/01/29/us/politics/trump-putin-ceasefire-cold.html",
    "summary": "Russia has left thousands of apartment buildings in Kyiv without heat in recent weeks, in a campaign that has appeared aimed at breaking Ukraine’s morale."
  },
  {
    "title": "Moscow Airport Sells for Half Off, a Sign of Russia’s Global Isolation",
    "link": "https://www.nytimes.com/2026/01/29/world/europe/moscow-domodedovo-airport-sale.html",
    "summary": "The government opened the sale to cut-rate bidding for Domodedovo Airport after it received no offers at its initial asking price of $1.7 billion."
  },
  {
    "title": "Pizza Cutter and a Fork: A Bizarre Bid to Break Mangione Out of Jail",
    "link": "https://www.nytimes.com/2026/01/29/nyregion/luigi-mangione-break-out-blade.html",
    "summary": "Federal prosecutors said a man was arrested after he impersonated an F.B.I. agent during a visit to the federal jail in Brooklyn where Luigi Mangione is being held."
  },
  {
    "title": "Murdoch and News Corp Take on the West Coast with The California Post",
    "link": "https://www.nytimes.com/2026/01/29/business/media/california-post-new-york-post-fox-rupert-murdoch.html",
    "summary": "The expansion of the Murdoch tabloid from its New York roots to the West Coast is the latest sign of the outlet’s national ambitions."
  },
  {
    "title": "Parents Navigate a Fracturing Vaccine Landscape",
    "link": "https://www.nytimes.com/2026/01/29/well/parents-vaccines.html",
    "summary": "Rattled by the C.D.C.’s actions and the spread of measles, some parents are scrambling to figure out how to best protect their children."
  },
  {
    "title": "New Food Stamp Rules Are Confusing Grocery Stores and Consumers",
    "link": "https://www.nytimes.com/2026/01/29/business/snap-benefits-food-stamps-rules-health.html",
    "summary": "A dizzying array of rules govern what can be bought with SNAP dollars, confusing grocery stores and consumers."
  },
  {
    "title": "How the A.I. Boom Could Push Up the Price of Your Next PC",
    "link": "https://www.nytimes.com/2026/01/29/technology/ai-memory-chips-pc-smartphone.html",
    "summary": "A.I. companies are buying up memory chips, causing the prices of those components — which are also used in laptops and smartphones — to soar."
  },
  {
    "title": "California Jury Convicts Ex-Google Engineer of Stealing AI Secrets",
    "link": "https://www.nytimes.com/2026/01/29/business/ai-secrets-stolen-google-china.html",
    "summary": "A federal jury found that Linwei Ding stole thousands of confidential files to help him start a company in Beijing."
  },
  {
    "title": "One Solution for Too Many A’s? Harvard Considers Giving A+ Grades.",
    "link": "https://www.nytimes.com/2026/01/29/us/harvard-grade-inflation.html",
    "summary": "Harvard University has been trying to cut back how many A grades professors give. Now, 53 percent of grades are A’s, down from 60 percent."
  },
  {
    "title": "Genes May Control Your Longevity, However Healthily You Live",
    "link": "https://www.nytimes.com/2026/01/29/health/longevity-lifespan-age-genes.html",
    "summary": "A new study suggests that those with long-lived families probably have the best prospects of making it to a very old age."
  },
  {
    "title": "The Polls Are Clear. Americans Don’t Want This.",
    "link": "https://www.nytimes.com/2026/01/29/opinion/minneapolis-immigration-ice-safety-trump.html",
    "summary": "There is rising anxiety among Americans that the presence of an armed federal force in cities is actively making life less safe for people who live there."
  },
  {
    "title": "Hind Rajab’s Mother: No Child Deserves to Die Like My Daughter",
    "link": "https://www.nytimes.com/2026/01/29/opinion/israel-gaza-child-death-hind-rajab.html",
    "summary": "What was done to my daughter did not break me. It left me with a mother’s responsibility to ensure no child is left unheard."
  },
  {
    "title": "Democrats Reach a Deal With the White House",
    "link": "https://www.nytimes.com/2026/01/29/briefing/democrats-reach-a-deal-with-the-white-house.html",
    "summary": "Also, genes may determine longevity, a new study finds. Here’s the latest at the end of Thursday."
  },
  {
    "title": "Maxim Naumov to Skate at 2026 Olympics After Parents’ Death in D.C. Plane Crash",
    "link": "https://www.nytimes.com/2026/01/29/us/maxim-naumov-2026-olympics-dc-plane-crash.html",
    "summary": "After his parents died in the midair collision over Washington, D.C., a year ago, Maxim Naumov struggled to put on his skates. Now he will compete for the United States at the Milan-Cortina Games."
  },
  {
    "title": "Michael Beck, 65, Dies; First to Report Symptoms of ‘Havana Syndrome’",
    "link": "https://www.nytimes.com/2026/01/29/us/michael-beck-dead.html",
    "summary": "As an employee with the N.S.A., he claimed he was exposed to a direct-energy device that led to a diagnosis of Parkinson’s disease."
  },
  {
    "title": "Costco Is Sued Over Preservatives in Its $5 Rotisserie Chickens",
    "link": "https://www.nytimes.com/2026/01/29/business/costco-chicken-lawsuit-preservatives.html",
    "summary": "A proposed class-action lawsuit claims Costco was misleading customers and engaging in false advertising when it described the chicken as having no preservatives."
  },
  {
    "title": "Man Charged With Hate Crimes After He Rams Car Into Chabad Headquarters",
    "link": "https://www.nytimes.com/2026/01/29/nyregion/chabad-brooklyn-car-ramming.html",
    "summary": "The police accused a New Jersey man of slamming his vehicle into the Hasidic Jewish organization’s Brooklyn headquarters. The man’s father said that his son wanted to convert to Judaism."
  }
]