[
  {
    "title": "Targeting Iran’s Leaders, Israel Found a Weak Link: Their Bodyguards",
    "link": "https://www.nytimes.com/2025/08/30/us/politics/israel-iran-assassination.html",
    "summary": "Israel was able to track the movements of key Iranian figures and assassinate them during the 12-day war this spring by following the cellphones carried by members of their security forces."
  },
  {
    "title": "Houthis Say Prime Minister Was Killed in Israeli Attack",
    "link": "https://www.nytimes.com/2025/08/30/world/middleeast/houthi-prime-minister-killed-israel.html",
    "summary": "Ahmed al-Rahawi had led the Houthi cabinet in Yemen since 2024. His killing is unlikely to halt the Iranian-backed group’s missile attacks on Israel."
  },
  {
    "title": "Mexico’s President Struggles to Escape Trump’s Growing Demands",
    "link": "https://www.nytimes.com/2025/08/30/world/americas/mexico-us-trump-sheinbaum.html",
    "summary": "After months of negotiation and concessions, President Claudia Sheinbaum of Mexico has found herself in a cycle of pressure from the White House."
  },
  {
    "title": "Trump’s Sweeping Tariffs Invalidated by Appeals Court",
    "link": "https://www.nytimes.com/2025/08/29/business/economy/trump-tariffs-appeals-court.html",
    "summary": "The decision is a big blow to President Trump’s trade policies, but the judges left the duties in place for now to allow time for a likely appeal to the Supreme Court."
  },
  {
    "title": "Will the C.D.C. Survive?",
    "link": "https://www.nytimes.com/2025/08/29/health/cdc-kennedy-public-health.html",
    "summary": "Robert F. Kennedy Jr.’s assault may have dealt lasting damage to the agency, experts fear, with harsh consequences for public health."
  },
  {
    "title": "From Cracker Barrel to Sydney Sweeney, Trump Has an Opinion to Share",
    "link": "https://www.nytimes.com/2025/08/30/us/politics/cracker-barrel-sweeney-trump.html",
    "summary": "In his second term, President Trump is using his power to reshape American culture, not just American policy. He has threatened consequences for many who disagree."
  },
  {
    "title": "Benny Johnson Was Fired for Plagiarism. At the White House, He’s Embraced.",
    "link": "https://www.nytimes.com/2025/08/30/business/media/trump-benny-johnson.html",
    "summary": "Benny Johnson, a right-wing podcaster, has enjoyed rare access and promotion from the Trump administration."
  },
  {
    "title": "The Nobel Prize and a Testy Phone Call: How the Trump-Modi Relationship Unraveled",
    "link": "https://www.nytimes.com/2025/08/30/us/politics/trump-modi-india.html",
    "summary": "President Trump’s repeated claims about having “solved” the India-Pakistan war infuriated Prime Minister Narendra Modi of India. And that was only the beginning."
  },
  {
    "title": "Russia Distracts Its Citizens From Ukraine War With Nonstop Festivals",
    "link": "https://www.nytimes.com/2025/08/30/world/europe/russia-ukraine-war-summer-in-moscow.html",
    "summary": "A festival known as Summer in Moscow showcases the city’s transformation into an ultramodern metropolis. But the feast can’t last forever."
  },
  {
    "title": "How Russia Is Distracting Citizens From the War",
    "link": "https://www.nytimes.com/video/world/europe/100000010362770/how-russia-is-distracting-citizens-from-the-war.html",
    "summary": "Moscow is hosting a big summer festival as Russia continues its war in Ukraine. Katrin Bennhold, a senior international reporter for The New York Times, talks with Ivan Nechepurenko, a Times reporter in Russia, about the spectacle and what it says about Russian public opinion more than three and a half years into the war."
  },
  {
    "title": "Large Russian Air Attack Hits Ukraine, Amid Stalled Bid for Peace Talks",
    "link": "https://www.nytimes.com/2025/08/30/world/europe/russia-barrage-ukraine-peace-talks.html",
    "summary": "It was the second massive assault in three days, as the Kremlin rebuffed peace talks sought by Ukraine and the United States."
  },
  {
    "title": "Families of Minneapolis Church Shooting Victims Pay Loving Tributes",
    "link": "https://www.nytimes.com/2025/08/29/us/minneapolis-shooting-victims-families.html",
    "summary": "The impact of the deaths of Fletcher Merkel, 8, and Harper Moyski, 10, and the injuries sustained by 18 others are only beginning to be felt."
  },
  {
    "title": "In Secret Diaries, the Church Shooter’s Plans for Mass Murder",
    "link": "https://www.nytimes.com/2025/08/30/us/minneapolis-church-shooter-robin-westman.html",
    "summary": "Robin W. Westman described how she had obtained guns and how she had visited the church on a test run this summer during a Sunday Mass."
  },
  {
    "title": "Marin Lately, a New Satire Publication, Skewers Marin County",
    "link": "https://www.nytimes.com/2025/08/30/us/marin-lately-satire.html",
    "summary": "In February, the publication Marin Lately began satirizing the wealthy, idyllic swath of the Bay Area. The author has been a mystery, until now."
  },
  {
    "title": "20 Years After Katrina, New Orleans Is Still Home for Those Who Left",
    "link": "https://www.nytimes.com/2025/08/30/us/new-orleans-katrina-diaspora.html",
    "summary": "For many displaced by Hurricane Katrina, distance did not diminish their bond with the city they left behind, even as they built new lives."
  },
  {
    "title": "After Katrina’s Deadly Waters, Therapists Brought Watercolors",
    "link": "https://www.nytimes.com/2025/08/29/arts/design/hurricane-katrina-anniversary-art-therapy.html",
    "summary": "When Hurricane Katrina devastated New Orleans, an art program helped displaced children process their emotions. Twenty years later, their creations still have power."
  },
  {
    "title": "Bernie Sanders: Kennedy Must Resign",
    "link": "https://www.nytimes.com/2025/08/30/opinion/bernie-sanders-robert-f-kennedy-jr-resign-hhs.html",
    "summary": "The health secretary is endangering the lives of American people now and into the future."
  },
  {
    "title": "Let Your Garden Grow",
    "link": "https://www.nytimes.com/2025/08/30/opinion/lawns-mowing-wildflowers.html",
    "summary": "Yards should be wilder, freer and more alive."
  },
  {
    "title": "Golden Hour",
    "link": "https://www.nytimes.com/2025/08/30/briefing/golden-hour.html",
    "summary": "This weekend marks summer’s unofficial end — but that doesn’t have to mean abandoning the season’s many splendors."
  },
  {
    "title": "Pro-Palestinian Protesters at the Venice Film Festival Raise Gaza War",
    "link": "https://www.nytimes.com/2025/08/30/arts/gaza-protest-venice-film-festival.html",
    "summary": "In the days leading up to the festival, hundreds of film professionals signed an open letter demanding that the star-studded event take a stance against the crisis in Gaza."
  },
  {
    "title": "How Fox Sports Is Using Horse Racing to Tap Into the Sports Betting Market",
    "link": "https://www.nytimes.com/2025/08/30/business/fox-sports-horse-racing-sports-betting.html",
    "summary": "Fox’s Saturday broadcasts of Saratoga horse races have averaged 501,000 viewers, more than the National Hockey League’s regular season on TNT or college basketball’s on Fox/FS1."
  },
  {
    "title": "It’s the End of ‘Big City.’ New York Will Be Fine.",
    "link": "https://www.nytimes.com/2025/08/29/nyregion/big-city-nyc-inequality.html",
    "summary": "The weekly column that focused on inequality in the city ran for 14 years, from Occupy Wall Street to Zohran Mamdani. Now it comes to a close."
  },
  {
    "title": "An Online Group Claims It’s Behind Campus Swatting Wave",
    "link": "https://www.nytimes.com/2025/08/30/us/school-shooting-hoax-universities-purgatory-swatting.html",
    "summary": "Members of the group offered on Telegram to draw armed officers to schools, malls and airports, though their claims are unverified. Such false emergency calls have disrupted campus life in recent days."
  }
]