[
  {
    "title": "Trump Welcomes Putin With B-2 Fighter Jet Flyover and Red Carpet",
    "link": "https://www.nytimes.com/2025/08/15/us/politics/trump-putin-alaska-scene.html",
    "summary": "President Trump clapped for his guest, Vladimir V. Putin of Russia, as he stepped foot in the United States for the first time in a decade."
  },
  {
    "title": "Trump Depicted Youth Crime in D.C. as Rampant. Here’s What the Data Shows.",
    "link": "https://www.nytimes.com/2025/08/15/us/trump-juvenile-crime-dc-data.html",
    "summary": "Concerns came to a head during the pandemic, when carjackings surged and many of those arrested were children. Carjackings and other crimes have declined considerably."
  },
  {
    "title": "Officers Clear More Homeless People from Sites Around Washington",
    "link": "https://www.nytimes.com/2025/08/15/us/politics/dc-homeless-encampments-police.html",
    "summary": "Local police now under federal oversight dismantled encampments, discarding tents and other belongings."
  },
  {
    "title": "4 Takeaways From the Week Trump Took Control of D.C.’s Police",
    "link": "https://www.nytimes.com/2025/08/15/us/politics/trump-washington-crime-takeaways.html",
    "summary": "The administration’s grip on the city has only tightened as the week has worn on, while pushback has begun to intensify."
  },
  {
    "title": "Elon Musk’s SpaceX Most Likely Doesn’t Pay Taxes",
    "link": "https://www.nytimes.com/2025/08/15/technology/spacex-musk-government-contracts-taxes.html",
    "summary": "Elon Musk’s rocket company relies on federal contracts, but years of losses have most likely let it avoid paying federal income taxes, according to internal company documents."
  },
  {
    "title": "The Woman to See About Your Face",
    "link": "https://www.nytimes.com/2025/08/15/style/beauty-broker-melinda-farina-plastic-surgery.html",
    "summary": "Melinda Farina, known as the Beauty Broker, sends Hollywood actresses and everyday women to doctors around the globe. In her world, the knives are always out."
  },
  {
    "title": "MAHA Draft Report Brings Relief to Some, Chagrin to Others",
    "link": "https://www.nytimes.com/2025/08/15/health/maha-draft-report-pesticides.html",
    "summary": "A draft of an upcoming White House report on children’s health was not as harsh toward the agriculture industry as some of Robert F. Kennedy Jr.’s allies had hoped."
  },
  {
    "title": "How Train Riders With Disabilities Are Faring on Amtrak",
    "link": "https://www.nytimes.com/2025/08/14/travel/amtrak-riders-passengers-disabilities.html",
    "summary": "Passengers are facing blocked wheelchair space, getting stuck in doors and suffering other indignities 35 years after the Americans With Disabilities Act became law."
  },
  {
    "title": "How Accessible Is Traveling by Amtrak?",
    "link": "https://www.nytimes.com/video/travel/100000010331128/how-accessible-is-traveling-by-amtrak.html",
    "summary": "Many people with disabilities depend on Amtrak to travel across the country, but the journey can still present obstacles. Gabe Castro-Root outlines some of the challenges disabled passengers encounter while traveling."
  },
  {
    "title": "For Some Venetians, This Overgrown Island Is Paradise",
    "link": "https://www.nytimes.com/2025/08/15/world/europe/venice-residents-poveglia-island-lease.html",
    "summary": "A citizens’ group is now in charge of the island of Poveglia, where they will create a park for anyone who wants to leave Venice’s maddening crowds of tourists behind."
  },
  {
    "title": "Mayor LaToya Cantrell of New Orleans Is Indicted on Corruption Charges",
    "link": "https://www.nytimes.com/2025/08/15/us/new-orleans-mayor-indictment.html",
    "summary": "LaToya Cantrell was charged with going to criminal lengths to carry out, and cover up, a romantic relationship with a city police officer assigned to protect her."
  },
  {
    "title": "Air Canada’s Flight Attendants Reject Call for Arbitration",
    "link": "https://www.nytimes.com/2025/08/15/world/canada/air-canada-flight-attendant-strike.html",
    "summary": "Their union says one of its core demands, to receive pay for groundwork, is unlikely to be introduced in arbitration. The airline began canceling flights ahead of the potential strike."
  },
  {
    "title": "As Air Canada Strike Looms, Here’s What to Know About Flight Cancellations and More",
    "link": "https://www.nytimes.com/2025/08/15/travel/air-canada-strike-flight-cancellations.html",
    "summary": "A strike by the carrier’s flight attendants could disrupt 130,000 travelers a day, including international fliers. Here’s what to know if your flight is affected."
  },
  {
    "title": "With a Shovel and a Dream, a Woman Finds a 2.3 Carat Diamond in Arkansas",
    "link": "https://www.nytimes.com/2025/08/15/us/arkansas-state-park-diamond-found-engagment-ring.html",
    "summary": "After three weeks, with bug bites and tattered hiking boots, Micherre Fox found the stone at Crater of Diamonds State Park."
  },
  {
    "title": "Two Decades of Putin Playing the West",
    "link": "https://www.nytimes.com/video/opinion/100000010343291/two-decades-of-putin-playing-the-west.html",
    "summary": "For more than 20 years, Western leaders have played right into Putin’s hands — and given one a shake."
  },
  {
    "title": "The Stock Market Is Getting Scary. What You Should Do.",
    "link": "https://www.nytimes.com/2025/08/15/opinion/stock-market-advice-investing.html",
    "summary": "There are troubling signs that our stock market may be overheated."
  },
  {
    "title": "Trump and Putin Meet in Alaska",
    "link": "https://www.nytimes.com/2025/08/15/briefing/trump-and-putin-meet-in-alaska.html",
    "summary": "Also, D.C. sued Trump over his takeover of the city’s police. Here’s the latest at the end of Friday."
  },
  {
    "title": "NY Weed Dispensaries Sue Regulators Over Misinterpretation of State Rules",
    "link": "https://www.nytimes.com/2025/08/15/nyregion/weed-cannabis-dispensary-lawsuit.html",
    "summary": "Last month, dozens of cannabis businesses were told they were located too close to schools after state officials realized they had misinterpreted regulations."
  },
  {
    "title": "Judge Blocks F.T.C. Investigation of Media Matters",
    "link": "https://www.nytimes.com/2025/08/15/technology/media-matters-ftc-musk-injunction.html",
    "summary": "The agency began looking into the liberal watchdog group’s research critical of Elon Musk and his social media platform, X, in May."
  },
  {
    "title": "Tommy McLain, the King of Swamp Pop, Dies at 85",
    "link": "https://www.nytimes.com/2025/08/15/arts/music/tommy-mclain-dead.html",
    "summary": "Playing a blend of rock, R&amp;B and zydeco, he had a hit in 1966 with “Sweet Dreams” and inspired Elvis Costello and Nick Lowe, among many others."
  },
  {
    "title": "Priscilla Presley Locked in Feud With Former Business Partners",
    "link": "https://www.nytimes.com/2025/08/15/arts/music/priscilla-presley-feud-former-business-partners.html",
    "summary": "Elvis’s ex-wife has traded lawsuits in a financial dispute with former advisers that has grown ugly with an allegation that she prematurely “pulled the plug” on her late daughter, Lisa Marie."
  }
]