[
  {
    "title": "Social Platforms Duck Blame for Inflaming Divisions Before Charlie Kirk’s Death",
    "link": "https://www.nytimes.com/2025/09/16/technology/charlie-kirk-meta-x-tiktok.html",
    "summary": "After authorities said Mr. Kirk’s suspected shooter had been “radicalized” online, Meta, Reddit, TikTok and other platforms have stayed quiet — though not Elon Musk, who owns X."
  },
  {
    "title": "How the Government Is Trying to Silence Charlie Kirk’s Critics",
    "link": "https://www.nytimes.com/2025/09/16/briefing/how-the-government-is-trying-to-silence-charlie-kirks-critics.html",
    "summary": "We look at the fight over free speech."
  },
  {
    "title": "Robert Redford, Screen Idol Turned Director and Activist, Dies at 89",
    "link": "https://www.nytimes.com/2025/09/16/movies/robert-redford-dead.html",
    "summary": "He made serious topics like grief and political corruption resonate with the masses, in no small part because of his own star power."
  },
  {
    "title": "As an Activist, Robert Redford Understood the Power of Celebrity",
    "link": "https://www.nytimes.com/2025/09/16/movies/robert-redford-activism.html",
    "summary": "His knowledge of the ways cameras and media create narratives helped him redirect those stories in service of larger causes like environmentalism."
  },
  {
    "title": "Robert Redford: A Life in Photos",
    "link": "https://www.nytimes.com/2025/09/16/movies/robert-redford-photos.html",
    "summary": "The Oscar-winning director, who preferred life away from Hollywood, was once a sex symbol and later an activist who used his celebrity to draw attention to the environment."
  },
  {
    "title": "Robert Redford: 15 Memorable Movies to Stream",
    "link": "https://www.nytimes.com/2025/09/16/movies/robert-redford-streaming.html",
    "summary": "His roles brought him to the screen as a Depression-era con man, a governor’s son and the journalist Bob Woodward. He also took to the director’s chair. Here are some of Redford’s career highlights."
  },
  {
    "title": "State Terrorism Charges Against Luigi Mangione Are Dismissed",
    "link": "https://www.nytimes.com/2025/09/16/nyregion/luigi-mangione-state-terrrorism-charges-dismissed.html",
    "summary": "The judge overseeing the case against Mr. Mangione said the evidence underpinning two of the most serious counts, one of which charged him with first-degree murder, was “legally insufficient.”"
  },
  {
    "title": "Howard Lutnick, the Pierre Hotel and Claims of a Secret Plan",
    "link": "https://www.nytimes.com/2025/09/16/business/lutnick-pierre-hotel.html",
    "summary": "Some residents of the Pierre claim that Howard Lutnick, who owns the penthouse, was part of a plot to sell off this symbol of Manhattan glamour and wealth."
  },
  {
    "title": "F.B.I. Agents Fired by Patel Speak Out on ‘Broken’ Trust",
    "link": "https://www.nytimes.com/2025/09/16/us/politics/kash-patel-fired-fbi-agents.html",
    "summary": "The two agents’ accounts offer an inside view of a bureau buffeted by politics and upheaval, adding to the scrutiny of the F.B.I. director as he prepares to testify to Congress."
  },
  {
    "title": "Trump Sues The New York Times For Articles Questioning His Success",
    "link": "https://www.nytimes.com/2025/09/16/business/media/trump-lawsuit-new-york-times.html",
    "summary": "The lawsuit, filed by the president in federal court in Florida, claims The Times defamed him and sought to undermine his campaign in the 2024 election."
  },
  {
    "title": "National Parks to Remove Some Materials on Slavery and Tribes",
    "link": "https://www.nytimes.com/2025/09/16/climate/trump-park-service-slavery-photo-tribes.html",
    "summary": "The Trump administration ordered a Civil War-era war image removed from a National Park site in Georgia as it moves to promote what it considers a more positive view of American history."
  },
  {
    "title": "Cassidy, His Job in Peril, Scrutinizes Kennedy on Vaccines",
    "link": "https://www.nytimes.com/2025/09/16/us/politics/bill-cassidy-vaccines-rfk-kennedy.html",
    "summary": "Senator Bill Cassidy, a Republican physician and vaccine proponent who is facing a primary challenge from the right, has a fraught relationship with the health secretary."
  },
  {
    "title": "Joe Manchin Would Like a Word. (OK, Maybe Several Words.)",
    "link": "https://www.nytimes.com/2025/09/16/us/politics/joe-manchin.html",
    "summary": "The voluble former senator, now retired from politics, appears to miss the arena and is mulling a return to it."
  },
  {
    "title": "Johnson Releases Spending Bill, Daring Democrats to Oppose It",
    "link": "https://www.nytimes.com/2025/09/16/us/politics/johnson-government-shutdown.html",
    "summary": "The speaker put forward a stopgap bill to fund the government past Sept. 30, saying there was “zero chance” he would add concessions Democrats have demanded."
  },
  {
    "title": "California’s Environmental Past Confronts Economic Worries of the Present",
    "link": "https://www.nytimes.com/2025/09/16/us/california-environment-democrats-newsom.html",
    "summary": "Gov. Gavin Newsom and Democratic state lawmakers have focused on pocketbook concerns this year, seeing their party’s national losses as a reckoning."
  },
  {
    "title": "California’s High Gas Prices Could Climb Further as Refineries Close",
    "link": "https://www.nytimes.com/2025/09/16/business/energy-environment/california-gas-prices-oil-refineries.html",
    "summary": "The state has led the country in adopting electric cars and reducing gas use, but it now faces much higher gas prices as oil companies plan to shut down refineries."
  },
  {
    "title": "Carl Heastie, Another Democratic Holdout, Is Expected to Endorse Mamdani",
    "link": "https://www.nytimes.com/2025/09/16/nyregion/heastie-mamdani-endorsement-nyc-mayor.html",
    "summary": "Mr. Heastie, the speaker of the New York State Assembly, is one of several prominent Democrats who had resisted backing Zohran Mamdani, the party’s nominee for New York City mayor."
  },
  {
    "title": "What Exactly Are A.I. Companies Trying to Build? Here’s a Guide.",
    "link": "https://www.nytimes.com/2025/09/16/technology/what-exactly-are-ai-companies-trying-to-build-heres-a-guide.html",
    "summary": "Amazon, Microsoft, Google, Meta and OpenAI plan to spend at least $325 billion by the end of the year in pursuit of A.I. We explain why they’re doing it."
  },
  {
    "title": "How Wall Street’s Big Bets on A.I. Are Driving Interest in Huge Parking Lots",
    "link": "https://www.nytimes.com/2025/09/16/business/jpmorgan-blackstone-data-centers-industrial-outdoor-storage.html",
    "summary": "J.P. Morgan, Blackstone and other financial giants are buying “industrial outdoor storage,” sites vital to logistics, trade and the construction of data centers."
  },
  {
    "title": "He Fled Putin’s War. The U.S. Deported Him to a Russian Jail.",
    "link": "https://www.nytimes.com/2025/09/16/world/europe/trump-russia-war-deportations-vovchenko.html",
    "summary": "Antiwar Russians are being sent back as part of President Trump’s immigration crackdown, despite facing imprisonment and other dangers."
  },
  {
    "title": "Russia Indoctrinates Children From Occupied Ukraine at 210 Sites, Study Says",
    "link": "https://www.nytimes.com/2025/09/16/world/europe/russia-re-education-camps-ukrainian-children.html",
    "summary": "War crime investigators at Yale discovered a program of re-education and military and police training that was larger than estimated earlier."
  },
  {
    "title": "What a No-Fly Zone Over Ukraine Would Mean for the West",
    "link": "https://www.nytimes.com/2025/09/16/world/europe/ukraine-nato-no-fly-zone-poland.html",
    "summary": "Poland suggested such a zone after a major Russian incursion. But political hesitance and military shortcomings pose clear obstacles."
  },
  {
    "title": "20 Years Ago, Alinea Electrified Chicago Dining. Does It Still Matter?",
    "link": "https://www.nytimes.com/2025/09/16/dining/restaurant-review-alinea-chicago.html",
    "summary": "At this famously innovative restaurant, our critic finds a mix of thought-provoking experiments and empty spectacle."
  },
  {
    "title": "The Kirk Crackdown Is Underway",
    "link": "https://www.nytimes.com/2025/09/16/opinion/trump-charlie-kirk-crackdown.html",
    "summary": "The idea that there is more left-wing extremist violence than right-wing extremist violence is a dangerous myth."
  },
  {
    "title": "We Are Going to Have to Live Here With Each Other",
    "link": "https://www.nytimes.com/2025/09/16/opinion/ezra-klein-podcast-ben-shapiro.html",
    "summary": "Ben Shapiro and I discuss the state — and stakes — of political disagreement in America."
  },
  {
    "title": "Late Night Finds Trump Strangely Fascinated by the White House Ballroom",
    "link": "https://www.nytimes.com/2025/09/16/arts/television/late-night-trump-white-house-ballroom.html",
    "summary": "“Every time he gets a chance to talk about it, he sounds likes one of my kids,” Seth Meyers said."
  },
  {
    "title": "Fani Willis Loses Bid to Continue Prosecuting Georgia Trump Case",
    "link": "https://www.nytimes.com/2025/09/16/us/fani-willis-georgia-trump.html",
    "summary": "The 4-3 ruling means that the criminal case against President Trump, related to his efforts to overturn his 2020 election loss, will not move forward anytime soon, if ever."
  },
  {
    "title": "Why a Pennsylvania Court Election This November Could Matter in 2028",
    "link": "https://www.nytimes.com/2025/09/16/us/politics/pennsylvania-supreme-court-election.html",
    "summary": "Voters will decide whether three Democratic State Supreme Court justices will keep their seats in a swing state that will be crucial to the next presidential election."
  },
  {
    "title": "YouTube Expands its Livestreaming Tools In Push for More Live Video",
    "link": "https://www.nytimes.com/2025/09/16/business/media/youtube-livestreaming-video.html",
    "summary": "The world’s largest and most influential video platform wants to persuade a lot more content creators to broadcast live."
  },
  {
    "title": "New Research Helps Explain Gas Craters in Siberia",
    "link": "https://www.nytimes.com/2025/09/16/climate/siberia-craters-exploding-permafrost-tundra.html",
    "summary": "Spontaneous gas explosions appear to be increasing in northern Russia because of climate change and some specific local conditions."
  }
]