[
  {
    "title": "Israelis Rally for Hostages in Gaza, Hoping It Will Be the Last Time",
    "link": "https://www.nytimes.com/2025/10/11/world/middleeast/israel-hostages-square-rally.html",
    "summary": "At a Tel Aviv rally, Israelis thanked President Trump for the cease-fire that paved the way for release of the remaining hostages. They were less enthused about their own country’s leader."
  },
  {
    "title": "Thousands Return to Northern Gaza, Hopeful, but Faced With Devastation",
    "link": "https://www.nytimes.com/2025/10/11/world/middleeast/return-gaza-city-ceasefire.html",
    "summary": "With the cease-fire holding overnight, many Palestinians continued to travel toward Gaza City on Saturday to learn what remained of their lives and homes."
  },
  {
    "title": "Federal Judges, Warning of ‘Judicial Crisis,’ Fault Supreme Court’s Emergency Orders",
    "link": "https://www.nytimes.com/2025/10/11/us/politics/judicial-crisis-supreme-court-trump.html",
    "summary": "Dozens of sitting judges shared with The Times their concerns about risks to the courts’ legitimacy as the Supreme Court releases opaque orders about Trump administration policies."
  },
  {
    "title": "Some Americans Are Starting to Feel the Impact of the Government Shutdown",
    "link": "https://www.nytimes.com/2025/10/11/us/politics/government-shutdown-effects.html",
    "summary": "The Trump administration said over 4,000 workers would be laid off. Farmers trying to plan next year’s crops don’t have all the tools they need. Some medical services have been curtailed in Native communities."
  },
  {
    "title": "Trump Says He Will Pay Troops Despite Government Shutdown",
    "link": "https://www.nytimes.com/2025/10/11/us/politics/trump-troops-pay-shutdown.html",
    "summary": "The president said he had identified funds even though Congress has not appropriated new money for the military."
  },
  {
    "title": "Diane Keaton, a Star of ‘The Godfather’ and ‘First Wives Club,’ Dies at 79",
    "link": "https://www.nytimes.com/2025/10/11/movies/diane-keaton-dead.html",
    "summary": "She brought an unconventional personality to scores of roles on television and in movies ranging from zany comedies like “Sleeper” to piercing dramas like “The Godfather.”"
  },
  {
    "title": "How Diane Keaton’s ‘Annie Hall’ Look Was Integral to Her Art",
    "link": "https://www.nytimes.com/2025/10/11/movies/diane-keaton-annie-hall.html",
    "summary": "Though she downplayed it, her role in creating the outfits of “Annie Hall” made her the author of a fascinating career."
  },
  {
    "title": "Diane Keaton: A Life in Pictures",
    "link": "https://www.nytimes.com/2025/10/11/arts/diane-keaton-photos.html",
    "summary": "On and off the screen, the star with a distinctive fashion sense was a singular presence."
  },
  {
    "title": "Diane Keaton: 5 Great Movies to Stream",
    "link": "https://www.nytimes.com/2025/10/11/movies/diane-keaton-movies-streaming.html",
    "summary": "The actress, who died on Saturday at 79, was known for both her dramatic heft and her comedic gifts. Here are some of the highlights."
  },
  {
    "title": "Katie Porter Videos Give California Rivals a New Opening",
    "link": "https://www.nytimes.com/2025/10/11/us/katie-porter-videos-california-governor.html",
    "summary": "Viral videos showing caustic behavior have blunted her momentum in the California governor’s race. Other campaigns are scrambling to take advantage."
  },
  {
    "title": "In L.A., a Former Ally of Mayor Bass Is Expected to Run Against Her",
    "link": "https://www.nytimes.com/2025/10/11/us/mayor-bass-austin-beutner.html",
    "summary": "The former supporter, Austin Beutner, who once led the city’s public schools as superintendent, is expected to challenge Ms. Bass’s re-election bid in next year’s mayoral race."
  },
  {
    "title": "16 People Killed in Blast at Tennessee Explosives Plant, Officials Confirm",
    "link": "https://www.nytimes.com/2025/10/11/us/tennessee-munitions-plant-explosion-deaths.html",
    "summary": "Local authorities said on Saturday that they had shifted their focus to searching for remains. The cause of the explosion was unclear."
  },
  {
    "title": "Close-Knit Rural Communities Reel After Tennessee Plant Explosion",
    "link": "https://www.nytimes.com/2025/10/11/us/tennessee-plant-explosion-hickman-humphreys-counties.html",
    "summary": "The plant owned by Accurate Energetic Systems has long been an economic bedrock in rural Hickman and Humphreys Counties. Now it’s a source of widespread grief."
  },
  {
    "title": "How Churners Earn Money By Regularly Signing Up for Credit Cards",
    "link": "https://www.nytimes.com/2025/10/11/business/credit-cards-churners.html",
    "summary": "A growing number of Americans are making thousands by exploiting credit card reward offers."
  },
  {
    "title": "When Mental Illness Shapes Life-or-Death Transplant Decisions",
    "link": "https://www.nytimes.com/2025/10/12/opinion/organ-transplant-mental-illness.html",
    "summary": "Patients’ mental health problems can make transplant decisions even more fraught."
  },
  {
    "title": "Jon Favreau on Where the Democrats Went Right",
    "link": "https://www.nytimes.com/2025/10/11/opinion/ezra-klein-podcast-jon-favreau.html",
    "summary": "Jon Favreau considers how the government shutdown could help Democrats rebuild their fractured party."
  },
  {
    "title": "At Least 1 Dead and 3 Injured After Shootings at Mississippi Universities",
    "link": "https://www.nytimes.com/2025/10/11/us/mississippi-shooting-jackson-alcorn.html",
    "summary": "The shootings at historically Black institutions occurred within about 24 hours of three other shootings across rural Mississippi that left at least eight people dead."
  },
  {
    "title": "Will Paul Biya of Cameroon, the World’s Oldest President, Win Again?",
    "link": "https://www.nytimes.com/2025/10/12/world/africa/cameroon-election-biya-president.html",
    "summary": "President Paul Biya of Cameroon would be nearly 100 years old by the time he completed his eighth term, but he has promised that “the best is still to come.”"
  },
  {
    "title": "China Detains Dozens of Members of Underground Church",
    "link": "https://www.nytimes.com/2025/10/11/world/asia/china-church-pastor-detained.html",
    "summary": "The church’s pastor, Ezra Jin Mingri, turned Zion Church into one of China’s largest unofficial congregations, even as government pressure on Christianity increased."
  }
]