[
  {
    "title": "Trump’s Tanker Crackdown Paralyzes Venezuelan Oil Exports",
    "link": "https://www.nytimes.com/2025/12/23/world/americas/trump-tankers-venezuela-oil-industry.html",
    "summary": "Oil exports, the country’s financial lifeblood, have plummeted after the United States took action against three ships that have been used to carry its crude."
  },
  {
    "title": "U.S. Is Adding to Its Military Buildup in the Caribbean",
    "link": "https://www.nytimes.com/2025/12/23/us/politics/military-cargo-planes-caribbean-venezuela.html",
    "summary": "Over the past week, C-17 heavy-lift cargo planes, which usually transport troops and equipment, flew to Puerto Rico at least 16 times, according to flight tracking data reviewed by The New York Times."
  },
  {
    "title": "Supreme Court Refuses to Allow Trump to Deploy National Guard in Chicago",
    "link": "https://www.nytimes.com/2025/12/23/us/politics/supreme-court-national-guard-chicago.html",
    "summary": "President Trump ordered state-based troops to Portland, Ore.; Los Angeles; Washington; and Chicago over the objections of state and local officials."
  },
  {
    "title": "19 States Sue to Block White House Plan to End Gender-Related Care for Minors",
    "link": "https://www.nytimes.com/2025/12/23/us/states-lawsuit-kennedy-gender-care-hospitals.html",
    "summary": "The coalition of states seeks to stop a Trump administration effort to cut off federal funding to hospitals that provide such care."
  },
  {
    "title": "Student Loan Borrowers in Default Could See Wages Garnished in Early 2026",
    "link": "https://www.nytimes.com/2025/12/23/business/student-loan-debtors-default-wages-garnish.html",
    "summary": "Starting the week of Jan. 7, the Education Department will begin sending notices about paycheck deductions to about 1,000 of five million borrowers in default."
  },
  {
    "title": "National Guard Troops to Arrive in New Orleans",
    "link": "https://www.nytimes.com/2025/12/23/us/politics/national-guard-new-orleans.html",
    "summary": "The troops will join an existing wave of Border Patrol agents, months after Gov. Jeff Landry first suggested that the National Guard could help tamp down on crime in Louisiana."
  },
  {
    "title": "Federal Prosecutor Was Surprised by Trump’s Flights on Epstein’s Jet",
    "link": "https://www.nytimes.com/2025/12/23/us/politics/trump-epstein-jet-flights.html",
    "summary": "A 2020 email noted that Donald Trump was listed as a passenger on Jeffrey Epstein’s jet at least eight times from 1993 to 1996."
  },
  {
    "title": "Redacted Material in Some Epstein Files Is Easily Recovered",
    "link": "https://www.nytimes.com/2025/12/23/us/politics/epstein-files-redactions-doj.html",
    "summary": "The ease of recovering information that was not properly redacted digitally suggests that at least some of the documents released by the Justice Department were hastily censored."
  },
  {
    "title": "Pulled ’60 Minutes’ Report, Briefly Streamed in Canada, Is All Over the Internet Now",
    "link": "https://www.nytimes.com/2025/12/23/business/media/60-minutes-cbs-news.html",
    "summary": "At the last minute, CBS News held a segment about Venezuelan men who were deported by the Trump administration to a prison in El Salvador. It surfaced online anyway."
  },
  {
    "title": "Kate Winslet’s Unhappy Family Christmas",
    "link": "https://www.nytimes.com/2025/12/23/movies/goodbye-june-kate-winslet.html",
    "summary": "The British actress’s directorial debut, “Goodbye June,” is based on a script written by her son and follows a fractured family reuniting in the hospital over the holidays."
  },
  {
    "title": "Stephen Miller Cites Children of Immigrants as a Problem",
    "link": "https://www.nytimes.com/2025/12/23/us/politics/stephen-miller-trump-immigrants.html",
    "summary": "As it seeks to end birthright citizenship, the Trump administration is arguing that immigrants bring problems that extend for generations. The data shows otherwise."
  },
  {
    "title": "Palm Beach Rallies Behind a Restaurant Manager Held at ‘Alligator Alcatraz’",
    "link": "https://www.nytimes.com/2025/12/23/style/jose-gonzalez-alligator-alcatraz-palm-beach.html",
    "summary": "After nearly two weeks in detention, José Gonzalez, the popular host of an upscale restaurant, returns home."
  },
  {
    "title": "How Did DOGE Disrupt So Much While Saving So Little?",
    "link": "https://www.nytimes.com/2025/12/23/us/politics/doge-musk-trump-analysis.html",
    "summary": "The group’s biggest claims were largely incorrect, a New York Times analysis found. And its many smaller cuts added up to few savings."
  },
  {
    "title": "The Confederacy Goes on Trial, Along With Schools Named Jackson and Lee",
    "link": "https://www.nytimes.com/2025/12/23/us/politics/confederate-school-names.html",
    "summary": "In an unusual trial, the N.A.A.C.P. has sought to show a school board’s “racist intent” by proving that the names of Robert E. Lee and Stonewall Jackson can’t be separated from white supremacy."
  },
  {
    "title": "Oklahoma Instructor Mel Curth Who Failed Student Samantha Fulnecky’s Gender Essay Is Fired",
    "link": "https://www.nytimes.com/2025/12/23/us/mel-curth-oklahoma-instructor-firing.html",
    "summary": "The instructor, a graduate student at the University of Oklahoma, gave a zero to a student who wrote an essay arguing in favor of traditional gender definitions based on biblical teachings."
  },
  {
    "title": "Pennsylvania Nursing Home Explosion Kills 2",
    "link": "https://www.nytimes.com/2025/12/23/us/explosion-bristol-nursing-home.html",
    "summary": "A resident and an employee were killed after two explosions at the Bristol Health and Rehab Center resulted in a large fire and partial collapse of the building, officials said."
  },
  {
    "title": "Suspect in Brown University Shooting Worked in Portugal After Leaving University",
    "link": "https://www.nytimes.com/2025/12/23/us/brown-university-shooting-suspect-portugal.html",
    "summary": "One friend said Claudio Neves Valente appeared to live a detached life, upset that “he couldn’t be the genius he thought he should be.”"
  },
  {
    "title": "Do Parents Have Favorite Children? Of Course They Do.",
    "link": "https://www.nytimes.com/2025/12/23/well/favorite-children.html",
    "summary": "And research shows the less favored children suffer for it."
  },
  {
    "title": "Thailand, Attacking Cambodia, Says Its Target Is the Scam Industry",
    "link": "https://www.nytimes.com/2025/12/24/world/asia/cambodia-scam-centers-refugees-thailand.html",
    "summary": "Thai warplanes have bombed compounds where people are forced to defraud others online. Rights activists say trafficking victims’ lives are at risk."
  },
  {
    "title": "Youth Hostels, Blood Banks, Yoga: How One Far-Right Network Spread Across the World",
    "link": "https://www.nytimes.com/2025/12/23/opinion/india-far-right-rss-hindu.html",
    "summary": "Far-right mobilization is not an inevitable consequence of the precariousness of our times."
  },
  {
    "title": "The Real-Life Marty Supreme Taught Me How to Hustle",
    "link": "https://www.nytimes.com/2025/12/23/opinion/culture/real-life-marty-supreme-reisman.html",
    "summary": "When I first moved to New York City, Marty Reisman befriended me."
  },
  {
    "title": "Libyan Military’s Chief of Staff and 4 Others Are Killed in Plane Crash in Turkey",
    "link": "https://www.nytimes.com/2025/12/23/world/middleeast/libya-general-plane-crash-turkey.html",
    "summary": "The internationally recognized government of Libya confirmed the deaths of Lt. Gen. Mohamed Ali Ahmed al-Haddad, the army chief of general staff, and other officers flying home after a meeting in Turkey."
  },
  {
    "title": "A Democrat, a Republican and a Supermarket Baron Go to ‘Marty Supreme’",
    "link": "https://www.nytimes.com/2025/12/23/nyregion/hochul-blakeman-red-carpet.html",
    "summary": "A “Marty Supreme” showing took a political turn when John Catsimatidis, who has a small role in the movie, invited both Gov. Kathy Hochul and her Republican rival, Bruce Blakeman."
  },
  {
    "title": "Mamdani Named His Fire Commissioner. Then Adams Did Too.",
    "link": "https://www.nytimes.com/2025/12/23/nyregion/nyc-fire-commissioner-bonsignore-mamdani.html",
    "summary": "Mayor-elect Zohran Mamdani chose Lillian Bonsignore, the former chief of New York’s E.M.S., as the first openly gay person to lead the Fire Department."
  },
  {
    "title": "Robert Nakamura, ‘Godfather’ of Asian American Film, Dies at 88",
    "link": "https://www.nytimes.com/2025/12/23/movies/robert-nakamura-dead.html",
    "summary": "In his work, he often returned to Manzanar, the camp in which he and his family, along with thousands of other people of Japanese descent, were interned during World War II."
  }
]