[
  {
    "title": "What is the origin of the Epstein case?",
    "link": "https://www.nytimes.com/live/2025/12/19/us/epstein-files-release/what-is-the-origin-of-the-epstein-case",
    "summary": ""
  },
  {
    "title": "How The Times is covering the latest release of Epstein files.",
    "link": "https://www.nytimes.com/2025/12/19/us/how-the-times-is-covering-the-latest-release-of-epstein-files.html",
    "summary": ""
  },
  {
    "title": "U.S. Strikes Islamic State Targets in Syria",
    "link": "https://www.nytimes.com/2025/12/19/us/politics/us-islamic-state-strikes-syria.html",
    "summary": "American forces struck dozens of suspected ISIS sites, making good on President Trump’s vow to avenge two American soldiers and a civilian U.S. interpreter killed by the group last week."
  },
  {
    "title": "Trump Picks New Leader for Southern Command as Venezuela Pressure Grows",
    "link": "https://www.nytimes.com/2025/12/19/us/politics/frank-donovan-southern-command-trump.html",
    "summary": "Lt. Gen. Francis L. Donovan, a Marine general with expansive experience in special operations and the Middle East, would take over after the abrupt departure of the previous commander."
  },
  {
    "title": "Elise Stefanik Drops Out of N.Y. Governor’s Race and Will Leave Congress",
    "link": "https://www.nytimes.com/2025/12/19/nyregion/elise-stefanik-drops-out-governor.html",
    "summary": "Ms. Stefanik, a Republican congresswoman and staunch ally of President Trump, abruptly ended her bid to unseat Gov. Kathy Hochul and said she would not seek another House term."
  },
  {
    "title": "Suspected Killer of M.I.T. Professor Studied With Victim, Graduating Top of Their Class",
    "link": "https://www.nytimes.com/2025/12/19/us/mit-professor-shooting-suspect-portugal-lisbon-physics.html",
    "summary": "The parents of the suspect in the Brown and M.I.T. killings had not seen or heard from him since he left Portugal to enroll at a graduate program at Brown more than two decades ago."
  },
  {
    "title": "Suspect in Brown and M.I.T. Killings Died 2 Days Before He Was Found, Autopsy Shows",
    "link": "https://www.nytimes.com/2025/12/19/us/suspect-brown-mit-autopsy.html",
    "summary": "The examination confirmed that the suspect had died from a self-inflicted gunshot wound. His body was found late Thursday in a storage unit in New Hampshire."
  },
  {
    "title": "How a Reddit Post Helped the Police Identify a Suspect in the Brown University Shooting",
    "link": "https://www.nytimes.com/2025/12/19/us/brown-mit-shooting-investigation-reddit.html",
    "summary": "Authorities said a key to identifying a suspect was a Reddit user who provided information about an encounter he had with the gunman, now identified as Claudio Manuel Neves Valente."
  },
  {
    "title": "52 Places to Go, So Little Time: Where We Went in 2025",
    "link": "https://www.nytimes.com/2025/12/19/travel/visiting-places-to-go.html",
    "summary": "Our writers and photographers were on the ground to find out what makes the destinations on our annual list rise above the rest."
  },
  {
    "title": "R.F.K. Jr. Likely to Swap U.S. Childhood Vaccine Schedule for Denmark’s",
    "link": "https://www.nytimes.com/2025/12/19/health/kennedy-childhood-vaccine-schedule-denmark.html",
    "summary": "The shift would mean fewer shots recommended for children. But a Danish health official found the idea baffling, saying the United States was getting “crazier and crazier in public health.”"
  },
  {
    "title": "How the T.S.A. Is Helping ICE",
    "link": "https://www.nytimes.com/video/us/100000010579727/how-the-tsa-is-helping-ice.html",
    "summary": "In a previously undisclosed partnership, the Transportation Security Administration and Immigration and Customs Enforcement are sharing data to identify passengers on upcoming flights whom ICE can arrest. Our reporter Hamed Aleaziz, who learned of this partnership, describes what to know about it and the ICE arrests that have followed."
  },
  {
    "title": "Kennedy Center, Memorial to JFK, Is Trump’s Now, Too",
    "link": "https://www.nytimes.com/2025/12/19/us/politics/kennedy-center-trump-sign.html",
    "summary": "The Kennedy Center installed President Trump’s name on the facade of the arts center, which had been designated as a living memorial to President John F. Kennedy."
  },
  {
    "title": "Immigration Officials Deport Queens 6-Year-Old and Father Who Fled China",
    "link": "https://www.nytimes.com/2025/12/19/nyregion/child-father-deported-china-nyc.html",
    "summary": "Hundreds of people had rallied for the family in New York City after they were separated by Immigration and Customs Enforcement agents in November."
  },
  {
    "title": "Trump Announces Pricing Deals With Nine Drugmakers",
    "link": "https://www.nytimes.com/2025/12/19/health/trump-drug-pricing-deals.html",
    "summary": "The companies were the latest to agree to sell drugs to Medicaid and directly to consumers at discounted prices. President Trump said he would soon begin similar negotiations with health insurers."
  },
  {
    "title": "Elon Musk’s 2018 Tesla Pay Deal Is Restored by Delaware Supreme Court",
    "link": "https://www.nytimes.com/2025/12/19/business/elon-musk-pay-ruling-delaware.html",
    "summary": "A state judge had invalidated the package, saying shareholders were not properly informed about it. Friday’s ruling cleared the plan, now worth $139 billion."
  },
  {
    "title": "Carrie Coon and Tracy Letts Want to Get Under Your Skin",
    "link": "https://www.nytimes.com/2025/12/19/theater/carrie-coon-tracy-letts-bug-broadway.html",
    "summary": "The couple are gearing up for the Broadway opening of “Bug,” about a descent into paranoia and psychosis in a squalid motel room."
  },
  {
    "title": "Bumpy Rollout for New Gates Meant to Stop Subway Fare Evasion",
    "link": "https://www.nytimes.com/2025/12/19/nyregion/nyc-subway-fare-gates-mta.html",
    "summary": "At a demonstration of devices designed to replace turnstiles, one rider got hit in the neck, and another sneaked through without paying."
  },
  {
    "title": "Metro-North and LIRR Commuters to Be Fined for ‘Repeatedly’ Activating Tickets on Train",
    "link": "https://www.nytimes.com/2025/12/19/nyregion/nyc-commuters-ticket-activation-fee-lirr-metro-north.html",
    "summary": "Passengers on Metro-North and Long Island Rail Road trains could face $8 fines if they keep waiting until after the train leaves to activate their mobile tickets."
  },
  {
    "title": "Hochul Expected to Veto Bill Requiring 2-Person Crews on Subway Trains",
    "link": "https://www.nytimes.com/2025/12/19/nyregion/hochul-mta-conductors-twu.html",
    "summary": "The bill, which would ensure that every train has a conductor and a driver, as most now do, was supported by the transit workers’ union and opposed by many transit advocates."
  },
  {
    "title": "Scott C. Beardsley Named University of Virginia’s New President",
    "link": "https://www.nytimes.com/2025/12/19/us/uva-president-scott-beardsley.html",
    "summary": "The selection of Scott Beardsley by the G.O.P.-appointed board comes after the previous president resigned under pressure from the Trump administration. A new Democratic-appointed board could try to overturn the choice."
  },
  {
    "title": "Mamdani Revamps Hiring After Old Antisemitic Remarks Prompt Aide to Quit",
    "link": "https://www.nytimes.com/2025/12/19/nyregion/mamdani-vetting-overhaul-da-costa-antisemitic.html",
    "summary": "Mayor-elect Zohran Mamdani said he did not know about the antisemitic posts and would not have hired the woman who made them if he had."
  },
  {
    "title": "Mamdani Names Deputy Mayors for Housing and Economic Justice",
    "link": "https://www.nytimes.com/2025/12/19/nyregion/zohran-mamdani-leila-bozorg-julie-su.html",
    "summary": "Zohran Mamdani, New York City’s mayor-elect, tapped Leila Bozorg, a longtime public official and development advocate, and Julie Su, who served as acting secretary of labor in the Biden administration."
  },
  {
    "title": "Can This Man Finally Defeat Mexico’s Cartels?",
    "link": "https://www.nytimes.com/2025/12/19/world/americas/mexico-cartels-harfuch.html",
    "summary": "Omar García Harfuch is overseeing one of the most aggressive offensives in years against Mexico’s powerful criminal groups. Many before him have failed."
  },
  {
    "title": "Mitt Romney: Tax the Rich, Like Me",
    "link": "https://www.nytimes.com/2025/12/19/opinion/romney-tax-the-rich.html",
    "summary": "There’s no getting around this if we want to avoid the deficit cliff ahead."
  },
  {
    "title": "Times Readers Open Up About the Real Cost of Motherhood",
    "link": "https://www.nytimes.com/2025/06/25/opinion/motherhood-penalty-career.html",
    "summary": "What’s the real cost of motherhood? Here’s what our readers said."
  },
  {
    "title": "The Justice Dept. Released a Trove of Epstein Files",
    "link": "https://www.nytimes.com/2025/12/19/briefing/epstein-files-brown-mit-shootings.html",
    "summary": "Also, investigators seek a motive in killings at Brown and M.I.T. Here’s the latest at the end of Friday."
  },
  {
    "title": "Federal Judge Overturns Conviction in Killing of D.J. Jam Master Jay",
    "link": "https://www.nytimes.com/2025/12/19/nyregion/jam-master-jay-conviction-overturned.html",
    "summary": "Karl Jordan Jr., godson of the musician, was convicted last year of murder in the service of a drug deal. The judge found that the government had not proved the motive."
  },
  {
    "title": "Emily Korzenik, 96, Dies; Rabbi Took a Bar Mitzvah to Poland",
    "link": "https://www.nytimes.com/2025/12/19/nyregion/emily-faust-korzenik-dead.html",
    "summary": "Part of the first generation of women ordained in America, she presided over the first bar mitzvah in Krakow, still scarred by the Holocaust, in decades. It did not go smoothly."
  },
  {
    "title": "High Winds in Denver Prompt Warnings About Dangerous Fire Risk",
    "link": "https://www.nytimes.com/2025/12/19/weather/denver-winds-fire-colorado.html",
    "summary": "Emergency authorities across the region urged people to stay home, and a utility company cut off power to 100,000 of its customers near Denver."
  }
]