[
  {
    "title": "Food Stamp Cuts Expose Trump’s Strategy to Use Shutdown to Advance Agenda",
    "link": "https://www.nytimes.com/2025/11/02/us/politics/trump-strategy-food-stamps.html",
    "summary": "The president has stretched the limits of his powers to help those at the heart of his agenda, not the many in greatest need."
  },
  {
    "title": "For SNAP Recipients, Anxiety Over Funding Leads to Hard Choices",
    "link": "https://www.nytimes.com/2025/11/02/us/im-going-to-stretch-it-anxiety-over-snap-leads-to-hard-choices.html",
    "summary": "At one grocery store in Massachusetts, shoppers grappled with growing fears and lighter carts."
  },
  {
    "title": "Even for Some Mamdani Supporters, His Thin Résumé Is Cause for Concern",
    "link": "https://www.nytimes.com/2025/11/02/nyregion/mamdani-experience-mayor.html",
    "summary": "Many voters struggle with a fundamental question about Zohran Mamdani’s candidacy: Is a 34-year-old state assemblyman ready to lead the nation’s largest city?"
  },
  {
    "title": "In Chinese American Families, There’s a Generational Split on Mamdani",
    "link": "https://www.nytimes.com/2025/11/02/business/zohran-mamdani-chinese.html",
    "summary": "Many older Chinese immigrants are shifting to the political right, dividing from their children, a trend playing out in the New York City mayor’s race."
  },
  {
    "title": "Andrew Cuomo, Scraping and Scrambling, Is Still Running as Andrew Cuomo",
    "link": "https://www.nytimes.com/2025/10/30/nyregion/andrew-cuomo-campaign.html",
    "summary": "The former governor, a distant second in most polls of the New York City mayor’s race, is working harder to attract voters and remind them who he is."
  },
  {
    "title": "Trump’s Retribution Campaign Leaves D.C. Prosecutor’s Office in Crisis",
    "link": "https://www.nytimes.com/2025/11/02/us/politics/trump-pirro-washington-prosecutors.html",
    "summary": "Few places have felt the effects as palpably as the U.S. attorney’s office in Washington, which is deeply enmeshed in the workings of government and has filed criminal cases against President Trump."
  },
  {
    "title": "Will Trump’s Tariff Deal Tilt the Playing Field Back Toward China?",
    "link": "https://www.nytimes.com/2025/11/02/business/economy/trump-tariff-deal-china.html",
    "summary": "The president’s trade truce with China has lowered U.S. tariffs to a level that could pause a longer-term effort to reduce America’s dependence on Beijing."
  },
  {
    "title": "War Powers Law Does Not Apply to Trump’s Boat Strikes, Administration Says",
    "link": "https://www.nytimes.com/2025/11/01/us/politics/trump-boat-attacks-war-powers.html",
    "summary": "The move deepened the idea that a Vietnam-era law, which says congressionally unauthorized deployments into “hostilities” must end after 60 days, does not apply to airstrike campaigns."
  },
  {
    "title": "Builders Find Hardship in Trump’s Tariffs And Deportations",
    "link": "https://www.nytimes.com/2025/11/02/business/construction-tariffs-immigration-trump.html",
    "summary": "Material costs are rising, workers are scarce and customers are delaying new construction plans."
  },
  {
    "title": "How to Track Runners in the NYC Marathon",
    "link": "https://www.nytimes.com/article/track-runners-nyc-marathon.html",
    "summary": "Spectators can use an app to track runners in real time on race day."
  },
  {
    "title": "She Was Ready to Have Her 15th Child. Then Came the Felony Charges.",
    "link": "https://www.nytimes.com/2025/11/02/magazine/marybeth-lewis-13-children-felony-charges.html",
    "summary": "MaryBeth Lewis’s desire to be a new mom again, at 65 years old, led to a custody battle like no other."
  },
  {
    "title": "In a Dark Year, Los Angeles Basks in the Dodgers’ Glow",
    "link": "https://www.nytimes.com/2025/11/02/us/los-angeles-celebrates-dodgers.html",
    "summary": "Scars of wildfires and immigration raids won’t soon fade, but like the city itself, the Dodgers persevered and gave Southern California residents the rally they needed."
  },
  {
    "title": "Canadians Mourn a Loss by Underdogs Who Brought a Nation Together",
    "link": "https://www.nytimes.com/2025/11/02/world/canada/blue-jays-dodgers-world-series-canada.html",
    "summary": "The Blue Jays, Canada’s only M.L.B. team, were a salve for a country hit by President Trump’s threats and tariffs. Then the Dodgers ended their thrilling postseason run."
  },
  {
    "title": "This Is the Way You Beat Trump — and Trumpism",
    "link": "https://www.nytimes.com/2025/11/02/opinion/democrats-liberalism-elections-crick.html",
    "summary": "Democrats do not just need to win more people. They also need to win more places."
  },
  {
    "title": "A.I. Is Deciding Who You Are",
    "link": "https://www.nytimes.com/2025/11/02/opinion/ai-privacy.html",
    "summary": "In the age of A.I., personal data is anything but personal."
  },
  {
    "title": "The New Host of The Morning",
    "link": "https://www.nytimes.com/2025/11/02/world/sam-sifton-new-york-city-marathon-dodgers.html",
    "summary": "I’m Sam Sifton. Before we get to the news today, I’d like to tell you a little about myself. You ought to know who’s writing to you."
  },
  {
    "title": "Meet Your News Friend, the New Host of The Morning",
    "link": "https://www.nytimes.com/2025/11/02/world/02themorning-meet-sam-sifton.html",
    "summary": "Sam Sifton wants readers to know: Everything is going to be all right, and you’re not alone."
  },
  {
    "title": "Communities in Hurricane-Ravaged Jamaica Still Cut Off as Death Toll Climbs",
    "link": "https://www.nytimes.com/2025/11/02/world/americas/jamaica-hurricane-melissa-death-toll.html",
    "summary": "The authorities have yet to reach dozens of areas in Jamaica, raising the question of how many people really died in last week’s storm."
  },
  {
    "title": "For Day of the Dead, One Mexican Town Digs Up Its Dead",
    "link": "https://www.nytimes.com/2025/11/02/world/americas/mexico-day-of-the-dead-bones-pomuch.html",
    "summary": "Pomuch, Mexico, is one of the last places where residents clean their relatives’ bones. Now they are grappling with a new challenge: tourists."
  },
  {
    "title": "Police Arrest Two British Men in Stabbing Rampage on Train",
    "link": "https://www.nytimes.com/2025/11/02/world/europe/uk-train-stabbing-huntingdon.html",
    "summary": "U.K. officials said they did not believe the attack on a train to London was connected to terrorism. Two of the 11 people wounded in the stabbing spree remain in critical condition, the police said."
  }
]