[
  {
    "title": "As Hours Dwindled Before Flight Cuts, the Government Was Publicly Mum",
    "link": "https://www.nytimes.com/2025/11/06/us/politics/flight-cuts-government-airports-faa.html",
    "summary": "Airlines did not wait for an announcement, notifying passengers and airports of expected changes before the Trump administration made official its list of affected airports."
  },
  {
    "title": "What Travelers Need to Know About the Shutdown, Flight Reductions and Delays",
    "link": "https://www.nytimes.com/2025/11/06/travel/shutdown-faa-flight-delays-cancellations.html",
    "summary": "As the government shutdown continues, more challenges await passengers as they deal with the newest announcement from the Trump administration: a 10 percent cut in flights at 40 U.S. airports."
  },
  {
    "title": "Airlines Rush to Prepare for Federal Reductions in Flights",
    "link": "https://www.nytimes.com/2025/11/06/business/airlines-federal-reductions-flights.html",
    "summary": "Airline planning and scheduling teams went into overdrive to identify which flights to cut while minimizing consequences for customers, pilots, flight attendants and the bottom line."
  },
  {
    "title": "A Nerve-Racking Week for SNAP Recipients, and Elon Musk’s $1 Trillion Pay Deal",
    "link": "https://www.nytimes.com/2025/11/07/podcasts/snap-food-stamps-elon-musk-trillion-payday.html",
    "summary": "Plus, the Friday news quiz."
  },
  {
    "title": "The Job Market Is Cooling but Not Collapsing, According to Private Data",
    "link": "https://www.nytimes.com/2025/11/07/business/jobs-unemployment-layoffs-economy.html",
    "summary": "The federal government shutdown canceled a second straight jobs report, but private data sources suggest the labor market has weakened modestly since summer."
  },
  {
    "title": "The Fed’s Recent Rate Decisions Have Been Divisive. It Is Likely to Get Worse.",
    "link": "https://www.nytimes.com/2025/11/07/business/federal-reserve-divided.html",
    "summary": "The last three policy votes have featured some form of dissent, as officials grapple with how to weigh a softening labor market and resurgent inflation."
  },
  {
    "title": "Mass Layoffs Are Scary, but Probably Not a Sign of the A.I. Apocalypse",
    "link": "https://www.nytimes.com/2025/11/07/business/layoffs-ai-replacement.html",
    "summary": "Despite fears that Amazon and other employers are already replacing workers with bots, the A.I. transition is likely to play out differently."
  },
  {
    "title": "Why Germany Is Still Divided When It Comes to Russia",
    "link": "https://www.nytimes.com/2025/11/07/world/europe/germany-russia-divide.html",
    "summary": "Many East Germans are more sympathetic toward Moscow than their western compatriots, reflecting decades of Soviet ties and disillusionment since reunification."
  },
  {
    "title": "Russian Jailed for Placing Tiny Antiwar Signs in a Market Says She Would Do it Again",
    "link": "https://www.nytimes.com/2025/11/07/world/europe/russia-protester-antiwar-aleksandra-skochilenko.html",
    "summary": "Freed in a major prisoner swap, Aleksandra Skochilenko said “the values of freedom of speech, of peace, could be more important than spending even 10 years in jail.”"
  },
  {
    "title": "Russian Sanctions Risk Straining Trump’s Chummy Relationship With Hungarian Leader",
    "link": "https://www.nytimes.com/2025/11/07/world/europe/trump-orban-meeting-russia-sanctions.html",
    "summary": "New U.S. penalties on Russian energy could be a sticking point as President Trump and Prime Minister Viktor Orban of Hungary meet."
  },
  {
    "title": "The Sierra Club Embraced Social Justice. Then It Tore Itself Apart.",
    "link": "https://www.nytimes.com/2025/11/07/us/politics/sierra-club-social-justice.html",
    "summary": "The environmental group gave up its singular focus on climate change for a broader agenda. The ensuing internal strife left it weakened as it takes on the Trump administration."
  },
  {
    "title": "Mamdani Wants to Tax the Rich. Can He Persuade State Leaders?",
    "link": "https://www.nytimes.com/2025/11/06/nyregion/mamdani-hochul-childcare-tax.html",
    "summary": "After an impressive victory, Mayor-elect Zohran Mamdani now must find funds for his programs. His push for higher taxes puts Gov. Kathy Hochul, who faces a re-election fight, in a tough spot."
  },
  {
    "title": "Rent-Stabilized to Rent-Free? Mamdani Could Be Headed to Gracie Mansion.",
    "link": "https://www.nytimes.com/2025/11/07/nyregion/mamdani-gracie-mansion-nyc-mayor.html",
    "summary": "Five bedrooms. A ballroom. A full-time chef. The official mayoral residence in New York City could not be more different from Zohran Mamdani’s current home."
  },
  {
    "title": "As Saudi Arabia Cracks Down on Drugs, Executions Near a Record High",
    "link": "https://www.nytimes.com/2025/11/07/world/middleeast/saudi-arabia-executions-war-on-drugs.html",
    "summary": "Facing an influx of amphetamines, the kingdom has put hundreds of people to death, many of them foreigners convicted of low-level smuggling."
  },
  {
    "title": "The 2025 New York Times/New York Public Library Best Illustrated Children’s Books",
    "link": "https://www.nytimes.com/2025/11/07/books/review/nyt-nypl-best-illustrated-childrens-books-award.html",
    "summary": "Take a peek at this year’s winners."
  },
  {
    "title": "As Idaho Grows Ever Redder, Boise Worries About Its Isolation",
    "link": "https://www.nytimes.com/2025/11/07/us/politics/boise-idaho-trump-conservatism.html",
    "summary": "Two city councilors won re-election on Tuesday, though their support for a pride flag at City Hall had sparked challenges from the right. Still, Idaho’s deep embrace of President Trump has the city worried."
  },
  {
    "title": "Trump’s Tariffs Leave Swiss Farmers With Too Much Milk",
    "link": "https://www.nytimes.com/2025/11/07/business/switzerland-tariffs-trump-milk-cheese-cows.html",
    "summary": "The country’s dairy farmers produced a bumper harvest of milk, but higher U.S. duties have forced them to consider ways to cut back, including slaughtering cows."
  },
  {
    "title": "Trump’s Tariffs Scar Canadian City Where Cars Have Been Made for Decades",
    "link": "https://www.nytimes.com/2025/11/07/world/canada/trump-tariffs-stellantis-canada-brampton.html",
    "summary": "An automaker’s decision to shift Canadian jobs to the United States has left workers in Brampton, Ontario, feeling betrayed and angry."
  },
  {
    "title": "China’s Exports Unexpectedly Falter as Prices Keep Falling",
    "link": "https://www.nytimes.com/2025/11/07/business/china-exports-fall.html",
    "summary": "Exports of cars, solar panels and batteries remain strong, but prices are falling because of factory overcapacity in China."
  },
  {
    "title": "Japanese Automakers Warn of Billions in Tariff Losses",
    "link": "https://www.nytimes.com/2025/11/07/business/japanese-automakers-tariff-losses.html",
    "summary": "Toyota, Honda and Nissan forecast big hits to their profits from higher tariffs that they acknowledged were likely ‘here to stay.’"
  },
  {
    "title": "Nancy Pelosi's Rise From Stay-at-Home Mom to House Speaker",
    "link": "https://www.nytimes.com/2025/11/06/us/nancy-pelosi-career-highlights.html",
    "summary": "The daughter of a politician, she didn’t expect to become one. But once she ran for office in 1987, there was no stopping her."
  },
  {
    "title": "San Francisco Sees Nancy Pelosi as a Tireless Leader for the City",
    "link": "https://www.nytimes.com/2025/11/06/us/nancy-pelosi-san-francisco-retirement.html",
    "summary": "Representative Nancy Pelosi, after announcing her retirement, was praised by many San Franciscans for her tireless efforts on behalf of the city. Some of her work went unheralded."
  },
  {
    "title": "More Democrats Need to Follow Pelosi’s Example and Retire",
    "link": "https://www.nytimes.com/2025/11/07/opinion/pelosi-age-democrats-retirement.html",
    "summary": "She has shown herself more willing than most to put aside her own ego for the greater good."
  },
  {
    "title": "‘The Jitterbug Seems Justified!’: 3 Writers on Democratic Elation and G.O.P. Alarm",
    "link": "https://www.nytimes.com/2025/11/07/opinion/elections-2025-trump-democrats.html",
    "summary": "What both parties should take away from a night of Democratic victories."
  },
  {
    "title": "Late Night Laments the Effects of the Longest-Ever Government Shutdown",
    "link": "https://www.nytimes.com/2025/11/07/arts/television/late-night-government-shutdown-airports.html",
    "summary": "Stephen Colbert advised that anyone traveling for Thanksgiving “might want to leave now.”"
  },
  {
    "title": "Lawsuits Blame ChatGPT for Suicides and Harmful Delusions",
    "link": "https://www.nytimes.com/2025/11/06/technology/chatgpt-lawsuit-suicides-delusions.html",
    "summary": "Seven complaints, filed on Thursday, claim the popular chatbot encouraged dangerous discussions and led to mental breakdowns."
  },
  {
    "title": "U.S. Sends Attack Aircraft to El Salvador Amid Regional Troop Buildup",
    "link": "https://www.nytimes.com/2025/11/06/world/americas/us-military-planes-el-salvador.html",
    "summary": "A New York Times analysis of satellite imagery and air traffic control communications found that U.S. military planes began operating out of the Central American country in mid-October."
  },
  {
    "title": "In N.B.A. Betting Scandal, Internet Touts Played Old Game in a New Form",
    "link": "https://www.nytimes.com/2025/11/07/nyregion/nba-betting-online-influencers.html",
    "summary": "A Supreme Court decision created a sports gambling industry now worth $14 billion. Many are angling for a cut."
  },
  {
    "title": "Former King of Spain, Juan Carlos, Details Death of Brother in Memoir",
    "link": "https://www.nytimes.com/2025/11/07/world/europe/spain-juan-carlos-king-memoir.html",
    "summary": "He wrote about the accident that killed his brother nearly 70 years ago. The book also describes his respect for Gen. Francisco Franco, the former dictator."
  }
]