[
  {
    "title": "No Proof Hamas Routinely Stole U.N. Aid, Israeli Military Officials Say",
    "link": "https://www.nytimes.com/2025/07/26/world/middleeast/hamas-un-aid-theft.html",
    "summary": "Israel has long restricted or completely blocked aid to Gaza on the argument that Hamas steals it to use as a weapon of control over the population."
  },
  {
    "title": "What to Know About the Deadly Shootings Near a Gaza Aid Site",
    "link": "https://www.nytimes.com/article/israel-gaza-aid-ground-offensive.html",
    "summary": "The head of the United Nations, Antonio Guterres, said the situation in Gaza was “a moral crisis that challenges the global conscience.”"
  },
  {
    "title": "From Epstein to Obama, Trump’s Washington Is Consumed by Competing Conspiracies",
    "link": "https://www.nytimes.com/2025/07/26/us/politics/trump-epstein-obama-conspiracies.html",
    "summary": "President Trump is trying to divert attention from the Epstein conspiracy theory with a new-and-improved one about Barack Obama and treason."
  },
  {
    "title": "A Clash Over a Promotion Puts Hegseth at Odds With His Generals",
    "link": "https://www.nytimes.com/2025/07/26/us/politics/hegseth-pentagon-leadership.html",
    "summary": "Suspicions about leaks and a mistrust of senior military officers have defined much of the defense secretary’s first six months on the job."
  },
  {
    "title": "A Kennedy Toils in Mississippi, Tracing His Grandfather’s Path",
    "link": "https://www.nytimes.com/2025/07/26/us/politics/joe-kennedy-mississippi.html",
    "summary": "Joe Kennedy III, the grandson of Senator Robert F. Kennedy, says there is work to do in red states. He also has a few things to say about his uncle, Robert F. Kennedy Jr."
  },
  {
    "title": "This Democrat Wants Cognitive Standards in Congress. Her Colleagues Disagree.",
    "link": "https://www.nytimes.com/2025/07/26/us/politics/age-cognitive-standards-congress.html",
    "summary": "Representative Marie Gluesenkamp Perez says age-related cognitive decline among elected officials is a major issue for voters."
  },
  {
    "title": "In Russia, Corruption Cases Follow Battlefield Failures",
    "link": "https://www.nytimes.com/2025/07/26/world/europe/russia-corruption-ukraine-war.html",
    "summary": "Officials in three of the five Russian regions bordering Ukraine have been accused of embezzling funds for border defenses."
  },
  {
    "title": "New Reports on Russian Interference Show Trump’s Claims on Obama Are Overblown",
    "link": "https://www.nytimes.com/2025/07/25/us/trump-obama-russia.html",
    "summary": "The administration’s claims are overblown, but newly declassified information provides some messy details about a January 2017 intelligence assessment of Moscow’s election interference."
  },
  {
    "title": "He Read (at Least) 3,599 Books in His Lifetime. Now Anyone Can See His List.",
    "link": "https://www.nytimes.com/2025/07/26/books/man-died-book-list-thousands.html",
    "summary": "After Dan Pelzer died this month at 92, his children uploaded the handwritten reading list to what-dan-read.com, hoping to inspire readers everywhere."
  },
  {
    "title": "Houston’s Astrodome Was a Vision of the Future. It’s Past Its Prime.",
    "link": "https://www.nytimes.com/2025/07/26/us/houston-astrodome.html",
    "summary": "Once a wonder of the world, the storied but moldering stadium has long been part of life in Houston. Is it worth saving?"
  },
  {
    "title": "Saving for College Once Felt Essential. Some Parents Are Rethinking Their Plans.",
    "link": "https://www.nytimes.com/2025/07/26/business/529-parents-saving-college.html",
    "summary": "Generations of parents have opened 529 plans to save for their children’s educations. Now some are reconsidering the value of college and looking into other options."
  },
  {
    "title": "How 529 Plans Are Changing With Passage of Trump’s Policy Law",
    "link": "https://www.nytimes.com/2025/07/26/your-money/529-plans-education-changes.html",
    "summary": "President Trump’s new policy law has broadened the uses of plans that were once primarily for saving for college. “They’ve become education savings accounts,” one expert said."
  },
  {
    "title": "How Hulk Hogan Leg-Dropped the Digital Media Industry",
    "link": "https://www.nytimes.com/2025/07/26/magazine/hulk-hogan-digital-media-industry.html",
    "summary": "His lawsuit over a leaked sex tape bankrupted Gawker Media — and helped inspire the American right’s ongoing war on the press."
  },
  {
    "title": "Harvard’s Leader, Penny Pritzker, Faces Intense Scrutiny in Trump Fight",
    "link": "https://www.nytimes.com/2025/07/26/us/harvard-penny-pritzker.html",
    "summary": "As Harvard and the government negotiate to end a conflict with billions of dollars on the line, some ask whether Penny Pritzker, the head of the school’s governing board, should step down."
  },
  {
    "title": "A Judge Gave a One-Word Answer. It Torpedoed the Etan Patz Case.",
    "link": "https://www.nytimes.com/2025/07/26/nyregion/etan-patz-case-challenges.html",
    "summary": "After an appeals court overturned a conviction, prosecutors must decide whether to retry a man in the notorious 1979 child killing for a third time."
  },
  {
    "title": "Plastic Turf Fields Are Taking Over America",
    "link": "https://www.nytimes.com/2025/07/26/business/artificial-turf-grass-sports.html",
    "summary": "The debate over whether to install turf over grass fields has become a referendum on sports, health, the environment and the use of scarce public resources."
  },
  {
    "title": "CBS: Caving. Bowing. Scraping.",
    "link": "https://www.nytimes.com/2025/07/26/opinion/trump-south-park-cbs.html",
    "summary": "Don’t take on satirists — they always get the last laugh."
  },
  {
    "title": "New York Is Planning a Train Line to Connect Its Transit Deserts. We Walked All 14 Miles of It.",
    "link": "https://www.nytimes.com/2025/07/26/opinion/interborough-express-brooklyn-queens-public-space.html",
    "summary": "What would light-rail service change about the space that keeps us apart?"
  },
  {
    "title": "Little Victories",
    "link": "https://www.nytimes.com/2025/07/26/briefing/little-victories.html",
    "summary": "We tend to confine our parties to milestones and cultural events, but there are countless micro-occasions worthy of commemorating."
  },
  {
    "title": "Drivers vs. Cyclists: A Battle For the Streets in Canada’s Largest City",
    "link": "https://www.nytimes.com/2025/07/26/world/canada/bike-lanes-toronto.html",
    "summary": "Cyclists in Toronto are resisting a law that would have the city rip out miles of bike lanes, setting back efforts toward safer streets."
  },
  {
    "title": "Trump Says He Expects Quick Cease-Fire Between Thailand and Cambodia",
    "link": "https://www.nytimes.com/2025/07/26/world/asia/thailand-cambodia-fighting-conflict-expands.html",
    "summary": "President Trump said he had intervened to help stop the deadly strife, now in its third day, after it extended to provinces about 200 miles south of where clashes began."
  },
  {
    "title": "The Hidden Victims of New York’s Worsening Housing Crisis",
    "link": "https://www.nytimes.com/2025/07/26/nyregion/nyc-overcrowding-homeless.html",
    "summary": "Thousands of people don’t have stable housing, sleeping on floors and couches and packed into too-small bedrooms. But they are not considered to be homeless."
  },
  {
    "title": "What to Know About the Hack at Tea, an App Where Women Share Red Flags About Men",
    "link": "https://www.nytimes.com/2025/07/26/us/tea-safety-dating-app-hack.html",
    "summary": "A data breach exposed photos and ID cards of women who signed up for a fast-growing app for women to share details of men they might date."
  }
]