[
  {
    "title": "Trump Said to Demand Justice Dept. Pay Him $230 Million for Past Cases",
    "link": "https://www.nytimes.com/2025/10/21/us/politics/trump-justice-department-compensation.html",
    "summary": "Senior department officials who were defense lawyers for the president and those in his orbit are now in jobs that typically must approve any such payout, underscoring potential ethical conflicts."
  },
  {
    "title": "Trump Dismisses Another Inspector General, Fueling Oversight Concerns",
    "link": "https://www.nytimes.com/2025/10/21/us/politics/trump-inspectors-general.html",
    "summary": "With the firing of the Export-Import Bank’s inspector general, the president has sidelined around two dozen of the watchdogs who seek out fraud and mismanagement in federal agencies."
  },
  {
    "title": "Trump Officials Move Toward Deal With University of Virginia After Standoff",
    "link": "https://www.nytimes.com/2025/10/21/us/politics/trump-virginia-university.html",
    "summary": "The Trump administration is closing in on a deal with the University of Virginia, four months after government pressure forced the school’s previous president to resign."
  },
  {
    "title": "A 200-Year-Old Precedent Holds the Key to Trump’s Troop Deployment",
    "link": "https://www.nytimes.com/2025/10/21/us/politics/supreme-court-national-guard-precedent.html",
    "summary": "The administration says the ruling, stemming from the seizure of an old mare, forbids judges from second-guessing his use of the National Guard."
  },
  {
    "title": "In Trump’s Washington, Hate Is Not a Deal Breaker",
    "link": "https://www.nytimes.com/2025/10/21/us/politics/trump-ingrassia-republicans.html",
    "summary": "Paul Ingrassia’s nomination illustrated how much antisemitic and hateful rhetoric has been explained away or rewarded by Republicans in power."
  },
  {
    "title": "As Trump Moves Forward With White House Ballroom Project, Architects Raise Concerns",
    "link": "https://www.nytimes.com/2025/10/21/arts/design/trump-ballroom-architects-review.html",
    "summary": "Architects were surprised by the scale and speed of the project, but the president is moving forward with his plans for a ballroom at the White House."
  },
  {
    "title": "What to Know About Trump’s Plan for a Triumphal Arch in Washington",
    "link": "https://www.nytimes.com/2025/10/21/us/politics/trump-arch-washington-memorial.html",
    "summary": "President Trump has proposed construction of an arch in the style of the Arc de Triomphe in Washington in the lead-up to the nation’s 250th anniversary."
  },
  {
    "title": "In a Reversal, Trump Will Not Meet With Putin in Coming Weeks",
    "link": "https://www.nytimes.com/2025/10/21/us/politics/trump-putin-ukraine-meeting.html",
    "summary": "The back-and-forth was the latest example of President Trump teasing a breakthrough, only to be pulled back by President Vladimir V. Putin of Russia."
  },
  {
    "title": "Inside Luigi Mangione’s Missing Months",
    "link": "https://www.nytimes.com/2025/10/21/us/luigi-mangione-asia-trip.html",
    "summary": "From beers at a Bangkok bar to a climb up Mount Omine in Japan, The Times traced the pivotal months before Mr. Mangione was charged with killing UnitedHealthcare’s C.E.O."
  },
  {
    "title": "With Israel-Hamas Cease-Fire, Some Pro-Palestinian Protesters Look Back at Their Movement, Ruefully",
    "link": "https://www.nytimes.com/2025/10/21/us/politics/campus-protesters-israel-gaza-cease-fire-reaction.html",
    "summary": "Activists welcome the truce. But the backlash to their demonstrations, some said, offered sobering lessons about power and politics."
  },
  {
    "title": "Vance Lands in Israel as U.S. Tries to Shore Up Gaza Cease-Fire Deal",
    "link": "https://www.nytimes.com/2025/10/21/world/middleeast/jd-vance-israel-gaza-ceasefire.html",
    "summary": "Vice President JD Vance appeared undeterred by recent flare-ups of violence in Gaza, and he declined to set a deadline for when Hamas must disarm."
  },
  {
    "title": "A Nepali Town Mourns a Native Son Who Died a Hamas Captive",
    "link": "https://www.nytimes.com/2025/10/21/world/asia/nepal-hostage-hamas-funeral.html",
    "summary": "The family of Bipin Joshi, a student, had campaigned internationally for his release and had held out hope until the end that after two years in Gaza, he would return alive."
  },
  {
    "title": "Stolen Louvre Jewelry Worth Over $100 Million, Paris Prosecutor Says",
    "link": "https://www.nytimes.com/2025/10/21/world/europe/louvre-robbery-jewelry.html",
    "summary": "The eight pieces are unlikely to garner that price if they are split apart or melted, the prosecutor said Tuesday."
  },
  {
    "title": "Paris Tour Guide Saw Stolen Louvre Jewels Just Before Heist",
    "link": "https://www.nytimes.com/2025/10/21/style/louvre-heist-jewels-tour-guide.html",
    "summary": "Jewelry swiped from the museum played a prominent part in a private guide’s tours of Paris. Now what?"
  },
  {
    "title": "Stephanie Johnson, Burlesque Dancer With Stories to Tell, Dies at 81",
    "link": "https://www.nytimes.com/2025/10/21/fashion/stephanie-tanqueray-johnson-dead.html",
    "summary": "Her memories of her days as Tanqueray in the gritty New York of the 1960s and ’70s found a new audience in recent years and made her a social media star."
  },
  {
    "title": "Why Mamdani Frightens Jews Like Me",
    "link": "https://www.nytimes.com/2025/10/21/opinion/zohran-mamdani-israel-gaza-jewish.html",
    "summary": "A candidate who stands out for his monomania, double standards and affinity for extremists."
  },
  {
    "title": "Taylor Swift’s ‘Life of a Showgirl’ Is Both Coarse and Conservative",
    "link": "https://www.nytimes.com/2025/10/21/opinion/taylor-swift-life-showgirl-conservative.html",
    "summary": "Coarseness and conservative impulses in “The Life of a Showgirl.”"
  },
  {
    "title": "Trump Is Demanding Millions From His Own Administration",
    "link": "https://www.nytimes.com/2025/10/21/briefing/trump-justice-department-japan-prime-minister.html",
    "summary": "Also, Japan elected its first female prime minister. Here’s the latest at the end of Tuesday."
  },
  {
    "title": "Antidepressant Side Effects Vary Widely by Drug, Study Finds",
    "link": "https://www.nytimes.com/2025/10/21/well/antidepressant-side-effects.html",
    "summary": "A new study compared the effects of 30 drugs on cholesterol, blood pressure and weight gain."
  },
  {
    "title": "Alina Habba Told to Release Videos in Assault Case Against Democrat",
    "link": "https://www.nytimes.com/2025/10/21/nyregion/lamonica-mciver-ice-charges.html",
    "summary": "A federal judge overseeing a case against Representative LaMonica McIver of New Jersey ordered prosecutors to release all relevant footage from a migrant detention facility."
  },
  {
    "title": "Eric Lu, an American, Wins International Chopin Piano Competition",
    "link": "https://www.nytimes.com/2025/10/21/arts/music/chopin-piano-competition-eric-lu.html",
    "summary": "In Warsaw, a 27-year-old pianist from Massachusetts beat out 180 competitors to win what some call the Olympics of the piano world."
  },
  {
    "title": "U.S. Marshal and Immigrant Are Shot During L.A. Traffic Stop",
    "link": "https://www.nytimes.com/2025/10/21/us/us-marshal-immigrant-shot-la-traffic-stop.html",
    "summary": "Officials said immigration officers fired shots after the man rammed a law enforcement vehicle. The immigrant and a marshal were wounded in the shooting."
  }
]