[
  {
    "title": "Trump Says He Will Meet With Putin in Alaska Next Week",
    "link": "https://www.nytimes.com/2025/08/08/us/politics/trump-russia-ukraine-deal.html",
    "summary": "Mr. Trump also suggested that a peace deal between Russia and Ukraine would include “some swapping of territories,” signaling that the U.S. may join Russia in trying to compel Ukraine to cede land."
  },
  {
    "title": "What Putin Hopes to Gain From a Summit With Trump",
    "link": "https://www.nytimes.com/2025/08/08/world/europe/putin-trump-summit-ukraine.html",
    "summary": "The American leader has agreed to a meeting with the Russian president in Alaska next Friday to discuss ending the war in Ukraine."
  },
  {
    "title": "India’s Modi Left Soul-Searching After Failed Courtships of Xi and Trump",
    "link": "https://www.nytimes.com/2025/08/08/world/asia/modi-india-trump-china-tariffs.html",
    "summary": "The collapse of the prime minister’s high-stakes efforts to transform ties with the world’s two superpowers has exposed the limits of India’s leverage."
  },
  {
    "title": "Trump Just Shrugs as Kennedy Undermines His Vaccine Legacy",
    "link": "https://www.nytimes.com/2025/08/08/us/politics/trump-kennedy-vaccines.html",
    "summary": "President Trump’s laissez-faire approach is notable, given that the development of the Covid vaccine was seen as one of his first term’s most notable achievements."
  },
  {
    "title": "Trump Is Removing Billy Long as the I.R.S. Head 2 Months After He Was Confirmed",
    "link": "https://www.nytimes.com/2025/08/08/us/politics/trump-billy-long-irs-commissioner.html",
    "summary": "Billy Long, a former Republican congressman, will no longer serve as the tax agency’s head. Treasury Secretary Scott Bessent will oversee the agency as acting commissioner."
  },
  {
    "title": "Trump Officials Press Case Against Harvard, and Add New Investigation",
    "link": "https://www.nytimes.com/2025/08/08/us/trump-harvard-patent-investigation-international-students.html",
    "summary": "The administration doubled down against Harvard, asserting that rising violent crime on campus meant the school should not host international students. It will also review the school’s patents."
  },
  {
    "title": "Suspect and Officer Are Dead After Shooting Outside CDC Near Emory University in Atlanta",
    "link": "https://www.nytimes.com/2025/08/08/us/emory-university-cdc-shooting.html",
    "summary": "The gunman fired at the headquarters of the Centers for Disease Control and Prevention because he blamed the Covid vaccine for his maladies, an official said."
  },
  {
    "title": "What Lobsters and Chickens Reveal About Europe’s Trade Strategy",
    "link": "https://www.nytimes.com/2025/08/09/world/europe/trump-tariffs-europe-trade-lobster-beef.html",
    "summary": "The European Union struck a trade deal that protected political priorities, like chicken and beef standards, while allowing headline-grabbing concessions. Consider lobsters."
  },
  {
    "title": "The Tycoons Who Profit From India’s Thirst for Russian Oil",
    "link": "https://www.nytimes.com/2025/08/09/business/india-russian-oil-ambani.html",
    "summary": "President Trump’s new front in the trade war against India focuses on a pair of enormous refineries with extraordinary owners."
  },
  {
    "title": "Why Are Tariffs on Switzerland So High?",
    "link": "https://www.nytimes.com/2025/08/08/business/tariffs-switzerland-trump.html",
    "summary": "President Trump sees Switzerland as doing too little to address its trade deficit with the U.S., a gap he focused on as he imposed a 39% tariff on Swiss goods."
  },
  {
    "title": "An Unusual Soccer Finale in Italy Reveals Libya’s Frailties",
    "link": "https://www.nytimes.com/2025/08/09/sports/an-unusual-soccer-finale-in-italy-reveals-libyas-frailties.html",
    "summary": "With two governments, and two soccer leagues, Libya is holding its soccer championship in Italy for a second year. Volatile politics and fans follow."
  },
  {
    "title": "Is Kim Jong-un Preparing a Successor?",
    "link": "https://www.nytimes.com/video/world/asia/100000010324151/is-kim-jong-un-preparing-a-successor.html",
    "summary": "Kim Jong-un, the leader of North Korea, might be preparing his young daughter, Kim Ju-ae, to become his successor. Choe Sang-Hun, the ​Seoul bureau chief for The New York Times, analyzed North Korean state propaganda to find out."
  },
  {
    "title": "William H. Webster, Who Ran Both the F.B.I. and the C.I.A., Dies at 101",
    "link": "https://www.nytimes.com/2025/08/08/us/william-h-webster-dead.html",
    "summary": "A former federal judge, he first came to the F.B.I. just as two of the worst spies in American history were running rampant."
  },
  {
    "title": "Texas Attorney General Moves to Oust Democrats From Office Over Walkout",
    "link": "https://www.nytimes.com/2025/08/08/us/politics/texas-redistricting-democrats.html",
    "summary": "Democratic lawmakers maintained their walkout to thwart a Republican gerrymander, prompting Ken Paxton to ask the state’s Supreme Court to remove 13 of them from their seats."
  },
  {
    "title": "At ‘Alligator Alcatraz,’ Did a Detainee Just Faint or Need CPR?",
    "link": "https://www.nytimes.com/2025/08/08/us/alligator-alcatraz-detainees-medical-treatment.html",
    "summary": "Homeland Security says a detainee fainted. But other accounts say the man was unconscious. One witness said the guards did not seem to know how to check his pulse."
  },
  {
    "title": "‘Alligator Alcatraz’ in the Florida Everglades Is Testing Environmental Law",
    "link": "https://www.nytimes.com/2025/08/08/climate/alligator-alcatraz-everglades-airport.html",
    "summary": "Officials building a Florida detention center appear to be skipping environmental reviews made mandatory decades ago after a fight over an airport at the very same spot."
  },
  {
    "title": "ICE Is Holding Migrants in Crowded and Unsanitary Cells, Suit Claims",
    "link": "https://www.nytimes.com/2025/08/08/nyregion/immigration-holding-cells-lawsuit-aclu.html",
    "summary": "The Immigration and Customs Enforcement facilities in New York have been used to detain migrants for days. U.S. officials have denied that the conditions are poor."
  },
  {
    "title": "Astronaut James Lovell, Commander of Apollo 13, Dies at 97",
    "link": "https://www.nytimes.com/2025/08/08/science/space/james-a-lovell-jr-dead.html",
    "summary": "He led the three-man crew that survived a near catastrophic explosion in space in 1970, and was later immortalized by Tom Hanks in the movie “Apollo 13.”"
  },
  {
    "title": "‘Hunting Wives,’ a Raunchy and Pulpy Drama, Is Netflix’s Most Popular Show",
    "link": "https://www.nytimes.com/2025/08/08/style/hunting-wives-netflix.html",
    "summary": "The drama has all the ingredients of a binge-watch: culture wars, murder and sex."
  },
  {
    "title": "Seed Oils Are Fine, Really",
    "link": "https://www.nytimes.com/2025/08/08/opinion/seed-oils-nutrition-ingredients-science.html",
    "summary": "Nutrition science demonizing individual foods or ingredients is often based on flawed science and misses the bigger picture."
  },
  {
    "title": "Akiko Takakura Survived Atomic Bombing. This is Her Story.",
    "link": "https://www.nytimes.com/2023/04/04/opinion/hiroshima-atomic-bomb-survivor.html",
    "summary": "Akiko Takakura survived the atomic bombing of Hiroshima. This is her story, in her words."
  },
  {
    "title": "Suspect in Deadly Montana Bar Shooting Is Captured, Official Says",
    "link": "https://www.nytimes.com/2025/08/08/us/montana-shooting-suspect-captured-manhunt.html",
    "summary": "An Army veteran wanted in connection with the killing of four people at a bar in the town of Anaconda was taken into custody on Friday after an eight-day manhunt."
  },
  {
    "title": "Thousands of Dollars Worth of Labubus Stolen From California Store",
    "link": "https://www.nytimes.com/2025/08/08/us/labubu-dolls-stolen-california.html",
    "summary": "Demand for the trendy dolls, elf-like creatures with nine-tooth grins, has people lining up for hours to buy them."
  },
  {
    "title": "‘Chimp Crazy’ Star Gets Nearly 4 Years in Prison for Lying About Ape’s Death",
    "link": "https://www.nytimes.com/2025/08/08/us/chimp-crazy-tonia-haddix-prison-sentence.html",
    "summary": "Prosecutors said that Tonia Haddix perjured herself to avoid giving up custody of Tonka, who had appeared in the movies ‘George of the Jungle’ and ‘Buddy.’"
  }
]