[
  {
    "title": "The Businessman Grateful for Trump’s Tariffs",
    "link": "https://www.nytimes.com/2025/07/08/world/americas/mexico-trump-tariffs.html",
    "summary": "A small company in northern Mexico had faced steep competition from China in making straps, plugs, fasteners, grommets, zip ties and clamps. Now, U.S. tariffs have driven a spike in his business."
  },
  {
    "title": "What Happened in Trade Talks Between Japan and the U.S.",
    "link": "https://www.nytimes.com/2025/07/08/business/trump-tariffs-japan-trade-talks.html",
    "summary": "Tokyo had expected smooth tariff negotiations but is experiencing whiplash, becoming a central target of President Trump’s trade frustrations."
  },
  {
    "title": "South Korea Keeps Its Chin Up as Trump Wields Tariff Threat",
    "link": "https://www.nytimes.com/2025/07/08/business/trump-tariffs-south-korea.html",
    "summary": "The country’s new president, in office for a little over a month, had just dispatched his senior deputies to Washington to try to work out a trade deal."
  },
  {
    "title": "Trump’s New Trade Threats, and the Return of Land Mines",
    "link": "https://www.nytimes.com/2025/07/08/podcasts/the-headlines/trump-tariff-flood-texas.html",
    "summary": "Plus, your next job interview might be with A.I."
  },
  {
    "title": "What We Saw in the Texas Flood Zone",
    "link": "https://www.nytimes.com/video/us/100000010271441/what-we-saw-in-the-texas-flood-zone.html",
    "summary": "Search-and-rescue teams have been hoping against hope to find signs of life after the Texas floods. Nicholas Bogel-Burroughs, an investigative reporter at The New York Times, describes what he has seen in Texas."
  },
  {
    "title": "Trump Looks to Avoid Casting Blame in Texas Flood as Democrats Question Cuts",
    "link": "https://www.nytimes.com/2025/07/07/us/politics/trump-texas-floods.html",
    "summary": "The White House rebuked critics for raising questions about the administration’s efforts to shrink federal agencies that deal with disaster preparedness and response."
  },
  {
    "title": "Trump and Netanyahu Meet Amid Gaza Cease-Fire Negotiations",
    "link": "https://www.nytimes.com/2025/07/07/us/politics/trump-netanyahu-dinner-gaza-cease-fire.html",
    "summary": "The two confronted an array of high-stakes Middle East issues. But first they took a victory lap, including the Israeli leader telling President Trump he had nominated him for a Nobel Peace Prize."
  },
  {
    "title": "5 Israeli Soldiers Killed in Gaza, Military Says",
    "link": "https://www.nytimes.com/2025/07/08/world/middleeast/israel-gaza-soldiers-killed.html",
    "summary": "Officials said the deaths occurred during combat in the north of the enclave but offered few other details."
  },
  {
    "title": "Sweden’s Secret to Well-Being? Tiny Urban Gardens.",
    "link": "https://www.nytimes.com/2025/07/08/well/sweden-urban-gardens.html",
    "summary": "Known as koloniträdgårdar, they provide city dwellers access to nature, fresh produce and community."
  },
  {
    "title": "Trump Wants to Close the U.S. Chemical Safety and Hazard Investigation Board",
    "link": "https://www.nytimes.com/2025/07/08/climate/chemical-safety-investigator-trump-cuts.html",
    "summary": "The White House is planning to eliminate the board, a small agency that investigates chemical disasters to understand what went wrong."
  },
  {
    "title": "Trump Pledges to Send More Weapons to Ukraine",
    "link": "https://www.nytimes.com/2025/07/07/us/politics/trump-ukraine-weapons.html",
    "summary": "“They have to be able to defend themselves,” the president said, appearing to signal a reversal after his administration paused some weapons transfers just last week."
  },
  {
    "title": "‘Diddy Parties’ Became a Meme. The Combs Case Was About Something Else.",
    "link": "https://www.nytimes.com/2025/07/08/arts/music/sean-combs-diddy-trial-hotels-white-parties.html",
    "summary": "The sweep of graphic lawsuits accusing Sean Combs of sex abuse led to a sense that his criminal case might examine celebrity debauchery in the music industry. It did not."
  },
  {
    "title": "Europe Needs Rare Earth Metals. Can a Factory in Seaside France Supply Them?",
    "link": "https://www.nytimes.com/2025/07/08/world/europe/eu-china-rare-earth-minerals-metals.html",
    "summary": "The continent wants to reduce the risks of depending so heavily on China for the valuable minerals. The question is how."
  },
  {
    "title": "Macron’s U.K. State Visit: Migrants and the War in Ukraine Are on the Agenda",
    "link": "https://www.nytimes.com/2025/07/08/world/europe/macron-starmer-france-uk-state-visit.html",
    "summary": "President Emmanuel Macron’s state visit to Britain, which began Tuesday, will be heavy on pageantry. But both he and Prime Minister Keir Starmer hope for practical results."
  },
  {
    "title": "Lawrence Summers: This Law Made Me Ashamed of My Country",
    "link": "https://www.nytimes.com/2025/07/08/opinion/trump-bill-medicaid-cuts.html",
    "summary": "A focus on economics misses the human brutality that is the most problematic aspect of this legislation"
  },
  {
    "title": "The Last Words of a Dying Glacier",
    "link": "https://www.nytimes.com/2025/07/08/opinion/climate-change-melting-glacier.html",
    "summary": "A glacier is disappearing. An artist is trying to preserve its sound."
  },
  {
    "title": "A Lost Summer Idyll",
    "link": "https://www.nytimes.com/2025/07/08/briefing/camp-mystic-texas-floods.html",
    "summary": "We explore the particular horror of a disaster at a summer camp."
  },
  {
    "title": "Jon Stewart Thinks Congress Is Basically Pro Wrestling Without the Fun",
    "link": "https://www.nytimes.com/2025/07/08/arts/television/jon-stewart-trump-bill-wrestling.html",
    "summary": "The “Daily Show” host said the drama around President Trump’s big policy bill was about as authentic as a World Wrestling Entertainment match."
  },
  {
    "title": "The Brothers Who Came Face to Face in Myanmar’s War",
    "link": "https://www.nytimes.com/2025/07/08/world/asia/myanmar-civil-war-brothers.html",
    "summary": "Bloody conflict has splintered many families in Myanmar over the past four years. But for one set of siblings, a surprise reunion was joyful, if bittersweet."
  },
  {
    "title": "OpenAI and Microsoft Bankroll New A.I. Training for Teachers",
    "link": "https://www.nytimes.com/2025/07/08/technology/chatgpt-teachers-openai-microsoft.html",
    "summary": "The American Federation of Teachers said it would use the $23 million, including $500,000 from the A.I. start-up Anthropic, to create a national training center."
  },
  {
    "title": "Dan Osborn to Seek Pete Ricketts’s Nebraska Senate Seat, Stressing Class Issues",
    "link": "https://www.nytimes.com/2025/07/08/us/politics/dan-osborn-to-seek-pete-rickettss-nebraska-senate-seat-stressing-class-issues.html",
    "summary": "A steamfitter and former union leader, running as an independent but with Democratic support, will take on the Republican incumbent, a billionaire’s son."
  },
  {
    "title": "TSA to End Shoe Removal Requirement at Airport Security Checkpoints",
    "link": "https://www.nytimes.com/2025/07/07/travel/tsa-shoes-removal-airport-security.html",
    "summary": "Most passengers had been required to remove their footwear at checkpoints since 2006, a policy later eased only for members of trusted traveler programs."
  }
]