[
  {
    "title": "As Trump Looks for Distraction on Epstein, Justice Dept. Rushes to His Aid",
    "link": "https://www.nytimes.com/2025/11/17/us/politics/trump-bondi-democrats-justice-department.html",
    "summary": "The department was deployed, in effect, as an arm of the president’s rapid-response operation to help him muscle through a damaging news cycle over Jeffrey Epstein, former and current officials said."
  },
  {
    "title": "The ‘Donroe Doctrine’: Trump’s Bid to Control the Western Hemisphere",
    "link": "https://www.nytimes.com/2025/11/17/world/americas/trump-latin-america-monroe-doctrine.html",
    "summary": "President Trump has tightened the U.S. grip on the Americas by rewarding allies and punishing rivals. That has upended the region’s politics."
  },
  {
    "title": "New Passport Rule Sends Blunt and Sweeping Message to Trans Americans",
    "link": "https://www.nytimes.com/2025/11/17/us/transgender-passports-supreme-court.html",
    "summary": "The Trump administration has said that the U.S. passports of transgender people must now reflect the sex on their original birth certificate, reversing a decades-old policy."
  },
  {
    "title": "The Crypto Industry’s $28 Billion in ‘Dirty Money’",
    "link": "https://www.nytimes.com/2025/11/17/technology/crypto-exchanges-dirty-money.html",
    "summary": "As President Trump has championed crypto and the industry has gone mainstream, funds from scammers and other criminal groups have flowed onto major crypto exchanges."
  },
  {
    "title": "How Fraudsters Use Cryptocurrency A.T.M.s to Target Victims",
    "link": "https://www.nytimes.com/2025/11/17/technology/fraudsters-cryptocurrency-atms.html",
    "summary": "The kiosks, which resemble conventional A.T.M.s and convert cash into virtual currencies, are increasingly under scrutiny as a tool for scammers."
  },
  {
    "title": "How to Not Get Kidnapped for Your Bitcoin",
    "link": "https://www.nytimes.com/2025/11/17/business/how-to-not-get-kidnapped-for-your-bitcoin.html",
    "summary": "Escaping zipties, hiring bodyguards and other practical lessons in self-defense for crypto traders, after a series of gruesome crimes spooked the community."
  },
  {
    "title": "U.S. Border Patrol Arrested 81 People in Charlotte, N.C.",
    "link": "https://www.nytimes.com/2025/11/16/us/border-patrol-arrests-charlotte-nc.html",
    "summary": "Border Patrol agents descended on Charlotte over the weekend, searching for immigrants who are in the country illegally. It remains unclear how long the agents will stay."
  },
  {
    "title": "At Catholic Churches, Trump’s Immigration Crackdown Takes Center Stage",
    "link": "https://www.nytimes.com/2025/11/16/us/catholic-church-immigration-trump.html",
    "summary": "Immigration was on the minds of priests and parishioners following a letter from the nation’s Catholic bishops decrying how immigrants are being treated."
  },
  {
    "title": "New International Student Enrollment Plummeted This Fall, Survey Finds",
    "link": "https://www.nytimes.com/2025/11/17/us/international-students-enrollment-decrease.html",
    "summary": "The overall number of international students enrolled in U.S. colleges and universities, including those who enrolled in prior years or who are working after graduation, fell only slightly."
  },
  {
    "title": "Andy Baraghani’s Thanksgiving Menu Is Bright, Colorful and Delicious",
    "link": "https://cooking.nytimes.com/article/andy-baraghani-thanksgiving-menu",
    "summary": "Andy Baraghani’s bright, brilliant menu is a feast for the eyes, too."
  },
  {
    "title": "A Councilwoman Intervened During an ICE Arrest. Then She Faced the Voters.",
    "link": "https://www.nytimes.com/2025/11/17/us/etel-haxhiaj-ice-immigration-election-massachusetts.html",
    "summary": "Months before the election, Etel Haxhiaj, a councilwoman in Worcester, Mass., was charged with assaulting an officer when she stood between the police and an immigrant family."
  },
  {
    "title": "After Marshawn Kneeland’s Death, Cowboys Prepare to Take the Field Again",
    "link": "https://www.nytimes.com/2025/11/17/us/marshawn-kneeland-dallas-cowboys.html",
    "summary": "Marshawn Kneeland spent nearly all of his 24 years working to get to the N.F.L. He died two days after scoring his first touchdown."
  },
  {
    "title": "Ukraine’s Cash Is Running Low, and Europe Has No Good Plan B",
    "link": "https://www.nytimes.com/2025/11/17/world/europe/ukraine-russia-frozen-assets-european-union.html",
    "summary": "The European Union wants to finance Ukraine’s war efforts using a loan based on Russia’s frozen assets in Belgium. If that falls through, there’s no easy alternative."
  },
  {
    "title": "Zelensky Ousted a Heavyweight Mayor. Was It a Power Grab?",
    "link": "https://www.nytimes.com/2025/11/14/world/europe/ukraine-zelensky-odesa-gennadiy-trukhanov.html",
    "summary": "President Volodymyr Zelensky removed Odesa’s mayor, raising fears he might be using his wartime powers to tighten control over opposition-run cities."
  },
  {
    "title": "France Agrees to Sell Up to 100 Rafale Fighter Jets to Ukraine",
    "link": "https://www.nytimes.com/2025/11/17/world/europe/ukraine-france-rafale-fighter-jets.html",
    "summary": "Some in Ukraine criticized the 10-year timeline for the warplanes and other defense equipment, but France called it a long-term commitment to the country."
  },
  {
    "title": "These Six Artworks Could Predict the Auction Market",
    "link": "https://www.nytimes.com/2025/11/17/arts/design/artworks-auction-market-toilet-klimt.html",
    "summary": "The art market had a summer of closures and consolidations. But major collections, blue-chip art and guarantees have pushed expectations high for the marquee sales."
  },
  {
    "title": "Europe Begins Rethinking Its Crackdown on Big Tech",
    "link": "https://www.nytimes.com/2025/11/17/technology/europe-big-tech.html",
    "summary": "European policymakers are crafting changes to scale back and simplify landmark rules for A.I. and data privacy, in a shift from an aggressive regulatory period."
  },
  {
    "title": "A Bailout May Come Too Late as Farmers Begin to Plan for Next Year",
    "link": "https://www.nytimes.com/2025/11/17/business/farmers-bailout-delay.html",
    "summary": "It could be months before they receive aid, well after the winter period when they talk to their bankers and make decisions about the planting ahead."
  },
  {
    "title": "New York’s Bodegas Are Here to Stay",
    "link": "https://www.nytimes.com/2025/11/17/nyregion/new-york-bodegas-stores-food.html",
    "summary": "The iconic corner store is perhaps the ultimate symbol of a city constantly evolving and on the move."
  },
  {
    "title": "An Officer Bungled a Teen Rape Case. The Victim Was Abused Again.",
    "link": "https://www.nytimes.com/2025/11/17/us/teen-rape-case-yates-county-officer.html",
    "summary": "The investigator, who did not believe the teen, faced little punishment, illustrating the different ways that officers in New York State are disciplined for misconduct."
  },
  {
    "title": "We Can Now Track Individual Monarch Butterflies. It’s a Revelation.",
    "link": "https://www.nytimes.com/2025/11/17/science/monarch-butterfly-migration-tracking-sensor.html",
    "summary": "Scientists used tiny new sensors to follow the insects on journeys that take thousands of miles to their winter colonies in Mexico."
  },
  {
    "title": "We Immigrated Legally. ICE Detained Us Anyway.",
    "link": "https://www.nytimes.com/2025/11/17/opinion/ice-detention-legal-immigration.html",
    "summary": "The brutal detention of three people who came to the U.S. legally reveals a cruel system that operates with impunity."
  },
  {
    "title": "This Is How Our Economy Comes Crashing Down",
    "link": "https://www.nytimes.com/2025/11/17/opinion/economy-ai-jobs-stocks.html",
    "summary": "Some of the pieces seem fine, but the base is increasingly fragile."
  },
  {
    "title": "Chaos at the Justice Department",
    "link": "https://www.nytimes.com/2025/11/17/briefing/chaos-at-the-justice-department.html",
    "summary": "President Trump has transformed the agency. We look at what’s happening on the inside."
  },
  {
    "title": "Hydropower Is Getting Less Reliable as the World Needs More Energy",
    "link": "https://www.nytimes.com/2025/11/17/business/energy-environment/brazil-hydropower-clean-energy-cop30.html",
    "summary": "Demand for power is growing fast, but hydro plants, the oldest source of clean energy, are struggling because of droughts, floods and other extreme weather linked to climate change."
  },
  {
    "title": "The Mayor of Secaucus Has a Fix for America: ‘Say Yes to Everyone’",
    "link": "https://www.nytimes.com/2025/11/17/nyregion/secaucus-nj-mayor-gonnelli.html",
    "summary": "As South Asian and Muslim immigrants transform a small New Jersey town, the five-term mayor has managed to keep the peace. What happens when he’s gone?"
  },
  {
    "title": "Eric Adams Meets Netanyahu on Day 3 of Taxpayer-Funded Trip to Israel",
    "link": "https://www.nytimes.com/2025/11/17/nyregion/eric-adams-netanyahu-israel.html",
    "summary": "Mr. Adams, whose tenure as mayor of New York City ends in six weeks, is using his second trip to Israel in three years to reinforce his staunch support of the country."
  },
  {
    "title": "Bangladesh Court Sentences Former Prime Minister to Death",
    "link": "https://www.nytimes.com/2025/11/17/world/asia/bangladesh-sheikh-hasina-death-sentence.html",
    "summary": "Sheikh Hasina, who is in exile in India, was convicted in absentia of crimes against humanity in connection with a bloody crackdown on protests last year."
  }
]