[
  {
    "title": "How The New York Times Investigated Videos of ICE Agents Killing Alex Pretti",
    "link": "https://www.nytimes.com/2026/01/26/insider/minneapolis-ice-shooting-videos-investigation.html",
    "summary": "Using more than a dozen videos related to the shooting of Alex Pretti, The Times worked to establish what is called ground truth: what happened, how it happened and who might be responsible."
  },
  {
    "title": "After Alex Pretti’s Killing, A Divided America Wonders What’s Next",
    "link": "https://www.nytimes.com/2026/01/27/us/alex-pretti-shooting-minneapolis-reaction.html",
    "summary": "Scenes from the violent unrest in Minneapolis played on a loop in many American households over the weekend, prompting reflection about where the nation is heading."
  },
  {
    "title": "Trump Changes Course in Minneapolis, and Social Media Giants Face Big Tobacco-Style Lawsuits",
    "link": "https://www.nytimes.com/2026/01/27/podcasts/the-headlines/trump-minneapolissocial-media-lawsuit.html",
    "summary": "Plus, Mamdani’s snowstorm recommendation."
  },
  {
    "title": "Record Debt in the World’s Richest Nations Threatens Global Growth",
    "link": "https://www.nytimes.com/2026/01/27/business/economy/government-debt-bonds.html",
    "summary": "The cost of borrowing is already choking crucial public spending in many developing economies. Now it’s raising broader alarms."
  },
  {
    "title": "Fed, Signaling Little Urgency, Prepares to Pause on Rate Cuts",
    "link": "https://www.nytimes.com/2026/01/27/business/economy/fed-rate-decision-outlook.html",
    "summary": "The Federal Reserve is expected to hold interest rates steady on Wednesday, despite relentless attacks from President Trump over borrowing costs."
  },
  {
    "title": "As Trump Heads to Iowa to Trumpet Economy, Many Residents Feel Pain",
    "link": "https://www.nytimes.com/2026/01/27/us/politics/trump-iowa-farms-tariffs.html",
    "summary": "Farmers are critical to Iowa’s economy. They have been battered by President Trump’s tariffs and are not yet experiencing the “golden age” that the president promised."
  },
  {
    "title": "Winter Storm Debilitates the South, Encasing Cities in Ice and Snow",
    "link": "https://www.nytimes.com/2026/01/26/weather/south-us-winter-storm-snow-ice.html",
    "summary": "The forecasts had predicted that the storm could be among the worst in a generation to hit the region. By Monday, it was clear that is exactly what happened."
  },
  {
    "title": "What to Expect for a Cold NYC Commute: Trains, Buses and Rail",
    "link": "https://www.nytimes.com/2026/01/26/weather/nyc-winter-storm-transit-trains-buses.html",
    "summary": "Mass transit is slowly getting back to normal around the city."
  },
  {
    "title": "New York City Races to Help Homeless People as Temperatures Plunge",
    "link": "https://www.nytimes.com/2026/01/26/nyregion/nyc-snow-homeless.html",
    "summary": "The weather underscored how vulnerable people are when they do not have a safe place to shelter. At least eight people have died, including several who had a history with the city’s shelter system."
  },
  {
    "title": "After Donations, Trump Administration Revoked Rule Requiring More Nursing Home Staff",
    "link": "https://www.nytimes.com/2026/01/27/us/politics/after-donations-trump-administration-revoked-rule-requiring-more-nursing-home-staff.html",
    "summary": "Executives who donated to the president’s super PAC met privately with him and urged a repeal of the rule, which was intended to prevent neglect of patients."
  },
  {
    "title": "Extra Scrutiny of FEMA Aid to States Has Created a $17 Billion Bottleneck",
    "link": "https://www.nytimes.com/2026/01/27/climate/fema-aid-kristi-noem.html",
    "summary": "Additional layers of review ordered by Kristi Noem, the homeland security secretary, have slowed assistance to disaster-struck communities."
  },
  {
    "title": "‘Volcano,’ the L.A. Disaster Movie That Boils Over With Unintended Comedy",
    "link": "https://www.nytimes.com/2026/01/27/movies/1990s-volcano-movie.html",
    "summary": "Tommy Lee Jones and Anne Heche teamed up in their heyday to save Los Angeles from lava in this big-budget 1997 film that defies all logic to fantastic, farcical effect."
  },
  {
    "title": "Work Will Stop on Critical Tunnel Project Unless Trump Restores Funding",
    "link": "https://www.nytimes.com/2026/01/27/nyregion/hudson-tunnel-gateway-funding.html",
    "summary": "The builders of the Gateway project, a critical rail tunnel between New York and New Jersey, are expected to warn that construction cannot continue without the withheld federal money."
  },
  {
    "title": "How Trump’s Threats to Greenland Made Him a Liability for Europe’s Far Right",
    "link": "https://www.nytimes.com/2026/01/27/world/europe/trump-liability-europe-far-right-populists.html",
    "summary": "Europe’s nationalist leaders once saw President Trump as an ideological ally. Now, as he threatens European sovereignty, they are seeking distance — at least for the moment."
  },
  {
    "title": "Trump Administration Social Media Posts Echo White Supremacist Messaging",
    "link": "https://www.nytimes.com/2026/01/27/us/politics/white-supremacy-trump-administration-social-media.html",
    "summary": "A flurry of posts from the White House, Department of Labor and Department of Homeland Security have included images, slogans and even a song used by the white nationalist right."
  },
  {
    "title": "UK Seeks Trade With China Without Triggering Trump’s Fury",
    "link": "https://www.nytimes.com/2026/01/27/world/europe/uk-china-visit-starmer-trade.html",
    "summary": "Prime Minister Keir Starmer hopes to boost his country’s lagging economy with a trip to Beijing. But he must carefully navigate between two superpowers."
  },
  {
    "title": "In Trump’s Shadow, India and the European Union Expand Trade Ties",
    "link": "https://www.nytimes.com/2026/01/27/business/india-europe-trade-tariffs-trump.html",
    "summary": "After nearly 20 years of negotiations, the two sides struck a far-reaching agreement that officials called “the mother of all trade deals.”"
  },
  {
    "title": "Trump Vows Higher Tariffs for South Korea Months After Trade Deal",
    "link": "https://www.nytimes.com/2026/01/27/world/asia/korea-trump-higher-tariff.html",
    "summary": "President Trump said Seoul was not moving fast enough to implement the agreement, which calls for South Korea to invest billions in the United States."
  },
  {
    "title": "Social Media Giants Face Landmark Legal Tests on Child Safety",
    "link": "https://www.nytimes.com/2026/01/27/technology/social-media-addiction-trial.html",
    "summary": "Starting this week, a series of trials will test a new legal strategy claiming that Meta, TikTok, Snap and YouTube caused personal injury through addictive products."
  },
  {
    "title": "The Social Media Addiction Trials: What to Know",
    "link": "https://www.nytimes.com/2026/01/27/technology/what-to-know-about-the-social-media-addiction-trials.html",
    "summary": "Landmark trials beginning this week will test a new legal strategy claiming that Meta, TikTok, Snap and YouTube caused personal injury through addictive products."
  },
  {
    "title": "All-Night Concerts in War-Ravaged Myanmar",
    "link": "https://www.nytimes.com/2026/01/27/world/asia/myanmar-concert-zat-pwe-war.html",
    "summary": "But the shows, which combine dance, drama and music, are also part of an effort by Myanmar’s military rulers to project a veneer of legitimacy."
  },
  {
    "title": "An Academic and a Dealmaker Takes on the Challenge of Running Columbia",
    "link": "https://www.nytimes.com/2026/01/27/nyregion/columbia-president-jennifer-mnookin.html",
    "summary": "Jennifer Mnookin forged compromises with protesters and politicians at the University of Wisconsin-Madison. Now, she faces her biggest test."
  },
  {
    "title": "Trial to Begin in Sex-Trafficking Case Against Alexander Brothers",
    "link": "https://www.nytimes.com/2026/01/27/nyregion/oren-tal-alexander-trial-sex-trafficking.html",
    "summary": "Prosecutors say the three men used their money, power and status to sexually assault women, including two underage girls. The men have denied the charges."
  },
  {
    "title": "Brothers Charged With Sex Trafficking Wage Campaign to Shame Accusers",
    "link": "https://www.nytimes.com/2026/01/27/nyregion/alexander-brothers-public-relations-campaign.html",
    "summary": "The Alexander brothers, once titans of the New York party scene, have retained a high-stakes public relations strategist, Juda Engelmayer, whose clients include Harvey Weinstein."
  },
  {
    "title": "Want Nirvana? Try a Colonoscopy.",
    "link": "https://www.nytimes.com/2026/01/27/magazine/colonoscopy.html",
    "summary": "It turns out that despite everything you’ve heard, getting a colonoscopy is wonderful."
  },
  {
    "title": "Mike Lawler: Minneapolis Deaths Show America Needs a New Immigration Plan",
    "link": "https://www.nytimes.com/2026/01/27/opinion/republicans-minneapolis-immigration-trump.html",
    "summary": "A Republican member of Congress argues that neither Biden nor Trump had the right solution on immigration."
  },
  {
    "title": "Trump’s Fantasies Are Killing Us",
    "link": "https://www.nytimes.com/2026/01/27/opinion/trump-hot-ice.html",
    "summary": "But being a “hot” country does not make you a good country. Or a decent one."
  },
  {
    "title": "Transportation Safety Board Set to Declare Cause of Midair Collision",
    "link": "https://www.nytimes.com/2026/01/27/us/politics/transportation-safety-board-set-to-declare-cause-of-midair-collision.html",
    "summary": "The National Transportation Safety Board is set to vote on the probable cause of last year’s crash near Washington and make recommendations."
  },
  {
    "title": "You Wouldn’t Want to Butt Heads With This Small Dinosaur",
    "link": "https://www.nytimes.com/2026/01/27/science/raptor-fossil-dinosaur-skull.html",
    "summary": "A newly discovered raptor had a knobby bump on its head, suggesting that, like some larger dinosaurs, it engaged in competitive head bashing."
  },
  {
    "title": "Alexander Vindman, of Trump Impeachment Fame, Runs for Senate in Florida",
    "link": "https://www.nytimes.com/2026/01/27/us/politics/alexander-vindman-trump-impeachment-florida-senate.html",
    "summary": "Mr. Vindman will run for the Democratic nomination to take on Senator Ashley Moody, a Republican. The race is an uphill fight for Democrats, but Mr. Vindman could be a strong fund-raiser."
  }
]