[
  {
    "title": "Epstein Files Are Missing Records About Woman Who Made Claim Against Trump",
    "link": "https://www.nytimes.com/2026/02/25/us/politics/trump-epstein-files.html",
    "summary": "Documents released by the Justice Department briefly mention a woman’s unverified accusation that Donald J. Trump assaulted her in the 1980s, when she was a minor. But several memos related to her account are not in the files."
  },
  {
    "title": "Larry Summers Will Resign From Harvard After Jeffrey Epstein Revelations",
    "link": "https://www.nytimes.com/2026/02/25/us/larry-summers-resignation-harvard-epstein.html",
    "summary": "Mr. Summers, former president of the school, had stepped back from teaching after documents showed a closer relationship to Jeffrey Epstein than previously known. He will leave at the end of the academic year."
  },
  {
    "title": "Maurene Comey, a Prosecutor in Epstein Case, Joins New York Law Firm",
    "link": "https://www.nytimes.com/2026/02/25/nyregion/comey-trump-law-firm-new-york.html",
    "summary": "Maurene Comey is joining Patterson Belknap Webb & Tyler. She was abruptly fired by the Trump administration last year after a career as a top federal prosecutor."
  },
  {
    "title": "Trump Puts On a Show, Casting Democrats as the Villains",
    "link": "https://www.nytimes.com/2026/02/25/us/politics/trump-state-of-the-union-speech.html",
    "summary": "On the defensive over the economy and with the midterms approaching, President Trump made clear that his political strategy is to paint Democrats as unpatriotic and ‘crazy.’"
  },
  {
    "title": "6 Takeaways From Trump’s State of the Union",
    "link": "https://www.nytimes.com/2026/02/25/us/politics/trump-state-of-the-union-takeaways.html",
    "summary": "In an address that was heavy on theatrics, President Trump lashed out at Democrats as “crazy” and unpatriotic."
  },
  {
    "title": "How The Times Handles the Congressional Hearing Circus",
    "link": "https://www.nytimes.com/2026/02/17/insider/congressional-hearing-insider.html",
    "summary": "Three editors in Washington discuss their approach to coverage of politicians and witnesses who sometimes seem to be performing for the cameras."
  },
  {
    "title": "Trump Says Tech Firms Should Pay More for Electricity",
    "link": "https://www.nytimes.com/2026/02/25/climate/ai-data-centers-trump-energy-costs.html",
    "summary": "The president said he had negotiated a deal with tech giants to cover the energy costs of data centers, but offered few details. Experts said such pledges could prove difficult in practice."
  },
  {
    "title": "Yondr Pouches, a Solution to School Phone Bans, Are No Match for Teens",
    "link": "https://www.nytimes.com/2026/02/25/style/yondr-pouch-school-phone-ban.html",
    "summary": "In some schools, Yondr, a pouch marketed to keep kids off devices, has proved no match for actual children."
  },
  {
    "title": "F.B.I. Raids Home of L.A.U.S.D. Chief Alberto Carvalho and School District Offices",
    "link": "https://www.nytimes.com/2026/02/25/us/fbi-raid-lausd-alberto-carvalho.html",
    "summary": "F.B.I. agents executed search warrants at the locations. The target of their investigation was unclear."
  },
  {
    "title": "Online Accusations in Guthrie Abduction Leave One Family ‘Scared Numb’",
    "link": "https://www.nytimes.com/2026/02/25/us/nancy-guthrie-true-crime-accusations.html",
    "summary": "A fifth-grade teacher and his principal wife hid in their bedroom as dozens of people who believed he might be a kidnapper appeared on their suburban street."
  },
  {
    "title": "Super-Agers’ Brains Have a Special Ability, New Study Suggests",
    "link": "https://www.nytimes.com/2026/02/25/well/mind/super-agers-brain-neurons.html",
    "summary": "The findings may help explain why this group has such exceptional memory."
  },
  {
    "title": "Writers Are Being Targeted by Scams. This Reporter Knows the Feeling.",
    "link": "https://www.nytimes.com/2026/02/25/books/review/publishing-scams.html",
    "summary": "From George Saunders to the National Book Foundation, the literary world has been besieged by fake requests. Just like me."
  },
  {
    "title": "Inside Nicolás Maduro’s Last Days as Venezuela’s Leader",
    "link": "https://www.nytimes.com/2026/02/25/world/americas/maduro-venezuela-us-capture-trump.html",
    "summary": "The Venezuelan leader overestimated his strength and misread his exchange with President Trump in the decisive weeks before his capture by U.S. forces."
  },
  {
    "title": "The Rise and Fall of a Notorious Florida Nudist Colony",
    "link": "https://www.nytimes.com/2026/02/25/realestate/florida-nudist-camp-for-sale.html",
    "summary": "The owners have put a 67-year-old nudist colony on the market, hoping a new steward can help it shed its troubled past."
  },
  {
    "title": "In N.C. Senate Race, Democrats Bet Roy Cooper Can Beat Trump’s Endorsement",
    "link": "https://www.nytimes.com/2026/02/25/us/nc-senate-race-2026-roy-cooper.html",
    "summary": "The race is one of a handful of competitive Senate elections this year, but Democrats seem most confident about North Carolina, partly because their candidate, former Gov. Roy Cooper, has never been beaten."
  },
  {
    "title": "Texas Gov. Greg Abbott Spent Millions on Attack Ads Against Jasmine Crockett",
    "link": "https://www.nytimes.com/2026/02/25/us/greg-abbott-jasmine-crockett-texas-primary-ads.html",
    "summary": "Gov. Greg Abbott hopes the ads featuring the Democrat will galvanize Republican voter turnout in November."
  },
  {
    "title": "Best and Worst Moments From Trump’s State of the Union Address",
    "link": "https://www.nytimes.com/2026/02/25/opinion/trump-state-of-the-union-best-worst.html",
    "summary": "Eight Opinion writers weigh in on the speech."
  },
  {
    "title": "Germany’s Leader Merz Delivers a Blunt Warning to China on Trade",
    "link": "https://www.nytimes.com/2026/02/25/world/asia/china-germany-merz-visit-xi.html",
    "summary": "Chancellor Friedrich Merz laid out his complaints in a frank message to his hosts on a trip to Beijing that China had designed to showcase their relationship."
  },
  {
    "title": "A New York City Diner That Served Blind Residents Has Closed Its Doors",
    "link": "https://www.nytimes.com/2026/02/25/nyregion/malibu-diner-nyc-blind-community.html",
    "summary": "When Malibu Diner in Chelsea shut down on Sunday night, it ended a unique breakfast program for older people in the city."
  },
  {
    "title": "BAFTAs 2026 Outburst: What Tourette’s Tics Feel Like",
    "link": "https://www.nytimes.com/2026/02/24/well/mind/tourettes-bafta-john-davidson.html",
    "summary": "Verbal or physical tics can be a daily struggle. So can dealing with the hurt they may cause."
  },
  {
    "title": "How Bookbinders Helped the Nazis Track Holocaust Victims",
    "link": "https://www.nytimes.com/2026/02/24/world/europe/nazi-germany-bookbinders.html",
    "summary": "Conservation experts helped the Nazi regime inspect church and civil archives to track down people they sought to persecute, a researcher concluded."
  }
]