[
  {
    "title": "Brown Shooting and an M.I.T. Professor’s Killing: What We Know",
    "link": "https://www.nytimes.com/2025/12/19/us/brown-mit-shootings-what-we-know.html",
    "summary": "A single suspect carried out the shooting at Brown University and the killing of an M.I.T. professor, and was later found dead in New Hampshire, authorities said."
  },
  {
    "title": "Suspect in MIT Professor’s Death Was an Ex-Classmate from Portugal, Prosecutors Say",
    "link": "https://www.nytimes.com/2025/12/19/us/mit-professor-brown-shooting-suspect-portugal.html",
    "summary": "Nuno F.G. Loureiro, the professor, attended the same physics program in Portugal as the man suspected in his killing."
  },
  {
    "title": "A Reddit Post Led to a Breakthrough in the Brown Shooting Investigation",
    "link": "https://www.nytimes.com/2025/12/19/us/brown-mit-shooting-investigation-reddit.html",
    "summary": "A Reddit user provided information that helped identify Claudio Manuel Neves Valente as not only the suspect in the campus shooting, but also the murder of an M.I.T. professor."
  },
  {
    "title": "Brown University Shooting Suspect Found Dead, and Trump Eases Marijuana Restrictions",
    "link": "https://www.nytimes.com/2025/12/19/podcasts/the-headlines/brown-university-suspect-trump-marijuana.html",
    "summary": "Plus, your Friday news quiz."
  },
  {
    "title": "Europe to Lend $105 Billion to Ukraine, Without Touching Russian Funds",
    "link": "https://www.nytimes.com/2025/12/18/world/europe/russia-eu-ukraine-frozen-assets.html",
    "summary": "European Union officials wanted to use Russia’s frozen assets to back a major loan to Ukraine. Facing opposition in their own camp, they settled on another way."
  },
  {
    "title": "With New E.U. Loan, Ukraine Avoids Budget Crunch and Can Plan War Effort",
    "link": "https://www.nytimes.com/2025/12/19/world/europe/ukraine-russia-frozen-assets-loan.html",
    "summary": "The loan will cover two-thirds of the country’s financial needs for the next two years. It also bolsters Ukraine’s position in ongoing peace talks."
  },
  {
    "title": "Putin Reaffirms Broad Military Goals for Russia in Ukraine",
    "link": "https://www.nytimes.com/2025/12/18/world/europe/putin-russia-ukraine.html",
    "summary": "President Vladimir V. Putin spoke at an annual news conference that highlights his grip over Russia and often sets the Kremlin’s tone for the next year."
  },
  {
    "title": "‘A Singularly Turbulent Time’: Deeper Uncertainty in Store for Global Economy",
    "link": "https://www.nytimes.com/2025/12/19/business/economy/trump-trade-global-econ.html",
    "summary": "A reordering of the rules of trade, set on top of transformational change in technology, demographics and climate, is remaking jobs, politics and lives."
  },
  {
    "title": "Bank of Japan Raises Interest Rates to Highest Level in 30 Years",
    "link": "https://www.nytimes.com/2025/12/18/business/bank-of-japan-rates-inflation.html",
    "summary": "The Bank of Japan moved to slow inflation as the prime minister is borrowing more to fund an ambitious effort to build up industry and support households."
  },
  {
    "title": "Want to Know Where the Market Is Going? Don’t Trust This, or Any, Forecast.",
    "link": "https://www.nytimes.com/2025/12/19/business/stock-market-forecast-wall-street.html",
    "summary": "Wall Street stock gurus are making predictions again. Our columnist got into the game with a number he doesn’t believe."
  },
  {
    "title": "How the Army Caused Alarm in the Washington Skies Years Before a Fatal Crash",
    "link": "https://www.nytimes.com/2025/12/19/us/politics/army-washington-dc-airspace-helicopter-crash.html",
    "summary": "An aged helicopter fleet and inexperienced pilots from nearby Fort Belvoir had raised “widespread concern” among local pilots before a midair collision killed 67 people."
  },
  {
    "title": "Judge Convicted of Obstructing Agents as They Sought Undocumented Immigrant",
    "link": "https://www.nytimes.com/2025/12/18/us/judge-hannah-dugan-trial-verdict.html",
    "summary": "The Wisconsin state judge, Hannah C. Dugan, was accused of ushering a man to a side door as federal agents waited outside a courtroom."
  },
  {
    "title": "Takeaways From the Trial of Wisconsin Judge Hannah Dugan",
    "link": "https://www.nytimes.com/2025/12/18/us/judge-hannah-dugan-trial-takeaways.html",
    "summary": "The Milwaukee judge was charged with obstructing federal immigration agents, who were trying to arrest a man who had appeared before her on a battery charge."
  },
  {
    "title": "Trump’s Attacks on Rob Reiner and Others Characterize an Uninhibited 2nd Term",
    "link": "https://www.nytimes.com/2025/12/18/us/politics/trump-insults-second-term.html",
    "summary": "Many of President Trump’s supporters love his professional-wrestling style of leadership. But some of his recent attacks have sickened even some of his own political allies."
  },
  {
    "title": "Trump Administration to Appeal Harvard Funding Case",
    "link": "https://www.nytimes.com/2025/12/19/us/trump-administration-appeal-harvard-funding-case.html",
    "summary": "Facing a deadline to appeal, the Justice Department told the courts late Thursday that it would try to overturn a judge’s ruling in favor of Harvard."
  },
  {
    "title": "Trump Signs Law Repealing Tough Sanctions on Syria",
    "link": "https://www.nytimes.com/2025/12/19/world/middleeast/syria-trump-repeal-sanctions-ceasar-act.html",
    "summary": "The Caesar Act was imposed in 2019 in response to widespread and systematic violations of human rights by the regime of former dictator Bashar al-Assad."
  },
  {
    "title": "Florida Executed A Record 19 People in 2025. He Witnessed Them All.",
    "link": "https://www.nytimes.com/2025/12/19/us/florida-executions-record.html",
    "summary": "John Koch, a radio reporter, witnesses every execution in Florida to keep close tabs on what he considers one of the most consequential actions the state takes."
  },
  {
    "title": "Falling Enrollment, Money Woes: The New School Seeks a Path to Survival",
    "link": "https://www.nytimes.com/2025/12/19/nyregion/new-school-nyc-cuts.html",
    "summary": "The New York City university has embarked on an overhaul that some professors and students say imperils its standing as a bastion of the liberal arts."
  },
  {
    "title": "After the Louvre Heist, Museums Look for Lessons to Help Stop Thieves",
    "link": "https://www.nytimes.com/2025/12/19/arts/design/louvre-heist-thief-museum-security.html",
    "summary": "Museums and the consultants who advise them have been busy reviewing their own precautions in the aftermath of the brazen daylight break-in at the Louvre."
  },
  {
    "title": "U.S. Will Pay $450,000 to Wildfire Fighters With Cancer",
    "link": "https://www.nytimes.com/2025/12/19/us/wildfire-fighters-cancer.html",
    "summary": "They will be eligible for a one-time payment as well as college tuition for their children. The effort is part of a legislative push to address the dangers of working in toxic smoke."
  },
  {
    "title": "Mitt Romney: Tax the Rich, Like Me",
    "link": "https://www.nytimes.com/2025/12/19/opinion/romney-tax-the-rich.html",
    "summary": "There’s no getting around this if we want to avoid the deficit cliff ahead."
  },
  {
    "title": "Trump’s New Marijuana Policy Offers an Opportunity",
    "link": "https://www.nytimes.com/2025/12/19/opinion/trump-marijuana-policy.html",
    "summary": "Marijuana has been tied to psychosis and other health problems. I still think it’s safer than alcohol."
  },
  {
    "title": "Britain Is Preparing for Attacks on Its Soil. Critics Say It Must Move Faster.",
    "link": "https://www.nytimes.com/2025/12/19/world/europe/uk-defense-russia.html",
    "summary": "As military officials sound the alarm over Russian hybrid attacks, the chair of Parliament’s defense committee said the government’s progress on ramping up home defense was “glacial.”"
  },
  {
    "title": "Mamdani Appointee Resigns After Decade-Old Antisemitic Posts Re-emerge",
    "link": "https://www.nytimes.com/2025/12/18/nyregion/mamdani-resigns-antisemitic-da-costa.html",
    "summary": "Catherine Almonte Da Costa resigned from her just-announced post as Mayor-elect Zohran Mamdani’s director of appointments after the Anti-Defamation League resurfaced the comments."
  },
  {
    "title": "NASA Webb Telescope Discovers Lemon-Shaped Planet, the ‘Stretchiest’ Ever Seen",
    "link": "https://www.nytimes.com/2025/12/18/science/lemon-planet-pulsar-webb.html",
    "summary": "An unusual object orbiting a rapidly spinning star might be a new phenomenon in the universe."
  }
]