[
  {
    "title": "Gunman Fatally Shoots Officer and 3 Others in Midtown Office Tower",
    "link": "https://www.nytimes.com/2025/07/29/nyregion/officer-killing-midtown-shooting.html",
    "summary": "The gunman, armed with an assault rifle, walked into the lobby and killed a police officer and two others. He killed another person on the 33rd floor before turning his gun on himself."
  },
  {
    "title": "A Shooting in New York Skyscraper, and Harvard’s Potential $500 Million Deal",
    "link": "https://www.nytimes.com/2025/07/29/podcasts/the-headlines/mass-shooting-manhattan-harvard-trump.html",
    "summary": "Plus, when the peanut M&amp;M was in trouble."
  },
  {
    "title": "Trump Is Winning His Trade War. What Will That Mean for the Economy?",
    "link": "https://www.nytimes.com/2025/07/29/business/economy/trump-tariffs-economy.html",
    "summary": "The president’s vision for reshaping global trade is falling into place, but he is embarking on an experiment that economists say could still produce damaging results."
  },
  {
    "title": "Europe Made Major Trade Concessions to Trump. How Did That Happen?",
    "link": "https://www.nytimes.com/2025/07/29/world/europe/europe-trump-trade-concessions-analysis.html",
    "summary": "Some European politicians are dismayed that the European Union did not drive a harder bargain, but facing the threat of a damaging trade war, officials say they had little choice."
  },
  {
    "title": "Trump’s Tariffs on Medicines From Europe Stand to Cost Drugmakers Billions",
    "link": "https://www.nytimes.com/2025/07/28/health/trump-drug-tariffs-europe.html",
    "summary": "Many pharmaceutical products made in Europe will face a 15 percent tariff, pinching manufacturers and potentially leading to higher drug prices."
  },
  {
    "title": "Why It Matters That India and Trump Don’t Have a Tariff Deal",
    "link": "https://www.nytimes.com/2025/07/29/business/trump-tariffs-india-trade.html",
    "summary": "The stakes are high, with the United States and India counting on one another as indispensable partners in their competition with China."
  },
  {
    "title": "Harvard Is Said to Be Open to Spending Up to $500 Million to Resolve Trump Dispute",
    "link": "https://www.nytimes.com/2025/07/28/us/politics/trump-harvard-payment.html",
    "summary": "The sum sought by the government is more than twice as much as the $200 million fine that Columbia University said it would pay when it settled its clash with the White House last week."
  },
  {
    "title": "Vance Embraces Role of Loyal Trump Warrior, Shifting Away From Past Stances",
    "link": "https://www.nytimes.com/2025/07/28/us/politics/vance-trump-ukraine-epstein.html",
    "summary": "The vice president has defended the administration’s handling of U.S. military engagement abroad and the Epstein files, even when those positions put him at odds with the right wing."
  },
  {
    "title": "Starmer Is Edging Closer to Recognizing a Palestinian State, UK Officials Say",
    "link": "https://www.nytimes.com/2025/07/29/world/europe/uk-starmer-palestinian-state.html",
    "summary": "Two government officials said Britain was actively weighing the recognition of a Palestinian state, in a shift driven by public pressure over starvation in Gaza."
  },
  {
    "title": "‘Worst-Case Scenario of Famine’ Unfolding in Gaza, U.N.-Backed Body Says",
    "link": "https://www.nytimes.com/article/israel-gaza-aid.html",
    "summary": "Access to food has plummeted to unprecedented levels, a monitoring group warned, as global outrage over Israel’s aid restrictions persisted."
  },
  {
    "title": "For Trump, Starvation in Gaza Tests His Foreign Policy Approach",
    "link": "https://www.nytimes.com/2025/07/28/us/politics/trump-starvation-gaza-america-first.html",
    "summary": "President Trump will have to decide whether America intends to take a leading role in confronting one of the biggest humanitarian catastrophes of the 21st century."
  },
  {
    "title": "Powell Under Siege as Fed Plans to Stand Pat on Rate Cuts",
    "link": "https://www.nytimes.com/2025/07/29/business/powell-trump-fed-rate-cuts.html",
    "summary": "Jerome H. Powell, the Federal Reserve chair, is facing relentless attacks from the president, a lively campaign to replace him and divisions in his own ranks over when to cut interest rates."
  },
  {
    "title": "Shoppers Embrace ‘Christmas in July’ Amid Rising Costs and Tariff Limbo",
    "link": "https://www.nytimes.com/2025/07/29/business/economic-anxiety-christmas-in-july.html",
    "summary": "People are starting their holiday shopping earlier this year, using summer sales from retailers like Amazon and Walmart to save time and money."
  },
  {
    "title": "Study May Undercut Idea That Cash Payments to Poor Families Help Child Development",
    "link": "https://www.nytimes.com/2025/07/28/us/politics/cash-payments-poor-families-child-development.html",
    "summary": "Rigorous new research appears to show that monthly checks intended to help disadvantaged children did little for their well-being, adding a new element to a dispute over expanded government aid."
  },
  {
    "title": "In Fight for House, New York May Follow Texas in Redrawing Maps",
    "link": "https://www.nytimes.com/2025/07/28/nyregion/new-york-redistricting-texas.html",
    "summary": "Democrats in three states are now considering moves to counter a push by Texas Republicans to redraw their state’s maps."
  },
  {
    "title": "N.J. Criminal Cases Screech to a Halt as Habba’s Authority Is Challenged",
    "link": "https://www.nytimes.com/2025/07/28/nyregion/alina-habba-new-jersey-us-attorney-battle.html",
    "summary": "Federal court hearings, grand jury proceedings and plea deals were abruptly canceled in New Jersey over questions about whether Alina Habba, the acting U.S. attorney, was legally appointed."
  },
  {
    "title": "Paul Dans, Project 2025 Architect, Will Challenge Lindsey Graham for Senate",
    "link": "https://www.nytimes.com/2025/07/28/us/politics/paul-dans-project-2025-lindsey-graham.html",
    "summary": "Paul Dans will run in the South Carolina primary highlighting the work of Project 2025, a conservative blueprint that President Trump has employed during his second term."
  },
  {
    "title": "Union Pacific to Buy Norfolk Southern in $85 Billion Railroad Deal",
    "link": "https://www.nytimes.com/2025/07/29/business/union-pacific-norfolk-southern-merger.html",
    "summary": "The merger would create the United States’ first coast-to-coast rail network, spanning 50,000 miles and 43 states."
  },
  {
    "title": "Ryne Sandberg, Hall of Fame Second Baseman for the Cubs, Dies at 65",
    "link": "https://www.nytimes.com/2025/07/28/sports/baseball/ryne-sandberg-dead.html",
    "summary": "Both a skilled fielder and a fearsome power hitter, he entered the national sports spotlight with two memorable home runs in a nationally televised 1984 game."
  },
  {
    "title": "Gwyneth Paltrow Is Astronomer’s ‘Temporary Spokesperson’ After Coldplay Kiss-Cam Scandal",
    "link": "https://www.nytimes.com/2025/07/28/style/gwyneth-paltrow-astronomer-spokesperson-coldplay-scandal.html",
    "summary": "The technology company that was at the center of a scandal last week released a tongue-in-cheek response. It landed."
  },
  {
    "title": "Trump, Juan Crow and Who Gets to Be an American",
    "link": "https://www.nytimes.com/2025/07/29/opinion/trump-juan-crow-birther-race.html",
    "summary": "The rights conferred to all by the Constitution are now subject to a sliding scale of extralegal violability depending on race, ethnicity or assumed immigration status."
  },
  {
    "title": "Lina Khan: Democrats Can Learn from Zohran Mamdani",
    "link": "https://www.nytimes.com/2025/07/29/opinion/lina-khan-mamdani-democrats-small-business.html",
    "summary": "Democrats Need to Win Back America’s Small Businesses"
  },
  {
    "title": "Your Questions About Education",
    "link": "https://www.nytimes.com/2025/07/29/briefing/your-questions-about-education.html",
    "summary": "Our reporters address reader submissions."
  },
  {
    "title": "Jimmy Fallon Ridicules Trump’s Choice Words About Epstein Island",
    "link": "https://www.nytimes.com/2025/07/29/arts/television/jimmy-fallon-trump-epstein.html",
    "summary": "The president said he “never had the privilege” of visiting Jeffrey Epstein’s island. Fallon’s take: “Trump’s staff was like, ‘A simple no would’ve been fine.’ ”"
  },
  {
    "title": "Heavy Rain and Flooding in China Kill at Least 30",
    "link": "https://www.nytimes.com/2025/07/28/world/asia/china-rain-beijing-deaths.html",
    "summary": "The rains set off flooding and landslides, forcing tens of thousands of people to flee their homes in the capital and neighboring Hebei Province."
  },
  {
    "title": "Russian Strike on Prison Kills 16, Ukraine Says",
    "link": "https://www.nytimes.com/2025/07/29/world/europe/ukraine-russia-trump.html",
    "summary": "The attack, which came just hours after President Trump gave the Kremlin a new deadline to work toward ending the war, was part of a wave across the country, the authorities said."
  },
  {
    "title": "India Says It Killed 3 Militants Behind Spring Terrorist Attack in Kashmir",
    "link": "https://www.nytimes.com/2025/07/29/world/asia/india-killed-militants-kashmir.html",
    "summary": "The government has faced criticism for being slow to catch the shooters who slaughtered 26 civilians and started clashes between India and Pakistan."
  },
  {
    "title": "Finland’s Short, Precious Summers Are Plagued by Goose Poop",
    "link": "https://www.nytimes.com/2025/07/29/world/europe/helsinki-finland-goose-droppings.html",
    "summary": "Finns trying to enjoy beaches and parks during their all-too-brief summers have been vexed by legions of geese — and their droppings. The smelly mess has resisted even the most innovative solutions."
  }
]