[
  {
    "title": "RFK Jr., Rejecting Vaccine Data, Fuels Distrust of Public Health Agencies",
    "link": "https://www.nytimes.com/2025/09/07/us/politics/kennedy-health-vaccines-cdc.html",
    "summary": "By promoting suspicions about the institutions he oversees, critics say Robert F. Kennedy Jr. is jeopardizing public health. He says he is pursuing transparency."
  },
  {
    "title": "Russia Strikes Ukraine Government Building in Largest Drone Assault of War",
    "link": "https://www.nytimes.com/2025/09/07/world/europe/russian-strike-kyiv-ukraine.html",
    "summary": "Ukrainians said it was the first time a key building in Kyiv’s government district had been damaged since the war began. Russia has kept attacking despite Trump administration efforts at peace talks."
  },
  {
    "title": "Russia Steps Up Disinformation Efforts as Trump Abandons Resistance",
    "link": "https://www.nytimes.com/2025/09/07/business/russia-disinformation-trump.html",
    "summary": "The Kremlin has begun a campaign to sway the parliamentary election in Moldova in what could become a new model of election interference online."
  },
  {
    "title": "Immigration Raid Exposes Tensions From Seoul to Washington to Rural Georgia",
    "link": "https://www.nytimes.com/2025/09/06/us/immigration-raid-georgia.html",
    "summary": "The raid at a Georgia plant being built with heavy investment from South Korea reveals strain as a rush to expand manufacturing in the United States clashes with an immigration crackdown."
  },
  {
    "title": "What We Know About the Hyundai-LG Plant Immigration Raid in Georgia",
    "link": "https://www.nytimes.com/2025/09/07/us/politics/hyundai-plant-immigration-raid-georgia.html",
    "summary": "Several hundred workers, most of them South Korean nationals, were detained at the construction site of a sprawling electric vehicle battery plant on Thursday."
  },
  {
    "title": "‘If I Live to 25, I’ve Lived a Good Life’",
    "link": "https://www.nytimes.com/2025/09/07/us/wildfire-firefighter-cancer.html",
    "summary": "He started fighting wildfires as a teenager. After inhaling smoke on the front lines for six seasons, he faced an impossible choice."
  },
  {
    "title": "Wildfire Fighters, Unmasked in Toxic Smoke, Are Getting Sick and Dying",
    "link": "https://www.nytimes.com/2025/08/17/us/wildfire-firefighters-masks-smoke.html",
    "summary": "The U.S. Forest Service has fought decades of efforts to better protect its crews — sending them into smoke without masks or warnings about the risks."
  },
  {
    "title": "Trump Is Met With Mostly Boos at U.S. Open as Security Delays a Match",
    "link": "https://www.nytimes.com/2025/09/07/us/politics/trump-us-open-tennis-boos-delays.html",
    "summary": "With the president in attendance at Arthur Ashe Stadium, the men’s final began as hundreds of people were still waiting to go through security screening."
  },
  {
    "title": "What’s Inside the Envelope That U.S. Open Winners Get? It’s Not a Check.",
    "link": "https://www.nytimes.com/2025/09/06/business/us-open-prize-money-checks.html",
    "summary": "Both singles champions will win $5 million. But the envelope they receive during the trophy presentation is a symbolic gesture."
  },
  {
    "title": "Brazilians Protest as Bolsonaro Coup Trial Nears Verdict",
    "link": "https://www.nytimes.com/2025/09/07/world/americas/brazil-bolsonaro-trial-protests.html",
    "summary": "Tensions are heating up in Brazil as the nation enters the final week of former President Jair Bolsonaro’s trial on attempted coup charges."
  },
  {
    "title": "Houthi Drone Hits Israeli Airport After Warning System Failure",
    "link": "https://www.nytimes.com/2025/09/07/world/middleeast/houthi-drone-israeli-airport.html",
    "summary": "The strike by the Yemeni militants followed the Israeli killing of several of their top leaders a week ago."
  },
  {
    "title": "Egypt-Israel Tensions Rise Over Attack on Gaza City",
    "link": "https://www.nytimes.com/2025/09/07/world/middleeast/egypt-israel-gaza-city.html",
    "summary": "A large-scale Israeli assault on the city in northern Gaza could push hundreds of thousands of Palestinians southward toward Egypt’s border."
  },
  {
    "title": "Why Are More Older People Dying After Falls?",
    "link": "https://www.nytimes.com/2025/09/07/health/falls-deaths-elderly-drugs.html",
    "summary": "Some researchers suspect that rising prescription drug use may explain a disturbing trend."
  },
  {
    "title": "A Town Reluctantly Let a Mosque Expand. Then Came the Backlash.",
    "link": "https://www.nytimes.com/2025/09/07/nyregion/oyster-bay-mosque-lawsuit.html",
    "summary": "A Long Island town board failed to approve a settlement its lawyers had struck with Masjid Al-Baqi after a yearslong dispute tainted by bigotry. The mosque’s federal suit will be heard next month."
  },
  {
    "title": "Stop Acting Like This Is Normal",
    "link": "https://www.nytimes.com/2025/09/07/opinion/trump-senate-democrats-shutdown.html",
    "summary": "Democrats aren’t powerless, and they don’t have to enable autocracy."
  },
  {
    "title": "The Future Is Flag Football",
    "link": "https://www.nytimes.com/2025/09/07/opinion/nfl-flag-football.html",
    "summary": "Flag football offers girls as well as boys a means of enjoying the sport without the risk of brain damage."
  },
  {
    "title": "Millions of Londoners Brace for Transit Disruption as Tube Strike Begins",
    "link": "https://www.nytimes.com/2025/09/07/world/europe/london-tube-strike.html",
    "summary": "A strike on the London Underground began Sunday over pay and conditions, threatening to upend commuter journeys for most of the week."
  },
  {
    "title": "Marilyn Monroe’s Los Angeles Home Is Saved From Demolition",
    "link": "https://www.nytimes.com/2025/09/07/us/marilyn-monroe-house-los-angeles.html",
    "summary": "A judge denied a neighbor’s petition to raze the Spanish-style hacienda, which the City Council had declared a cultural landmark."
  },
  {
    "title": "Australian Woman, Erin Patterson, Gets Life in Mushroom Murder Case",
    "link": "https://www.nytimes.com/2025/09/07/world/australia/australia-mushroom-murder-erin-patterson.html",
    "summary": "Erin Patterson was found guilty of murdering three of her husband’s relatives and trying to kill a fourth by serving them deadly mushrooms."
  }
]