[
  {
    "title": "After Trump Split, Epstein Said He Could ‘Take Him Down’",
    "link": "https://www.nytimes.com/2025/11/12/us/epstein-emails-trump.html",
    "summary": "Jeffrey Epstein cast himself as a Trump insider and wanted to leverage potentially damaging information about the president and his business dealings, according to emails with associates."
  },
  {
    "title": "Epstein’s Emails About Trump",
    "link": "https://www.nytimes.com/video/us/politics/100000010520312/epstein-trump-emails-explained.html",
    "summary": "Our investigative reporter Steve Eder provides context about Jeffrey Epstein’s relationship with President Donald Trump based on information from over 20,000 pages of documents from Epstein’s estate released by the House Oversight Committee on Wednesday."
  },
  {
    "title": "What Epstein’s Emails Claim About Trump’s Knowledge of His Conduct",
    "link": "https://www.nytimes.com/2025/11/12/us/politics/epstein-emails-trump.html",
    "summary": "The House Oversight Committee on Wednesday released more than 20,000 pages of documents from Jeffrey Epstein’s estate. Times reporters provide context on key emails."
  },
  {
    "title": "What’s Behind the Coming House Vote on Releasing the Epstein Files",
    "link": "https://www.nytimes.com/2025/11/13/us/politics/house-vote-epstein-files.html",
    "summary": "Proponents of fuller transparency used an arcane rule to prod their leaders to act. When it became clear they had succeeded, the speaker agreed to hold a vote."
  },
  {
    "title": "Michael Wolff, Chronicler of Elites, Provided Epstein With Advice on Trump",
    "link": "https://www.nytimes.com/2025/11/12/business/media/michael-wolff-epstein-trump-emails.html",
    "summary": "Mr. Wolff was enough of an insider to provide advice to Jeffrey Epstein on how to handle his dealings with Donald J. Trump."
  },
  {
    "title": "As Shutdown Ends, When Will SNAP and Air Travel Be Back to Normal?",
    "link": "https://www.nytimes.com/2025/11/12/us/shutdown-travel-snap-backpay.html",
    "summary": "Some programs like SNAP could be restored within hours, while other effects could take longer to unravel."
  },
  {
    "title": "The Shutdown Is Over. But for Federal Workers, the Anxiety Persists.",
    "link": "https://www.nytimes.com/2025/11/13/us/politics/shutdown-federal-workers-aftermath.html",
    "summary": "After being sidelined for more than a month, they are bracing for the backlog that awaits them and struggling with the financial burden of going without pay."
  },
  {
    "title": "How D.C. Area Businesses Aided Furloughed Workers Amid Government Shutdown",
    "link": "https://www.nytimes.com/2025/11/13/us/politics/furloughed-workers-support.html",
    "summary": "The region was already unsettled by sweeping government layoffs and funding cuts when the shutdown started."
  },
  {
    "title": "Comey and James Challenge Appointment of Lindsey Halligan, Trump Loyalist Prosecuting Them",
    "link": "https://www.nytimes.com/2025/11/13/us/politics/lindsey-halligan-trump-attorney-court-challenge.html",
    "summary": "The outcome could have serious consequences for the cases against two of President Trump’s opponents, James B. Comey, the former F.B.I. director, and Letitia James, the New York attorney general."
  },
  {
    "title": "Justice Dept. Struggled to Find Lawyers to Handle Maurene Comey Suit",
    "link": "https://www.nytimes.com/2025/11/13/nyregion/justice-department-maurene-comey-lawyers.html",
    "summary": "Ms. Comey, the daughter of the former F.B.I. director James B. Comey, sued the Trump administration after she was abruptly fired over the summer, saying the action was retaliation."
  },
  {
    "title": "Trump Administration Expected to Drastically Cut Housing Grants",
    "link": "https://www.nytimes.com/2025/11/12/us/politics/trump-homeless-funding.html",
    "summary": "In a major shift, HUD’s plan would direct most of the $3.5 billion in homelessness funds away from Housing First to programs that prioritize work and drug treatment."
  },
  {
    "title": "How Pakistan’s Spending Blitz Helped Win Over Trump and Flip U.S. Policy",
    "link": "https://www.nytimes.com/2025/11/13/world/asia/pakistan-trump-lobbying.html",
    "summary": "As Pakistan has hired lobbyists with close ties to President Trump, it has also received favorable tariff treatment and unique access in Washington."
  },
  {
    "title": "William Kennedy, Albany’s Bard, Reads a Story With Legs",
    "link": "https://www.nytimes.com/2025/11/13/arts/william-kennedy-albanys-bard-reads-a-story-with-legs.html",
    "summary": "The author, 97, raised money for the food pantry at his old church by reading from “Legs,” the gangster novel he began his celebrated Albany cycle with half a century ago."
  },
  {
    "title": "Ukraine’s Dilemma as Pokrovsk Teeters: Save Lives or Keep Holding On",
    "link": "https://www.nytimes.com/2025/11/13/world/europe/ukraine-pokrovsk-russia-battle.html",
    "summary": "Military analysts and some Ukrainian commanders worry that Kyiv may be repeating the mistake of staying in an embattled city longer than it should, aiming to inflict far more casualties than it suffers."
  },
  {
    "title": "What Our Photographer Saw as a Safe City Became a Blood Bath",
    "link": "https://www.nytimes.com/2025/11/13/world/europe/ukraine-russia-pokrovsk.html",
    "summary": "The Ukrainian city of Pokrovsk is on the verge of becoming another shattered trophy for the Russian Army."
  },
  {
    "title": "Israeli Settlers Burn West Bank Mosque Amid Rise in Violent Attacks",
    "link": "https://www.nytimes.com/2025/11/13/world/middleeast/israel-settlers-west-bank-mosque.html",
    "summary": "Since the 2023 attack on Israel by Hamas, growing settler violence and Israeli attacks on Palestinian militants have thrown the West Bank into turmoil and displaced tens of thousands."
  },
  {
    "title": "Under Fire for Tucker Carlson Remarks, Think Tank Chief Pleads Ignorance",
    "link": "https://www.nytimes.com/2025/11/13/us/politics/kevin-roberts-heritage-foundation-nick-fuentes.html",
    "summary": "Kevin Roberts, under fire for defending Tucker Carlson’s interview with a white nationalist, said that he did not keep up with the news and that he had simply read an aide’s script."
  },
  {
    "title": "The Luxury Electric Vehicle Is in Trouble",
    "link": "https://www.nytimes.com/2025/11/13/business/luxury-electric-vehicles.html",
    "summary": "Sales of expensive battery-powered cars like the Ford F-150 Lightning have stalled, forcing automakers to slow production and offer more affordable vehicles."
  },
  {
    "title": "In the Faroe Islands’ Soccer Team, the Players Also Have Day Jobs",
    "link": "https://www.nytimes.com/2025/11/13/world/europe/this-scrappy-soccer-team-has-a-cinderella-chance-at-making-the-world-cup.html",
    "summary": "The Faroe Islands, rugged green specks in the North Atlantic, are an underdog. Most of the guys on the team have day jobs."
  },
  {
    "title": "Does the Subway Still Need Train Conductors?",
    "link": "https://www.nytimes.com/2025/11/13/nyregion/subway-train-conductors-hochul.html",
    "summary": "Gov. Kathy Hochul must decide by year’s end whether to sign a law that would mandate two-person crews on all trains, a practice critics say is costly and outdated."
  },
  {
    "title": "Hochul Vetoed 7 of His Bills in a Single Day. Could It Be Personal?",
    "link": "https://www.nytimes.com/2025/11/13/nyregion/skoufis-hochul-bills-veto.html",
    "summary": "State Senator James Skoufis of New York has been a steady critic of Gov. Kathy Hochul, a fellow Democrat. Her vetoes of his bills seemed intended to send a message."
  },
  {
    "title": "Erik Bottcher Joins Crowded House Primary to Succeed Nadler",
    "link": "https://www.nytimes.com/2025/11/13/nyregion/erik-bottcher-congress-nadler-schlossberg.html",
    "summary": "Erik Bottcher, a Democrat from Chelsea, began his career as an L.G.B.T.Q. rights activist. He faces a growing field of rivals vying for a Manhattan House seat."
  },
  {
    "title": "Wifredo Lam: Artist-Poet of Tropical Dreams and Sorrows",
    "link": "https://www.nytimes.com/2025/11/13/arts/design/wifredo-lam-retrospective-moma.html",
    "summary": "The great Cuban modernist, whose politics and Afro-Asian roots shaped his paintings and inspired generations of artists, gets a revelatory survey at MoMA."
  },
  {
    "title": "Pardon Me. I Am Not Done Committing Crimes.",
    "link": "https://www.nytimes.com/2025/11/13/opinion/trump-pardons-crimes.html",
    "summary": "One of the founders’ worst fears has been realized."
  },
  {
    "title": "What James and Maurene Comey’s Cases Tell Us About Trump",
    "link": "https://www.nytimes.com/2025/11/13/opinion/trump-comey-james-maurene.html",
    "summary": "The legal precedent established by Maurene Comey’s case may turn out to be far more consequential than the finding in her father’s."
  },
  {
    "title": "Epstein’s Emails",
    "link": "https://www.nytimes.com/2025/11/13/briefing/epsteins-emails.html",
    "summary": "Congress released new files from the Epstein investigation. We explain what they mean."
  },
  {
    "title": "Blue Origin to Launch NASA’s ESCAPADE Mission to Mars: How to Watch",
    "link": "https://www.nytimes.com/2025/11/13/science/blue-origin-launch-rocket.html",
    "summary": "This will be the second flight of the orbital rocket from Jeff Bezos’ space company and will include a key test of whether it can land a booster stage for later reuse."
  },
  {
    "title": "Ultraprocessed Foods Linked to Colorectal Cancer Risk in Women Under 50",
    "link": "https://www.nytimes.com/2025/11/13/well/eat/ultraprocessed-foods-colorectal-cancer-risk.html",
    "summary": "The study’s findings track with recent research on the alarming rise of the cancer in younger adults."
  },
  {
    "title": "How to See the Northern Lights on Wednesday",
    "link": "https://www.nytimes.com/2025/11/12/science/how-to-see-the-northern-lights-wednesday.html",
    "summary": "A geomagnetic storm made the aurora borealis visible across a swath of the United States again on Wednesday, illuminating the skies as far south as Arizona."
  },
  {
    "title": "A BlackRock-Backed Roofing Conglomerate Goes Bust",
    "link": "https://www.nytimes.com/2025/11/13/business/economy/private-equity-roofers-contractors-blackrock.html",
    "summary": "Investment firms are buying and bundling contractors, leaving some workers and customers worse off."
  }
]