[
  {
    "title": "Ayatollah Ali Khamenei, Planning for His Possible Assassination, Picks Successors",
    "link": "https://www.nytimes.com/2025/06/21/world/middleeast/iran-ayatollah-israel-war.html",
    "summary": "Ayatollah Ali Khamenei has not only picked replacements in his chain of military command in case they are killed in Israeli strikes, he has also named three senior clerics to replace him should he, too, be slain."
  },
  {
    "title": "As Iran and Israel Battle, the Rest of the Mideast Fears What’s Next",
    "link": "https://www.nytimes.com/2025/06/21/world/middleeast/iran-israel-regional-consequences.html",
    "summary": "The fight between two well-armed regional powers has their neighbors worried about the conflict spreading, a concern worsened by the prospect of U.S. involvement."
  },
  {
    "title": "An Iran Deal in Two Weeks? Hard to Achieve, Even if Trump Really Wants One.",
    "link": "https://www.nytimes.com/2025/06/20/us/politics/trump-israel-iran-deal.html",
    "summary": "Negotiating with Tehran is time-consuming and difficult under the best of circumstances. And it remains unclear whether President Trump’s 14-day clock is more than a way to buy time for military preparations."
  },
  {
    "title": "The Lessons of Trump’s Fight With Los Angeles Over Immigration",
    "link": "https://www.nytimes.com/2025/06/21/magazine/trump-los-angeles-immigration.html",
    "summary": "The president’s clashes with Los Angeles over immigration were a decade in the making — and their outcome remains unclear."
  },
  {
    "title": "Detention Is Over for Students Trump Seeks to Deport. Not His Crackdown.",
    "link": "https://www.nytimes.com/2025/06/21/nyregion/mahmoud-khalil-immigration-crackdown.html",
    "summary": "An effort to expel students the administration says are a national security threat has given way to a broad campaign that touches many corners of American life."
  },
  {
    "title": "Vance Blames L.A. Violence on California Democrats and Disparages Padilla",
    "link": "https://www.nytimes.com/2025/06/20/us/politics/vance-padilla-newsom-bass.html",
    "summary": "Vice President JD Vance said during a Los Angeles stop that Gov. Gavin Newsom and Mayor Karen Bass had encouraged protesters to engage in violence. He also criticized Senator Alex Padilla and called him by the wrong name."
  },
  {
    "title": "Dodgers Pledge Aid to L.A. Families Affected by Trump Crackdown",
    "link": "https://www.nytimes.com/2025/06/20/us/politics/la-dodgers-ice-raids.html",
    "summary": "Pressed by Angelenos, including a large Latino fan base, the Dodgers promised support but stopped short of denouncing ICE raids that have outraged much of the metropolis."
  },
  {
    "title": "Harvard and Trump Restart Talks to Potentially End Bitter Dispute",
    "link": "https://www.nytimes.com/2025/06/20/us/politics/harvard-federal-funding-trump.html",
    "summary": "Details about the discussions emerged after President Trump said the two sides, which have been locked in court battles for weeks, might reach a settlement soon."
  },
  {
    "title": "The Efforts to Erase Black History",
    "link": "https://www.nytimes.com/video/us/politics/100000010093139/the-efforts-to-erase-black-history.html",
    "summary": "President Trump’s executive orders have sought to reframe the history of race and culture in America. Erica L. Green, a White House correspondent for The New York Times, describes how the orders have led to the erasing of history of the Black experience."
  },
  {
    "title": "How Trump Treats Black History Differently Than Other Parts of America’s Past",
    "link": "https://www.nytimes.com/2025/06/20/us/politics/trump-black-history-federal-holidays.html",
    "summary": "Since taking office in January, President Trump has tried to reframe the country’s past involving racism and discrimination by de-emphasizing that history or at times denying that it happened."
  },
  {
    "title": "Trump Says He Wants to Fund More Trade Schools. Just Not These.",
    "link": "https://www.nytimes.com/2025/06/21/business/job-corps-trump-trade-schools.html",
    "summary": "The Job Corps program has long been the subject of debate, but it is now also a point of contention in the administration’s efforts to pull back the social safety net."
  },
  {
    "title": "U.S. Heat Wave Forecast: When High Temperatures Will Affect You",
    "link": "https://www.nytimes.com/2025/06/19/weather/us-heat-wave-midwest-northeast-forecast.html",
    "summary": "Many places around the country will experience their first significant heat of the year in the next few days. Here’s why it’s so dangerous."
  },
  {
    "title": "U.K. Heat Wave Leaves Britons Looking for Ways to Stay Cool",
    "link": "https://www.nytimes.com/2025/06/21/world/europe/uk-heat-wave-britain.html",
    "summary": "As high temperatures have become more common in recent years, some people are adjusting, including by investing in air-conditioners."
  },
  {
    "title": "How to Stay Cool and Safe in a Heat Wave",
    "link": "https://www.nytimes.com/article/excessive-heat-stay-cool.html",
    "summary": "As temperatures rise, here’s guidance on coping with extreme heat."
  },
  {
    "title": "The Question Dividing New Yorkers: Is the City Sinking or Bouncing Back?",
    "link": "https://www.nytimes.com/2025/06/21/nyregion/state-of-new-york-city.html",
    "summary": "On the cusp of choosing the city’s next mayor, New Yorkers are taking stock of their town. But many are split on whether it’s back on track, or off the rails."
  },
  {
    "title": "N.Y.C. Mayoral Primary May Hinge on Early Voters as Heat Wave Looms",
    "link": "https://www.nytimes.com/2025/06/21/nyregion/voting-primary-nyc-heat.html",
    "summary": "Primary Day turnout will also be a factor in a race that could come down to whether Andrew Cuomo’s union supporters and paid staff can fend off Zohran Mamdani’s volunteer army."
  },
  {
    "title": "We Asked. The Top Candidates for Mayor of New York City Answered.",
    "link": "https://www.nytimes.com/2025/06/20/nyregion/nyc-mayor-interviews.html",
    "summary": "We interviewed eight of the leading candidates for New York City mayor about their experience, their plans for the city and their sometimes contentious bagel orders. Here’s what they said."
  },
  {
    "title": "As N.Y.C. Mayoral Primary Nears, Money Talks as Mamdani Walks",
    "link": "https://www.nytimes.com/2025/06/20/nyregion/mamdani-cuomo-money-mayor.html",
    "summary": "Zohran Mamdani, who is second to Andrew M. Cuomo in the polls, was rebuffed in his bid to raise his spending cap. It did not stop his seven-mile trek down Manhattan."
  },
  {
    "title": "What to Know About the Wedding of Jeff Bezos and Lauren Sánchez",
    "link": "https://www.nytimes.com/2025/06/20/style/jeff-bezos-lauren-sanchez-wedding.html",
    "summary": "The second marriage for both is taking place in Venice, Italy, under a shroud of secrecy and amid a swarm of speculation."
  },
  {
    "title": "A White Nationalist at University of Florida Wrote a Paper Promoting Racist Views. It Won Him an Award.",
    "link": "https://www.nytimes.com/2025/06/21/us/white-supremacist-university-of-florida-paper.html",
    "summary": "The University of Florida student won an academic honor after he argued in a paper that the Constitution applies only to white people. From there, the situation spiraled."
  },
  {
    "title": "Anne Burrell Memorial Service Attended by Food Network Stars",
    "link": "https://www.nytimes.com/2025/06/20/dining/anne-burrell-memorial-service.html",
    "summary": "The Food Network chef, who died Tuesday at 55, was remembered in a star-studded service that sent her off with a singalong."
  },
  {
    "title": "Anne Burrell’s Death Is Under Investigation as a Possible Drug Overdose",
    "link": "https://www.nytimes.com/2025/06/20/dining/anne-burrell-overdose-death-investigation.html",
    "summary": "The city’s medical examiner has not determined a cause, but an internal police document says the TV chef was found surrounded by pills."
  },
  {
    "title": "BTS Is Back Together. Does It Still Rule K-Pop?",
    "link": "https://www.nytimes.com/2025/06/21/world/asia/bts-kpop.html",
    "summary": "Suga is the last member of the wildly popular band to complete his national service. After more than two years apart, the challenge is to rekindle the magic."
  },
  {
    "title": "How South Korea Became a Cultural Powerhouse",
    "link": "https://www.nytimes.com/2025/06/21/world/asia/south-korea-kpop-culture.html",
    "summary": "With BTS poised to reunite, “Squid Game” returning and a Broadway show winning awards, the Korean cultural wave keeps on rolling."
  },
  {
    "title": "Who’s the Mad King Now?",
    "link": "https://www.nytimes.com/2025/06/21/opinion/trump-king-george.html",
    "summary": "George III learned the hard way not to unleash troops on his people."
  },
  {
    "title": "Trump Is Vulnerable. Democrats Still Need a Strategy.",
    "link": "https://www.nytimes.com/2025/06/21/opinion/trump-immigration-deportations.html",
    "summary": "Three Opinion writers on why Trump’s deportations might be backfiring."
  },
  {
    "title": "Season Opener",
    "link": "https://www.nytimes.com/2025/06/21/briefing/season-opener.html",
    "summary": "It’s the first full day of summer. Make sure you don’t miss a minute of it."
  },
  {
    "title": "A.I. Sludge Has Entered the Job Search",
    "link": "https://www.nytimes.com/2025/06/21/business/dealbook/ai-job-applications.html",
    "summary": "Candidates are frustrated. Employers are overwhelmed. The problem? An untenable pile of applications — many of them generated with the help of A.I. tools."
  },
  {
    "title": "Air India C.E.O.’s Remarks After Plane Crash Draw Scrutiny",
    "link": "https://www.nytimes.com/2025/06/21/business/air-india-crash-ceo-speech.html",
    "summary": "A video message by Campbell Wilson, Air India’s chief executive, closely resembled what the head of American Airlines said after a deadly crash months earlier."
  },
  {
    "title": "Suspect in Minnesota Attacks Was a Doomsday Prepper, Investigator Says",
    "link": "https://www.nytimes.com/2025/06/20/us/minnesota-assassination-preppers-boelter.html",
    "summary": "An F.B.I. agent said Vance Boelter left instructions for his wife in the event of a calamity, according to a court document."
  },
  {
    "title": "Drought Is Hurting Global Food Supplies",
    "link": "https://www.nytimes.com/2025/06/21/climate/drought-food-prices-coffee-wheat-beef.html",
    "summary": "Staples including wheat, beef and coffee are all being affected by the lack of rainfall. In some cases, prices are climbing to record highs."
  }
]