[
  {
    "title": "Trump Demands That Bondi Move ‘Now’ to Prosecute Foes",
    "link": "https://www.nytimes.com/2025/09/20/us/politics/trump-justice-department-us-attorneys.html",
    "summary": "His demand came a day after he ousted the federal prosecutor who failed to charge two of his most-reviled adversaries, Letitia James and James B. Comey."
  },
  {
    "title": "Trump Justice Dept. Closed Investigation Into Tom Homan for Accepting Bag of Cash",
    "link": "https://www.nytimes.com/2025/09/20/us/politics/tom-homan-fbi-trump.html",
    "summary": "Mr. Homan came under scrutiny after he was said to be recorded last year taking $50,000 in cash from undercover F.B.I. agents."
  },
  {
    "title": "California Bars ICE Agents From Wearing Masks in the State",
    "link": "https://www.nytimes.com/2025/09/20/us/california-ice-agents-masks-law.html",
    "summary": "Gov. Gavin Newsom signed a bill to prevent federal agents from concealing their identities with masks. The law is expected to face a legal challenge."
  },
  {
    "title": "Top Democratic Leaders Ask Trump for Meeting to Avert a Shutdown",
    "link": "https://www.nytimes.com/2025/09/20/us/politics/jeffries-schumer-trump.html",
    "summary": "After a Republican plan to keep funding flowing foundered in the Senate, Representative Hakeem Jeffries and Senator Chuck Schumer accused the president of standing in the way of a solution."
  },
  {
    "title": "With Calls for Retribution Over Kirk, Some See Rise of a ‘Woke Right’",
    "link": "https://www.nytimes.com/2025/09/19/us/charlie-kirk-free-speech-republicans.html",
    "summary": "Conservatives have pressed for consequences for those who make negative comments about Charlie Kirk. But a few on the right say they worry about limits on speech."
  },
  {
    "title": "Trump Escalates Attack on Free Speech",
    "link": "https://www.nytimes.com/video/us/politics/100000010409626/trump-escalates-attack-on-free-speech.html",
    "summary": "Zolan Kanno-Youngs, a White House correspondent for The New York Times, describes how the Trump administration’s pressuring of ABC to take action against Jimmy Kimmel is part of a broader crackdown by the administration since the assassination of Charlie Kirk."
  },
  {
    "title": "Arrest in Arizona Before Charlie Kirk Memorial Heightens Security Concerns",
    "link": "https://www.nytimes.com/2025/09/20/us/charlie-kirk-memorial-security-arizona.html",
    "summary": "After a man was charged with impersonating a police officer, a spokesman for the group Charlie Kirk founded said the man had been providing advance security for a guest."
  },
  {
    "title": "He Wrote a Biting Post About Charlie Kirk. The Fury Came Fast.",
    "link": "https://www.nytimes.com/2025/09/20/us/florida-charlie-kirk-free-speech.html",
    "summary": "Residents of Palmetto Bay, Fla., have demanded the resignation of Councilman Stephen Cody, who wrote a post mocking Charlie Kirk’s support for gun rights."
  },
  {
    "title": "What to Know About Charlie Kirk’s Funeral: Time, How to Watch and Speakers",
    "link": "https://www.nytimes.com/2025/09/20/us/charlie-kirk-funeral-memorial-time-guests.html",
    "summary": "The conservative activist will be honored in a public program on Sunday, with President Trump and several top administration officials expected to speak."
  },
  {
    "title": "Trump’s $100,000 H1-B Visa Fee Spurs Confusion and Chaos for Companies",
    "link": "https://www.nytimes.com/2025/09/20/business/trump-h1b-visas-fee-employees.html",
    "summary": "The White House sought to clarify the proclamation on Saturday, but many companies remained cautious. “We are still flying in somewhat foggy conditions,” one attorney said."
  },
  {
    "title": "White House Outlines a TikTok Deal With a U.S. Board",
    "link": "https://www.nytimes.com/2025/09/20/technology/white-house-tiktok-deal.html",
    "summary": "A potential deal to reduce TikTok’s ties to China would give the app a new board with six American directors out of seven, the White House press secretary said."
  },
  {
    "title": "Trump Hails Progress on TikTok Deal After Call With Xi",
    "link": "https://www.nytimes.com/2025/09/19/world/asia/tiktok-xi-trump-china.html",
    "summary": "President Trump said he would meet with President Xi Jinping next month in South Korea. Mr. Xi said he welcomes a TikTok deal that would benefit both sides."
  },
  {
    "title": "Seeing Through the Reality of Meta’s Smart Glasses",
    "link": "https://www.nytimes.com/2025/09/20/technology/personaltech/meta-smart-glasses-mark-zuckerberg.html",
    "summary": "Mark Zuckerberg’s glitch-filled unveiling of computerized glasses revealed a company that may struggle to deliver on its promise for the future of computing."
  },
  {
    "title": "What Wall Street Sees in the Data Center Boom",
    "link": "https://www.nytimes.com/2025/09/20/business/dealbook/data-centers-ai.html",
    "summary": "Data center capacity has become a barometer for both the health of the tech market and the risk of an A.I. bubble."
  },
  {
    "title": "Can France’s Palestinian Proposal Change 75 Years of Failed Diplomacy?",
    "link": "https://www.nytimes.com/2025/09/20/world/middleeast/france-palestinian-state-peace-plan.html",
    "summary": "The French president has rallied 142 nations behind a road map for a two-state solution after the Gaza war ends. Missing from the list: Israel and the United States."
  },
  {
    "title": "What to Know About the Visa Standoff Between Trump and the United Nations",
    "link": "https://www.nytimes.com/2025/09/20/world/middleeast/visa-standoff-trump-united-nations.html",
    "summary": "The president of the Palestinian Authority won’t be able to attend the U.N. General Assembly after the Trump administration denied him a visa."
  },
  {
    "title": "They Helped Oust a Dictator. Now the New Regime Is Coming for Them.",
    "link": "https://www.nytimes.com/2025/09/20/world/americas/nicaragua-ortega-arrests.html",
    "summary": "President Daniel Ortega of Nicaragua and his wife, who is co-president, have been arresting longtime loyalists, in an apparent quest to ensure no one outside the family rises to power."
  },
  {
    "title": "They Were Promised a Taste of America. They Got Abuse and Exploitation.",
    "link": "https://www.nytimes.com/2025/09/20/nyregion/j1-visa-foreign-workers.html",
    "summary": "Every year, tens of thousands of young people are sent on visas to toil as farmworkers, housekeepers and office interns, all in the name of cultural exchange."
  },
  {
    "title": "4 Takeaways From the Times Investigation Into the J-1 Visa Program",
    "link": "https://www.nytimes.com/2025/09/20/nyregion/j-1-visa-investigation-takeaways.html",
    "summary": "Some American companies have used the cultural exchange program as a supply of cheap, exploitable labor, records and interviews show."
  },
  {
    "title": "Marian Burros, 92, Dies; Food Writer Famed for Her Plum Torte and More",
    "link": "https://www.nytimes.com/2025/09/20/dining/marian-burros-dead.html",
    "summary": "At The Times and elsewhere, she combined recipe writing with reporting on topics like consumer protection and food safety. Her torte was a longtime fan favorite."
  },
  {
    "title": "Combs Sentencing Focuses Attention on Prostitution Law From 1910",
    "link": "https://www.nytimes.com/2025/09/19/arts/music/sean-combs-diddy-sentencing-mann-act.html",
    "summary": "Acquitted of more serious charges, Sean Combs was found guilty of violating a law enacted during a panic over “white slavery” that is now a common tool in sex crimes prosecutions."
  },
  {
    "title": "Robert Redford Was Everything You Hoped He’d Be",
    "link": "https://www.nytimes.com/2025/09/20/opinion/robert-redford-death.html",
    "summary": "Redford and Newman, real movie stars with real values."
  },
  {
    "title": "Confused About Vaccine Guidance? Doctors Are, Too.",
    "link": "https://www.nytimes.com/2025/09/20/opinion/vaccine-guidance-doctors.html",
    "summary": "Physicians are having tough conversations about vaccines."
  },
  {
    "title": "Man Charged After Drive-by Shooting at Local ABC Station in Sacramento",
    "link": "https://www.nytimes.com/2025/09/20/us/sacramento-shooting-tv-news-station.html",
    "summary": "Officers responding to the site of the shooting found that at least three rounds had hit the station’s window. No injuries were reported, and a motive was unclear."
  },
  {
    "title": "Five-Alarm Fire on Brooklyn Waterfront Devastates Artists’ Warehouse",
    "link": "https://www.nytimes.com/2025/09/20/nyregion/red-hook-warehouse-fire.html",
    "summary": "A row of converted 19th-century buildings filled with artists in the 1990s and transformed Red Hook. Now the work of more than 500 artists may be lost."
  },
  {
    "title": "Diane Martel, Inventive Director of Music Videos, Dies at 63",
    "link": "https://www.nytimes.com/2025/09/20/arts/diane-martel-dead.html",
    "summary": "Over three decades, she worked with superstars such as Jennifer Lopez and Mariah Carey, and faced claims of misogyny with her video for Robin Thicke’s “Blurred Lines.”"
  },
  {
    "title": "Why Russia Revived a Cold War-Era Song Contest",
    "link": "https://www.nytimes.com/2025/09/20/arts/music/intervision-song-contest.html",
    "summary": "A Vietnamese pop star won the Intervision Song Contest in Moscow on Saturday. The United States was meant to participate, but politics intervened."
  }
]