[
  {
    "title": "Officials in Iran Suspect Sabotage in Wave of Fires and Explosions",
    "link": "https://www.nytimes.com/2025/07/23/world/middleeast/iran-fires-sabotage.html",
    "summary": "For weeks, fires and explosions have been reported almost daily in Iran. Officials are investigating what they think is a coordinated campaign."
  },
  {
    "title": "Republicans Rely on Trump’s Promises to Grease the Path for His Agenda",
    "link": "https://www.nytimes.com/2025/07/22/us/politics/republicans-trump-agenda.html",
    "summary": "G.O.P. leaders scrounging for the votes to push through the president’s priorities have increasingly turned to him and his team to win over holdouts with special carve-outs and commitments."
  },
  {
    "title": "E.P.A. Is Said to Draft a Plan to End Its Ability to Fight Climate Change",
    "link": "https://www.nytimes.com/2025/07/22/climate/epa-endangerment-finding-rescind.html",
    "summary": "According to two people familiar with the draft, it would eliminate the bedrock scientific finding that greenhouse-gas emissions threaten human life by dangerously warming the planet."
  },
  {
    "title": "FEMA Urban Search and Rescue Chief Resigns, Citing Agency ‘Chaos’, Colleagues Said",
    "link": "https://www.nytimes.com/2025/07/22/climate/fema-urban-search-rescue-chief-resigns.html",
    "summary": "Ken Pagurek had told colleagues the Trump administration was causing ‘chaos’ inside FEMA and creating dangerous delays in disaster response."
  },
  {
    "title": "U.S. and Japan Reach Trade Deal",
    "link": "https://www.nytimes.com/2025/07/22/us/politics/trump-japan-trade-deal.html",
    "summary": "President Trump said on Tuesday that the trade deal he struck with one of America’s closest allies would impose a 15 percent tariff on Japanese exports."
  },
  {
    "title": "Canada Won’t Accept a Trade Deal With the U.S. at ‘Any Cost’",
    "link": "https://www.nytimes.com/2025/07/22/world/canada/carney-trade-deal-trump.html",
    "summary": "Prime Minister Mark Carney, after a meeting with Canada’s political leaders, downplayed the chances of success in talks aimed at reaching a trade deal with President Trump."
  },
  {
    "title": "Trump Baselessly Accuses Obama of ‘Treason’ as Questions Swirl About Epstein",
    "link": "https://www.nytimes.com/2025/07/22/us/politics/trump-obama-clinton-epstein-treason.html",
    "summary": "President Trump deflected questions about the disgraced financier Jeffrey Epstein by lashing out at his perceived enemies."
  },
  {
    "title": "Johnson Cuts Short House Business to Avoid Vote on Releasing Epstein Files",
    "link": "https://www.nytimes.com/2025/07/22/us/politics/mike-johnson-ends-house-session-epstein-vote.html",
    "summary": "The Republican speaker truncated the legislative schedule for the week ahead of a summer recess, moving to deny Democrats the chance to force votes on whether to release the Epstein material."
  },
  {
    "title": "Ozzy Osbourne, Black Sabbath Lead Singer Turned Reality TV Star, Dies at 76",
    "link": "https://www.nytimes.com/2025/07/22/arts/music/ozzy-osbourne-dead.html",
    "summary": "As the lead singer of Black Sabbath, he helped invent heavy metal. On “The Osbournes,” he presented a comedic counterpoint to his rock ’n’ roll infamy."
  },
  {
    "title": "Ozzy Osbourne, the Lovable Prince of Darkness",
    "link": "https://www.nytimes.com/2025/07/22/arts/music/ozzy-osbourne-prince-of-darkness-black-sabbath.html",
    "summary": "The rocker helped define the sound, look and attitude of metal. But his persistence through addiction, his connection to audience and a late-career reality TV show endeared him to generations."
  },
  {
    "title": "12 Essential Ozzy Osbourne and Black Sabbath Songs",
    "link": "https://www.nytimes.com/2025/07/22/arts/music/ozzy-osbourne-songs-black-sabbath.html",
    "summary": "The frontman, who with Black Sabbath helped pioneer heavy metal in 1970s England, always found new ways to reinvent himself."
  },
  {
    "title": "Showdown in New Jersey Over Top Federal Prosecutor",
    "link": "https://www.nytimes.com/2025/07/22/nyregion/alina-habba-nj-us-attorney.html",
    "summary": "Alina Habba’s term as interim U.S. attorney was set to expire this week. Federal judges announced a replacement, but Attorney General Pam Bondi quickly intervened."
  },
  {
    "title": "Under Trump, Hospitals Limit Transgender Care for Minors, Even in Blue States",
    "link": "https://www.nytimes.com/2025/07/22/us/trump-transgender-healthcare-california-hospitals.html",
    "summary": "Two prominent medical centers in California recently announced they would stop treatments, citing pressure from the Trump administration."
  },
  {
    "title": "U.S. Olympic Officials Bar Transgender Women From Women’s Competitions",
    "link": "https://www.nytimes.com/2025/07/22/us/politics/us-olympics-trans-women-athletes-ban-trump.html",
    "summary": "The U.S. Olympic & Paralympic Committee changed its eligibility rules on Monday to comply with President Trump’s executive order, taking the decision away from national governing bodies for each sport."
  },
  {
    "title": "In Trump’s Battle With Murdoch, Fox News Is a Complication",
    "link": "https://www.nytimes.com/2025/07/22/business/media/trump-murdoch-fox-wall-street-journal.html",
    "summary": "The two are constrained by the thing that has kept them linked for a decade: their shared reliance on Fox News die-hards."
  },
  {
    "title": "Malcolm-Jamal Warner Drowned in Area Known for Rip Currents",
    "link": "https://www.nytimes.com/2025/07/22/arts/malcolm-jamal-warner-rip-currents-costa-rica.html",
    "summary": "New details emerged about the death of the “Cosby Show” actor, who drowned on the Caribbean side of Costa Rica."
  },
  {
    "title": "Rip Current Survival Tips: What to Do if You Get Caught in One",
    "link": "https://www.nytimes.com/article/rip-current-survival-escape-tips.html",
    "summary": "From land, a rip current can appear relatively calm, as a strip of water that extends out between breaking waves. Its appearance can be deceiving."
  },
  {
    "title": "Columbia Expels and Suspends Students Involved in Library Takeover",
    "link": "https://www.nytimes.com/2025/07/22/nyregion/columbia-university-expels-suspends-students-library-protest.html",
    "summary": "The occupation of Butler Library in May represented an effort by a pro-Palestinian student protest group to regain momentum on campus."
  },
  {
    "title": "Zelensky Targeted in Wartime Protests in Ukraine for the First Time",
    "link": "https://www.nytimes.com/2025/07/22/world/europe/zelensky-protests-corruption.html",
    "summary": "The demonstrators were angered by government moves to dismantle anticorruption efforts and quell dissent."
  },
  {
    "title": "D.A. Who Led Etan Patz Case Says Conviction Reversal Came as a Shock",
    "link": "https://www.nytimes.com/2025/07/22/nyregion/etan-patz-cyrus-vance-reaction.html",
    "summary": "Cyrus Vance prosecuted Pedro Hernandez twice. An appeals court overturned the conviction, ruling that the trial judge should not have let jurors consider an improper confession."
  },
  {
    "title": "What to Know About the $250 Visa Integrity Fee for U.S. Tourists",
    "link": "https://www.nytimes.com/2025/07/22/travel/visa-integrity-fee-trump-big-beautiful-bill.html",
    "summary": "A newly enacted “visa integrity fee” will apply to millions of foreign visitors, including travelers from Mexico, India, Brazil and China."
  },
  {
    "title": "Trump Is Building a Machine to Disappear People",
    "link": "https://www.nytimes.com/2025/07/23/opinion/migration-deportation-sudan-trump.html",
    "summary": "The president’s use of migrants as bargaining chips will corrode international politics."
  },
  {
    "title": "No, Israel Is Not Committing Genocide in Gaza",
    "link": "https://www.nytimes.com/2025/07/22/opinion/no-israel-is-not-committing-genocide-in-gaza.html",
    "summary": "The charge isn’t only obscene. It’s also absurd."
  },
  {
    "title": "Microsoft Says Chinese State-Backed Hackers Exploiting Flaws in Attacks",
    "link": "https://www.nytimes.com/2025/07/23/world/asia/chinese-hackers-microsoft-sharepoint.html",
    "summary": "At least two Chinese hacking groups were using security flaws in SharePoint, a popular collaboration software, to breach systems, Microsoft said."
  },
  {
    "title": "Sarah Morlok Cotton, Quadruplet Who Knew Fame and Suffering, Dies at 95",
    "link": "https://www.nytimes.com/2025/07/22/science/sarah-morlok-cotton-dead.html",
    "summary": "She was the last of four sisters who became a Depression-era sensation, performing onstage. Offstage, they endured abuse and were studied for their schizophrenia."
  },
  {
    "title": "Video Taken by Migrant Shows Overcrowded ICE Holding Cell in Manhattan",
    "link": "https://www.nytimes.com/2025/07/22/nyregion/video-immigration-holding-cells-overcrowded-unsanitary.html",
    "summary": "Immigrants have complained about unsanitary conditions in the facility at 26 Federal Plaza, including paltry meals and a lack of showers."
  },
  {
    "title": "Federal Prosecutors Close Inquiry Into Co-Founder of Kraken Crypto Exchange",
    "link": "https://www.nytimes.com/2025/07/22/technology/jesse-powell-kraken-verge-investigation.html",
    "summary": "The F.B.I. had raided the home of Jesse Powell in 2023 as part of an investigation into claims that he hacked into the online accounts of a nonprofit."
  }
]