[
  {
    "title": "FEMA Didn’t Answer Thousands of Calls From Flood Survivors, Documents Show",
    "link": "https://www.nytimes.com/2025/07/11/climate/fema-missed-calls-texas-floods.html",
    "summary": "Two days after deadly Texas floods, the agency struggled to answer calls from survivors because of call center contracts that weren’t extended."
  },
  {
    "title": "After Texas Disaster, Trump Shifts His Tone on FEMA",
    "link": "https://www.nytimes.com/2025/07/11/us/politics/trump-fema-texas-flood.html",
    "summary": "Earlier this year, President Trump suggested he wanted to shutter the agency. Now, he says his aides “fixed it up in no time.”"
  },
  {
    "title": "Texas Flood Survivors Recount Night of Terror at Waterfront Campgrounds",
    "link": "https://www.nytimes.com/2025/07/11/us/texas-flood-survivors-waterfront-campgrounds.html",
    "summary": "The half-mile stretch occupied by two campgrounds appears to have been one of the deadliest spots along the Guadalupe River in Central Texas during last week’s flash floods."
  },
  {
    "title": "Trump Visits Texas Flood Sites: ‘Hell of a Situation, Isn’t It?’",
    "link": "https://www.nytimes.com/2025/07/11/us/politics/trump-texas-flood-sites.html",
    "summary": "Mr. Trump and Melania Trump met with victims’ families and viewed some of the aftermath of last weekend’s flooding."
  },
  {
    "title": "Air India Plane Crash Report Says Fuel to Engines Was Cut Off",
    "link": "https://www.nytimes.com/2025/07/11/world/asia/air-india-crash-report.html",
    "summary": "The focus on the fuel switches on Air India Flight 171 raised questions about the pilots’ actions."
  },
  {
    "title": "Pam Bondi and FBI’s Dan Bongino Clash Over Handling of Epstein Case",
    "link": "https://www.nytimes.com/2025/07/11/us/politics/jeffrey-epstein-pam-bondi-dan-bongino-clash.html",
    "summary": "An irate attorney general is said to have confronted the deputy director of the F.B.I. at a tense White House meeting earlier in the week."
  },
  {
    "title": "Energy Department to Gut Funding for Solar and Wind Projects",
    "link": "https://www.nytimes.com/2025/07/11/business/energy-environment/energy-department-renewable-funding-cuts.html",
    "summary": "Stripping hundreds of millions of dollars from renewable energy and efficiency initiatives is part of a broader move to undo efforts to wean the United States off fossil fuels."
  },
  {
    "title": "As Trump Sows Tariff Confusion, Rules of Global Commerce Give Way to Chaos",
    "link": "https://www.nytimes.com/2025/07/11/world/europe/trump-tariffs-global-trade-deals.html",
    "summary": "Blunt letters dictating terms posted to social media and changes late in negotiations have left trading partners wondering what President Trump will do next."
  },
  {
    "title": "‘Buy the Dip’ Wins Again for Stock Investors",
    "link": "https://www.nytimes.com/2025/07/11/business/stocks-buy-the-dip.html",
    "summary": "Individual investors were the ones who piled into stocks when they plunged in early April, while big Wall Street institutions missed out on the gains."
  },
  {
    "title": "David Gergen, Washington Veteran Who Advised Four Presidents, Dies at 83",
    "link": "https://www.nytimes.com/2025/07/11/us/politics/david-gergen-dead.html",
    "summary": "After serving in the government, he became a prominent political commentator. “Centrism doesn’t mean splitting the difference,” he said."
  },
  {
    "title": "Immigration Arrests in Los Angeles Spike Amid Aggressive Enforcement",
    "link": "https://www.nytimes.com/2025/07/11/us/politics/los-angeles-immigration-enforcement.html",
    "summary": "Nearly 3,000 people have been arrested since the beginning of June, more than three times the number in previous months this year."
  },
  {
    "title": "Farmworker Dies After Fleeing a Federal Raid in Southern California",
    "link": "https://www.nytimes.com/2025/07/11/us/immigration-raids-farmworker-death.html",
    "summary": "During a chaotic raid in Ventura County on Thursday, the worker fell from a greenhouse at a cannabis farm, suffered spinal and skull injuries, and died on Friday."
  },
  {
    "title": "Support for Immigration Rebounds as Trump Cracks Down on It, Poll Finds",
    "link": "https://www.nytimes.com/2025/07/11/us/immigration-poll-trump.html",
    "summary": "In a marked reversal from a year ago, more Americans now have positive views about immigration, and a record high believes it is good for the nation."
  },
  {
    "title": "Judge Orders Los Angeles Police to Stop Shooting Projectiles at Journalists",
    "link": "https://www.nytimes.com/2025/07/11/us/judge-orders-los-angeles-police-to-stop-shooting-projectiles-at-journalists.html",
    "summary": "Los Angeles Police Department officers fired foam projectiles and flash-bang devices at reporters and photographers who were covering the immigration protests in June."
  },
  {
    "title": "Amanda Anisimova Makes Wimbledon Final Years After Taking Extended Break",
    "link": "https://www.nytimes.com/2025/07/11/style/amanda-anisimova-wimbledon.html",
    "summary": "The 23-year-old star could be the first American woman to win the tournament since 2016. A self-imposed sabbatical may have helped her get there."
  },
  {
    "title": "Trump Says NATO Countries Will Buy Weapons to Give to Ukraine",
    "link": "https://www.nytimes.com/2025/07/11/world/europe/trump-nato-weapons-ukraine.html",
    "summary": "If the plan is finalized, it would allow critical aid to flow to Ukraine as it endures one of Russia’s heaviest assaults of the war."
  },
  {
    "title": "Russia Sees France as Its Main Enemy in Europe, French General Says",
    "link": "https://www.nytimes.com/2025/07/11/europe-france-general-russia-enemy.html",
    "summary": "During a rare news conference on Friday, the head of the French military, Thierry Burkhard, said Russia remains a “lasting, close” threat."
  },
  {
    "title": "How Netanyahu Prolonged the War in Gaza to Stay in Power",
    "link": "https://www.nytimes.com/2025/07/11/magazine/benjamin-netanyahu-gaza-war.html",
    "summary": "Secret meetings, altered records, ignored intelligence: the inside story of the prime minister’s political calculations since Oct. 7."
  },
  {
    "title": "Takeaways From the Times Investigation Into Benjamin Netanyahu",
    "link": "https://www.nytimes.com/2025/07/11/magazine/benjamin-netanyahu-gaza-investigation-takeaways.html",
    "summary": "Prolonging the Gaza war helped the Israeli prime minister forestall a political reckoning."
  },
  {
    "title": "Netanyahu Ends Washington Trip Without a Gaza Truce",
    "link": "https://www.nytimes.com/2025/07/11/world/middleeast/netanyahu-washington-gaza-talks.html",
    "summary": "Benjamin Netanyahu, the Israeli prime minister, met several times with President Trump, amid rising hopes of a cease-fire in Gaza, but there are still obstacles to a truce with Hamas."
  },
  {
    "title": "Can ‘Superman’ Fly Above Today’s Polarized Politics?",
    "link": "https://www.nytimes.com/2025/07/11/movies/superman-politics-backlash.html",
    "summary": "The director of the reboot, James Gunn, called the superhero from the planet Krypton “an immigrant,” thrusting the summer popcorn movie into an Earthbound culture war."
  },
  {
    "title": "How James Gunn Modeled Superman’s Dog Krypto After His Own Pet",
    "link": "https://www.nytimes.com/2025/07/11/movies/superman-krypto-dog-james-gunn.html",
    "summary": "For the furry sidekick, Krypto, in “Superman,” the director James Gunn found inspiration — and a physical model — in his own unruly pet."
  },
  {
    "title": "Have Christians Finally Had It With Trump?",
    "link": "https://www.nytimes.com/2025/07/11/opinion/trump-republicans-christians.html",
    "summary": "The irreconcilable difference between Trumpian politics and Christianity."
  },
  {
    "title": "Novak Djokovic, I Was Wrong About You",
    "link": "https://www.nytimes.com/2025/07/11/opinion/djokovic-wimbledon-tennis.html",
    "summary": "We never really gave him his due. Maybe the problem was us."
  },
  {
    "title": "Trump Visited Flood Sites in Texas",
    "link": "https://www.nytimes.com/2025/07/11/briefing/trump-texas-flood-sites-earth-spinning.html",
    "summary": "Also, Earth is spinning a bit faster. Here’s the latest at the end of Friday."
  },
  {
    "title": "U.S. Subpoenas Governor Who Said He Would House Migrant at His Home",
    "link": "https://www.nytimes.com/2025/07/11/nyregion/philip-murphy-new-jersey-alina-habba-investigation.html",
    "summary": "Federal prosecutors in New Jersey are investigating remarks that Gov. Philip D. Murphy, a Democrat, made in February."
  },
  {
    "title": "‘They Kept Coming’: Hundreds of Packages Pile Up Outside Woman’s Home",
    "link": "https://www.nytimes.com/2025/07/11/us/amazon-packages-returns-california-woman.html",
    "summary": "A year ago, misdirected Amazon returns began arriving at Karen Holton’s house in California. Eventually, she said, they were stacked so high that she could not easily use her door."
  },
  {
    "title": "Man Had 14 Toucans Stashed in His Volkswagen Dashboard, U.S. Says",
    "link": "https://www.nytimes.com/2025/07/11/us/california-man-charged-toucan-smuggling.html",
    "summary": "Carlos Abundez, 35, is facing federal smuggling charges after U.S. Customs and Border Protection officers made the discovery. The birds, a threatened species, were in stable condition."
  },
  {
    "title": "Heat Warnings Issued for Parts of Eastern Canada",
    "link": "https://www.nytimes.com/2025/07/11/weather/canada-heat-warnings.html",
    "summary": "Warnings were issued for southern Ontario and southwest Quebec as hot and humid weather is expected to linger through Thursday."
  }
]