[
  {
    "title": "Xi, Putin and Modi Try to Signal Unity at China Summit",
    "link": "https://www.nytimes.com/2025/09/01/world/asia/china-xi-putin-modi.html",
    "summary": "Their display of friendship in China was aimed at projecting an alternative to U.S. global leadership, even as serious differences among them remain."
  },
  {
    "title": "India Was the Economic Alternative to China. Trump Ended That.",
    "link": "https://www.nytimes.com/2025/09/01/business/india-china-trump-tariffs.html",
    "summary": "A lurch in policy has shaken the India-U.S. economic alliance against China, leaving India little choice but to consider reversing its own strategy."
  },
  {
    "title": "Hundreds Dead After 6.0-Magnitude Earthquake Hits Afghanistan",
    "link": "https://www.nytimes.com/2025/08/31/world/asia/afghanistan-earthquake-jalalabad.html",
    "summary": "The quake, near the border with Pakistan, injured more than 2,500 people, the authorities said. The death toll was expected to rise."
  },
  {
    "title": "What to Know About the Earthquake in Afghanistan",
    "link": "https://www.nytimes.com/2025/09/01/world/asia/earthquake-afghanistan-what-to-know.html",
    "summary": "Hundreds of people were killed and more than 2,500 were injured, according to the Taliban government, and the death toll was expected to rise."
  },
  {
    "title": "Judge Halts U.S. Effort to Deport Guatemalan Children as Planes Sit on Tarmac",
    "link": "https://www.nytimes.com/2025/08/31/us/politics/trump-deportations-judge-guatemala-children.html",
    "summary": "The temporary block ended another last-minute flurry of legal action over the Trump administration’s immigration crackdown."
  },
  {
    "title": "Robert Mueller Has Parkinson’s Disease, Family Says",
    "link": "https://www.nytimes.com/2025/08/31/us/politics/robert-mueller-parkinsons-disease.html",
    "summary": "The former special counsel, who led the Russia investigation during President Trump’s first term, has had difficulty speaking in recent months. A congressional committee dropped a request for Mr. Mueller to testify this week."
  },
  {
    "title": "A Jamaican Man Served Time in the U.S., Then Was Deported to an African Prison",
    "link": "https://www.nytimes.com/2025/09/01/world/africa/trump-deportations-prison-us-eswatini-africa-jamaica.html",
    "summary": "The case of Orville Etoria highlights a tension in President Trump’s deportation agenda, in which immigrants can be sent abroad and detained indefinitely."
  },
  {
    "title": "He Burned a Flag and Won a Right. With Trump’s Order, He Worries That’s at Risk.",
    "link": "https://www.nytimes.com/2025/09/01/us/politics/flag-burning-trump-johnson-supreme-court.html",
    "summary": "The Supreme Court ruled in 1989 that burning an American flag is speech protected by the First Amendment. President Trump says it should be punished."
  },
  {
    "title": "Rudy Giuliani Is Hurt in Car Crash in New Hampshire",
    "link": "https://www.nytimes.com/2025/08/31/us/politics/rudy-giuliani-accident-car-crash-new-hampshire.html",
    "summary": "Mr. Giuliani, the former New York City mayor and lawyer for President Trump, suffered a fractured vertebra, his head of security said."
  },
  {
    "title": "What to Know About Rudy Giuliani’s Car Accident",
    "link": "https://www.nytimes.com/2025/09/01/nyregion/rudy-giuliani-car-crash-accident.html",
    "summary": "Rudolph W. Giuliani, the former mayor of New York and lawyer for President Trump, suffered a fractured vertebra when a vehicle slammed into his car on Saturday."
  },
  {
    "title": "How Bad Bunny’s Puerto Rico Residency is Boosting the Economy",
    "link": "https://www.nytimes.com/2025/09/01/business/bad-bunny-puerto-rico-economy.html",
    "summary": "Bad Bunny’s three-month concert series in San Juan is spurring a short-term surge in Puerto Rico’s economy."
  },
  {
    "title": "Israel’s New Negotiating Stance Is Likely to Prolong Gaza War, Experts Say",
    "link": "https://www.nytimes.com/2025/09/01/world/middleeast/israel-gaza-cease-fire-negotiations.html",
    "summary": "A shift toward pressing for a permanent cease-fire deal, alongside plans for a new offensive in Gaza City, means the fighting is unlikely to end soon."
  },
  {
    "title": "U.S. Suspends Visas for Palestinian Passport Holders, Officials Say",
    "link": "https://www.nytimes.com/2025/08/31/world/middleeast/us-palestinian-visa-suspensions.html",
    "summary": "The move will stop, at least temporarily, travel for medical treatment, attending university, visiting relatives or conducting business."
  },
  {
    "title": "Houthis Vow Revenge After Israeli Attack Kills Senior Officials",
    "link": "https://www.nytimes.com/2025/08/31/world/middleeast/yemen-houthis-israel.html",
    "summary": "Israel’s assassination of top officials last week is likely to make the Iranian-backed militia even more hawkish, Yemen analysts say."
  },
  {
    "title": "Ukraine War Leads to Global Shortage of TNT for Military and Mining Use",
    "link": "https://www.nytimes.com/2025/09/01/us/politics/ukraine-war-tnt-shortage.html",
    "summary": "Mining materials to make cement, gravel and a host of other common products require an explosive that is becoming more expensive and limited in supply."
  },
  {
    "title": "Kyiv Links Moscow to Killing of Former Ukrainian Parliament Speaker",
    "link": "https://www.nytimes.com/2025/09/01/world/europe/ukraine-andriy-parubiy-murder.html",
    "summary": "Ukraine said it had arrested a suspect in the murder of the politician, who had voiced anti-Russian views. The authorities did not explain how the suspect was tied to Moscow."
  },
  {
    "title": "Where You Can Stumble Upon a U.S. Open Match",
    "link": "https://www.nytimes.com/2025/09/01/nyregion/us-open-tennis-junior-tournament.html",
    "summary": "A small part of the New York City tennis tournament is staged, miles away from the main action, at the gleaming Cary Leeds Center for Tennis & Learning in the Bronx."
  },
  {
    "title": "Dan Rather Is Still Chasing the News",
    "link": "https://www.nytimes.com/2025/09/01/business/media/dan-rather-steady-newsletter.html",
    "summary": "He’s 93, and 20 years removed from signing off as a CBS anchor. But he’s still tapping out stories. “As Popeye used to say, I am what I am.”"
  },
  {
    "title": "In the Remains of Canada’s Jasper Wildfire, Clues to Tame Future Blazes",
    "link": "https://www.nytimes.com/2025/09/01/world/canada/canada-wildfires-alberta-jasper.html",
    "summary": "A giant fire last year consumed much of Canada’s Jasper National Park. Canadian scientists leading research into wildfires are using the blaze to learn lessons for the future."
  },
  {
    "title": "California’s High Potency Cannabis is Fueling a ‘Cali Weed’ Trend in the UK",
    "link": "https://www.nytimes.com/2025/09/01/world/europe/california-uk-cannabis-smuggling.html",
    "summary": "High-strength, California-grown marijuana is so popular in the U.K. that large quantities are being illegally smuggled on passenger flights, officials say."
  },
  {
    "title": "Applying to College in the Age of Racial Trauma",
    "link": "https://www.nytimes.com/2025/09/01/opinion/college-essay-post-affirmative-action.html",
    "summary": "The new, higher premium placed on college application essays that focus on racially traumatic experiences produces numerous undesirable consequences."
  },
  {
    "title": "We Ran the C.D.C. Secretary Kennedy Is Endangering Every American’s Health",
    "link": "https://www.nytimes.com/2025/09/01/opinion/cdc-leaders-kennedy.html",
    "summary": "Agency leaders sound the alarm."
  },
  {
    "title": "A Look at Vintage Photography From Our Archives",
    "link": "https://www.nytimes.com/2025/09/01/briefing/a-look-at-vintage-photography-from-our-archives.html",
    "summary": "We study photographers’ contact sheets from the last century."
  },
  {
    "title": "Anti-Immigrant Protests Attended by Neo-Nazis in Australia Worry Leaders",
    "link": "https://www.nytimes.com/2025/09/01/world/australia/australia-immigration-protests.html",
    "summary": "The government condemned the demonstrations, which drew tens of thousands of people. Some of the events included speakers tied to neo-Nazi groups."
  },
  {
    "title": "South Korea Doctors’ Strike Begins to Wind Down",
    "link": "https://www.nytimes.com/2025/09/01/world/asia/south-korea-doctors-strike.html",
    "summary": "Thousands of residents and interns were protesting a government proposal that would have dramatically increased the number of medical students in the country."
  },
  {
    "title": "Brazil Tightens Bolsonaro House Arrest Amid Escape Concerns",
    "link": "https://www.nytimes.com/2025/08/31/world/americas/brazil-bolsonaro-trial-restrictions.html",
    "summary": "Former President Jair Bolsonaro, who will stand trial on Tuesday, is being closely monitored by the Brazilian authorities, who fear he may try to flee."
  },
  {
    "title": "Why the Graffiti Artist Fonki Finds Inspiration in Angkorian Sculpture",
    "link": "https://www.nytimes.com/2025/09/01/world/asia/fonki-graffiti-cambodia-angkor-wat.html",
    "summary": "The artist Fonki developed a graffiti style that blends ancient motifs with scenes of modern Cambodia."
  }
]