[
  {
    "title": "U.S. Attacked Boat With Aircraft That Looked Like a Civilian Plane",
    "link": "https://www.nytimes.com/2026/01/12/us/politics/us-boat-attacks-law.html",
    "summary": "Even accepting the Trump administration’s claim that there is an armed conflict with suspected drug runners, the laws of war bar “perfidy.”"
  },
  {
    "title": "Trump’s Plans for Venezuelan Oil Run Headlong Into Reality",
    "link": "https://www.nytimes.com/2026/01/12/us/politics/trump-venezuela-oil-dominance-influence.html",
    "summary": "President Trump’s fixation on Venezuela’s oil raises the question of how much “energy dominance” is really worth nowadays."
  },
  {
    "title": "Lawyer Whom Maduro Didn’t Hire Is Booted From His Case",
    "link": "https://www.nytimes.com/2026/01/12/nyregion/maduro-lawyers-bruce-fein.html",
    "summary": "Last week, a lawyer came forward claiming to represent the unseated president of Venezuela, Nicolás Maduro. The judge overseeing the case settled the matter on Monday."
  },
  {
    "title": "FBI’s ICE Shooting Inquiry Examines Renee Good’s Possible Ties to Activist Groups",
    "link": "https://www.nytimes.com/2026/01/12/us/politics/fbi-renee-good-ice-shooting.html",
    "summary": "Former department officials warned that such a broad inquiry raised the specter that forms of political protests could be criminalized."
  },
  {
    "title": "Trump Suggests Renee Good’s ‘Disrespectful’ Attitude Justified Fatal ICE Shooting",
    "link": "https://www.nytimes.com/2026/01/12/us/politics/trump-shooting-renee-good-ice.html",
    "summary": "President Trump suggested that Renee Good’s “highly disrespectful” attitude toward law enforcement played a role in her fatal shooting by an ICE agent."
  },
  {
    "title": "Fed Changes Course and Takes On Trump’s Political Fight",
    "link": "https://www.nytimes.com/2026/01/12/business/federal-reserve-changes-course-trump-administration.html",
    "summary": "The Justice Department’s decision to open up a criminal investigation of Jerome H. Powell, the chair of the Federal Reserve, is a major escalation in the pressure campaign against the central bank to cut interest rates."
  },
  {
    "title": "A Top Fed Official Conveys Little Urgency for Immediate Rate Cuts",
    "link": "https://www.nytimes.com/2026/01/12/business/federal-reserve-john-williams-rates.html",
    "summary": "The Federal Reserve is likely to hold interest rates steady when it meets at the end of the month, keeping tensions high with President Trump."
  },
  {
    "title": "Labor Secretary’s Aides Placed on Leave in Misconduct Investigation",
    "link": "https://www.nytimes.com/2026/01/12/business/lori-chavez-deremer-misconduct-investigation.html",
    "summary": "The Labor Department is investigating a complaint alleging misconduct by Secretary Lori Chavez-DeRemer."
  },
  {
    "title": "Kelly Sues Pentagon Over Threats of Punishment From Hegseth",
    "link": "https://www.nytimes.com/2026/01/12/us/politics/mark-kelly-pentagon-hegseth-suit.html",
    "summary": "Senator Mark Kelly, Democrat of Arizona, asked a federal judge to block the Trump administration from disciplining him for a video warning about illegal military orders."
  },
  {
    "title": "Judge Blocks Trump Effort to Stop Rhode Island’s Revolution Wind Project",
    "link": "https://www.nytimes.com/2026/01/12/climate/judge-strikes-down-trumps-latest-effort-to-stop-offshore-wind.html",
    "summary": "The ruling means that construction can continue on Revolution Wind, a $6.2 billion project off the coast of Rhode Island, at least for now."
  },
  {
    "title": "Trump Cuts to Energy Projects in Blue States Were Unlawful, Judge Rules",
    "link": "https://www.nytimes.com/2026/01/12/climate/trump-energy-department-grant-cuts-unlawful.html",
    "summary": "The Energy Department canceled $7.5 billion in Biden-era energy spending, largely in Democratic-led states, during last year’s government shutdown."
  },
  {
    "title": "Photos: Backstage With Teyana Taylor, Owen Cooper and More Golden Globe Winners",
    "link": "https://www.nytimes.com/2026/01/12/movies/golden-globe-winners-awards-portraits.html",
    "summary": "Rose Byrne, Owen Cooper, Seth Rogen, Teyana Taylor and other award winners in the spotlight."
  },
  {
    "title": "Nikki Glaser’s Monologue, Teyana Taylor’s Speech and Other Moments From the 2026 Globes",
    "link": "https://www.nytimes.com/2026/01/12/movies/golden-globes-best-worst-moments.html",
    "summary": "Nikki Glaser returned as host and killed, while Teyana Taylor delivered the speech of the night. Then there were those awful production choices."
  },
  {
    "title": "Trump Explores Diplomacy With Iran While Weighing Strikes, Officials Say",
    "link": "https://www.nytimes.com/2026/01/12/us/politics/trump-iran-options-diplomacy-strikes.html",
    "summary": "The Pentagon is presenting a wider range of strike options to the president than previously reported. Targets could include Iran’s nuclear program and ballistic missile sites."
  },
  {
    "title": "Why China Is Suddenly Obsessed With American Poverty",
    "link": "https://www.nytimes.com/2026/01/13/business/china-american-poverty.html",
    "summary": "State media, embracing the gaming phrase “kill line,” is asserting China’s political superiority over the United States, deflecting focus on China’s own economic challenges."
  },
  {
    "title": "Meta Plans to Cut 10% to 15% of Employees in Reality Labs Business",
    "link": "https://www.nytimes.com/2026/01/12/technology/meta-layoffs-reality-labs.html",
    "summary": "The layoffs are set to be announced this week and would affect Meta’s work on the metaverse, as the company spends heavily on building artificial intelligence."
  },
  {
    "title": "Apple Teams Up With Google for A.I. in Its Products",
    "link": "https://www.nytimes.com/2026/01/12/technology/apple-google-ai-partnership.html",
    "summary": "Apple was facing increasing questions about its plans for artificial intelligence as other big tech companies invested tens of billions in the technology."
  },
  {
    "title": "Arson Suspect Targeted Mississippi Synagogue for Its ‘Jewish Ties,’ F.B.I. Says",
    "link": "https://www.nytimes.com/2026/01/12/us/mississippi-synagogue-arson.html",
    "summary": "The suspect, Stephen Spencer Pittman, was turned in by his father, who said his son had laughed as he confessed to the fire that damaged the synagogue, investigators said."
  },
  {
    "title": "Synagogue Is Vandalized Days After Anniversary of L.A. Wildfire That Leveled It",
    "link": "https://www.nytimes.com/2026/01/12/us/pasadena-synagogue-vandalized.html",
    "summary": "Graffiti denouncing Zionism was discovered Sunday on a wall of the campus, which has not yet been rebuilt after the Eaton fire."
  },
  {
    "title": "Gavin Newsom Vows to Stop Proposed Billionaire Tax in California",
    "link": "https://www.nytimes.com/2026/01/13/us/newsom-billionaire-tax-california.html",
    "summary": "Gov. Gavin Newsom said he was working behind the scenes to block a proposed tax on billionaires’ wealth and was committed to defeating the measure if it reached the ballot."
  },
  {
    "title": "Why New Jersey Is Running Out of Groundhogs",
    "link": "https://www.nytimes.com/2026/01/12/nyregion/new-jersey-groundhog-day-veto.html",
    "summary": "Since Milltown Mel died, a New Jersey town has faced a groundhog crisis. Now the governor has vetoed an effort to bring in out-of-state replacements."
  },
  {
    "title": "Trump’s Attack on the Federal Reserve Is Already Backfiring",
    "link": "https://www.nytimes.com/2026/01/12/opinion/trump-jerome-powell-federal-reserve.html",
    "summary": "And the market is gently shrugging."
  },
  {
    "title": "The Resistance Libs Were Right",
    "link": "https://www.nytimes.com/2026/01/12/opinion/resistance-libs-trump-fascism.html",
    "summary": "Trump’s message, the emotional core of his movement, has always been textbook fascism."
  },
  {
    "title": "Elle Simone Scott, Chef and Cooking Show Stalwart, Dies at 49",
    "link": "https://www.nytimes.com/2026/01/12/dining/elle-simone-scott-dead.html",
    "summary": "She was the first Black cast member on the PBS show “America’s Test Kitchen,” and used her influence to help other female chefs of color."
  },
  {
    "title": "Pitching Crypto and Needling Mamdani: Adams’s Post-Mayoralty Takes Shape",
    "link": "https://www.nytimes.com/2026/01/12/nyregion/adams-mamdani-crypto-congo.html",
    "summary": "Two weeks ago, Eric Adams was in Times Square to lead the New Year’s Eve ball drop as his last act as mayor. He returned on Monday to promote a new business interest."
  },
  {
    "title": "Dan Bongino, No Longer at the F.B.I., Will Return to Podcasting",
    "link": "https://www.nytimes.com/2026/01/12/arts/dan-bongino-fbi-podcast.html",
    "summary": "The former F.B.I. deputy director, who had hosted a right-wing, pro-Trump podcast, will restart the show after a rocky tenure at the law-enforcement agency."
  },
  {
    "title": "Former Congressional Employee Accused of Stealing 240 Phones",
    "link": "https://www.nytimes.com/2026/01/12/us/congressional-employee-stolen-phones.html",
    "summary": "A Maryland man used his government job to order new cellphones worth over $150,000 and then sell them to a pawnshop, federal prosecutors said."
  }
]