[
  {
    "title": "Justice Department to Investigate Epstein Ties, but Not to Trump",
    "link": "https://www.nytimes.com/2025/11/14/us/politics/trump-epstein-inquiry-democrats.html",
    "summary": "President Trump ordered the Justice Department to investigate the dealings of Democrats with Jeffrey Epstein, after a week in which his own relationship with the convicted sex offender was in the spotlight."
  },
  {
    "title": "Trump Cuts Ties With Marjorie Taylor Greene, Calling Her ‘Wacky’",
    "link": "https://www.nytimes.com/2025/11/14/us/politics/trump-marjorie-taylor-greene-split.html",
    "summary": "The rupture exposed the divides within President Trump’s MAGA base over the Epstein files and more."
  },
  {
    "title": "A Tiny West Wing Office Is Big on Trump Messaging",
    "link": "https://www.nytimes.com/2025/11/14/us/trump-oval-office-study-merch.html",
    "summary": "The Oval Office study has become a room for Trump merchandise."
  },
  {
    "title": "Trump Pulls Nominee for Top I.R.S. Lawyer",
    "link": "https://www.nytimes.com/2025/11/14/us/politics/donald-korb-irs-trump.html",
    "summary": "President Trump’s announcement came after the nominee, Donald L. Korb, came under fire from the far-right activist Laura Loomer on social media."
  },
  {
    "title": "Trump Escalates Pressure on Venezuela, but Endgame Is Unclear",
    "link": "https://www.nytimes.com/2025/11/14/us/politics/trump-pressure-venezuela.html",
    "summary": "President Trump’s aides have provided conflicting accounts of what, exactly, they are seeking to achieve, as America’s largest aircraft carrier heads toward the Caribbean region."
  },
  {
    "title": "Trump Administration to Reduce Flight Cuts at Airports Imposed During Shutdown",
    "link": "https://www.nytimes.com/2025/11/14/us/politics/flights-restrictions-travel-faa.html",
    "summary": "The leaders of the Federal Aviation Administration and the Department of Transportation said they would continue monitoring air traffic controller staffing, which has been improving since the shutdown ended."
  },
  {
    "title": "Trump Administration Lifts Some Food Tariffs in Effort to Ease Prices",
    "link": "https://www.nytimes.com/2025/11/14/business/economy/trump-food-tariffs-inflation.html",
    "summary": "It is walking back levies on imports including beef and coffee in what critics say is an admission that tariffs raised prices in the first place."
  },
  {
    "title": "Judge Orders Trump Not to Threaten University of California’s Funding",
    "link": "https://www.nytimes.com/2025/11/14/us/trump-university-of-california-funding.html",
    "summary": "An extraordinary rebuke to the federal government’s campaign against elite schools, the ruling could upend settlement talks with the university system."
  },
  {
    "title": "The Strategic Uncoupling of Zohran Mamdani and Brad Lander",
    "link": "https://www.nytimes.com/2025/11/14/nyregion/mamdani-lander-dan-goldman.html",
    "summary": "Mr. Lander, the New York City comptroller, campaigned with Mr. Mamdani and once hoped to join him in City Hall. Now he is eyeing a congressional seat."
  },
  {
    "title": "Southern California Storm Forecast to Bring Heavy Rain and Flood Risk",
    "link": "https://www.nytimes.com/2025/11/14/weather/california-rain-flood-storm-los-angeles-forecast.html",
    "summary": "An unusually powerful storm has prompted some evacuation orders before heavy rain on Saturday."
  },
  {
    "title": "Pioneering U.S. Street Photography, With Vienna in the Background",
    "link": "https://www.nytimes.com/2025/11/13/arts/design/lisette-model-albertina-veinna.html",
    "summary": "Lisette Model’s candid and cruel portraits spawned an American genre. But the key to understanding her might lie in Europe, where she was born."
  },
  {
    "title": "A.I.G. Parts Ways With Incoming President Before He Assumes Role",
    "link": "https://www.nytimes.com/2025/11/14/nyregion/aig-president-relationship-job.html",
    "summary": "John Neal’s withdrawal from the insurer comes as the company grapples with another high-profile departure."
  },
  {
    "title": "Boston University Student Attacked Online Over Claim He Called ICE on Workers",
    "link": "https://www.nytimes.com/2025/11/14/us/boston-university-republican-student-ice-carwash-workers.html",
    "summary": "The student, the president of the school’s College Republicans club, said he reported immigrant carwash workers. Now he is facing online attacks after nine of the workers were detained."
  },
  {
    "title": "Amid Trump’s Deportation Push, More Families Are Being Torn Apart",
    "link": "https://www.nytimes.com/2025/11/14/us/trump-deportations-families.html",
    "summary": "Maribel Lopez was hastily deported to Guatemala despite a pending asylum appeal, leaving behind a toddler. Her case highlights a growing pattern of speedy deportations."
  },
  {
    "title": "ICE Scouted Site to Hold Immigrant Detainees in New York City",
    "link": "https://www.nytimes.com/2025/11/14/nyregion/ice-detention-facility-staten-island.html",
    "summary": "Federal officials explored the possibility of using a Coast Guard facility on Staten Island. The effort appears to be part of a plan to expand President Trump’s immigration crackdown."
  },
  {
    "title": "John Beam, Football Coach From Netflix’s ‘Last Chance U,’ Dies After Being Shot",
    "link": "https://www.nytimes.com/2025/11/13/us/john-beam-laney-college-shooting-last-chance.html",
    "summary": "John Beam died after being shot at Laney College in Oakland, Calif., where he was athletic director. A man was charged in connection with the shooting."
  },
  {
    "title": "Housing Official Who Attacked Democrats Invokes a Disputed Family Legacy",
    "link": "https://www.nytimes.com/2025/11/14/business/bill-pulte-mobile-homes-fhfa.html",
    "summary": "The Trump nominee Bill Pulte has called out a Fed governor and New York’s attorney general for issues with their mortgage documents. Some leaders of the family’s home-building business bristle at how he has enhanced his reputation."
  },
  {
    "title": "Seneca Soldier and Statesman Can Finally Add Lawyer to His Legacy",
    "link": "https://www.nytimes.com/2025/11/14/nyregion/ely-samuel-parker-new-york-native-american.html",
    "summary": "Ely Samuel Parker, a Native American who served as an aide to Ulysses S. Grant during the Civil War, was kept from practicing law during his lifetime."
  },
  {
    "title": "Trump’s Spending Abuses Are Out of Control. He Shouldn’t Have That Power in the First Place.",
    "link": "https://www.nytimes.com/2025/11/14/opinion/trump-congress-spending-power.html",
    "summary": "Trump’s actions should alarm anybody who shares the American founders’ suspicion of centralized power."
  },
  {
    "title": "‘This Is the War Against Human Nature’",
    "link": "https://www.nytimes.com/2025/11/14/opinion/paul-kingsnorth-humanity-technology.html",
    "summary": "Paul Kingsnorth argues technology is killing us - physically and spiritually."
  },
  {
    "title": "Disney and YouTube TV End Blackout",
    "link": "https://www.nytimes.com/2025/11/14/business/disney-youtube-tv-deal.html",
    "summary": "After a 15-day standoff, a deal cleared the way for YouTube TV to resume carrying ESPN, ABC and other Disney-owned channels."
  },
  {
    "title": "Dog Accidentally Shoots and Injures a Pennsylvania Man, Police Say",
    "link": "https://www.nytimes.com/2025/11/14/us/dog-shoots-owner-pennsylvania.html",
    "summary": "The man had been cleaning a shotgun and placed it on the bed shortly before it was fired. He received treatment at an area hospital."
  },
  {
    "title": "Elizabeth Franz, Versatile Tony-Winning Actress, Is Dead at 84",
    "link": "https://www.nytimes.com/2025/11/14/theater/elizabeth-franz-dead.html",
    "summary": "She won the award for her performance as Linda Loman in a 1999 Broadway revival of “Death of a Salesman” and played the matriarch Kate Jerome in two Neil Simon comedies."
  },
  {
    "title": "San Francisco Mayor Has First Major Error With Embarrassing Appointment",
    "link": "https://www.nytimes.com/2025/11/14/us/san-francisco-mayor-lurie-alcaraz-resign.html",
    "summary": "Mayor Daniel Lurie has enjoyed strong approval ratings this year, but residents were dismayed after he appointed a city supervisor who quickly resigned after revelations emerged."
  }
]