[
  {
    "title": "For Shooting Suspect, a Long Path of Conflict From Afghanistan to America",
    "link": "https://www.nytimes.com/2025/11/27/us/guard-shooting-suspect-profile.html",
    "summary": "Rahmanullah Lakanwal was among the Afghans who came to the United States after the Taliban takeover of Afghanistan. Earlier, he served in a paramilitary unit that worked with U.S. forces."
  },
  {
    "title": "National Guard Soldier Dies After Being Shot in Washington",
    "link": "https://www.nytimes.com/2025/11/28/us/national-guard-shooting-washington.html",
    "summary": "Another Guard member was in critical condition. The suspect is an Afghan man who once served in a paramilitary unit that worked with U.S. forces, officials said."
  },
  {
    "title": "Trump Uses National Guard Shooting to Cast Suspicion on Refugees",
    "link": "https://www.nytimes.com/2025/11/27/us/politics/trump-national-guard-shooting.html",
    "summary": "President Trump claimed there were “a lot of problems with Afghans,” without providing evidence, as his administration announced that it was implementing new immigration guidelines."
  },
  {
    "title": "Recent Afghan Arrivals Fear Their Futures in the U.S. Are Now in Jeopardy",
    "link": "https://www.nytimes.com/2025/11/27/us/politics/afghans-immigrants-fearful-guard-shooting.html",
    "summary": "Many are anxious after the Trump administration vowed to undertake sweeping reviews of immigrants after the shooting of two National Guard troops."
  },
  {
    "title": "Death Toll Rises to 128 in Hong Kong High-Rise Fire",
    "link": "https://www.nytimes.com/2025/11/28/world/asia/hong-kong-fire.html",
    "summary": "Hope of finding survivors has dwindled, with many residents of the densely packed Wang Fuk Court apartment towers still unaccounted for."
  },
  {
    "title": "What to Know About the Deadly Fire at a Hong Kong Apartment Complex",
    "link": "https://www.nytimes.com/2025/11/26/world/asia/hong-kong-fire-what-to-know.html",
    "summary": "This was the worst fire in Hong Kong in nearly 70 years. At least 128 people were dead and the authorities said they expect to find more bodies in the charred towers."
  },
  {
    "title": "Shoppers Head Into the Holidays With Spending Plans Intact",
    "link": "https://www.nytimes.com/2025/11/28/business/holidays-spending-consumer-sentiment.html",
    "summary": "Prices are higher, and the job market is weakening, but many people plan to spend heartily this season."
  },
  {
    "title": "Trump Cut Europe Out of Ukraine Talks. Here’s How Europe Pushed Back.",
    "link": "https://www.nytimes.com/2025/11/27/world/europe/europe-ukraine-trump.html",
    "summary": "European leaders were blindsided by President Trump’s 28-point-plan to end the Ukraine war, setting off a dash for influence."
  },
  {
    "title": "Home of Ukraine’s Lead Negotiator Is Searched in Corruption Case",
    "link": "https://www.nytimes.com/2025/11/28/world/europe/ukraine-yermak-corruption-peace-talks.html",
    "summary": "The scrutiny of Andriy Yermak, President Volodymyr Zelensky’s chief of staff, could disrupt U.S.-led peace talks and further rattle Ukrainian politics."
  },
  {
    "title": "In Turkey, Pope Seeks to Soothe an Ancient Christian Divide",
    "link": "https://www.nytimes.com/2025/11/28/world/middleeast/pope-leo-turkey-church.html",
    "summary": "In Istanbul, Pope Leo XIV will meet the patriarch of the Eastern Orthodox Church to show amity between two of the world’s largest Christian groups."
  },
  {
    "title": "Pope Leo Visits Turkey on His First Trip as Pontiff",
    "link": "https://www.nytimes.com/2025/11/27/world/europe/pope-leo-trip-pictures.html",
    "summary": "The pope started his six-day trip, which will also include a visit to Lebanon."
  },
  {
    "title": "Why Nadine Menendez Still Hasn’t Visited Her Husband in Prison",
    "link": "https://www.nytimes.com/2025/11/28/nyregion/nadine-robert-menenedez-prison.html",
    "summary": "Robert Menendez, a former Democratic senator, has been in prison since June. He hasn’t seen his wife, who is set to begin serving her sentence next summer."
  },
  {
    "title": "‘Hey, Lemonade!’: A Backstage Fixture at the Grand Ole Opry",
    "link": "https://www.nytimes.com/2025/11/28/us/politics/hey-lemonade-a-backstage-fixture-at-the-grand-ole-opry.html",
    "summary": "Legions of backstage workers have helped the Grand Ole Opry thrive for a century in Nashville. Diana McBride is known for her lemonade — and much more."
  },
  {
    "title": "SNAP Helping Families Put Thanksgiving Dinner on the Table",
    "link": "https://www.nytimes.com/2025/11/27/us/politics/snap-benefits-trump-thanksgiving.html",
    "summary": "SNAP benefits helped Leanna Nieves of Haverhill, Mass., buy Thanksgiving dinner for her family, but she used the day to set aside what have been chronic worries about the federal program."
  },
  {
    "title": "Did Myanmar’s Junta Demolish Scam Centers Just for Show?",
    "link": "https://www.nytimes.com/2025/11/28/world/asia/myanmar-scam-centers-junta.html",
    "summary": "Myanmar’s junta made a grand display of demolishing buildings that hosted the centers, even broadcasting the explosions. But the scammers have found new homes."
  },
  {
    "title": "At Last, a Name for the Murderous Face in a Holocaust Photo",
    "link": "https://www.nytimes.com/2025/11/28/science/holocaust-nazi-photography.html",
    "summary": "With the help of A.I., a historian has identified the killer in a 1941 image that defined the savagery of the Nazi regime."
  },
  {
    "title": "What I Love When I Love America",
    "link": "https://www.nytimes.com/2025/11/28/opinion/america-love-of-country.html",
    "summary": "My love of country this Thanksgiving season is not based on what this or that politician does, but on what America has always been."
  },
  {
    "title": "Goodbye, Price Tags. Hello Dynamic Pricing.",
    "link": "https://www.nytimes.com/2025/11/28/opinion/dynamic-pricing-algorithms.html",
    "summary": "Shopping has always been a game. And now it’s being rigged against you."
  },
  {
    "title": "How Gen Z Is Shopping",
    "link": "https://www.nytimes.com/2025/11/28/briefing/how-gen-z-is-shopping.html",
    "summary": "We look at their habits on Black Friday."
  },
  {
    "title": "Hondurans Fear Unrest Ahead of Election as Trump Endorses a Candidate",
    "link": "https://www.nytimes.com/2025/11/28/world/americas/honduras-election-trump-administration.html",
    "summary": "On Sunday, voters will choose between a left-wing presidential candidate and two conservatives, one backed by President Trump. The results are likely to be bitterly contested."
  },
  {
    "title": "Aftershocks of an Epic Art Crime Reverberate in Japan",
    "link": "https://www.nytimes.com/2025/11/28/world/asia/japan-art-forgeries.html",
    "summary": "At least four works by a famous convicted forger have been discovered in Japan. Transparency about the mistakes, however, has sparked as much curiosity as scandal."
  },
  {
    "title": "Labubu and KPop Demon Hunters Join Macy’s Thanksgiving Day Parade",
    "link": "https://www.nytimes.com/2025/11/27/nyregion/macys-thanksgiving-day-parade.html",
    "summary": "Crowds in New York City bundled up to take in the latest version of a tradition that has run for nearly a century."
  },
  {
    "title": "N.Y. Lawmakers Put Pressure on Hochul to Sign Prison Reform Bills",
    "link": "https://www.nytimes.com/2025/11/28/nyregion/ny-prisons-abuse-lawmakers-reform.html",
    "summary": "The bills, which have already passed the State Legislature, would help prevent brutality in prisons, supporters say. But the governor has yet to enact them."
  }
]