[
  {
    "title": "Camp Mystic in Texas, Where 20 Children Are Missing, Is Nearly a Century Old",
    "link": "https://www.nytimes.com/2025/07/04/us/camp-mystic-texas.html",
    "summary": "Camp Mystic, on the banks of the Guadalupe River in Hunt, Texas, has been operated by generations of the same family since the 1930s."
  },
  {
    "title": "Floods in the same part of Texas swept away 10 teenagers in July 1987.",
    "link": "https://www.nytimes.com/live/2025/07/04/us/texas-floods-guadalupe-river/floods-camp-deaths-july-1987",
    "summary": ""
  },
  {
    "title": "States Brace for Added Burdens of Trump’s Tax and Spending Law",
    "link": "https://www.nytimes.com/2025/07/04/us/politics/states-trump-bill.html",
    "summary": "With the president’s domestic policy law signed, states will have to administer many of the cuts and decide how much they can spend to keep their citizens insured and fed."
  },
  {
    "title": "From Court to Congress to the Mideast, Trump Tallies His Wins",
    "link": "https://www.nytimes.com/2025/07/04/us/trump-policy-bill-iran-israel-supreme-court.html",
    "summary": "There are serious questions about the wisdom and durability of President Trump’s policies, but on his terms, he can point to a string of accomplishments."
  },
  {
    "title": "Court Rejects Effort to Keep Migrants From Being Sent to South Sudan",
    "link": "https://www.nytimes.com/2025/07/04/us/politics/trump-migrants-lawsuit-sudan.html",
    "summary": "After the Supreme Court ruled that the deportations could move forward, a last-ditch attempt to block them with a new lawsuit faltered."
  },
  {
    "title": "Hamas Says It’s Ready to ‘Immediately” Return to Truce Negotiations",
    "link": "https://www.nytimes.com/2025/07/04/world/middleeast/hamas-israel-ceasefire.html",
    "summary": "It was not immediately clear whether the group was demanding any significant changes to the plan for a 60-day truce, hostage-for-prisoner swaps and talks on a permanent end to the Gaza war."
  },
  {
    "title": "Celebrating the Fourth of July Across the Country",
    "link": "https://www.nytimes.com/2025/07/04/us/july-4th-photos-videos.html",
    "summary": "Displays of patriotism were evident at parades and hot dog eating contests, even at a time of deep political divisions among Americans."
  },
  {
    "title": "Some Ways Fireworks Impact Animals and People",
    "link": "https://www.nytimes.com/2025/07/04/climate/fireworks-animals-pollution.html",
    "summary": "Firework displays can harm animals and create bursts of pollution with lingering effects, but there are ways to mitigate them."
  },
  {
    "title": "Joey Chestnut Returns to Nathan’s Hot Dog Eating Contest",
    "link": "https://www.nytimes.com/2025/07/04/nyregion/joey-chestnut-nathans-hot-dog-contest.html",
    "summary": "Mr. Chestnut, who was barred last year over an endorsement deal with a vegan-meat company, and Miki Sudo easily won their respective contests but did not break records."
  },
  {
    "title": "A Space-Out Competition in Seoul Was Harder Than I Expected",
    "link": "https://www.nytimes.com/2025/07/04/world/asia/space-out-competition-seoul.html",
    "summary": "I spent 90 minutes attempting to empty my mind and slow my heartbeat at a “space out” competition. It was harder — and weirder — than I expected."
  },
  {
    "title": "A Solid Report Card for the Markets, Despite Shock and Worry",
    "link": "https://www.nytimes.com/2025/07/04/business/markets-investment-returns-trump.html",
    "summary": "While the Trump administration has engaged in continual disruptions, most investors have prospered."
  },
  {
    "title": "Madre Fire Grows to 70,800 Acres, Prompting Evacuations in California",
    "link": "https://www.nytimes.com/2025/07/03/us/madre-wildfire-san-luis-obispo-california.html",
    "summary": "The blaze is burning in a rural area of San Luis Obispo County, in the central coast, but its smoke has spread to nearby counties."
  },
  {
    "title": "Heat in Eastern Europe Fuels Fire, Fish Deaths and Tensions Over Protests",
    "link": "https://www.nytimes.com/2025/07/04/world/europe/heat-wave-eastern-europe.html",
    "summary": "Exceptionally high temperatures strained electricity systems as people sought air-conditioning, although many did not have that option."
  },
  {
    "title": "Joseph Giordano, Surgeon Who Helped Save Reagan’s Life, Dies at 84",
    "link": "https://www.nytimes.com/2025/07/04/us/joseph-giordano-dead.html",
    "summary": "He had built one of the country’s leading trauma centers in Washington, which made it possible for his team to respond quickly after the president was shot."
  },
  {
    "title": "Move Over, $100 Lobster Salad. In the Hamptons, These Melons Cost $400.",
    "link": "https://www.nytimes.com/2025/07/04/nyregion/hamptons-grocery-prices.html",
    "summary": "Gourmet grocery stores are upping their game in the Hamptons, serving a welcoming wealthy clientele."
  },
  {
    "title": "Oasis Starts Its World Tour With Cardiff Concert",
    "link": "https://www.nytimes.com/2025/07/04/arts/music/oasis-tour-cardiff-concert.html",
    "summary": "Liam and Noel Gallagher put aside their brotherly rivalry to play the first date of their band’s long-awaited comeback tour in Cardiff, Wales."
  },
  {
    "title": "What Tourists in Martha’s Vineyard Showed Me About Being Indigenous",
    "link": "https://www.nytimes.com/2025/07/04/opinion/wampanoag-marthas-vineyard-native.html",
    "summary": "In my parents’ gift shop, I learned about being Native."
  },
  {
    "title": "Top Hochul Aide Resigns After Being Accused of Sexual Harassment",
    "link": "https://www.nytimes.com/2025/07/04/nyregion/hochul-press-secretary-small-resigns-sexual-harassment.html",
    "summary": "Avi Small, who had served as Gov. Kathy Hochul’s longtime press secretary, was accused of inappropriately touching another male aide."
  },
  {
    "title": "Explaining the Roll Cloud Spotted in Portugal This Week",
    "link": "https://www.nytimes.com/2025/07/03/weather/roll-cloud-portugal-heat-wave.html",
    "summary": "A “roll cloud” spotted off the coast of Portugal looked like something out of a movie. Here’s the science behind it."
  },
  {
    "title": "Fatally Injured Teenager Is Discovered on Top of a N.Y.C. Subway Car",
    "link": "https://www.nytimes.com/2025/07/04/nyregion/subway-car-dead-7-train.html",
    "summary": "A 15-year-old boy could be the latest victim of subway surfing, a dangerous practice of riding on the roofs of train cars that has lured New York City youth for decades."
  },
  {
    "title": "Anna Ornstein, Psychoanalyst Who Survived the Holocaust, Dies at 98",
    "link": "https://www.nytimes.com/2025/07/04/health/anna-ornstein-dead.html",
    "summary": "Despite the unspeakable horror of her youth, she embraced a school of psychotherapy that stresses empathy and the belief that everyone can change for the better."
  }
]