[
  {
    "title": "Elon Musk Wins $1 Trillion Tesla Pay Package",
    "link": "https://www.nytimes.com/2025/11/06/business/elon-musk-tesla-pay-vote.html",
    "summary": "Shareholders approved a plan to grant Mr. Musk shares worth nearly $1 trillion if he meets ambitious goals, including vastly expanding the company’s stock market valuation."
  },
  {
    "title": "Judge Orders Trump Administration to Fully Fund SNAP Benefits This Month",
    "link": "https://www.nytimes.com/2025/11/06/us/politics/snap-food-stamps-shutdown-trump.html",
    "summary": "The Justice Department later said it would appeal, leaving the program known as SNAP in limbo."
  },
  {
    "title": "Here Are Airports That Could Be Affected by the Air Traffic Slowdown",
    "link": "https://www.nytimes.com/2025/11/06/us/politics/airports-list-flight-cuts-government-shutdown.html",
    "summary": "The cuts to flights are expected to begin Friday and deepen over the weekend to reach a 10 percent reduction in air traffic."
  },
  {
    "title": "What Travelers Need to Know About the Shutdown, Flight Reductions and Delays",
    "link": "https://www.nytimes.com/2025/11/06/travel/shutdown-faa-flight-delays-cancellations.html",
    "summary": "As the government shutdown continues, more challenges await passengers as they deal with the newest announcement from the Trump administration: a 10 percent cut in flights at 40 U.S. airports."
  },
  {
    "title": "Supreme Court Clears Way for Trump Transgender Passport Policy",
    "link": "https://www.nytimes.com/2025/11/06/us/politics/supreme-court-transgender-passport.html",
    "summary": "A lower court judge had temporarily blocked the administration’s policy requiring that passports reflect sex as found on an original birth certificate."
  },
  {
    "title": "Trump Team Now Claims Its Trillions in Tariff Revenue Are ‘Incidental’",
    "link": "https://www.nytimes.com/2025/11/06/us/politics/trump-tariffs-revenue-supreme-court.html",
    "summary": "In arguments before the Supreme Court, the White House backed away from its claims that President Trump’s tariffs were about raising revenue."
  },
  {
    "title": "Key Questions From Conservative Justices in the Tariffs Case",
    "link": "https://www.nytimes.com/2025/11/06/us/conservative-justices-tariffs-case.html",
    "summary": "A lively argument spanning almost three hours featured illuminating exchanges that tested the usual commitments of some of the justices on the right side of the court."
  },
  {
    "title": "Justice Dept. Is Said to Be Investigating D.C. Mayor Over Foreign Trip",
    "link": "https://www.nytimes.com/2025/11/06/us/politics/trump-muriel-bowser-qatar-investigation.html",
    "summary": "The investigation into Muriel E. Bowser, which is being handled by the U.S. attorney’s office in Washington, could face significant hurdles because of the known facts of the case and recent turmoil inside the Justice Department."
  },
  {
    "title": "Judy Garland’s ‘Lucky Jacket’ Returns to Carnegie Hall",
    "link": "https://www.nytimes.com/2025/11/06/style/judy-garland-lucky-jacket-carnegie-hall.html",
    "summary": "She wore it at Carnegie Hall on “the greatest evening in show-business history.” Now the jacket that got away is coming home."
  },
  {
    "title": "Challenging Trump, Pelosi Made History",
    "link": "https://www.nytimes.com/2025/11/06/us/politics/trump-pelosi-relationship.html",
    "summary": "The first and only woman to be speaker of the House also was the most powerful and prominent woman in Washington to effectively confront President Trump."
  },
  {
    "title": "Who Will Replace Nancy Pelosi in Congress?",
    "link": "https://www.nytimes.com/2025/11/06/us/nancy-pelosi-retirement-replacement.html",
    "summary": "Two Democrats have already announced their campaigns to replace Representative Nancy Pelosi in her San Francisco district, and others may join the race soon."
  },
  {
    "title": "Republicans Retire Pelosi as a Villain, and Turn to Mamdani",
    "link": "https://www.nytimes.com/2025/11/06/us/politics/nancy-pelosi-zohran-mamdani-republicans.html",
    "summary": "Searching for another liberal boogeyman, Republicans have zeroed in on Zohran Mamdani. Whether their strategy will work in the midterms is less clear."
  },
  {
    "title": "U.S. Sends Attack Aircraft to El Salvador Amid Regional Troop Buildup",
    "link": "https://www.nytimes.com/2025/11/06/world/americas/us-military-planes-el-salvador.html",
    "summary": "A New York Times analysis of satellite imagery and air traffic control communications found that U.S. military planes began operating out of the Central American country in mid-October."
  },
  {
    "title": "Republicans Block Measure to Bar Military Strike on Venezuela",
    "link": "https://www.nytimes.com/2025/11/06/us/politics/republicans-military-strike-venezuela.html",
    "summary": "All but two G.O.P. senators voted against a resolution to stop the president from expanding his military campaign against drug traffickers to include land targets inside Venezuela."
  },
  {
    "title": "Stefanik to Launch Campaign to Challenge Gov. Hochul in New York",
    "link": "https://www.nytimes.com/2025/11/06/nyregion/stefanik-governor.html",
    "summary": "Elise Stefanik, a Republican congresswoman, is a leading ally of President Trump who has gone to great lengths to criticize Ms. Hochul and Mayor-elect Zohran Mamdani."
  },
  {
    "title": "Mamdani Allies Create a Nonprofit to Push His Affordability Agenda",
    "link": "https://www.nytimes.com/2025/11/06/nyregion/mamdani-agenda-nonprofit.html",
    "summary": "A new group will solicit donations to replicate Zohran Mamdani’s grass-roots army of volunteers and to help build momentum for his proposals."
  },
  {
    "title": "Anti-Defamation League Creates ‘Mamdani Monitor’ Tip Line for Antisemitism Reports",
    "link": "https://www.nytimes.com/2025/11/06/nyregion/zohran-mamdani-monitor-antisemitism-adl.html",
    "summary": "The group, which has taken aim at Mayor-elect Zohran Mamdani over his criticism of Israel, is facing backlash after unveiling a website where New Yorkers could report incidents of antisemitism."
  },
  {
    "title": "Trump Officials Accused of Bullying Tactics to Kill a Climate Measure",
    "link": "https://www.nytimes.com/2025/11/06/climate/trump-climate-international-bullying.html",
    "summary": "Nations were poised to approve the first fee on pollution from ships. That’s when the Trump administration began the threats."
  },
  {
    "title": "COP30 Begins With U.S. Allies and Rivals Alike Calling for Action",
    "link": "https://www.nytimes.com/2025/11/06/climate/cop30-speeches-belem-brazil-climate.html",
    "summary": "The calls for action on opening day stood in sharp contrast to the position of the President Trump, who has called global warming a “con job.”"
  },
  {
    "title": "Lula Hitches a Ride to the COP30 Climate Talks in a Chinese E.V.",
    "link": "https://www.nytimes.com/2025/11/06/climate/lula-cop30-byd-electric-vehicle.html",
    "summary": "The climate-friendly ride, part of a fleet assembled to shuttle delegations to the gathering in Brazil, sent a clear signal: China is making inroads in Latin America."
  },
  {
    "title": "Trump Announces Deal to Drop Obesity Drug Prices to as Little as $149 a Month",
    "link": "https://www.nytimes.com/2025/11/06/health/obesity-drug-prices-trump.html",
    "summary": "President Trump announced a deal with Eli Lilly and Novo Nordisk to lower prices on hugely popular weight-loss drugs for Medicare, Medicaid and American patients who pay with their own money."
  },
  {
    "title": "What Trump’s New Drug Pricing Deal Means for People With Obesity",
    "link": "https://www.nytimes.com/2025/11/06/health/trump-obesity-drug-prices-explainer.html",
    "summary": "The president’s agreement with drug companies involves a range of prices, depending on dose, product and how you’re paying."
  },
  {
    "title": "Big Food’s Fight Against Kennedy Is Heating Up",
    "link": "https://www.nytimes.com/2025/11/06/health/rfk-big-food-companies-maha.html",
    "summary": "A new industry group wants to set aside the piecemeal state-by-state approach imposing food dye and labeling laws in favor of federal control. The opposition has roiled the MAHA coalition."
  },
  {
    "title": "Sexual Assault of the President Exposes Mexico’s Endemic Machismo",
    "link": "https://www.nytimes.com/2025/11/06/world/americas/mexico-sheinbaum-women-abuse.html",
    "summary": "President Claudia Sheinbaum was groped on the street this week, in an episode that set off a national conversation about what has and has not changed since Mexico elected its first female leader."
  },
  {
    "title": "Egypt’s Grand Museum Is Finally Open. Now, ‘We Need Our Stuff Back.’",
    "link": "https://www.nytimes.com/2025/11/06/arts/design/grand-egyptian-museum-opening.html",
    "summary": "The museum’s most anticipated exhibit is the full 5,500 items from King Tutankhamen’s tomb. Egyptians say it’s time to experience their most precious antiquities at home."
  },
  {
    "title": "AR-15 Ammunition at a Crime Scene? Good Odds This Army Plant Made It.",
    "link": "https://www.nytimes.com/2025/11/06/us/military-ammunition-crime-lake-city.html",
    "summary": "Popular AR-15 ammunition made at an Army-owned facility was far more likely than any other to turn up in a government database tracking evidence from gun crimes, new data shows."
  },
  {
    "title": "How ‘The Office’ Memes Became the Language of the Internet",
    "link": "https://www.nytimes.com/2025/11/06/arts/television/the-office-memes-internet.html",
    "summary": "Oh my God, OK, it’s happening! From social-media posters to the F.C.C. chair, we are all living in Michael Scott’s world."
  },
  {
    "title": "Nancy Pelosi Retires as a Master of Congress",
    "link": "https://www.nytimes.com/2025/11/06/opinion/nancy-pelosi-american-history.html",
    "summary": "She’ll rightly be lionized as the first woman speaker, but in one sense, that was the most incidental of her myriad accomplishments."
  },
  {
    "title": "Did Liberal Feminism Ruin the Workplace?",
    "link": "https://www.nytimes.com/2025/11/06/opinion/women-workplace-feminism-conservative.html",
    "summary": "And if so, can conservative feminism fix it?"
  },
  {
    "title": "Trump Officials Plan Flight Cuts at Nation’s Busiest Airports",
    "link": "https://www.nytimes.com/2025/11/06/briefing/trump-officials-plan-flight-cuts-at-nations-busiest-airports.html",
    "summary": "Also, Nancy Pelosi is retiring. Here’s the latest at the end of Thursday."
  },
  {
    "title": "Jury Awards $10 Million to Abigail Zwerner, Teacher Shot by 6-Year-Old Student",
    "link": "https://www.nytimes.com/2025/11/06/us/abby-zwerner-virginia-teacher-shooting-lawsuit.html",
    "summary": "The teacher, Abigail Zwerner, was shot in the hand and chest by a first grade student who brought his mother’s gun to class in 2023."
  },
  {
    "title": "Britain Faces Up to Tough Economic Choices. Finally, Economists Say.",
    "link": "https://www.nytimes.com/2025/11/06/business/britain-economy-interest-rates.html",
    "summary": "The central bank held interest rates steady on Thursday, a decision that came at a time when British policymakers and lawmakers are confronting economic challenges."
  },
  {
    "title": "NTSB Sifts Through UPS Louisville Plane Crash Wreckage",
    "link": "https://www.nytimes.com/2025/11/06/us/ups-plane-crash-louisville-wreckage-investigation.html",
    "summary": "The UPS aircraft’s voice and data recorders were recovered and could provide insights into what happened before and during the crash, which killed at least 13 people."
  }
]