[
  {
    "title": "Trump Moves to End Gender-Related Care for Minors, Threatening Hospitals That Offer It",
    "link": "https://www.nytimes.com/2025/12/18/health/trump-gender-affirming-care-funding.html",
    "summary": "Proposed new rules would punish the hospitals by pulling all federal financing.  Advocates say lawsuits will follow."
  },
  {
    "title": "Once Again, Health Care Proves to Be a Bitter Political Pill for G.O.P.",
    "link": "https://www.nytimes.com/2025/12/18/us/politics/health-care-gop.html",
    "summary": "The inability to find a credible counter to the Affordable Care Act has long bedeviled Republicans and cost them at the polls. It’s threatening to do so again next year."
  },
  {
    "title": "Trump Administration Tries to Stop Some Immigrants From Driving Trucks",
    "link": "https://www.nytimes.com/2025/12/18/business/trump-immigrants-trucks.html",
    "summary": "The transportation department said the new rules were intended to make roads safer, but there’s no data to suggest that immigrants cause more truck accidents."
  },
  {
    "title": "U.S. Inflation Slowed to 2.7% in November as Shutdown Distorts Data",
    "link": "https://www.nytimes.com/2025/12/18/business/economy/inflation-cpi-interest-rates.html",
    "summary": "Data collection issues skewed the latest Consumer Price Index report, economists warned, clouding the picture for the Federal Reserve as it also grapples with a cooling labor market."
  },
  {
    "title": "6 Takeaways From Trump’s Address to the Nation",
    "link": "https://www.nytimes.com/2025/12/18/us/politics/trump-address-nation-takeaways.html",
    "summary": "In an 18-minute address, President Trump said the economy was booming despite the public’s consistent concerns about prices. Here are six takeaways from the speech."
  },
  {
    "title": "Fact-Checking Trump’s Prime-Time Address on the Economy",
    "link": "https://www.nytimes.com/2025/12/17/us/politics/fact-check-trump-economy-address.html",
    "summary": "The president cited misleading statistics to insist, wrongly, that prices were coming down."
  },
  {
    "title": "‘Don’s Best Friend’: How Epstein and Trump Bonded Over the Pursuit of Women",
    "link": "https://www.nytimes.com/2025/12/18/us/jeffrey-epstein-donald-trump.html",
    "summary": "The president has tried to minimize their friendship, but documents and interviews reveal an intense and complicated relationship. Chasing women was a game of ego and dominance. Female bodies were currency."
  },
  {
    "title": "Shock and Sadness Hang Over the Reiners’ Neighborhood",
    "link": "https://www.nytimes.com/2025/12/17/us/reiner-brentwood-mourning-scene.html",
    "summary": "Neighbors said a pall had fallen over the wealthy Los Angeles area where Rob Reiner and his wife, Michele, were found stabbed to death."
  },
  {
    "title": "Rob Reiner Family Tragedy Strikes a Nerve for Families Fighting Addiction",
    "link": "https://www.nytimes.com/2025/12/18/us/rob-reiner-family-murder-addiction.html",
    "summary": "Nick Reiner, charged with murdering his parents, Rob and Michele Singer Reiner, spent much of his life battling drug addiction, an affliction that millions of Americans face."
  },
  {
    "title": "The Woman in the Coldplay Concert Kiss Cam Video Is Ready to Talk",
    "link": "https://www.nytimes.com/2025/12/18/style/coldplay-concert-couple-kiss-cam-woman.html",
    "summary": "Kristin Cabot was caught on camera with her boss at a concert. The video went viral. Soon she was drowning in the vitriol of strangers."
  },
  {
    "title": "Trump Media to Merge With TAE Technologies, a Nuclear Fusion Firm, in a $6 Billion Deal",
    "link": "https://www.nytimes.com/2025/12/18/business/trump-media-tae-technologies-fusion-power-deal.html",
    "summary": "Trump Media & Technology Group, the social media and crypto company part owned by President Trump, said it would help develop a “utility-scale fusion power plant.”"
  },
  {
    "title": "The D.N.C. Is Scrapping Its Report on What Went Wrong in 2024",
    "link": "https://www.nytimes.com/2025/12/18/us/politics/dnc-2024-autopsy-democrats-ken-martin.html",
    "summary": "Ken Martin, the Democratic National Committee chairman, ordered the autopsy months ago but is now said to believe that its release would be counterproductive for the party."
  },
  {
    "title": "Pope Leo Appoints Bishop Ronald Hicks to Succeed Timothy Dolan",
    "link": "https://www.nytimes.com/2025/12/18/us/bishop-ronald-hicks-cardinal-timothy-dolan-archbishop-new-york.html",
    "summary": "The appointment of Bishop Ronald A. Hicks is expected to bring a markedly different leadership style to New York’s archdiocese."
  },
  {
    "title": "The Putin Confidant Who Pushed Back Against Russia’s War in Ukraine",
    "link": "https://www.nytimes.com/2025/12/18/world/europe/russia-putin-aide-dmitri-kozak-ukraine-war.html",
    "summary": "Dmitri N. Kozak had worked with President Vladimir V. Putin for three decades before quitting in September. His associates described his break with the Russian leader."
  },
  {
    "title": "Zelensky Appeals to E.U. Leaders for Frozen Russian Funds to Fight War",
    "link": "https://www.nytimes.com/2025/12/18/world/europe/ukraine-zelensky-russia-putin.html",
    "summary": "President Volodymyr Zelensky said in Brussels, where the leaders had gathered, that without the money, his country would have to reduce its drone production significantly."
  },
  {
    "title": "Palo Alto Confronts Billionaires Over Their Housing Compounds",
    "link": "https://www.nytimes.com/2025/12/18/us/palo-alto-billionaire-compound-law.html",
    "summary": "The Silicon Valley college town has changed drastically as Mark Zuckerberg, Larry Page and other tech founders have scooped up multiple properties."
  },
  {
    "title": "Sleep Cots and Graham Crackers at Elon Musk’s Child Care Program",
    "link": "https://www.nytimes.com/2025/12/18/technology/elon-musk-daycare-school.html",
    "summary": "Mr. Musk has ambitions to remake education, but his latest effort to open an elementary school in Texas appears to have faltered."
  },
  {
    "title": "New York City Set to Raise the Cap on Permits for Street Vendors",
    "link": "https://www.nytimes.com/2025/12/18/nyregion/nyc-street-vendor-permits-cap-raised.html",
    "summary": "The legislation, which would make thousands more permits available, is part of a package of City Council bills aimed at helping the city’s vendors get on the right side of the law."
  },
  {
    "title": "They Thought They Had ‘Made It.’ Now They Can’t Afford Food.",
    "link": "https://www.nytimes.com/2025/12/18/nyregion/nyc-food-budgets.html",
    "summary": "New Yorkers in the so-called “missing middle,” who may make too much for food benefits, say it’s still hard to find enough money for groceries."
  },
  {
    "title": "City Council Introduces Bill to Create Mamdani’s Community Safety Agency",
    "link": "https://www.nytimes.com/2025/12/18/nyregion/city-council-community-safety-mamdani.html",
    "summary": "The proposed Department of Community Safety would send mental health teams to respond to 911 calls, rather than the police, according to Mayor-elect Zohran Mamdani’s plans."
  },
  {
    "title": "Mamdani Names Budget Director as He Prepares to Enact Costly Agenda",
    "link": "https://www.nytimes.com/2025/12/18/nyregion/zohran-mamdani-sherif-soliman-omb.html",
    "summary": "Mayor-elect Zohran Mamdani chose Sherif Soliman, a veteran of municipal government and the chief financial officer of the City University of New York, to lead the Office of Management and Budget."
  },
  {
    "title": "Iran’s President Says He Can’t Make ‘Miracles’ to Solve the Country’s Woes",
    "link": "https://www.nytimes.com/2025/12/18/world/middleeast/iran-pezeshkian-domestic-foreign-crises.html",
    "summary": "Despite sky-high inflation, water and energy cuts and prospects for a deal with the U. S. dimming, President Masoud Pezeshkian has apparently thrown up his hands."
  },
  {
    "title": "David Brooks, E.J. Dionne and Robert Siegel Take Stock of 2025",
    "link": "https://www.nytimes.com/2025/12/18/opinion/the-conversation-trump-presidency-anxiety.html",
    "summary": "Trump is giving himself an A-plus-plus-plus, but the rest of America is anxious."
  },
  {
    "title": "Wyoming Cowboys Are Breaking Down Barriers, Literally",
    "link": "https://www.nytimes.com/2025/12/09/climate/wyoming-virtual-fences-livestock.html",
    "summary": "GPS collars on cattle are letting ranchers remove fences in the West. That’s good for wildlife and for the land."
  },
  {
    "title": "French Doctor Sentenced to Life for Fatally Poisoning 12 People",
    "link": "https://www.nytimes.com/2025/12/18/world/europe/france-anesthesiologist-fatal-poisoning.html",
    "summary": "Frédéric Péchier, an anesthesiologist, was found guilty of poisoning 30 patients, of whom 12 died."
  },
  {
    "title": "Is Applying to College Via Early Decision a Good Idea? Here’s What Your Income Has to Do With It.",
    "link": "https://www.nytimes.com/2025/12/18/your-money/early-decision-financial-aid-college-university.html",
    "summary": "Early decision isn’t just for the rich, as long as people with lower incomes can get accurate price quotes before agreeing to attend if they get in."
  },
  {
    "title": "Over 1,000 Were Killed in Attack on Camp in Darfur, Sudan, U.N. Says",
    "link": "https://www.nytimes.com/2025/12/18/world/africa/sudan-rsf-attack-darfur-un.html",
    "summary": "A paramilitary attack in April was one of the most brutal of Sudan’s civil war. Now, hunger is spreading as Western aid cuts have reduced U.N. rations."
  }
]