[
  {
    "title": "China’s Rare Earth Restrictions Aim to Beat U.S. at Its Own Game",
    "link": "https://www.nytimes.com/2025/10/16/business/economy/china-rare-earths-supply-chain.html",
    "summary": "Beijing’s latest effort to weaponize global supply chains is modeled on the American technology controls that it has long criticized."
  },
  {
    "title": "China Fans Patriotic Sentiment as Trade War With U.S. Heats Up",
    "link": "https://www.nytimes.com/2025/10/16/world/asia/china-nationalism-trade-war.html",
    "summary": "Chinese state media is rallying the public and posting old propaganda footage, but officials are also careful to leave room for talks with President Trump."
  },
  {
    "title": "The Small Company in Europe Caught in the Big Trade War Between the U.S. and China",
    "link": "https://www.nytimes.com/2025/10/16/business/nexperia-netherlands-us-china.html",
    "summary": "Nexperia, a computer chip maker headquartered in the Netherlands, was taken over by the Dutch government after pressure from officials in Washington."
  },
  {
    "title": "Who Will Blink First on Trade: President Trump or Xi Jinping?",
    "link": "https://www.nytimes.com/2025/10/16/business/dealbook/trump-china-trade-negotiations.html",
    "summary": "Washington and Beijing both need a trade win as steep new tariffs and tough import limits on critical minerals loom."
  },
  {
    "title": "Trump Authorizes Covert C.I.A. Action, and Hamas Starts Bloody Crackdown",
    "link": "https://www.nytimes.com/2025/10/16/podcasts/the-headlines/trump-cia-action-venezuela-hamas.html",
    "summary": "Plus, where are all the pennies?!"
  },
  {
    "title": "Oval Office Becomes a Diorama of Power Dynamics as Trump Goes After Rivals",
    "link": "https://www.nytimes.com/2025/10/15/us/politics/trump-bondi-patel-blanche-oval-office.html",
    "summary": "Top officials, unwilling to fight for the historical independence of their institutions, watched on Wednesday as President Trump continued his pursuit of controlling law enforcement."
  },
  {
    "title": "Trump Administration Authorizes Covert C.I.A. Action in Venezuela",
    "link": "https://www.nytimes.com/2025/10/15/us/politics/trump-covert-cia-action-venezuela.html",
    "summary": "The development comes as the U.S. military is drawing up options for President Trump to consider, including possible strikes inside the country."
  },
  {
    "title": "Chicagoans Resist I.C.E. Agents",
    "link": "https://www.nytimes.com/2025/10/16/us/chicago-ice-raids-ressit.html",
    "summary": "Immigration agents are using aggressive tactics. Residents of the sanctuary city are trying to resist them."
  },
  {
    "title": "Zohran Mamdani Explains His Rise",
    "link": "https://www.nytimes.com/2025/10/16/podcasts/the-daily/zohran-mamdani-interview.html",
    "summary": "Our interview with the New York mayoral candidate who has burst onto the national stage."
  },
  {
    "title": "Mamdani Is Making Overtures to Jewish Leaders. Some Are Listening.",
    "link": "https://www.nytimes.com/2025/10/16/nyregion/mandani-jews-israel-palestine.html",
    "summary": "Zohran Mamdani is stepping up his Jewish outreach, as he holds private meetings with rabbis and other leaders across New York City who oppose his stance on Israel."
  },
  {
    "title": "On Fox News, Mamdani Speaks Directly to Trump: I Won’t Be a Mayor Like Adams",
    "link": "https://www.nytimes.com/2025/10/15/nyregion/mamdani-fox-interview.html",
    "summary": "Zohran Mamdani, the Democratic nominee for New York City mayor, defended his positions while parrying questions about the Israel-Gaza war."
  },
  {
    "title": "Judge Temporarily Blocks Trump From Firing Government Workers During Shutdown",
    "link": "https://www.nytimes.com/2025/10/15/us/politics/government-shutdown-trump-layoffs-unions.html",
    "summary": "Labor groups are set to square off against the Trump administration one day after the president renewed his threat to cut “Democrat programs.”"
  },
  {
    "title": "Trump Administration Decimates Birth Control Office in Layoffs",
    "link": "https://www.nytimes.com/2025/10/15/us/politics/trump-birth-control-layoffs.html",
    "summary": "The layoffs have raised fears that the administration could be effectively ending an initiative that provides contraception for millions of low-income women."
  },
  {
    "title": "The Lonely House Republican Still Coming to Work During the Shutdown",
    "link": "https://www.nytimes.com/2025/10/15/us/politics/kevin-kiley-shutdown.html",
    "summary": "Representative Kevin Kiley of California has criticized his own party for keeping the House out of session during the shutdown. He is battling boredom and disaffection as the stalemate drags on."
  },
  {
    "title": "Israel Marks Two Years Since Oct. 7 as a Fragile Cease-Fire in Gaza Holds",
    "link": "https://www.nytimes.com/2025/10/16/world/middleeast/israel-october-7-attack-hamas-ceasefire.html",
    "summary": "Ceremonies took place on Thursday to commemorate two years since the surprise attack on southern Israel, according to the Jewish calendar."
  },
  {
    "title": "Hamas Says It Has Returned All Hostage Remains It Can Recover",
    "link": "https://www.nytimes.com/2025/10/15/world/middleeast/hamas-gaza-hostages-remains-israel.html",
    "summary": "The militants said they would need special equipment to retrieve more bodies in Gaza. The announcement could put the truce with Israel at risk."
  },
  {
    "title": "Israel Begins Burying Its Dead Hostages",
    "link": "https://www.nytimes.com/2025/10/15/world/middleeast/israel-hostages-funerals.html",
    "summary": "With the bodies of 10 people returned from Gaza, Israelis elated by the release of hostages began mourning those who did not make it home alive."
  },
  {
    "title": "Sandra Oh Debuts at the Met Opera in ‘La Fille du Régiment’",
    "link": "https://www.nytimes.com/2025/10/16/arts/music/sandra-oh-met-opera.html",
    "summary": "Performing in Donizetti’s “La Fille du Régiment” at the Metropolitan Opera, Oh has already perfected the art of waving a fan with sass."
  },
  {
    "title": "Ten Inmates Escaped From a New Orleans Jail. Derrick Groves Stood Out.",
    "link": "https://www.nytimes.com/2025/10/16/us/new-orleans-prison-escape.html",
    "summary": "In May, 10 inmates escaped from a jail in New Orleans, highlighting the facility’s chronic problems. Derrick Groves was at large for months."
  },
  {
    "title": "Solution to CIA’s Kryptos Sculpture Is Found in Smithsonian Vault",
    "link": "https://www.nytimes.com/2025/10/16/science/kryptos-cia-solution-sanborn-auction.html",
    "summary": "Jim Sanborn planned to auction off the solution to Kryptos, the puzzle he sculpted for the intelligence agency’s headquarters. Two fans of the work then discovered the solution."
  },
  {
    "title": "High-End Amenities in Office Buildings? These N.Y. Tenants Say No Thanks.",
    "link": "https://www.nytimes.com/2025/10/16/business/office-amenities-class-b-buildings.html",
    "summary": "Leasing activity for older buildings, hit hard during the pandemic, is gaining momentum, a strong indicator that the overall office market in Manhattan is on the upswing."
  },
  {
    "title": "Francesca Albanese Documents the Worst Crime Humanity Can Inflict. She’s an Optimist.",
    "link": "https://www.nytimes.com/2025/10/16/opinion/palestinians-united-nations-francesca-albanese.html",
    "summary": "Francesca Albanese’s provocative allegations have made her a villain to some and a hero to others."
  },
  {
    "title": "Amy Coney Barrett Is Looking Beyond the Trump Era",
    "link": "https://www.nytimes.com/2025/10/16/opinion/amy-coney-barrett-interesting-times-podcast.html",
    "summary": "The Supreme Court justice isn’t making decisions based on public opinion."
  },
  {
    "title": "U.S. Enters 15th Day of Late-Night Jokes About Government Shutdown",
    "link": "https://www.nytimes.com/2025/10/16/arts/television/jimmy-kimmel-government-shutdown.html",
    "summary": "Jimmy Kimmel told his viewers that in 2018, “Trump shut the government down until they brought back the McRib or something.”"
  },
  {
    "title": "France’s Government Narrowly Survives No-Confidence Vote",
    "link": "https://www.nytimes.com/2025/10/16/world/europe/france-lecornu-no-confidence-vote.html",
    "summary": "The result gives Sébastien Lecornu, France’s prime minister, a reprieve after weeks of political turmoil. But he still has to get a budget passed by the end of the year."
  },
  {
    "title": "Denmark’s Renewable Energy Prospects Dim Under the Trump Administration",
    "link": "https://www.nytimes.com/2025/10/16/business/denmark-orsted-wind-farms-trump.html",
    "summary": "Orsted, a Danish wind farm developer, has been hammered by high costs and President Trump’s efforts to stymie renewable energy. Its struggles are rippling across Denmark."
  },
  {
    "title": "N.Y.P.D. to Notify Parents When Minors Are Entered Into Gang Database",
    "link": "https://www.nytimes.com/2025/10/16/nyregion/nypd-gang-database.html",
    "summary": "The change was one several the department agreed to make to a tool that has been criticized by the City Council and Zohran Mamdani, the Democratic mayoral nominee."
  }
]