[
  {
    "title": "Comey’s Lawyers Head to Court to Argue Vindictive Prosecution by Trump",
    "link": "https://www.nytimes.com/2025/11/19/us/politics/comey-vindictive-prosecution-trump.html",
    "summary": "James B. Comey’s lawyers are expected to argue that the Justice Department effectively allowed itself to be taken captive by the president’s desire for political revenge."
  },
  {
    "title": "Larry Summers Resigns From OpenAI’s Board",
    "link": "https://www.nytimes.com/2025/11/19/technology/larry-summers-resigns-from-openais-board.html",
    "summary": "Mr. Summers’ departure from the artificial intelligence company’s board followed revelations of his communications with the disgraced financier Jeffrey Epstein."
  },
  {
    "title": "Trump’s Tariffs Sent Trade Plummeting in August",
    "link": "https://www.nytimes.com/2025/11/19/us/politics/trumps-tariffs-trade-data.html",
    "summary": "The steep tariffs President Trump issued in August led to a contraction in imports and the trade deficit, newly released data shows."
  },
  {
    "title": "How Trump and Nvidia’s C.E.O. Became Partners on the International Stage",
    "link": "https://www.nytimes.com/2025/11/19/technology/trump-nvidia-jensen-huang.html",
    "summary": "Over the last 10 months, President Trump has become close with Jensen Huang, Nvidia’s chief executive, as the company’s chips have become a tool in trade and peace talks."
  },
  {
    "title": "Nvidia and Walmart Could Ease Wall St.’s Jitters. Or Make Them Worse.",
    "link": "https://www.nytimes.com/2025/11/19/business/stock-market-nvidia-walmart-earnings.html",
    "summary": "After four consecutive down days, the stock market is looking increasingly queasy. Earnings reports from Nvidia, Walmart and Target could hint at what’s ahead."
  },
  {
    "title": "Netherlands Hands Back Control of Chinese-Owned Chipmaker Nexperia",
    "link": "https://www.nytimes.com/2025/11/19/business/nexperia-netherlands-china-chips.html",
    "summary": "Uncertainty over the availability of the company’s chips, which are used in cars and electronics, had added to concerns of a global shortage."
  },
  {
    "title": "Trump Lauds M.B.S. During White House Visit and Dismisses Khashoggi’s Killing",
    "link": "https://www.nytimes.com/2025/11/18/us/politics/trump-saudi-crown-prince-visit.html",
    "summary": "President Trump rejected a U.S. intelligence report finding that Crown Prince Mohammed bin Salman had ordered the murder of a journalist."
  },
  {
    "title": "Saudi Arabia Backs Elon Musk’s xAI With Data Center Deal",
    "link": "https://www.nytimes.com/2025/11/19/technology/saudi-arabia-elon-musk-xai.html",
    "summary": "Mr. Musk’s xAI will work with the Saudi artificial intelligence company Humain on a new data center, part of Crown Prince Mohammed bin Salman’s effort to diversify his country’s economy."
  },
  {
    "title": "Trump Berates Mary Bruce of ABC News After Question About Jamal Khashoggi",
    "link": "https://www.nytimes.com/2025/11/18/business/media/trump-reporter-khashoggi-saudis.html",
    "summary": "The president grew frustrated with Mary Bruce of ABC News over her questions during his meeting with the Saudi crown prince. On Friday, he told a Bloomberg News reporter, “Quiet, piggy.”"
  },
  {
    "title": "Melania Trump’s Green Gown Signals Saudi Arabia Diplomatic Ties",
    "link": "https://www.nytimes.com/2025/11/19/style/melania-trump-mohammed-bin-salman-dinner.html",
    "summary": "At the official dinner for Crown Prince Mohammed bin Salman, the first lady offered an unexpected sign of allegiance."
  },
  {
    "title": "Orthodox Church Pews Are Overflowing With Converts",
    "link": "https://www.nytimes.com/2025/11/19/us/orthodox-christianity.html",
    "summary": "“In the whole history of the Orthodox Church in America, this has never been seen,” a priest said about the surge of young men drawn to the demanding practice of Christianity."
  },
  {
    "title": "How Two New York Times Reporters Cover Christianity in Trump’s Polarized America",
    "link": "https://www.nytimes.com/2025/11/19/us/trump-politics-religion-christianity.html",
    "summary": "We asked our journalists who write about religion nationwide about how they navigate debates about what Christianity is and isn’t."
  },
  {
    "title": "Thanksgiving Pies So Good, You’ll Want to Skip Dinner",
    "link": "https://cooking.nytimes.com/article/pies-thanksgiving-desserts",
    "summary": "Go straight to the good stuff this Thanksgiving: apple and cream, chocolate espresso, honeyed cranberry and more."
  },
  {
    "title": "Don’t Tread on Frank: How One Man’s Yard Became a Battlefield",
    "link": "https://www.nytimes.com/2025/11/19/us/politics/hoa-politics.html",
    "summary": "The clash is about strong personalities, an exacting homeowners’ association and a partisan divide that has reached the hyperlocal level."
  },
  {
    "title": "Anxiety Over Trump’s Crackdown Alters Life for Many Immigrants, Poll Finds",
    "link": "https://www.nytimes.com/2025/11/19/us/immigration-poll-trump-crackdown.html",
    "summary": "Months into the Trump deportation campaign, one-third of noncitizens, including about 60 percent of undocumented immigrants, say they are avoiding aspects of daily life."
  },
  {
    "title": "Most Immigrants Support Border Enforcement, but Not Mass Deportations, Poll Finds",
    "link": "https://www.nytimes.com/2025/11/19/us/immigrants-poll-enforcement.html",
    "summary": "A survey by The New York Times and KFF shows that even many of those who support President Trump feel his approach has gone too far."
  },
  {
    "title": "What Polls Say About Americans’ Views on Immigrants and Immigration",
    "link": "https://www.nytimes.com/2025/11/19/polls/how-americans-feel-immigration.html",
    "summary": "A review of polls of the general public shows how opinions on immigration vary widely based on the details included in poll questions."
  },
  {
    "title": "Russian Missile Kills at Least 25 in Ukrainian Apartment Building",
    "link": "https://www.nytimes.com/2025/11/19/world/europe/ukraine-russia-strikes-peace-talks.html",
    "summary": "The attack was part of a wave of strikes across the country as President Volodymyr Zelensky seeks to revive stalled peace talks."
  },
  {
    "title": "Zelensky Under Siege as Corruption Case Shatters Ukraine’s Wartime Unity",
    "link": "https://www.nytimes.com/2025/11/19/world/europe/ukraine-zelensky-corruption.html",
    "summary": "An anti-Zelensky political coalition is coalescing as the president’s allies are accused of enriching themselves while the country’s soldiers die on the battlefield."
  },
  {
    "title": "What to Know About the Corruption Scandal Roiling Ukraine",
    "link": "https://www.nytimes.com/2025/11/19/world/europe/ukraine-corruption-scandal-zelensky.html",
    "summary": "An investigation into the state-owned nuclear power company has reached members of President Volodymyr Zelensky’s inner circle."
  },
  {
    "title": "For Victims of Sexual Assault on Cruise Ships, Justice Can Be Elusive",
    "link": "https://www.nytimes.com/2025/11/19/travel/cruise-lines-sexual-assault.html",
    "summary": "As cruise travel hits record demand, cases of sexual assault have also risen. Many accusers learn that the rights they had on land don’t always apply."
  },
  {
    "title": "Jessica Tisch Will Remain Police Commissioner Under Mamdani",
    "link": "https://www.nytimes.com/2025/11/19/nyregion/jessica-tisch-nypd-commissioner-mamdani.html",
    "summary": "Commissioner Tisch, the current head of the N.Y.P.D., said she had agreed to serve in Mayor-elect Zohran Mamdani’s administration."
  },
  {
    "title": "As Mamdani Tries to Woo the N.Y.P.D., He Is Met With Skepticism and Hope",
    "link": "https://www.nytimes.com/2025/11/16/nyregion/nypd-mamdani-expectations.html",
    "summary": "Zohran Mamdani takes office on Jan. 1 with ambitious plans to rethink policing and some officers angry about his past criticisms. Winning them over could be a key to a successful term."
  },
  {
    "title": "New Gene-Editing Strategy Could Help Development of Treatments for Rare Diseases",
    "link": "https://www.nytimes.com/2025/11/19/health/gene-editing-rare-diseases.html",
    "summary": "Instead of requiring personalized gene edits for each patient, the new approach could create a standardized method to use for many diseases."
  },
  {
    "title": "In Washington, Birds Are Giving ‘Yelp Reviews’ of Forest Restoration Work",
    "link": "https://www.nytimes.com/2025/11/18/climate/washington-birds-habitat-health.html",
    "summary": "A collective of land trusts, conservancies and tribes is capturing birdsong with audio gear and A.I. for clues about habitat health."
  },
  {
    "title": "Body Slams, Curated: Pro Wrestling Enters Its Museum Era",
    "link": "https://www.nytimes.com/2025/11/18/arts/design/professional-wrestling-art-drag.html",
    "summary": "The over-the-top spectacle has been slicing into the art world, with gallery shows, performances and a forthcoming major exhibition."
  },
  {
    "title": "Jeffrey Epstein’s Victims Are the Real Story",
    "link": "https://www.nytimes.com/2025/11/19/opinion/epstein-files-victims.html",
    "summary": "Women’s pain is not entertainment."
  },
  {
    "title": "Patreon’s C.E.O.: My Vision for a Better Internet",
    "link": "https://www.nytimes.com/2025/11/19/opinion/patreon-algorithms-social-media-internet.html",
    "summary": "The internet should enrich people, not advertisers."
  },
  {
    "title": "How Are Immigrants Feeling?",
    "link": "https://www.nytimes.com/2025/11/19/briefing/how-are-immigrants-feeling.html",
    "summary": "We explain the latest insights from a poll on their attitudes about the country."
  },
  {
    "title": "Stephen Colbert Celebrates ‘Epstein Rockin’ Eve’",
    "link": "https://www.nytimes.com/2025/11/19/arts/television/late-night-trump-epstein-files.html",
    "summary": "“Stay up for a ball drop you’re going to want to miss,” the “Late Show” host said as Congress voted for the release of the Jeffrey Epstein files."
  },
  {
    "title": "The Key to Fighting Lung Cancer Is More Screenings, New Study Shows",
    "link": "https://www.nytimes.com/2025/11/19/well/lung-cancer-screening-study.html",
    "summary": "A new report says too few eligible Americans are being checked for the country’s deadliest cancer before it spreads."
  },
  {
    "title": "Who’s Running to Replace Jerry Nadler? 10 People and Counting.",
    "link": "https://www.nytimes.com/2025/11/19/nyregion/nadler-candidates-who-running.html",
    "summary": "Mr. Nadler’s coveted House seat in Manhattan will be up for grabs next year in a district that is the wealthiest in New York."
  },
  {
    "title": "Tom Steyer Will Run for California Governor in 2026 Race",
    "link": "https://www.nytimes.com/2025/11/19/us/tom-steyer-california-governor-2026.html",
    "summary": "Tom Steyer, who ran for president in 2020 and funded an effort to impeach President Trump, will join the crowded field trying to succeed Gov. Gavin Newsom."
  },
  {
    "title": "At This College, the English Dept. Is Out. ‘Human Narratives’ Is In.",
    "link": "https://www.nytimes.com/2025/11/19/nyregion/montclair-state-restructuring.html",
    "summary": "At Montclair State University in New Jersey, a departmental restructuring plan is igniting concerns about the future of the humanities."
  }
]