[
  {
    "title": "Many Cities Say Yes to Federal Police Help, but No to ‘Occupation’",
    "link": "https://www.nytimes.com/2025/09/06/us/federal-law-enforcement-national-guard-policing.html",
    "summary": "Some mayors and police chiefs said they would welcome more traditional law enforcement cooperation with federal agents, but see the National Guard as a step too far."
  },
  {
    "title": "Grand Juries in D.C. Reject Wave of Charges Under Trump’s Crackdown",
    "link": "https://www.nytimes.com/2025/09/06/us/trump-dc-national-guard-grand-juries-crime.html",
    "summary": "The persistent rejections suggest that the grand jurors may have had enough of prosecutors seeking harsh charges in a highly politicized environment."
  },
  {
    "title": "Chicago Braces for Trump’s Immigration Crackdown",
    "link": "https://www.nytimes.com/2025/09/05/us/trump-immigration-chicago.html",
    "summary": "Protesters held demonstrations and city leaders spoke against the prospect of a surge of federal agents."
  },
  {
    "title": "How Trump’s Blunt-Force Diplomacy Is Pushing His Rivals Together",
    "link": "https://www.nytimes.com/2025/09/05/us/politics/trump-diplomacy-rivals.html",
    "summary": "Some of President Trump’s pressure tactics appear to have backfired, sending would-be allies into the embrace of China."
  },
  {
    "title": "Trump Says U.S. Military Has ‘Never Fought to Win’ Since World War II",
    "link": "https://www.nytimes.com/2025/09/05/us/politics/trump-military-wars.html",
    "summary": "As he signed an order recognizing the Defense Department as the “Department of War,” President Trump said that the country “could have won every war, but we really chose to be very politically correct.”"
  },
  {
    "title": "A Second Weak Jobs Report Challenges Trump’s Claim the Economy Is Booming",
    "link": "https://www.nytimes.com/2025/09/05/us/politics/trump-jobs-report-tariffs-deportations.html",
    "summary": "After a bad employment report in August, President Trump fired the official in charge of the numbers. This month’s data was just as disappointing."
  },
  {
    "title": "Settlement Talks Stall Between Harvard and the Trump Administration",
    "link": "https://www.nytimes.com/2025/09/06/us/politics/harvard-trump-negotiations-stall.html",
    "summary": "One major reason is said to be an emerging divide within the administration over whether the current framework is too favorable to Harvard."
  },
  {
    "title": "George Mason’s president, Gregory Washington, Will Not Apologize to the Trump Administration",
    "link": "https://www.nytimes.com/2025/09/06/us/george-mason-university-gregory-washington-trump-attack.html",
    "summary": "Gregory Washington, George Mason’s first Black president, runs a university that prizes diversity. That has made him a target of the Trump administration."
  },
  {
    "title": "Thrust Into the Line of Fire, Iranians Worry About What Comes Next",
    "link": "https://www.nytimes.com/2025/09/06/world/africa/thrust-into-the-line-of-fire-iranians-worry-about-what-comes-next.html",
    "summary": "A 12-day war in June upended the shadow war rivalry between Israel and Iran. Some Iranians want to strike back, others want to move on."
  },
  {
    "title": "Inside Iran After the 12-Day War",
    "link": "https://www.nytimes.com/video/world/middleeast/100000010381500/behind-the-reporting-iran-reporter-israel-war.html",
    "summary": "Following a 12-day war with Israel in July, which resulted in the deaths of over 1,000 civilians and many of Iran’s top nuclear scientists and officials, a New York Times team was granted access to Tehran. Declan Walsh, a Times international correspondent, explains how the conflict has created a widespread sense of uncertainty and flux in the Iranian capital."
  },
  {
    "title": "Israel Targets More Buildings in Gaza City and Warns Residents to Flee",
    "link": "https://www.nytimes.com/2025/09/06/world/middleeast/israel-gaza-humanitarian.html",
    "summary": "The Israeli military issued evacuation orders for residents in the high-rise towers and urged Palestinians to move to the south of Gaza, as it intensifies its offensive on the city."
  },
  {
    "title": "The Girls Are Screaming",
    "link": "https://www.nytimes.com/2025/09/06/arts/music/girls-scream-john-proctor-olivia-rodrigo-addison-rae.html",
    "summary": "A shriekathon in “John Proctor Is the Villain” is the latest in a wave of young women letting their pipes loose — and exhorting anyone to join in."
  },
  {
    "title": "Immigration Raid on Hyundai-LG Plant in Georgia Rattles South Korea",
    "link": "https://www.nytimes.com/2025/09/06/world/asia/immigration-raid-hyundai-lg-south-korea-georgia.html",
    "summary": "The shocked but subdued reaction to the arrest of hundreds of Koreans at the site reflected the delicate position of a government engaged in tense trade talks with the Trump administration."
  },
  {
    "title": "Would Anyone Use a Chinese Stablecoin?",
    "link": "https://www.nytimes.com/2025/09/06/business/china-stablecoin-trump.html",
    "summary": "A new law in Hong Kong could pave the way for digital currencies tied to China."
  },
  {
    "title": "How a Top Secret SEAL Team 6 Mission Into North Korea Fell Apart",
    "link": "https://www.nytimes.com/2025/09/05/us/navy-seal-north-korea-trump-2019.html",
    "summary": "The 2019 operation, greenlit by President Trump, sought a strategic edge. It left unarmed North Koreans dead."
  },
  {
    "title": "Food Delivery Drivers Feel Strain of Italy’s Ban on Outdoor Work on Hottest Days",
    "link": "https://www.nytimes.com/2025/09/06/world/europe/italy-food-delivery-drivers-heat-rules.html",
    "summary": "Delivery riders are already some of the most vulnerable workers of booming gig economies. During successive heat waves this summer in Italy, it got complicated."
  },
  {
    "title": "‘They Keep Us Rolling’: Wheelchair Tennis at the U.S. Open Has a Pit Crew",
    "link": "https://www.nytimes.com/2025/09/06/nyregion/us-open-wheelchair.html",
    "summary": "A trio of technicians must rush to the aid of players whose wheelchairs break during the tournament. They have just 15 minutes."
  },
  {
    "title": "Adams Insists He’s Running for Mayor Despite Saudi Ambassadorship Talks",
    "link": "https://www.nytimes.com/2025/09/05/nyregion/eric-adams-saudi-arabia-ambassador.html",
    "summary": "The discussions were said to be part of an effort to consolidate opposition to Zohran Mamdani’s campaign for mayor, but appeared to be fading on Friday."
  },
  {
    "title": "A Mayor in Disrepute Saved by an Ambassadorship. The Year Was 1950.",
    "link": "https://www.nytimes.com/2025/09/06/nyregion/odwyer-ambassador-truman-mayor.html",
    "summary": "Eric Adams would not be the first to leave Gracie Mansion for an embassy. William O’Dwyer did it decades ago."
  },
  {
    "title": "How Giorgio Armani Conquered Hollywood",
    "link": "https://www.nytimes.com/2025/09/05/fashion/giorgio-armani-hollywood-wanda-mcdaniel.html",
    "summary": "Armani amassed a cavalcade of celebrity spokespeople. Many came through a former journalist named Wanda McDaniel."
  },
  {
    "title": "Men + Women + Apps = Bad Romance",
    "link": "https://www.nytimes.com/2025/09/06/opinion/men-women-apps-bad-romance.html",
    "summary": "The two sexes are looking past each other."
  },
  {
    "title": "‘Democrats Should Let the Government Shut Down’",
    "link": "https://www.nytimes.com/2025/09/06/opinion/democrats-shutdown-congress-trump.html",
    "summary": "On this week’s round table, three Opinion writers discuss how to fight Trump’s takeover."
  },
  {
    "title": "Offer Accepted",
    "link": "https://www.nytimes.com/2025/09/06/briefing/offer-accepted.html",
    "summary": "We spend a lot of time thinking of reasons we shouldn’t do things. What if we decided to default to yes?"
  },
  {
    "title": "Keir Starmer’s Miserable Moment in the U.K. Has Nigel Farage Gloating",
    "link": "https://www.nytimes.com/2025/09/06/world/europe/uk-starmer-farage.html",
    "summary": "The resignation on Friday of Angela Rayner, Britain’s deputy prime minister, was the latest setback for Prime Minister Keir Starmer as he battles the rise of the right-wing populist Nigel Farage."
  },
  {
    "title": "When It Comes to Spotting Fake Receipts, It’s A.I. vs. A.I.",
    "link": "https://www.nytimes.com/2025/09/06/business/dealbook/ai-receipts-expense-reports.html",
    "summary": "Software companies that audit expense reports are adding a new arsenal of capabilities to try to detect receipts that have been created using A.I. chatbots."
  },
  {
    "title": "Karina Milei, Argentina’s Mysterious First Sister, Captivates Nation After Audio Leaks",
    "link": "https://www.nytimes.com/2025/09/06/world/americas/javier-milei-karina-argentina-leaked-audio.html",
    "summary": "Karina Milei has become a lightning rod for corruption accusations even as her power and the loyalty of her brother, President Javier Milei, remain unwavering."
  }
]