[
  {
    "title": "How Can the Government ‘Take Back’ a City It Largely Controls?",
    "link": "https://www.nytimes.com/2025/08/14/upshot/washington-dc-home-rule.html",
    "summary": "President Trump and his allies have berated Washington, D.C., officials. Yet the federal government has often made it harder for those officials to manage the capital."
  },
  {
    "title": "Troops in Washington Remain Largely Unseen So Far",
    "link": "https://www.nytimes.com/2025/08/14/us/troops-washington-trump.html",
    "summary": "Federal agents are assisting the local police, but a surge in National Guard troops hasn’t hit the streets."
  },
  {
    "title": "D.C. Police Move to Share Limited Information With Federal Immigration Officials",
    "link": "https://www.nytimes.com/2025/08/14/us/politics/dc-police-federal-immigration-enforcement.html",
    "summary": "Chief Pamela A. Smith’s order effectively serves as a carve-out to how the department enforces a broader ban that prohibits the local police from cooperating with federal immigration enforcement."
  },
  {
    "title": "Russia Seeks to Add Trade and Arms Control Into Trump-Putin Talks",
    "link": "https://www.nytimes.com/2025/08/14/world/europe/trump-putin-talks-russia-trade-arms-control.html",
    "summary": "Over recent months, the Kremlin has been trying to move the diplomatic focus away from Ukraine to bilateral issues, such as trade and strategic stability."
  },
  {
    "title": "Why Does Trump Want to Meet With Putin, and What Are the Risks?",
    "link": "https://www.nytimes.com/2025/08/13/us/politics/trump-putin-alaska-meeting-stakes.html",
    "summary": "President Trump wants to be seen as a peacemaker, but the meeting comes with enormous stakes."
  },
  {
    "title": "The Auctioneer and the Treasury Chief: Billy Long’s Quick Fall at the I.R.S.",
    "link": "https://www.nytimes.com/2025/08/14/us/politics/billy-long-scott-bessent-irs-treasury.html",
    "summary": "Treasury Secretary Scott Bessent sought total control over the I.R.S., an agency where Mr. Long, the new commissioner, had started to put his own mark on the job."
  },
  {
    "title": "Trump’s Tariffs Set to Hit Ireland, Where Drugmakers Play Tax Games",
    "link": "https://www.nytimes.com/2025/08/14/health/pharma-tariffs-ireland-taxes.html",
    "summary": "Manufacturing in Ireland has long helped many American drug companies pay lower taxes. But that strategy was designed for a world without President Trump’s tariffs."
  },
  {
    "title": "There’s Money to Be Made From ‘MAHA.’ Food Companies Want In.",
    "link": "https://www.nytimes.com/2025/08/14/dining/maha-health-food-marketing.html",
    "summary": "Processed-food giants and produce growers are tweaking products and ads to reach the Make America Healthy Again movement. But the strategy carries risks."
  },
  {
    "title": "Fact-Checking Trump’s Epstein Defenses",
    "link": "https://www.nytimes.com/2025/08/14/us/politics/fact-check-trump-epstein.html",
    "summary": "In the face of mounting discontent over his administration’s handling of the Jeffrey Epstein files, President Trump has turned to deflection, denial and downplaying."
  },
  {
    "title": "A Timeline of What We Know About Trump and Epstein",
    "link": "https://www.nytimes.com/2025/07/17/us/politics/timeline-trump-epstein.html",
    "summary": "Donald Trump was friendly for at least 15 years with Jeffrey Epstein, the multimillionaire financier and convicted sex offender who died in jail in 2019."
  },
  {
    "title": "He Was Lost. Could a Shooting Range Like Thunder Ranch Help Him Find Himself?",
    "link": "https://www.nytimes.com/2025/08/14/us/men-shooting-range-thunder-ranch-guns.html",
    "summary": "Thunder Ranch is one of the best-known shooting schools in American gun culture, offering firearms as a way to change your life when all else fails."
  },
  {
    "title": "Does Earning $142,000 in New York City Make You Rich?",
    "link": "https://www.nytimes.com/2025/08/14/nyregion/who-is-rich-new-york-city.html",
    "summary": "Andrew Cuomo is basing his new line of attack against Zohran Mamdani on a certain definition of wealth. But the reality is complicated."
  },
  {
    "title": "Plan to Add 9,500 Homes to Midtown Expected to Get City Council Approval",
    "link": "https://www.nytimes.com/2025/08/14/nyregion/midtown-manhattan-residential-development.html",
    "summary": "The plan would open a swath of Manhattan, including the garment district, to residential development."
  },
  {
    "title": "Israeli Settlers Unleash Record High Attacks in West Bank",
    "link": "https://www.nytimes.com/2025/08/14/world/middleeast/west-bank-israel-settler-attacks.html",
    "summary": "Extremists are carrying out one of the most violent campaigns against Palestinian villages since the U.N. began keeping records."
  },
  {
    "title": "Israel Says More Aid Is Entering Gaza, but Relief Groups Warn of Bottlenecking",
    "link": "https://www.nytimes.com/2025/08/14/world/middleeast/israel-aid-gaza-issues.html",
    "summary": "Israel says its has allowed more aid into Gaza in recent days, and food prices are dropping, but humanitarian groups warn it is not enough."
  },
  {
    "title": "What It Takes to Find Food in Gaza",
    "link": "https://www.nytimes.com/video/world/middleeast/100000010322362/what-it-takes-to-find-food-in-gaza.html",
    "summary": "Starvation has spread in Gaza, as the prices of basic goods have skyrocketed and getting aid is difficult and often deadly. Ashley Wu, a graphics reporter for The New York Times, explains the dire choices that many Gazans face, as Israel faces growing condemnation over the crisis."
  },
  {
    "title": "Toronto Film Festival Cancels Screenings of Israeli Documentary About Oct. 7 Attack",
    "link": "https://www.nytimes.com/2025/08/14/world/canada/tiff-israel-oct-7-documentary-canceled.html",
    "summary": "The event’s organizers said the producers of the film, which includes footage of atrocities recorded by Hamas fighters during the attack, had failed to obtain the rights to the videos."
  },
  {
    "title": "Syria Violence in March Amounts to War Crimes, U.N. Report Says",
    "link": "https://www.nytimes.com/2025/08/14/world/middleeast/syria-violence-war-crimes-un-report.html",
    "summary": "An inquiry found that members of the new government’s forces took part in killing Syrian civilians during sectarian fighting in March, but found no evidence that they acted on government orders."
  },
  {
    "title": "Big Tech’s A.I. Data Centers Are Driving Up Electricity Bills for Everyone",
    "link": "https://www.nytimes.com/2025/08/14/business/energy-environment/ai-data-centers-electricity-costs.html",
    "summary": "Electricity rates for individuals and small businesses could rise sharply as Amazon, Google, Microsoft and other technology companies build data centers and expand into the energy business."
  },
  {
    "title": "Taylor Swift Found a New Way to Control Her Narrative: Podcasts",
    "link": "https://www.nytimes.com/2025/08/14/business/media/taylor-swift-podcast-celebrity-interviews.html",
    "summary": "For stars promoting their projects, podcasts have become an appealing alternative to late-night TV and glossy magazines."
  },
  {
    "title": "Taylor Swift and Drake Promote Albums on Podcasts in Media Landscape Shift",
    "link": "https://www.nytimes.com/2025/08/14/arts/music/celebrity-podcasts-taylor-swift-drake.html",
    "summary": "The two megastars recently sat for hourslong video conversations on streaming platforms, but took different approaches to what they revealed."
  },
  {
    "title": "For Some Patients, the ‘Inner Voice’ May Soon Be Audible",
    "link": "https://www.nytimes.com/2025/08/14/science/brain-neuroscience-computers-speech.html",
    "summary": "In a recent study, scientists successfully decoded not only the words people tried to say but the words they merely imagined saying."
  },
  {
    "title": "Revisiting Carrie Bradshaw’s Apartments in ‘Sex and the City’ and ‘And Just Like That’",
    "link": "https://www.nytimes.com/2025/08/14/realestate/carrie-bradshaw-apartments-sex-and-the-city.html",
    "summary": "The end of “And Just Like That …” means the end of a real estate portfolio that includes a cozy Upper East Side studio and a grand Gramercy townhouse."
  },
  {
    "title": "Crime Keeps Falling. Here’s Why.",
    "link": "https://www.nytimes.com/2025/08/14/opinion/crime-statistics-washington-dc.html",
    "summary": "Reflections on social cohesion and law enforcement can help policymakers reduce crime even further."
  },
  {
    "title": "Abolish the Senate. End the Electoral College. Pack the Court.",
    "link": "https://www.nytimes.com/2025/08/14/opinion/trump-democracy-test-left.html",
    "summary": "Why the left can’t win without a new Constitution."
  },
  {
    "title": "How Cryptocurrency Could Be Coming for Your Bank Account",
    "link": "https://www.nytimes.com/2025/08/14/briefing/how-cryptocurrency-could-be-coming-for-your-bank-account.html",
    "summary": "We explain the benefits and the risks."
  },
  {
    "title": "Judge Orders Liquidation of Infowars to Pay Sandy Hook Families",
    "link": "https://www.nytimes.com/2025/08/14/us/infowars-sale-alex-jones-sandy-hook.html",
    "summary": "The order comes after a series of legal setbacks for the families of Sandy Hook victims as they tried to collect money owed to them by the conspiracy theorist Alex Jones."
  },
  {
    "title": "A Solution to the C.I.A.’s ‘Kryptos’ Sculpture Goes Up for Auction",
    "link": "https://www.nytimes.com/2025/08/14/science/kryptos-sculpture-cia-solution-auction.html",
    "summary": "Sleuths have solved three of the panels of the Kryptos sculpture at the agency’s headquarters. Now the artwork’s creator is announcing the sale of the solution to the fourth."
  },
  {
    "title": "Man Who Faked His Death and Fled to Scotland Is Convicted of Rape",
    "link": "https://www.nytimes.com/2025/08/14/us/nicholas-rossi-rape-trial-utah.html",
    "summary": "Nicholas Rossi lived for years as a fugitive before being extradited. A jury in Utah found him guilty of a 2008 sexual assault."
  },
  {
    "title": "Echoes of Old Walls Appear, Briefly, in Britain’s Arid Soil",
    "link": "https://www.nytimes.com/2025/08/14/world/europe/britain-archaeology-parchmarks-dry.html",
    "summary": "Unusually dry conditions are revealing the outlines of old walls at British historical sites. Climate change is making the lines, called “parchmarks,” more frequently visible."
  }
]