[
  {
    "title": "For Trump, Nothing Was Off Limits During the Shutdown",
    "link": "https://www.nytimes.com/2025/11/10/us/politics/trump-government-shutdown.html",
    "summary": "President Trump pressured Democrats by taking punishing actions no previous administration ever took during a shutdown."
  },
  {
    "title": "Senate Passes Bill to Reopen Government Amid Democratic Rift",
    "link": "https://www.nytimes.com/2025/11/10/us/politics/senate-government-shutdown.html",
    "summary": "The vote, on Day 41 of the shutdown, signaled an end in sight to weeks of gridlock. Eight members of the Democratic Caucus supplied the critical backing."
  },
  {
    "title": "Flight Delays and Cancellations Won’t Immediately Stop When Government Shutdown Ends",
    "link": "https://www.nytimes.com/2025/11/11/business/air-travel-government-shutdown-airlines.html",
    "summary": "There is hope the Thanksgiving holiday will be spared, but carriers will need some time to deal with the disruptions that the shutdown has caused for air travel."
  },
  {
    "title": "Bookstore Food Drives Help Food Stamp Recipients",
    "link": "https://www.nytimes.com/2025/11/11/books/bookstores-food-banks-snap-recipients.html",
    "summary": "During the government shutdown, booksellers are collecting food for Americans who receive federal aid to buy groceries."
  },
  {
    "title": "How the Heavy-Metal Fall of a Dictator Shapes Trump’s Venezuela Policy",
    "link": "https://www.nytimes.com/2025/11/11/us/politics/panama-noriega-maduro.html",
    "summary": "Seizing Panama’s leader was relatively easy. But the similarities between Panama and Venezuela are dangerously misleading, some analysts warn."
  },
  {
    "title": "‘It Feels Like I’m in a Nightmare’: Inside the First Deportation Flight to Iran",
    "link": "https://www.nytimes.com/2025/11/11/world/middleeast/iran-trump-deportation-flight.html",
    "summary": "For decades, Iranians fleeing persecution have found protection in the United States. But this fall, the Trump administration deported a planeload of people to Iran after making a deal with Tehran."
  },
  {
    "title": "Halt in Fees on Chinese Vessels Endangers U.S. Shipbuilding Efforts",
    "link": "https://www.nytimes.com/2025/11/11/business/commercial-shipbuilding-us-china.html",
    "summary": "The two countries agreed to suspend the fees for a year as part of their recent trade pact, but America still aims to build more commercial ships."
  },
  {
    "title": "Trump Wants to Revive Shipping. He Will Need More Mariners.",
    "link": "https://www.nytimes.com/2025/11/11/business/merchant-marines-shipbuilding.html",
    "summary": "Few American are becoming mariners today, but demand could soon rise because President Trump and a bipartisan group of legislators in Congress want to revitalize the American shipbuilding industry."
  },
  {
    "title": "Trump’s Tariffs Hit Specialty Grocery Stores for Some Immigrant Communities Especially Hard",
    "link": "https://www.nytimes.com/2025/11/11/business/economy/trump-tariffs-immigrants-grocery-stores.html",
    "summary": "For immigrant communities from countries with especially high duties, food costs have risen sharply courtesy of President Trump."
  },
  {
    "title": "The NYC Demographic Trends That Shaped Mamdani’s Win",
    "link": "https://www.nytimes.com/2025/11/11/us/mamdani-nyc-voters-election-demographics.html",
    "summary": "Moderate Black voters and young progressives favored Zohran Mamdani for mayor, while Andrew Cuomo won many wealthy New Yorkers and those who voted for Donald Trump."
  },
  {
    "title": "Sarah Jessica Parker Describes Her Year as a Booker Prize Judge",
    "link": "https://www.nytimes.com/2025/11/11/books/sarah-jessica-parker-booker-prize.html",
    "summary": "The actor had to read so many books (153) she bowed out of most family activities. Still, she said, collaborating to pick a winner was worth the sacrifice."
  },
  {
    "title": "Accused of Desecration, a Doctor Faces the End of His Life’s Work",
    "link": "https://www.nytimes.com/2025/11/11/nyregion/manhattan-doctor-anointment-extradition-japan.html",
    "summary": "Dr. Masahide Kanayama has devoted his life in Manhattan to medicine and God. He could face five years of hard labor in Japan."
  },
  {
    "title": "Why So Many People Are Turning to Collective Screaming",
    "link": "https://www.nytimes.com/2025/11/11/magazine/collective-screaming-therapy-anxiety-stress.html",
    "summary": "It’s a practice with roots in Greek tragedy, which has a lot to teach us about the power — and limits — of raised voices."
  },
  {
    "title": "The Young Women Grappling With an ‘Old Man’s Disease’",
    "link": "https://www.nytimes.com/2025/11/11/health/als-young-women.html",
    "summary": "Diagnosed with A.L.S., they traded stories, drank tequila and made grim jokes at a unique annual gathering on Cape Cod."
  },
  {
    "title": "The Volunteer Buglers Giving 24-Note Salutes",
    "link": "https://www.nytimes.com/2025/11/11/arts/music/taps-veterans-military-buglers.html",
    "summary": "Thousands of musicians — civilians, veterans, teenagers, retirees — are playing taps at military funerals in a rebuke of technology."
  },
  {
    "title": "Judge Rejects Utah’s Republican-Drawn Redistricting Map",
    "link": "https://www.nytimes.com/2025/11/11/us/utah-redistricting-gerrymander-congress.html",
    "summary": "The judge instead adopted a map drawn by a centrist coalition. Democrats celebrated the ruling ahead of the 2026 midterms, but Republicans vowed to fight it."
  },
  {
    "title": "SoftBank Sells $5.8 Billion Stake in Nvidia to Pay for OpenAI Deals",
    "link": "https://www.nytimes.com/2025/11/11/business/dealbook/softbank-nvidia-divest.html",
    "summary": "The move has further stoked concerns among some investors that the rally in artificial intelligence stocks was overdone."
  },
  {
    "title": "In West Virginia’s Maternity Deserts, a Midwife Fills a Void",
    "link": "https://www.nytimes.com/2025/11/10/well/west-virginia-midwives.html",
    "summary": "Staysha Quentrill is part of a small group trying to revive Appalachia’s tradition of at-home midwifery — in a state where women drive hours for obstetric care."
  },
  {
    "title": "Use A.I. to Reinvigorate Democracy — Not Replace It",
    "link": "https://www.nytimes.com/2025/11/11/opinion/ai-democracy-government-authoritarianism.html",
    "summary": "Governments shouldn’t hand over decision-making to A.I."
  },
  {
    "title": "On Veterans Day, This Is the Lonely, Terrible Sorrow We Must Never Forget",
    "link": "https://www.nytimes.com/2025/11/11/opinion/veterans-day-world-war-ii.html",
    "summary": "To imagine the cost of an “America First” policy, walk through World War II cemeteries in Europe."
  },
  {
    "title": "Late Night Is Disappointed in Democrats Over Shutdown Deal",
    "link": "https://www.nytimes.com/2025/11/11/arts/television/late-night-democrats-government-shutdown.html",
    "summary": "“Our long national nightmare is different,” Stephen Colbert said after some Democratic senators voted with Republicans to end the government shutdown."
  },
  {
    "title": "Iraqis Are Voting for a New Parliament. Here’s What to Know.",
    "link": "https://www.nytimes.com/2025/11/11/world/middleeast/iraq-election-what-to-know.html",
    "summary": "Iraq is caught in a power struggle between Washington and Tehran, with the Trump administration insisting that the next government disarm powerful Iran-backed militias."
  },
  {
    "title": "Pakistan ‘in a State of War’ After Explosion Kills 12 in Capital",
    "link": "https://www.nytimes.com/2025/11/11/world/asia/pakistan-explosion-islamabad.html",
    "summary": "An attack on a courthouse in Islamabad was the first major assault to hit Islamabad in more than a decade."
  },
  {
    "title": "The Mysterious ‘Louvre Detective’ Was a 15-Year-Old Passer-by",
    "link": "https://www.nytimes.com/2025/11/11/world/europe/louvre-detective-fedora-photo.html",
    "summary": "The photo of a dapper man in a fedora sparked many questions: Was the person real? A Sherlock Holmes-inspired detective on the case? Or just being very French?"
  },
  {
    "title": "Ban a Pro-Palestinian Group? The U.K. Government Thought Few Would Care.",
    "link": "https://www.nytimes.com/2025/11/11/world/europe/uk-starmer-ban-palestine-action.html",
    "summary": "Official advice provided to the government before its ban on Palestine Action underestimated the significant public protests that followed, records show."
  }
]