[
  {
    "title": "Lower-Income Americans Are Missing Car Payments",
    "link": "https://www.nytimes.com/2025/10/20/business/car-loans-missed-payments.html",
    "summary": "Inflation and a tough job market are making it harder for some people to pay back the car loans they signed in better times."
  },
  {
    "title": "Wealthy Americans Are Spending. People With Less Are Struggling.",
    "link": "https://www.nytimes.com/2025/10/19/business/economic-divide-spending-inflation-jobs.html",
    "summary": "Data show a resilient economy. But that largely reflects spending by the rich, while others pull back amid high prices and a weakening labor market."
  },
  {
    "title": "Lawmaker Demands Hearing on U.S. Strikes on Boats in Caribbean",
    "link": "https://www.nytimes.com/2025/10/20/us/politics/congress-boat-strikes-caribbean.html",
    "summary": "Representative Adam Smith said the Trump administration had failed to provide a legal rationale for killing rather than arresting drug trafficking suspects."
  },
  {
    "title": "To Fight ICE, Portland’s Leaders Turn to What They Know Best: Zoning",
    "link": "https://www.nytimes.com/2025/10/20/us/politics/portland-ice.html",
    "summary": "Portland, Ore., is well known for its dense laws on land use. Now, under pressure from its liberal residents, the city is using those restrictions against immigrant detention."
  },
  {
    "title": "Judge Demands Answers on Trump Immigration Crackdown in Chicago",
    "link": "https://www.nytimes.com/2025/10/20/us/chicago-hearing-tear-gas-trump.html",
    "summary": "A federal judge has ordered operational leaders of the crackdown to appear before her on Monday to be questioned about their tactics and their use of tear gas."
  },
  {
    "title": "Louvre Robbery May Have Been More About Stones Than Art, Experts Say",
    "link": "https://www.nytimes.com/2025/10/20/arts/louvre-robbery-gems-precious-metals.html",
    "summary": "Sunday’s robbery at the Paris museum could be the latest example of thieves targeting museums for jewels and precious metals to break down and sell on."
  },
  {
    "title": "Louvre Museum Remains Closed After Jewelry Robbery: What to Know",
    "link": "https://www.nytimes.com/2025/10/20/world/europe/france-louvre-jewel-heist.html",
    "summary": "A stunning heist has raised uncomfortable questions about security at the Paris museum."
  },
  {
    "title": "Other Brazen Art Heists Like the Louvre Jewelry Theft",
    "link": "https://www.nytimes.com/2025/10/20/us/art-museum-heists-louvre.html",
    "summary": "The robbery at the Paris museum on Sunday is only the latest in a long line of breaches."
  },
  {
    "title": "Colin Jost, Pete Davidson and the Staten Island Ferry Fiasco",
    "link": "https://www.nytimes.com/2025/10/20/style/colin-jost-pete-davidson-staten-island-ferry.html",
    "summary": "Nearly four years after they bought an out-of-service ferryboat for $280,100, their plans for a floating event space may be running aground."
  },
  {
    "title": "This Weekend’s Violence in Gaza Shows How Fragile the Cease-Fire Really Is",
    "link": "https://www.nytimes.com/2025/10/20/world/middleeast/gaza-israel-hamas-cease-fire.html",
    "summary": "A round of violence on Sunday was short-lived, but analysts expect more tensions between Israel and Palestinian militants that will put the truce under strain."
  },
  {
    "title": "Where Does the Israel-Hamas Cease-Fire Stand?",
    "link": "https://www.nytimes.com/2025/10/16/world/middleeast/israel-hamas-gaza-cease-fire.html",
    "summary": "Unresolved issues and flare-ups of violence threaten to destabilize the fragile agreement."
  },
  {
    "title": "Amazon’s AWS Disruption Creates Outages for Hundreds of Websites for Hours",
    "link": "https://www.nytimes.com/2025/10/20/business/aws-down-internet-outage.html",
    "summary": "Amazon Web Services, a major provider of cloud services, cited a problem at its data center in Northern Virginia. The outage highlighted the fragility of global internet infrastructure."
  },
  {
    "title": "Supreme Court Will Weigh Gun Restrictions for Drug Users",
    "link": "https://www.nytimes.com/2025/10/20/us/politics/supreme-court-gun-drug-users.html",
    "summary": "The Second Amendment case tests a federal law used to convict Hunter Biden that bars drug users and addicts from possessing guns."
  },
  {
    "title": "Canada Moves to Discourage Arctic Rivals as the Fabled Northwest Passage Opens Up",
    "link": "https://www.nytimes.com/2025/10/20/world/canada/canada-arctic-northwest-passage.html",
    "summary": "The Inuit of the far north helped solve the mystery of a doomed 19th-century expedition. Now Canada needs them to strengthen its claim to this newly contested region."
  },
  {
    "title": "A Norwegian Who Shared Underwear With the Inuit and Found the Northwest Passage",
    "link": "https://www.nytimes.com/2025/10/20/world/americas/northwest-passage-canada-inuit.html",
    "summary": "Unlike the leader of the doomed Franklin expedition, Roald Amundsen delighted in getting to know and learning from the Inuit."
  },
  {
    "title": "In China, a Forbidden Question Looms: Who Leads After Xi?",
    "link": "https://www.nytimes.com/2025/10/20/world/asia/china-communist-succession-plenum.html",
    "summary": "Xi Jinping seems to believe that only his continued rule can secure China’s rise. But as he ages, choosing a successor will become riskier and more difficult."
  },
  {
    "title": "AI Data Centers Create Fury From Mexico to Ireland",
    "link": "https://www.nytimes.com/2025/10/20/technology/ai-data-center-backlash-mexico-ireland.html",
    "summary": "As tech companies build data centers worldwide to advance artificial intelligence, vulnerable communities have been hit by blackouts and water shortages."
  },
  {
    "title": "How Chile Embodies A.I.’s No-Win Politics",
    "link": "https://www.nytimes.com/2025/10/20/technology/chile-ai-politics.html",
    "summary": "Political debates have flared across Chile over artificial intelligence. Should the nation pour billions into A.I. and risk public backlash, or risk being left behind?"
  },
  {
    "title": "Peanut Allergies Have Plummeted in Children, Study Shows",
    "link": "https://www.nytimes.com/2025/10/20/well/peanut-allergy-drop.html",
    "summary": "Doctors have long recommended that infants avoid peanuts. But in 2017, experts officially reversed that guidance, and food allergies decreased sharply."
  },
  {
    "title": "For the Ghosts in a Berkshires Mansion, the Gilded Age Never Ended",
    "link": "https://www.nytimes.com/2025/10/20/realestate/ventfort-hall-gilded-age-berkshires.html",
    "summary": "Ventfort Hall, an 1893 mansion built for J.P. Morgan’s sister, was in disrepair. The living and the dead teamed up to save it."
  },
  {
    "title": "Fallen Confederate Statues Take Center Stage in a Bold New Show",
    "link": "https://www.nytimes.com/2025/10/20/arts/design/art-civil-war-monuments-brick-geffen-contemporary-los-angeles.html",
    "summary": "“Monuments,” a group exhibition in Los Angeles, led by Kara Walker, places contemporary art face to face with statuary removed in the last decade."
  },
  {
    "title": "America Still Has a Political Center, and It’s the Key to Winning",
    "link": "https://www.nytimes.com/2025/10/20/opinion/moderation-strategy-democrat-republican-center.html",
    "summary": "The antidote to our polarized politics is a creative, re-energized political center."
  },
  {
    "title": "Senator Ruben Gallego Has Three Words for Democrats",
    "link": "https://www.nytimes.com/2025/10/20/opinion/ruben-gallego-interview-democrats-border-security-affordability.html",
    "summary": "Lessons from a Democrat who won in a Republican state."
  },
  {
    "title": "How Ultraprocessed Food Took Over America",
    "link": "https://www.nytimes.com/2025/10/20/briefing/how-ultraprocessed-food-took-over-america.html",
    "summary": "These products are among the greatest health threats of our time."
  },
  {
    "title": "Prison Guard Convicted in Fatal Beating Caught on Video, With 2 Acquitted",
    "link": "https://www.nytimes.com/2025/10/20/nyregion/marcy-prison-beating-murder-trial.html",
    "summary": "Footage of a group of guards punching, choking and stomping Robert L. Brooks ignited an outcry. Six guards pleaded guilty to charges, but for two, the gamble of a trial paid off."
  },
  {
    "title": "Disney+ Cancellations Jump After Kimmel Suspension",
    "link": "https://www.nytimes.com/2025/10/20/business/media/disney-subscription-cancellations-kimmel.html",
    "summary": "Roughly three million Americans canceled the streaming service in the month that it temporarily suspended Jimmy Kimmel’s show. About 4.1 million people canceled Disney-owned Hulu."
  },
  {
    "title": "What to Know About Diwali, the Hindu Festival of Lights",
    "link": "https://www.nytimes.com/article/diwali-india-festival-lights.html",
    "summary": "The biggest public holiday in India, Diwali features prayers for prosperity and good fortune — and lots of sweets."
  },
  {
    "title": "Vision Restored Using Prosthetic Retinal Implant",
    "link": "https://www.nytimes.com/2025/10/20/health/retinal-implant-macular-degeneration.html",
    "summary": "The device could help a million people with a severe form of macular degeneration to be able to see enough to read."
  }
]