[
  {
    "title": "RFK Jr. Cancels Nearly $500 Million in mRNA Vaccine Contracts",
    "link": "https://www.nytimes.com/2025/08/05/health/rfk-jr-vaccine-funding.html",
    "summary": "That kind of shot was first used during the Covid-19 pandemic, but the health secretary has been sharply critical of the technology."
  },
  {
    "title": "Trump Surveys White House on Morning Roof Stroll",
    "link": "https://www.nytimes.com/2025/08/05/us/politics/trump-white-house-stroll.html",
    "summary": "White House reporters looked up from the driveway to see a familiar figure in a most unfamiliar location."
  },
  {
    "title": "Officials Move to Open Inquiry on Trump’s ‘Russia Hoax’ Grievance",
    "link": "https://www.nytimes.com/2025/08/05/us/politics/trump-russia-grand-jury-investigation.html",
    "summary": "Such an investigation would have to overcome a number of legal and practical hurdles, but an order by Attorney General Pam Bondi asking for a grand jury inquiry in Florida accomplishes political objectives."
  },
  {
    "title": "Trump Threatens Federal Takeover of D.C. After Member of DOGE Assaulted",
    "link": "https://www.nytimes.com/2025/08/05/us/politics/trump-doge-member-assaulted.html",
    "summary": "President Trump shared a photograph that appeared to show a 19-year-old software engineer shirtless and bloodied, after an attempted carjacking."
  },
  {
    "title": "California Democrats Look to Redraw House Map Amid Texas Redistricting War",
    "link": "https://www.nytimes.com/2025/08/05/us/politics/california-texas-redistricting-maps.html",
    "summary": "As a Texas senator summoned the F.B.I. to round up Democrats, the redistricting war that began in Texas was spreading, with California aiming at five Republican House seats."
  },
  {
    "title": "Why the G.O.P. Isn’t Doing Many Town Halls",
    "link": "https://www.nytimes.com/video/us/politics/100000010324588/why-the-gop-isnt-doing-many-town-halls.html",
    "summary": "The booing started in seconds at Representative Mike Flood’s town hall in Lincoln, Neb. Annie Karni, a congressional correspondent for The New York Times, reports from the auditorium after the Republican congressman’s town hall, which she said was one of the most raucous political events she’s ever witnessed."
  },
  {
    "title": "Mike Flood Heckled at Town Hall Over Trump’s Domestic Policy Bill",
    "link": "https://www.nytimes.com/2025/08/05/us/politics/mike-flood-town-hall.html",
    "summary": "Most Republican lawmakers are avoiding town hall meetings, reluctant to confront energized Democrats and answer tough questions. When Representative Mike Flood of Nebraska gave it a try, the booing started in seconds."
  },
  {
    "title": "3 Years Before Midtown Manhattan Shooting, Nevada Police Had Gunman Committed",
    "link": "https://www.nytimes.com/2025/08/05/nyregion/park-avenue-gunman-mental-health.html",
    "summary": "The Las Vegas police released documents and records describing the mental health breakdowns that the man who killed four people in a New York building had faced earlier."
  },
  {
    "title": "Why Do Stars Like Al Pacino and Liev Schreiber Love Playing Shakespeare in Central Park?",
    "link": "https://www.nytimes.com/2025/08/05/theater/shakespeare-in-the-park-nyc-delacorte-theater.html",
    "summary": "‘You realize you’re being upstaged by an animal that’s completely unpredictable’: As the Delacorte Theater reopens, actors and others recall their favorite memories."
  },
  {
    "title": "Columbia and Brown to Disclose Admissions and Race Data in Trump Deal",
    "link": "https://www.nytimes.com/2025/08/05/nyregion/columbia-brown-admissions-trump.html",
    "summary": "A widely overlooked part of a settlement with the two universities could profoundly alter how elite schools determine who gets accepted."
  },
  {
    "title": "Bolsonaro House Arrest Casts Shadow Over Brazil-U.S. Trade Talks",
    "link": "https://www.nytimes.com/2025/08/05/world/americas/brazil-bolsonaro-us-trade-talks.html",
    "summary": "The Brazilian Supreme Court justice’s order could complicate efforts to negotiate over President Trump’s punishing tariffs, set to go into effect this week."
  },
  {
    "title": "With Canada No Longer Able to Rely on U.S., Carney Pushes New Markets",
    "link": "https://www.nytimes.com/2025/08/05/world/canada/canada-carney-tariffs-response.html",
    "summary": "Prime Minister Mark Carney suggested he’s unlikely to add additional retaliatory tariffs on U.S. goods, but he is trying to help affected companies develop new products and find new buyers."
  },
  {
    "title": "Titan Submersible Deaths Were Preventable, Coast Guard Report Says",
    "link": "https://www.nytimes.com/2025/08/05/us/titan-sub-implosion-coast-guard-report.html",
    "summary": "The 2023 implosion killed five people on a dive to the wreckage of the Titanic, prompting a sprawling search of the north Atlantic Ocean."
  },
  {
    "title": "China Is a Nation of Savers. Many Are Drowning in Debt.",
    "link": "https://www.nytimes.com/2025/08/06/business/china-consumer-debt.html",
    "summary": "As Beijing pushes consumer lending to stimulate the economy, millions of Chinese borrowers, especially the young, are falling into debt spirals."
  },
  {
    "title": "NFL Will Get a Stake in ESPN in a Complex Deal",
    "link": "https://www.nytimes.com/2025/08/05/business/media/nfl-espn-disney-deal.html",
    "summary": "The network and sports league announced a deal that gives the N.F.L. an ownership stake in ESPN. In exchange, the network will control some of the league’s media outlets."
  },
  {
    "title": "New York City Carriage Horse Collapses and Dies on Manhattan Street",
    "link": "https://www.nytimes.com/2025/08/05/nyregion/nyc-carriage-horse-dies.html",
    "summary": "The death of the 15-year-old mare named Lady was being investigated by the city’s health department, officials said."
  },
  {
    "title": "The Promise of Palestinian Statehood Is Ringing Hollow",
    "link": "https://www.nytimes.com/2025/08/06/opinion/israel-palestinians-un-statehood.html",
    "summary": "Recognition will come with strings attached and little chance for holding Israel to account."
  },
  {
    "title": "Eighty Years of Nuclear Weapons Is Enough",
    "link": "https://www.nytimes.com/2025/08/06/opinion/hiroshima-nagasaki-anniversary-nuclear-weapons.html",
    "summary": "The nuclear taboo is on the verge of collapse."
  },
  {
    "title": "Mary Sheffield and Solomon Kinloch Jr. Advance in Detroit Mayoral Election",
    "link": "https://www.nytimes.com/2025/08/06/us/elections/detroit-mayoral-election.html",
    "summary": "Mary Sheffield and Solomon Kinloch Jr. will face off in a November election. Mike Duggan, Detroit’s mayor for a dozen years, is not seeking re-election."
  },
  {
    "title": "Cuomo Calls for Gaza Aid and Says ‘Some People’ Blame Israel for Crisis",
    "link": "https://www.nytimes.com/2025/08/05/nyregion/cuomo-gaza-aid-israel.html",
    "summary": "Former Gov. Andrew M. Cuomo appeared to criticize Israel over the humanitarian crisis in Gaza. Hours later, he distanced himself from his remarks."
  },
  {
    "title": "Video Forces Pakistan to Confront ‘Honor Killings’ and Gender Violence",
    "link": "https://www.nytimes.com/2025/08/06/world/asia/pakistan-honor-killing-gender-violence.html",
    "summary": "Women in Pakistan die every day for supposedly dishonoring their families, and arrests are rare. But Bano Bibi’s defiant last words were caught on video."
  },
  {
    "title": "Why Are Earthquakes Happening in New York and New Jersey?",
    "link": "https://www.nytimes.com/2025/08/05/nyregion/earthquake-nj-nyc-new-york-why.html",
    "summary": "The recent temblors were classified as “weak,” and may have been connected to a bigger earthquake last year in the area."
  }
]