[
  {
    "title": "Trump Administration Aims to Strip More Foreign-Born Americans of Citizenship",
    "link": "https://www.nytimes.com/2025/12/17/us/politics/trump-immigration-citizenship-denaturalization.html",
    "summary": "An official with U.S. Citizenship and Immigration Services said it would prioritize “those who’ve unlawfully obtained U.S. citizenship.”"
  },
  {
    "title": "ICE Must Allow Lawmakers to Inspect Detention Centers, Judge Rules",
    "link": "https://www.nytimes.com/2025/12/17/us/politics/ice-inspections-democrats-congress-lawsuit.html",
    "summary": "Judge Jia M. Cobb wrote that two policies announced in June appeared to unlawfully bar members of Congress from making unannounced visits at immigration detention facilities."
  },
  {
    "title": "ICE Arrests Disrupt Schools, Prompting Fear Among Families",
    "link": "https://www.nytimes.com/2025/12/17/us/politics/ice-arrests-schools.html",
    "summary": "President Trump’s immigration crackdown has at times resulted in arrests near schools, setting off concerns among parents, educators and students."
  },
  {
    "title": "Immigration Agents and Protesters Face Off in Frigid Minnesota",
    "link": "https://www.nytimes.com/2025/12/17/us/immigration-agents-protesters-roof-minnesota.html",
    "summary": "A surge of ICE agents has led to 670 arrests and chaotic standoffs in subzero weather."
  },
  {
    "title": "House Rejects Measure to Bar Strikes Inside Venezuela",
    "link": "https://www.nytimes.com/2025/12/17/us/politics/trump-venezuela-house-vote.html",
    "summary": "The Democratic measure was defeated mostly along party lines, along with another resolution that would have halted the military’s escalating campaign of boat attacks."
  },
  {
    "title": "Top Republican Examining Boat Strike ‘Satisfied’ With Military Mission",
    "link": "https://www.nytimes.com/2025/12/17/us/politics/boat-strike-video-questions-lawmakers.html",
    "summary": "After viewing video of a follow-up strike, Republicans largely had confidence in the Pentagon’s legal rationale while Democrats questioned its legality."
  },
  {
    "title": "Dan Bongino to Step Down as FBI Deputy Director",
    "link": "https://www.nytimes.com/2025/12/17/us/politics/dan-bongino-steps-down-fbi.html",
    "summary": "The departure of Mr. Bongino had seemed inevitable since August, when the White House hired Missouri’s attorney general, Andrew Bailey, to share his job as deputy director."
  },
  {
    "title": "Republicans Clinch Democrats’ Bid to Force Vote on ACA Subsidies",
    "link": "https://www.nytimes.com/2025/12/17/us/politics/obamacare-subsidies-house.html",
    "summary": "After the speaker denied them a vote on extending the subsidies, four Republicans from competitive districts joined Democrats’ bid to go around G.O.P. leaders and force action."
  },
  {
    "title": "Fani Willis Calls Trump and Allies ‘Criminals’ in Hearing Before Georgia Senate Committee",
    "link": "https://www.nytimes.com/2025/12/17/us/fani-willis-georgia-senate-hearing-trump.html",
    "summary": "The district attorney in Atlanta addressed a Republican-led committee created to investigate her conduct during her prosecution of President Trump last year."
  },
  {
    "title": "Jack Smith Defends Trump Prosecutions in House Deposition",
    "link": "https://www.nytimes.com/2025/12/17/us/politics/jack-smith-trump-prosecutions-congress.html",
    "summary": "Even adversaries of Jack Smith, the former special counsel, conceded that his tight-lipped, painstaking approach made tripping him up particularly difficult."
  },
  {
    "title": "Bodies of Rob and Michele Reiner Were Found in Master Bedroom, Police Say",
    "link": "https://www.nytimes.com/2025/12/17/us/rob-michele-reiner-location-death.html",
    "summary": "After finding the slain couple, investigators focused on their younger son, Nick, as a suspect. He was formally charged with murder on Tuesday."
  },
  {
    "title": "Video Footage Shows Nick Reiner Enter Store an Hour Before His Arrest",
    "link": "https://www.nytimes.com/2025/12/17/us/nick-reiner-arrest-video-gas-station.html",
    "summary": "Mr. Reiner was filmed entering a gas station’s store in South Los Angeles to buy a sports drink roughly an hour before he was arrested by the police across the street."
  },
  {
    "title": "How the Rhinelander Trial Scandalized the Jazz Age",
    "link": "https://www.nytimes.com/2025/12/17/magazine/rhinelander-trial-interracial-marriage.html",
    "summary": "Rhinelander v. Rhinelander was one of the most scandalous trials of the Jazz Age. 100 years later, it reads as a tragedy about the country’s original sin."
  },
  {
    "title": "N.Y. Governor Will Sign Right-to-Die Bill for the Terminally Ill",
    "link": "https://www.nytimes.com/2025/12/17/nyregion/medical-dying-assisted-suicide-hochul.html",
    "summary": "Gov. Kathy Hochul cast the measure in unusually personal terms, saying she had felt “the pain of seeing someone you love suffer and feeling powerless to stop it.”"
  },
  {
    "title": "Search for Unidentified Killer at Brown University Stretches to 4th Day",
    "link": "https://www.nytimes.com/2025/12/17/us/brown-shooter-suspect-providence.html",
    "summary": "Officials said that they were working with physical evidence, including DNA, and that they were seeking a second man who appeared to have crossed paths with the possible suspect’."
  },
  {
    "title": "Twelve Men Saturated East Harlem Housing Project With Drugs, U.S. Says",
    "link": "https://www.nytimes.com/2025/12/17/nyregion/sdny-harlem-drug-charges.html",
    "summary": "For more than three and a half years, officials said, the men used the Johnson Houses as “an open drug market” to sell crack cocaine and fentanyl."
  },
  {
    "title": "Fighting for Femininity, Not Feminism on the New Women’s Right",
    "link": "https://www.nytimes.com/2025/12/16/style/new-womens-right-feminism.html",
    "summary": "A group of young conservatives feel that the pressures they face as 20-something women have been made worse by the liberal feminism that defined their youth."
  },
  {
    "title": "The New Flu Variant Could Spread Widely This Year. Here’s What to Know.",
    "link": "https://www.nytimes.com/2025/12/17/well/new-flu-variant-symptoms.html",
    "summary": "Here’s what to know about the dominant version of the virus that’s circulating now."
  },
  {
    "title": "Canada’s Population Shrinks Amid Tightened Immigration",
    "link": "https://www.nytimes.com/2025/12/17/world/canada/canada-population-decline-immigration.html",
    "summary": "The government has greatly restricted the number of work and study permits issued to foreigners following an unpopular immigration boom during the pandemic."
  },
  {
    "title": "Beloved Objects Cherished By Those We Lost in 2025",
    "link": "https://www.nytimes.com/2025/12/17/magazine/objects-they-loved-2025.html",
    "summary": "Metal crosses, a recliner, a blue wedding suit: the most cherished belongings of Ozzy Osbourne, Brian Wilson, Kitty Dukakis and others."
  },
  {
    "title": "Let’s Go Beyond Trump’s Vile Words About Rob Reiner",
    "link": "https://www.nytimes.com/2025/12/17/opinion/trump-rob-reiner.html",
    "summary": "We must do far more to address the national crisis of addiction that leaves so many households in despair as well as danger."
  },
  {
    "title": "The Man Who Rules the Country Presides Over Nothing",
    "link": "https://www.nytimes.com/2025/12/17/opinion/trump-presidential-power-miller-vought.html",
    "summary": "Why are the Supreme Court and Congress conspiring to give him more power?"
  },
  {
    "title": "The U.S. Seeks to Increase Denaturalizations",
    "link": "https://www.nytimes.com/2025/12/17/briefing/the-us-seeks-to-increase-denaturalizations.html",
    "summary": "Also, New York will allow the terminally ill to end their lives. Here’s the latest at the end of Wednesday."
  },
  {
    "title": "How Do You Afford Life in New York City?",
    "link": "https://www.nytimes.com/2025/12/17/nyregion/new-york-city-affordability.html",
    "summary": "The New York Times is looking to talk to New Yorkers about how they budget, splurge and save in one of the most expensive cities in the world."
  },
  {
    "title": "California’s Endless Fog Is Finally Clearing",
    "link": "https://www.nytimes.com/2025/12/17/weather/california-tule-fog-central-valley.html",
    "summary": "An unrelenting gloom has blanketed much of the state’s Central Valley since late November."
  },
  {
    "title": "Christine Choy, Documentarian of Asian American Life, Dies at 76",
    "link": "https://www.nytimes.com/2025/12/17/movies/christine-choy-dead.html",
    "summary": "Her film “Who Killed Vincent Chin?” earned an Oscar nomination in 1988 and was inducted into the National Film Registry for its cultural significance."
  },
  {
    "title": "Stabbing Near Chabad Headquarters Investigated as a Possible Hate Crime",
    "link": "https://www.nytimes.com/2025/12/17/nyregion/hate-crime-stabbing-chabad.html",
    "summary": "A dispute on a Brooklyn street appeared to explode after the perpetrator made antisemitic statements, the police said."
  }
]