[
  {
    "title": "Venezuela Live Updates: U.S. Forces Seize Two Tankers; Rubio Lays Out Plan for American Control",
    "link": "https://www.nytimes.com/live/2026/01/07/world/venezuela-us-trump",
    "summary": "After the secretary of state unveiled a proposal for managing Venezuela and the U.S. forces boarded a Russian-flagged tanker and a second ship, President Trump had a phone call with President Gustavo Petro of Colombia amid escalating tensions between the two leaders."
  },
  {
    "title": "During Maduro Raid in Venezuela, a Close Call for Helicopters and Trump’s Plan",
    "link": "https://www.nytimes.com/2026/01/07/us/politics/trump-venezuela-helicopter.html",
    "summary": "As a damaged U.S. helicopter struggled to stay aloft over Venezuela’s capital, the success of the entire operation hung in the balance."
  },
  {
    "title": "Maduro Is Gone, but Repression in Venezuela Has Intensified",
    "link": "https://www.nytimes.com/2026/01/07/world/americas/venezuela-repression.html",
    "summary": "Security forces have boarded buses, searched phones and interrogated people, looking for evidence that they welcomed the capture of Nicolás Maduro."
  },
  {
    "title": "Oil Firms Say Venezuela Owes Them Billions Over Earlier Investments",
    "link": "https://www.nytimes.com/2026/01/07/business/energy-environment/trump-venezuela-oil-exxon-mobil-conocophillips.html",
    "summary": "Companies like Exxon Mobil and ConocoPhillips say that Venezuela owes them billions of dollars for confiscating their assets two decades ago."
  },
  {
    "title": "Lawmakers Split After Classified Briefings on Venezuela",
    "link": "https://www.nytimes.com/2026/01/07/us/politics/venezuela-briefing-congress-rubio.html",
    "summary": "Republicans praised what they characterized as a narrow and well-executed plan, while Democrats expressed alarm, warning that the mission was vaguely defined."
  },
  {
    "title": "The ICE Shooting Came During an Operation Focused on Somali Immigrants",
    "link": "https://www.nytimes.com/2026/01/07/us/ice-minneapolis-somalis-immigration.html",
    "summary": "Federal immigration officials have stepped up enforcement activity in Minnesota amid a fraud scandal there that includes many people of Somali origin."
  },
  {
    "title": "Horns, Whistles and Then Gunfire on a Minneapolis Street",
    "link": "https://www.nytimes.com/2026/01/07/us/minneapolis-ice-shooting-witness.html",
    "summary": "A man opened his door to discover a tableau of deadly violence after a federal agent fatally shot a woman."
  },
  {
    "title": "Deadly Minneapolis Encounter Is the 9th ICE Shooting Since September",
    "link": "https://www.nytimes.com/2026/01/07/us/ice-shootings-minneapolis-other-cities.html",
    "summary": "All those targeted in the shootings were fired on while in their vehicles."
  },
  {
    "title": "Trump Says He Wants Congress to Stop Wall St. From Buying Single-Family Houses",
    "link": "https://www.nytimes.com/2026/01/07/business/trump-wall-street-investors-homes.html",
    "summary": "The president said he wanted Congress to stop the purchases by big investors, which have driven up rents and set obstacles for first-time buyers in some markets."
  },
  {
    "title": "Justice Dept. Staff Fear Turmoil Diverts Them From Potential Threats",
    "link": "https://www.nytimes.com/2026/01/07/us/justice-department-threats-cyberattacks-terrorism.html",
    "summary": "Rank-and-file prosecutors and agents have expressed serious concern that a hobbled work force hurts the government’s ability to identify and stop terrorist plots, cyberattacks, mass violence and fraud."
  },
  {
    "title": "Most Lawyers in the Manhattan U.S. Attorney’s Office Are on Epstein Duty",
    "link": "https://www.nytimes.com/2026/01/07/nyregion/epstein-files-redactions.html",
    "summary": "The Justice Department has dedicated scores of lawyers, including more than 125 from the Southern District of New York, to reviewing over two million documents in the prominent case."
  },
  {
    "title": "RFK Jr. Overhauls Food Pyramid to Emphasize Red Meat and Dairy",
    "link": "https://www.nytimes.com/2026/01/07/well/rfk-jr-food-pyramid-nutrition-guidelines-protein.html",
    "summary": "The Trump administration released new dietary guidelines on Wednesday, pushing Americans to prioritize protein and cut back on added sugars and processed foods."
  },
  {
    "title": "New Dietary Guidelines Abandon Longstanding Advice on Alcohol",
    "link": "https://www.nytimes.com/2026/01/07/health/dietary-guidelines-alcohol.html",
    "summary": "Now the government’s recommendation is to “limit” drinking, without specifying safe amounts for men and women. The guidelines no longer warn of risks like cancer."
  },
  {
    "title": "New Novels to Read This Year",
    "link": "https://www.nytimes.com/2026/01/07/books/review/new-fiction-books-2026.html",
    "summary": "Tayari Jones, Ann Patchett, George Saunders and Veronica Roth return with new novels; Jennette McCurdy makes her fiction debut; and more."
  },
  {
    "title": "New Nonfiction Books to Read This Year",
    "link": "https://www.nytimes.com/2026/01/07/books/review/most-anticipated-nonfiction-books-2026.html",
    "summary": "Memoirs by Sylvester Stallone and the founder of Barstool Sports; essays from celebrated novelists Jesmyn Ward and Jayne Anne Phillips; and more."
  },
  {
    "title": "Abel Ferrara: In Rome, They Call Him ‘Maestro’",
    "link": "https://www.nytimes.com/2026/01/07/style/in-rome-they-call-him-maestro.html",
    "summary": "Abel Ferrara, an icon of down-and-dirty New York cinema who has a key role in ‘Marty Supreme,’ tells the story of his wild career in a frank memoir."
  },
  {
    "title": "California Tech Executives Plot Against Rep. Ro Khanna Over Support of Wealth Tax",
    "link": "https://www.nytimes.com/2026/01/07/us/politics/ro-khanna-california-wealth-tax.html",
    "summary": "It’s hard right now to be a progressive Democrat in the heart of America’s tech industry."
  },
  {
    "title": "Nick Reiner’s Lawyer, Alan Jackson, Removes Himself From Murder Case",
    "link": "https://www.nytimes.com/2026/01/07/movies/nick-reiner-lawyer-alan-jackson.html",
    "summary": "Mr. Reiner, who is charged with killing his parents, will now be represented by a public defender. His arraignment has been rescheduled for next month."
  },
  {
    "title": "As Charlie Kirk’s Turning Point Pushes Into High Schools, Dissension Follows",
    "link": "https://www.nytimes.com/2026/01/07/us/politics/charlie-kirk-turning-point-usa-high-schools.html",
    "summary": "Since Mr. Kirk’s death, chapters of his organization’s affiliate for teenagers have more than doubled in number, aided by politicians who have said they won’t tolerate opposition."
  },
  {
    "title": "University to Pay $500,000 to Professor It Fired Over Charlie Kirk Post",
    "link": "https://www.nytimes.com/2026/01/07/us/austin-peay-professor-charlie-kirk-settlement-reinstated.html",
    "summary": "Austin Peay State University in Tennessee also reinstated Darren Michael, a tenured acting professor whose post about Mr. Kirk’s killing inflamed conservatives."
  },
  {
    "title": "Yemen Separatist Leader Refuses to Attend Talks, Deepening Saudi Arabia-UAE Clash",
    "link": "https://www.nytimes.com/2026/01/07/world/middleeast/yemen-separatist-leader-zubaidi-saudi-arabia-uae.html",
    "summary": "Invited to Saudi Arabia for talks, dozens of Yemeni separatist officials went incommunicado on Wednesday as the conflict in their country took a sharp twist."
  },
  {
    "title": "Texas A&M Warns Professor Not to Teach Plato Because of Gender Rules",
    "link": "https://www.nytimes.com/2026/01/07/us/tamu-plato-race-gender.html",
    "summary": "The university is reviewing courses under new rules restricting teaching about race and gender. Administrators told a philosophy professor to cut some lessons on Plato to comply."
  },
  {
    "title": "Can Timothée Chalamet Break This Oscar Curse?",
    "link": "https://www.nytimes.com/2026/01/07/movies/timothee-chalamet-michael-b-jordan-oscar-curse.html",
    "summary": "The best actor Oscar almost never goes to young men, though the 30-year-old has his best chance yet with “Marty Supreme.”"
  },
  {
    "title": "2026 SAG Actor Award Nominations List: ‘One Battle’ and ‘Sinners’ Lead",
    "link": "https://www.nytimes.com/2026/01/07/movies/actor-award-sag-nominations-list.html",
    "summary": "Timothée Chalamet and Ariana Grande also scored nods. Cynthia Erivo and the stars of “Jay Kelly” were left out."
  },
  {
    "title": "Trump’s Voters Are Discovering What ‘America First’ Really Means",
    "link": "https://www.nytimes.com/2026/01/07/opinion/trump-venezuela-america-first.html",
    "summary": "Whether or not the Venezuelan raid was advisable, it was Trumpian."
  },
  {
    "title": "What I Saw When I Peeked Over the Edge of Consciousness",
    "link": "https://www.nytimes.com/2026/01/07/opinion/near-death-conference-grief-chicago.html",
    "summary": "Facing death is a core part of making meaning of one’s life. To struggle through this universal contemplation without a community can be brutal."
  },
  {
    "title": "The U.S. Seized Two Oil Tankers",
    "link": "https://www.nytimes.com/2026/01/07/briefing/us-oil-tankers-venezuela.html",
    "summary": "Also, an ICE agent fatally shot a woman in Minneapolis. Here’s the latest at the end of Wednesday."
  },
  {
    "title": "Google and Character.AI to Settle Lawsuit Over Teenager’s Death",
    "link": "https://www.nytimes.com/2026/01/07/technology/google-characterai-teenager-lawsuit.html",
    "summary": "The settlement came in the case of a 14-year-old in Florida who had killed himself after developing a relationship with an A.I. chatbot."
  },
  {
    "title": "Julie Menin Is Elected New York City Council Speaker",
    "link": "https://www.nytimes.com/2026/01/07/nyregion/julie-menin-nyc-council-speaker.html",
    "summary": "Ms. Menin, a centrist Democrat, said she would investigate bad actors in business and city agencies and played down areas of difference with Mayor Zohran Mamdani."
  },
  {
    "title": "Philip Yancey, Prominent Christian Author, Admits to Extramarital Affair",
    "link": "https://www.nytimes.com/2026/01/07/us/philip-yancey-affair.html",
    "summary": "He said he would retire from writing and public speaking."
  }
]