[
  {
    "title": "The First Big Elections of the New Trump Era Are Today. Here’s What to Look For.",
    "link": "https://www.nytimes.com/2025/11/04/us/politics/elections-new-york-new-jersey-virginia.html",
    "summary": "The mayor’s race in New York will gauge voters’ desire for a left-wing shift, and Democrats running for governor in New Jersey and Virginia again made fighting the president central to their bids."
  },
  {
    "title": "Photos From NYC Mayoral Race Capture Campaigns of Mamdani, Cuomo and Sliwa",
    "link": "https://www.nytimes.com/2025/11/03/nyregion/photos-nyc-mayor-mamdani-cuomo-sliwa.html",
    "summary": "Times photographers caught signal moments from the campaign trail as Zohran Mamdani, Andrew Cuomo and Curtis Sliwa battled for votes."
  },
  {
    "title": "Former Vice President Dick Cheney Dies at 84",
    "link": "https://www.nytimes.com/2025/11/04/us/politics/dick-cheney-dead.html",
    "summary": "A former defense secretary and congressman, he held the nation’s No. 2 job under President George W. Bush and was an architect of policies in an era of war and economic change."
  },
  {
    "title": "Dick Cheney: A Life in Pictures",
    "link": "https://www.nytimes.com/2025/11/04/obituaries/dick-cheney-life-career-photos.html",
    "summary": "The former vice president helped shaped the role of the United States around the world."
  },
  {
    "title": "Republicans Hold Firm on Filibuster and Prosecutor Veto Power, Despite Trump’s Frustrations",
    "link": "https://www.nytimes.com/2025/11/04/us/politics/trump-republicans-filibuster.html",
    "summary": "President Trump is showing mounting frustration at his inability to win confirmation of U.S. attorneys in blue states or break the filibuster's grip on the Senate. The G.O.P. has been uncharacteristically uncooperative."
  },
  {
    "title": "The Battle Over an Activist Who Protested Stephen Miller Near His Virginia Home",
    "link": "https://www.nytimes.com/2025/11/03/us/politics/stephen-miller-activist-battle-free-speech.html",
    "summary": "Criminal inquiries pit the Miller family’s safety concerns against the First Amendment rights of an activist in Northern Virginia critical of the administration."
  },
  {
    "title": "Bessent Plans to Attend Tariff Arguments at the Supreme Court",
    "link": "https://www.nytimes.com/2025/11/04/us/politics/supreme-court-tariffs-bessent.html",
    "summary": "Treasury Secretary Scott Bessent dismissed the idea that his presence could be seen as an attempt to intimidate the court on a case that President Trump considers vital to his economic policy."
  },
  {
    "title": "Small Businesses Gear Up for Tariff Fight at Supreme Court",
    "link": "https://www.nytimes.com/2025/11/04/us/politics/tariffs-supreme-court-small-business.html",
    "summary": "Companies that sell diamonds, plant sensors and wine all have one thing in common: They are weighing in against tariffs in a consequential case."
  },
  {
    "title": "This Closed Factory Shows How Hard Reviving Drug Manufacturing Will Be",
    "link": "https://www.nytimes.com/2025/11/04/health/generic-drug-manufacturing-trump.html",
    "summary": "President Trump wants pharmaceutical production to return to the United States. A shuttered factory in Louisiana shows how hard that will be for generic medicines."
  },
  {
    "title": "She Voted for Trump Three Times. Now She Is Leading a Fight Against His Tariffs.",
    "link": "https://www.nytimes.com/2025/11/04/us/politics/sara-albrecht-liberty-justice-center-tariffs.html",
    "summary": "The Liberty Justice Center led by Sara Albrecht is better known for backing right-leaning causes, but it filed the tariff case that will be heard by the Supreme Court this week."
  },
  {
    "title": "A Beloved Vintage Store Closed. A Customer Bought All 4,500 Items.",
    "link": "https://www.nytimes.com/2025/11/04/business/vicky-szuflita-vintage-store.html",
    "summary": "Everything in the shop appeared to have been abandoned. A devoted customer took it all home and started selling the items herself."
  },
  {
    "title": "Right-Wing Chatbots Turbocharge America’s Political and Cultural Wars",
    "link": "https://www.nytimes.com/2025/11/04/business/right-wing-chatbots-gab-arya-chatgpt-gemini.html",
    "summary": "Once pitched as dispassionate tools to answer your questions, A.I. chatbots are now programmed to reflect the biases of their creators."
  },
  {
    "title": "The Editor Got a Letter From ‘Dr. B.S.’ So Did a Lot of Other Editors.",
    "link": "https://www.nytimes.com/2025/11/04/science/letters-to-the-editor-ai-chatbots.html",
    "summary": "The rise of artificial intelligence has produced serial writers to science and medical journals, most likely using chatbots to boost the number of citations they’ve published."
  },
  {
    "title": "China’s Security State Sells an A.I. Dream",
    "link": "https://www.nytimes.com/2025/11/04/world/asia/china-police-ai-surveillance.html",
    "summary": "China’s new national drive to embrace artificial intelligence is also giving the authorities new ways to monitor and control its citizens."
  },
  {
    "title": "In Search of the Simpsonville Massacre",
    "link": "https://www.nytimes.com/2025/11/04/science/archaeology-simpsonville-civil-war.html",
    "summary": "In 1865, two dozen Union soldiers, all formerly enslaved, were ambushed and killed along a road in Kentucky. Archaeologists are still searching for their remains."
  },
  {
    "title": "Bold Assassinations Are ‘Reality Check’ in Mexico’s Cartel Fight",
    "link": "https://www.nytimes.com/2025/11/04/world/americas/mexico-mayor-carlos-manzo-drug-war.html",
    "summary": "The murder of Mexico’s most vocal anti-crime mayor shows that, despite President Claudia Sheinbaum’s crackdown on drug cartels, the battle is just beginning."
  },
  {
    "title": "It Would Be Trump’s Honor to Pay for Food Stamps",
    "link": "https://www.nytimes.com/2025/11/04/opinion/food-stamps-snap-shutdown.html",
    "summary": "When Republicans sing Kumbaya."
  },
  {
    "title": "Nick Fuentes Is Becoming Charlie Kirk’s Successor",
    "link": "https://www.nytimes.com/2025/11/03/opinion/nick-fuentes-kirk-successor.html",
    "summary": "A white nationalist’s rise reveals a seemingly unstoppable ratchet of radicalization on the right."
  },
  {
    "title": "At the Gun Range",
    "link": "https://www.nytimes.com/2025/11/04/briefing/at-the-gun-range.html",
    "summary": "Blast waves may be damaging shooters’ brains. The Times has a new investigation on how it happens."
  },
  {
    "title": "MS … NOW? As MSNBC Rebrands, a $20 Million Effort to Avoid Confusion.",
    "link": "https://www.nytimes.com/2025/11/04/business/media/msnbc-name-change-ms-now.html",
    "summary": "After three decades, the MSNBC brand will be retired on Nov. 15. The network has called in Rachel Maddow to help viewers make the transition."
  },
  {
    "title": "U.S. Seeks Two-Year U.N. Mandate for Gaza Stabilization Force",
    "link": "https://www.nytimes.com/2025/11/04/world/middleeast/un-mandate-gaza-force.html",
    "summary": "A draft Security Council resolution said that an international force would ensure that Gaza be demilitarized, though specifics were unclear."
  },
  {
    "title": "Amazon Oil Drilling Undermines Brazil’s Climate Credibility Before COP30",
    "link": "https://www.nytimes.com/2025/11/04/world/americas/brazil-oil-drilling-amazon-cop30.html",
    "summary": "Brazil, which is hosting the 30th U.N. Climate Change Conference this month, wants to show the world it is a leader in safeguarding the planet. Its record tells a more complicated story."
  },
  {
    "title": "As UK Tries to Curb Immigration, Rural Scotland Looks to Attract Foreign Workers",
    "link": "https://www.nytimes.com/2025/11/04/world/europe/rural-scotland-immigration-labor-uk.html",
    "summary": "Bucking the anti-immigration trend in British politics, remote areas of Scotland would like to attract foreign workers to offset declining local populations."
  }
]