[
  {
    "title": "U.S. Hits Brazil With 50% Tariffs and Sanctions in Sharp Escalation",
    "link": "https://www.nytimes.com/2025/07/30/world/americas/trump-sanctions-brazil-judge-bolsonaro.html",
    "summary": "The White House hit Brazil on Wednesday with a 50 percent tariff and sanctions on a justice overseeing investigations into former President Jair Bolsonaro."
  },
  {
    "title": "Trump Threatens India With Steep Tariffs, Including Penalty Over Russian Oil",
    "link": "https://www.nytimes.com/2025/07/30/us/politics/india-tariffs-trump-russia.html",
    "summary": "The president said Wednesday that imports from India would be subject to a 25 percent tariff as of Friday, as trade talks between the countries hit a stumbling block."
  },
  {
    "title": "Trump Targets Copper With Tariffs, Though Not as Aggressively as Expected",
    "link": "https://www.nytimes.com/2025/07/30/us/politics/trump-tariffs-copper.html",
    "summary": "The president stopped short of putting a 50 percent tariff on refined copper, as he had threatened earlier this year. The market reaction was swift anyway and prices tumbled."
  },
  {
    "title": "What Kamala Harris’s Decision for Governor Means for 2028",
    "link": "https://www.nytimes.com/2025/07/30/us/politics/kamala-harris-2028-democrats.html",
    "summary": "A Harris ally says “all options are on the table” but cautions against reading too much into the former vice president’s choice to skip the California governor race."
  },
  {
    "title": "Texas Republicans Unveil Gerrymandered House Map, Trying to Please Trump",
    "link": "https://www.nytimes.com/2025/07/30/us/politics/texas-republican-redistricting.html",
    "summary": "The proposed map would give Republicans a chance to gain five U.S. House seats, including in Houston, Dallas and along the U.S.-Mexican border."
  },
  {
    "title": "Brown University Makes a Deal With the White House to Restore Funding",
    "link": "https://www.nytimes.com/2025/07/30/us/brown-trump-deal-university-funding.html",
    "summary": "The deal, which will require Brown to spend $50 million, comes after two other Ivy League schools negotiated with the Trump administration to restore millions in research dollars."
  },
  {
    "title": "‘Loyalty Enforcer’ Laura Loomer Targets Additional Officials",
    "link": "https://www.nytimes.com/2025/07/30/us/politics/laura-loomer-trump.html",
    "summary": "The far-right activist is continuing to use her close association with President Trump to go after those she deems insufficiently loyal."
  },
  {
    "title": "Bill Barring Stock Trading for Congress Advances With Trump Carve-Out",
    "link": "https://www.nytimes.com/2025/07/30/us/politics/senate-stock-trading-bill-congress-trump-carveout.html",
    "summary": "The bill passed the committee with the support of every Democrat and only one Republican, its sponsor, who modified it to shield President Trump from a divestment requirement."
  },
  {
    "title": "Trump Administration Authorizes Deployment of National Guard at ICE Facilities",
    "link": "https://www.nytimes.com/2025/07/30/us/politics/trump-national-guard-ice.html",
    "summary": "An Immigration and Customs Enforcement memo said that National Guard troops would assist in the deportation process for migrants in their custody."
  },
  {
    "title": "Jason Momoa Prefers to Be Called a ‘Sensitive Alpha Male’",
    "link": "https://www.nytimes.com/2025/07/30/arts/television/jason-momoa-chief-of-war.html",
    "summary": "For “Chief of War,” the actor went from playing fictional superheroes to a real one in this epic passion project set in Hawaii."
  },
  {
    "title": "Gaza Hunger Presents Trump With Moral Test Familiar to Past Presidents",
    "link": "https://www.nytimes.com/2025/07/30/us/politics/trump-gaza-foreign-policy.html",
    "summary": "The crisis has echoes of past humanitarian crises that left presidents wringing their hands over how to respond."
  },
  {
    "title": "Canada to Recognize Palestinian State at the U.N. General Assembly",
    "link": "https://www.nytimes.com/2025/07/30/world/canada/canada-palestinian-state-recognition.html",
    "summary": "Canada joins France and Britain in taking similar steps, after months of increasing criticism of Israel by Prime Minister Mark Carney."
  },
  {
    "title": "Fed Keeps Rates Steady Despite Internal Divisions and Political Pressure",
    "link": "https://www.nytimes.com/2025/07/30/business/fed-meeting-july-dissent.html",
    "summary": "The central bank kept interest rates steady for a fifth straight meeting, despite badgering from President Trump. It has “made no decisions” on cutting rates at its next meeting, the Fed chair said."
  },
  {
    "title": "Treasury Secretary Says Trump Accounts Could Pave Way to Privatizing Social Security",
    "link": "https://www.nytimes.com/2025/07/30/business/bessent-trump-social-security.html",
    "summary": "Treasury Secretary Scott Bessent’s comments about the safety net program ventured onto the so-called third rail of American politics."
  },
  {
    "title": "Park Avenue Killer Bought Rifle for $1,400 From His Casino Boss",
    "link": "https://www.nytimes.com/2025/07/30/nyregion/park-avenue-killer-rifle.html",
    "summary": "The man who gunned down four people at a Park Avenue office building left anti-psychotic medication in his Las Vegas apartment, and a note."
  },
  {
    "title": "N.T.S.B. Details Evidence in Fatal Crash at Reagan National Airport",
    "link": "https://www.nytimes.com/2025/07/30/us/politics/army-helicopter-potomac-crash.html",
    "summary": "Flight instruments probably led the Black Hawk crew to believe the helicopter was lower than it actually was before the collision with a commercial airplane on Jan. 29."
  },
  {
    "title": "Canada’s Measles Cases Surpass U.S., Alberta Officials Push for State of Emergency",
    "link": "https://www.nytimes.com/2025/07/30/world/canada/canada-alberta-measles-outbreak.html",
    "summary": "Some doctors in Alberta have criticized officials for not declaring a health emergency in the western province where measles infections are surging."
  },
  {
    "title": "Brennan and Clapper: The Trump Administration Is Rewriting History of Russia and 2016",
    "link": "https://www.nytimes.com/2025/07/30/opinion/trump-obama-treason-russia-miller.html",
    "summary": "We want to set the record straight and also sound a warning."
  },
  {
    "title": "This Is the Moment Democrats Have Been Talking About for Years",
    "link": "https://www.nytimes.com/2025/07/30/opinion/antonio-delgado-kathy-hochul-democrats.html",
    "summary": "The party establishment is missing its chance to prove there is more to it than just outrage and opposition."
  },
  {
    "title": "Trump Escalated His Feud With Brazil",
    "link": "https://www.nytimes.com/2025/07/30/briefing/trump-feud-brazil-fed-rate-pause.html",
    "summary": "Also, Kamala Harris will not run for California governor. Here’s the latest at the end of Wednesday."
  },
  {
    "title": "N.Y.C. Subway and Bus Fares Are Likely to Increase to $3 in January 2026",
    "link": "https://www.nytimes.com/2025/07/30/nyregion/nyc-subway-bus-fares-2026-mta.html",
    "summary": "The proposed 10-cent increase, the first since 2023, has been long in the works and would come after the mothballing of the MetroCard."
  },
  {
    "title": "Why Did Such a Powerful Earthquake Generate Such a Weak Tsunami?",
    "link": "https://www.nytimes.com/2025/07/30/science/russia-earthquake-tsunami-physics.html",
    "summary": "The quake in Russia on Wednesday was among the strongest ever recorded — but in many places, the resulting wave was small."
  },
  {
    "title": "Laura Dahlmeier, Gold Medal-Winning German Biathlete, Dies in Rockfall",
    "link": "https://www.nytimes.com/2025/07/30/world/asia/laura-dahlmeier-olympian-died-accident-pakistan.html",
    "summary": "Ms. Dahlmeier, 31, an experienced mountaineer, was climbing in Pakistan when she was hit by falling rocks, officials said."
  },
  {
    "title": "Virginia City Councilman, Lee Vogler, Is Set on Fire in Attack, Police Say",
    "link": "https://www.nytimes.com/2025/07/30/us/lee-vogler-fire-attack-showcase-magazine-virginia.html",
    "summary": "A man burst into an office in Danville, Va., where the councilman, J. Lee Vogler, was working, doused him with a flammable liquid and set him on fire, the authorities said."
  }
]