[
  {
    "title": "In 2025, Trade Deficit in Goods Reached Record High",
    "link": "https://www.nytimes.com/2026/02/19/business/economy/imports-tariffs-trade-deficit.html",
    "summary": "Data released Thursday by the Census Bureau showed the overall trade deficit with the world narrowed, the result of an expanding trade surplus in services. The trade deficit in goods was the highest on record."
  },
  {
    "title": "Trump Mulls a North American Trade Pact Without Canada",
    "link": "https://www.nytimes.com/2026/02/19/business/economy/trump-canada-mexico-usmca-trade.html",
    "summary": "U.S. officials are threatening major changes to a trade agreement with Mexico and Canada that could upend the way business is done and leave Canada on the outs."
  },
  {
    "title": "One Year In, Trump’s Tariffs Have Not Helped U.S. Wine Businesses",
    "link": "https://www.nytimes.com/2026/02/19/dining/drinks/trump-tariffs-us-wine.html",
    "summary": "One year in, many producers say tariffs have not helped them, and some countries are rejecting U.S. wine altogether."
  },
  {
    "title": "How The Times Is Digging Into Millions of Pages of Epstein Files",
    "link": "https://www.nytimes.com/2026/02/12/insider/jeffrey-epstein-files-documents.html",
    "summary": "Two dozen journalists. A pile of pages that would reach the top of the Empire State Building. And an effort to find the next revelation in a sprawling case."
  },
  {
    "title": "After Avalanche Warnings, a Sierra Nevada Tragedy",
    "link": "https://www.nytimes.com/2026/02/19/us/avalanche-lake-tahoe-deaths.html",
    "summary": "Eight skiers were killed and one other was presumed dead in the deadliest snow disaster in modern California history. Six were found alive."
  },
  {
    "title": "In Lake Tahoe Avalanche Recovery, the Safety of Searchers Is Top Concern",
    "link": "https://www.nytimes.com/2026/02/19/us/lake-tahoe-avalanche-recovery-safety.html",
    "summary": "Weather and snow conditions will dictate when the bodies of skiers killed in the avalanche near Lake Tahoe can be retrieved from mountain. More snow is expected."
  },
  {
    "title": "Sugar Bowl Academy Says Multiple Victims Were Tied to Its Ski Resort School",
    "link": "https://www.nytimes.com/2026/02/18/us/tahoe-avalanche-skiers-sugar-bowl-school.html",
    "summary": "Many of the people on the fatal trek had ties to a ski-focused private school, Sugar Bowl Academy, in the Sierra Nevada."
  },
  {
    "title": "A Swiss Survivor on What It’s Like to Be Caught in an Avalanche",
    "link": "https://www.nytimes.com/2026/02/18/us/avalanche-survivor.html",
    "summary": "Heinz Mueller was buried under 30 feet of snow in the Swiss Alps in 1993 but made it out alive. “It’s panic,” he says."
  },
  {
    "title": "Trump Considers Building a Military Base in Gaza as Peace Plans Clash With Reality",
    "link": "https://www.nytimes.com/2026/02/19/world/middleeast/gaza-rebuilding.html",
    "summary": "Israeli strikes on Gaza have killed about 600 people since a cease-fire began, according to health officials in the territory. Many displaced Palestinians are still living in tents. And there are some 60 million tons of war debris to be cleared."
  },
  {
    "title": "Gaza’s Board of Peace: What to Know",
    "link": "https://www.nytimes.com/2026/01/19/world/middleeast/trump-board-of-peace-gaza.html",
    "summary": "President Trump’s new organization was established to oversee a Gaza cease-fire but has expanded its mandate. Critics say it could undermine the United Nations."
  },
  {
    "title": "As Trump Weighs Possible Iran Strikes, U.S. Military Moves Into Place",
    "link": "https://www.nytimes.com/2026/02/18/us/politics/us-military-iran.html",
    "summary": "President Trump has given no indication that he has made a decision about how to proceed, as diplomatic talks continue."
  },
  {
    "title": "Maps: Where the U.S. Is Building Up Military Force Near Iran",
    "link": "https://www.nytimes.com/2026/01/29/us/politics/trump-iran-us-military-maps.html",
    "summary": "President Trump has not authorized military action in Iran, but the United States has built up its presence in the region in recent weeks. Now it’s sending even more firepower."
  },
  {
    "title": "Where Things Stand on Witkoff and Kushner’s Negotiations Over Iran, Ukraine and Gaza",
    "link": "https://www.nytimes.com/2026/02/19/world/europe/witkoff-kushner-iran-ukraine-israel.html",
    "summary": "Iran, Ukraine and Gaza are in play as the Trump envoys conduct talks on all of them. But progress in each conflict is scant."
  },
  {
    "title": "How Trump Is Making Sure His Ballroom Plans Sail Through",
    "link": "https://www.nytimes.com/2026/02/19/us/politics/how-trump-is-making-sure-his-ballroom-plans-sail-through.html",
    "summary": "President Trump has installed allies — including his former receptionist — on the boards and commissions tasked with overseeing the project."
  },
  {
    "title": "Why Is Trump Dumping East Wing Rubble in a Public Park?",
    "link": "https://www.nytimes.com/2026/02/19/us/politics/trump-east-wing-rubble-in-a-public-park.html",
    "summary": "The East Potomac Golf Links is a municipal course that has been a fixture in Washington for decades. President Trump is turning it into something else."
  },
  {
    "title": "Ring’s Founder Knows You Hated That Super Bowl Ad",
    "link": "https://www.nytimes.com/2026/02/19/business/ring-super-bowl-ad-privacy.html",
    "summary": "Since the commercial aired, Jamie Siminoff has been trying to quell an outcry over privacy concerns with his doorbell cameras."
  },
  {
    "title": "A Press Freedom Case in Peril, From a Lawyer Who Helped Write It",
    "link": "https://www.nytimes.com/2026/02/19/us/politics/thedocket-dershowitz-sullivan.html",
    "summary": "Alan Dershowitz was present at the creation of New York Times v. Sullivan. Now he is asking the Supreme Court to revise or destroy it."
  },
  {
    "title": "Billy Idol Had It All, and Then He ‘Lit It With Butane’",
    "link": "https://www.nytimes.com/2026/02/19/arts/music/billy-idol-should-be-dead-documentary.html",
    "summary": "Last year, the British rocker with the iconic sneer played his biggest tour yet. At 70, he’s revealing how he survived the tough times in a new documentary."
  },
  {
    "title": "Dueling Protests at South Korean Ex-Leader’s Sentencing Highlight Political Rift",
    "link": "https://www.nytimes.com/2026/02/19/world/asia/yoon-south-korea-protests.html",
    "summary": "As a judge reprimanded former President Yoon Suk Yeol for amplifying political tribalism, demonstrators from warring camps blared slogans outside the courtroom."
  },
  {
    "title": "How Mamdani’s Income and Property Tax Proposals Could Affect New Yorkers",
    "link": "https://www.nytimes.com/2026/02/18/nyregion/mamdani-millionaire-tax-property.html",
    "summary": "Mayor Zohran Mamdani has now proposed two options that called for raising taxes. Here’s a look at each proposal and the rationale and chances for each."
  },
  {
    "title": "Mamdani Seeks Deputy Mayor to Run His Proposed Community Safety Agency",
    "link": "https://www.nytimes.com/2026/02/19/nyregion/mamdani-public-safety-department.html",
    "summary": "City Hall officials familiar with the plan said the mayor was moving closer to establishing a civilian corps that would respond to mental health emergencies."
  },
  {
    "title": "Who Would Win Gold in the Coward Olympics?",
    "link": "https://www.nytimes.com/2026/02/19/opinion/newsom-mamdani-democrats-taxes.html",
    "summary": "There are a lot of potential contestants."
  },
  {
    "title": "Our Favorite, Most Outrageous and Most Unexpected Moments of the Games",
    "link": "https://www.nytimes.com/2026/02/19/opinion/winter-olympics-roundtable.html",
    "summary": "Three writers and an Olympic medalist on the grit and grace of the winter games."
  },
  {
    "title": "The Board of Peace",
    "link": "https://www.nytimes.com/2026/02/19/briefing/the-board-of-peace.html",
    "summary": "Today we look at President Trump’s new diplomatic initiative."
  },
  {
    "title": "University of British Columbia Professors Sue School Over Political Correctness",
    "link": "https://www.nytimes.com/2026/02/19/world/americas/bc-university-dei-lawsuit-indigenous-canada.html",
    "summary": "A group of academics at the University of British Columbia say the school’s D.E.I. policies and practices, which include land acknowledgments, violate a law that requires universities to be “nonpolitical.”"
  },
  {
    "title": "A Rare Glimpse of a Sleeper Shark in Antarctic Waters",
    "link": "https://www.nytimes.com/2026/02/19/world/australia/sleeper-shark-antarctica-sighting.html",
    "summary": "Researchers filmed a 10-to-13-foot sleeper shark off the South Shetland Islands, in what may be the first recording of the species that far south."
  },
  {
    "title": "Assault on Sudanese City Bore ‘Hallmarks of Genocide,’ U.N. Finds",
    "link": "https://www.nytimes.com/2026/02/19/world/africa/sudan-un-el-fasher-rsf.html",
    "summary": "A paramilitary group in Sudan’s civil war “acted with genocidal intent” in a monthslong siege of El Fasher, according to human rights experts."
  }
]