[
  {
    "title": "Trump Repeatedly Praises North Korea’s Dictator in Meeting With South’s President",
    "link": "https://www.nytimes.com/2025/08/25/us/politics/trump-north-south-korea.html",
    "summary": "In the Oval Office, President Trump met his South Korean counterpart as the relationship between their countries has been strained."
  },
  {
    "title": "Abrego Garcia Detained Again After Government Signaled It Would Re-Deport Him",
    "link": "https://www.nytimes.com/2025/08/25/us/politics/kilmar-abrego-garcia-arrested-ice-deportation.html",
    "summary": "A judge in Maryland barred the Trump administration from immediately deporting Kilmar Armando Abrego Garcia until he had a chance to challenge the move."
  },
  {
    "title": "Israeli Hospital Strike Kills 20 in Gaza, Including 5 Journalists",
    "link": "https://www.nytimes.com/2025/08/25/world/middleeast/gaza-hospital-journalists.html",
    "summary": "Five journalists, along with medical workers, were among the dead at Nasser Hospital, where a second strike hit as ambulance crews were arriving. Prime Minister Benjamin Netanyahu said the military would investigate."
  },
  {
    "title": "What to Know About the Journalists Killed in Gaza",
    "link": "https://www.nytimes.com/2025/08/25/world/middleeast/gaza-journalists-killed-nasser-hospital.html",
    "summary": "Five journalists were killed in what local officials said was an Israeli strike on Nasser Hospital in the southern Gazan city of Khan Younis."
  },
  {
    "title": "U.N. Peacekeepers in Lebanon Face Uncertain Future",
    "link": "https://www.nytimes.com/2025/08/25/world/europe/lebanon-israel-un-unifil-peacekeeping.html",
    "summary": "With its mission up for renewal, the U.N. force is under pressure to disband even as Israeli airstrikes continue along one of the world’s most volatile borders."
  },
  {
    "title": "Lawmakers Visit Syria to Push for Repealing Sanctions Law",
    "link": "https://www.nytimes.com/2025/08/25/us/politics/lawmakers-syria-repeal-sanctions-law.html",
    "summary": "A bipartisan pair of members of Congress made the first official U.S. visit there since the fall of the Assad government, arguing that it was time to permanently lift American sanctions."
  },
  {
    "title": "Crime Gone in a Week? The Politics Behind Trump’s Federal Crackdown.",
    "link": "https://www.nytimes.com/2025/08/25/us/politics/trump-crime-federal-crackdown-politics.html",
    "summary": "President Trump is using crime as a political weapon, proclaiming quick-fix solutions to deeply rooted challenges in cities led by Democrats."
  },
  {
    "title": "Trump Orders Major Expansion of National Guard’s Role in Law Enforcement",
    "link": "https://www.nytimes.com/2025/08/25/us/politics/trump-national-guard.html",
    "summary": "An executive order released on Monday directs the creation of specialized Guard units to quell civil disturbances in each state and seeks civilian volunteers to assist federal agents in Washington."
  },
  {
    "title": "How Did Jillian Michaels End Up Here?",
    "link": "https://www.nytimes.com/2025/08/25/well/jillian-michaels-profile.html",
    "summary": "America’s toughest trainer was a proud Hollywood liberal. Now, she’s become a defining voice of the MAHA era."
  },
  {
    "title": "SpaceX Scrubs 10th Starship Test Launch Because of Lousy Weather",
    "link": "https://www.nytimes.com/2025/08/25/science/spacex-starship-launch.html",
    "summary": "Weather interfered on Monday night with the ability of Elon Musk’s company to show it could overcome setbacks faced by its Starship prototype."
  },
  {
    "title": "House Republican Seeks Documents From Epstein Estate",
    "link": "https://www.nytimes.com/2025/08/25/us/politics/epstein-files-subpoena-comer.html",
    "summary": "Representative James E. Comer of Kentucky demanded financial records, video recordings and information on meetings with famous people."
  },
  {
    "title": "In Private Deal, the D.N.C. Covered $20 Million in Harris Bills Post-Election",
    "link": "https://www.nytimes.com/2025/08/25/us/politics/kamala-harris-dnc-fundraising.html",
    "summary": "The former vice president has been raising the funds to pay all of those expenses and to keep the party whole financially. But small donors making those contributions have been left in the dark."
  },
  {
    "title": "Sinaloa Cartel Founder Known as El Mayo Pleads Guilty to Drug Trafficking",
    "link": "https://www.nytimes.com/2025/08/25/nyregion/el-mayo-sinaloa-drug-trafficking-plea.html",
    "summary": "Ismael Zambada García will spend life in prison. He had been charged with running a criminal network that sold cocaine, heroin and other illegal drugs."
  },
  {
    "title": "New Study Shows Heat Waves Make People Age Faster",
    "link": "https://www.nytimes.com/2025/08/25/climate/heat-waves-aging.html",
    "summary": "Exposure to heat waves over just two years could add up to 12 extra days of age-related health damage."
  },
  {
    "title": "Maurice Tempelsman, Diamond Magnate and Jackie Onassis’s Companion, Dies at 95",
    "link": "https://www.nytimes.com/2025/08/25/business/maurice-tempelsman-dead.html",
    "summary": "A private and politically connected gem merchant, he was thrust into the public spotlight when his personal relationship with the former first lady became known in the late 1980s."
  },
  {
    "title": "Israel’s Gaza Campaign Is Making It a Pariah State",
    "link": "https://www.nytimes.com/2025/08/25/opinion/international-world/friedman-israel-gaza-hamas.html",
    "summary": "Israel is well on its way to making itself a pariah state — to the point that Israelis will think twice about speaking Hebrew when traveling abroad."
  },
  {
    "title": "Teens Are Using Chatbots as Therapists. That’s Alarming.",
    "link": "https://www.nytimes.com/2025/08/25/opinion/teen-mental-health-chatbots.html",
    "summary": "We are deploying digital pseudo-therapists at an unprecedented scale, and those most at risk of negative outcomes are teens."
  },
  {
    "title": "Abrego Garcia Was Detained Again",
    "link": "https://www.nytimes.com/2025/08/25/briefing/abrego-garcia-was-detained-again.html",
    "summary": "Also, heat waves could be making you age faster. Here’s the latest at the end of Monday."
  },
  {
    "title": "Kennedy Center’s New Dance Director Criticized ‘Woke’ Ballet Culture",
    "link": "https://www.nytimes.com/2025/08/25/arts/dance/kennedy-center-stephen-nakagawa.html",
    "summary": "Stephen Nakagawa, a former dancer with the Washington Ballet, wrote a letter to the leader of the arts center complaining about “radical leftist ideologies in ballet.”"
  },
  {
    "title": "‘I Could Literally Be Left Behind to Die’: How a Student With a Disability Changed the Law",
    "link": "https://www.nytimes.com/2025/08/25/us/students-disability-evacuation-plans.html",
    "summary": "Schools across the country face increasing threats, but many students with disabilities don’t have a way to evacuate."
  },
  {
    "title": "Sheila R. Canby, Curator at the Met Who Humanized Islam, Dies at 76",
    "link": "https://www.nytimes.com/2025/08/25/arts/sheila-r-canby-dead.html",
    "summary": "In overseeing the expansion of the Islamic art galleries at the Metropolitan Museum, she countered hostile narratives about the Muslim world that arose after 9/11."
  },
  {
    "title": "Scientists Find a Quadruple Star System in Our Cosmic Backyard",
    "link": "https://www.nytimes.com/2025/08/25/science/quadruple-star-system.html",
    "summary": "Two of the objects in the arrangement are cold brown dwarfs, which will serve as a benchmark for others throughout the Milky Way."
  }
]