[
  {
    "title": "In Trump’s Second Term, Far-Right Agenda Enters the Mainstream",
    "link": "https://www.nytimes.com/2025/08/23/us/politics/trump-far-right.html",
    "summary": "President Trump has embraced an array of far-right views and talking points in ways that have delighted many right-wing activists who have long supported those ideas."
  },
  {
    "title": "A Muted Homecoming for Kilmar Abrego Garcia",
    "link": "https://www.nytimes.com/2025/08/23/us/kilmar-abrego-garcia-returns-home.html",
    "summary": "Mr. Abrego Garcia, who was wrongfully deported to El Salvador, is keeping a low profile as his lawyers prepare to fight the Trump administration’s proposal to deport him to Uganda."
  },
  {
    "title": "Fed Officials Try to Keep Focus on Economy as Trump Intensifies Attacks",
    "link": "https://www.nytimes.com/2025/08/23/business/powell-fed-trump-economy-jackson-hole.html",
    "summary": "The administration’s effort to oust a Fed governor as part of a pressure campaign for lower borrowing costs created an inescapable distraction at this year’s Jackson Hole conference."
  },
  {
    "title": "Intel's Downfall Underlines How Even Tech Giants Can Fade",
    "link": "https://www.nytimes.com/2025/08/23/technology/intel-computer-chips-tech-ai-trump.html",
    "summary": "The Silicon Valley chipmaker’s journey from icon to a government project, with the sale of a 10 percent stake to the Trump administration, underlines how even the mightiest in tech can fall."
  },
  {
    "title": "After Gaza Famine Report, U.S. Is Mostly Silent and Israel Defiant",
    "link": "https://www.nytimes.com/2025/08/23/world/middleeast/gaza-famine-report-us-reaction.html",
    "summary": "The White House has not commented on a report finding famine in Gaza. Analysts say that absent U.S. pressure, Israel is unlikely to change course."
  },
  {
    "title": "Justice Dept. Sent Congress Epstein Files That Were Already Public, Democrats Say",
    "link": "https://www.nytimes.com/2025/08/23/us/politics/congress-epstein-files-public.html",
    "summary": "The ‘overwhelming majority’ of the material provided to a key investigative committee in response to a subpoena had already been released, according to Democratic members."
  },
  {
    "title": "5 Takeaways From Ghislaine Maxwell’s Interview About Jeffrey Epstein",
    "link": "https://www.nytimes.com/2025/08/22/us/politics/ghislaine-maxwell-transcript-takeaways.html",
    "summary": "In a courthouse interview with the deputy attorney general, Ms. Maxwell, who has been convicted of sex trafficking, maintained that President Trump and other famous figures were not involved."
  },
  {
    "title": "Can Redesigns of Wagner Park and East River Park Save Lower Manhattan?",
    "link": "https://www.nytimes.com/2025/08/23/headway/nyc-manhattan-park-redesigns-wagner-east-river.html",
    "summary": "Two new parks fortifying the city’s coastline survived a bureaucratic gantlet that reveals why progress so often feels stuck."
  },
  {
    "title": "The ‘Lioness’ at the Center of a City Hall Battered by Scandal",
    "link": "https://www.nytimes.com/2025/08/23/nyregion/ingrid-lewis-martin-eric-adams.html",
    "summary": "Before Ingrid Lewis-Martin was indicted on bribery charges, she was one of the most powerful people in Mayor Eric Adams’s orbit. Now she may hasten his fall in New York."
  },
  {
    "title": "New York Is a Big City. Its Graft Has Become Small-Town Stuff.",
    "link": "https://www.nytimes.com/2025/08/22/nyregion/new-york-city-corruption.html",
    "summary": "The city’s corruption once had ambition to match its soaring skyscrapers. Indictments this week described cut-rate schemes with far lower returns — and there was that cash in a potato-chip bag."
  },
  {
    "title": "The Menendez Brothers’ Momentum Built for Years. It Was Dashed in 2 Days.",
    "link": "https://www.nytimes.com/2025/08/23/arts/menendez-brothers-supporters-parole-denied.html",
    "summary": "Young people energized a push for redemption — and the release of Lyle and Erik. Parole commissioners took a different view and a harder line."
  },
  {
    "title": "Where U.S. Medicines Are Made and How Trump’s Tariffs Could Affect Them",
    "link": "https://www.nytimes.com/2025/08/23/health/prescription-drugs-manufacturing-tariffs.html",
    "summary": "President Trump’s planned pharmaceutical tariffs threaten to hit many of the most common and well-known drugs that Americans take."
  },
  {
    "title": "Faced With Trump’s English Mandate, Mexico’s Truckers Report to Class",
    "link": "https://www.nytimes.com/2025/08/23/world/americas/mexico-english-truckers-trump.html",
    "summary": "Companies, fearing penalties that could put them out of business, race to make sure their drivers have enough English to communicate with U.S. officials."
  },
  {
    "title": "At Lady Gaga’s Mayhem Ball, a Pop Star Is Reborn",
    "link": "https://www.nytimes.com/2025/08/23/arts/music/lady-gaga-mayhem-ball-review.html",
    "summary": "The singer and songwriter proved she’s operating at the peak of her powers during a two-and-a-half-hour set that drew sharp connections between her past and present."
  },
  {
    "title": "Texas Legislature Gives Final Approval to Redistricting Map Favoring Republicans",
    "link": "https://www.nytimes.com/2025/08/23/us/texas-redistricting.html",
    "summary": "The map’s passage was a major victory in President Trump’s push to get Republican state leaders to help his party keep control of the U.S. House."
  },
  {
    "title": "How Redistricting Wars Could Give the G.O.P. Up to 7 Seats",
    "link": "https://www.nytimes.com/2025/08/22/us/redistricting-gerrymandering-texas-california-stakes.html",
    "summary": "As a handful of states have made moves and begun discussing redrawing their maps, here’s what’s at stake."
  },
  {
    "title": "The White House Wants Indiana to Redistrict. Republicans There Are Split.",
    "link": "https://www.nytimes.com/2025/08/22/us/indiana-redistricting-congress-republicans.html",
    "summary": "As President Trump asks Republican-led states to redraw congressional maps, some Indiana conservatives are pushing back. “They should leave it alone,” one legislator said."
  },
  {
    "title": "Green Funerals Are Becoming a Popular Choice for Environmentally Conscious Americans",
    "link": "https://www.nytimes.com/2025/08/23/health/green-natural-burials.html",
    "summary": "More Americans are choosing burials in which everything is biodegradable."
  },
  {
    "title": "We Can Disagree on Trump’s Motives. But a Pattern Is Still Emerging.",
    "link": "https://www.nytimes.com/2025/08/23/opinion/trump-voting-mail-election-stolen.html",
    "summary": "Just how can we tell which of Trump’s moves matters?"
  },
  {
    "title": "Would You Believe This Spy’s Name?",
    "link": "https://www.nytimes.com/2025/08/23/opinion/spy-fiction-books-names-foreign.html",
    "summary": "Spy fiction thrives on vermismilitude — shy are so many writers so incompetent when it comes to naming foriegn characters?"
  },
  {
    "title": "Florida Paints Over Rainbow Memorial for Pulse Nightclub Shooting Victims",
    "link": "https://www.nytimes.com/2025/08/23/us/politics/orlando-pulse-shooting-rainbow-crosswalk-memorial.html",
    "summary": "The mayor of Orlando, Fla., said that the crosswalk mural, which featured the Pride flag’s colors, was removed overnight this week. Community members protested and have, for now, repainted it."
  },
  {
    "title": "Police Release Names of 5 Killed in Tour Bus Crash Near Buffalo",
    "link": "https://www.nytimes.com/2025/08/23/nyregion/new-york-buffalo-bus-crash.html",
    "summary": "Those killed in the accident on Friday ranged in age from 22 to 65 and included three people from New Jersey, a Chinese student at Columbia University and a person from India."
  },
  {
    "title": "Flat Fire in Oregon Doubles in 24 Hours to More Than 18,000 Acres",
    "link": "https://www.nytimes.com/2025/08/23/weather/flat-fire-oregon.html",
    "summary": "More than 1,000 homes in Oregon were under some kind of evacuation because of the Flat fire, which was one of many wildfires burning in the West, amid hot weather."
  },
  {
    "title": "The All-Female Hacker House Trying to Break A.I.’s Glass Ceiling",
    "link": "https://www.nytimes.com/2025/08/23/business/ai-female-hackers-foundher-house.html",
    "summary": "FoundHer House, a home in San Francisco’s Glen Park neighborhood, is the rare all-female hacker house where residents are creating a supportive community to build their start-ups."
  }
]