[
  {
    "title": "For Shooting Suspect, a Long Path of Conflict From Afghanistan to America",
    "link": "https://www.nytimes.com/2025/11/27/us/guard-shooting-suspect-profile.html",
    "summary": "Rahmanullah Lakanwal was among the Afghans who came to the United States after the Taliban takeover of Afghanistan. Earlier, he served in a paramilitary unit that worked with U.S. forces."
  },
  {
    "title": "Trump Uses National Guard Shooting to Cast Suspicion on Refugees",
    "link": "https://www.nytimes.com/2025/11/27/us/politics/trump-national-guard-shooting.html",
    "summary": "President Trump claimed there were “a lot of problems with Afghans,” without providing evidence, as his administration announced that it was implementing new immigration guidelines."
  },
  {
    "title": "Hong Kong’s Worst Fire in Decades Fuels Scrutiny of Safety Lapses",
    "link": "https://www.nytimes.com/2025/11/27/world/asia/hong-kong-fire-tai-po-apartment-buildings.html",
    "summary": "The authorities said flammable netting and foam boards may have fueled the city’s deadliest blaze in nearly 80 years, killing more than 90 and prompting arrests."
  },
  {
    "title": "‘No Alarm Went Off’: Hong Kong Fire Survivor Recounts Harrowing Escape",
    "link": "https://www.nytimes.com/2025/11/27/world/asia/hong-kong-fire-survivors-escape.html",
    "summary": "Many windows were covered, preventing residents from seeing the fire and smoke, one survivor said."
  },
  {
    "title": "U.S. Has Limited Knowledge of Those It Kills in Boat Strikes",
    "link": "https://www.nytimes.com/2025/11/27/us/politics/us-military-boat-strikes.html",
    "summary": "The U.S. military has killed more than 80 people since the campaign began in early September. But it does not know who specifically is being killed."
  },
  {
    "title": "Why Is the U.S. Threatening Venezuela?",
    "link": "https://www.nytimes.com/video/world/americas/100000010549651/trump-venezuela-pressure-campaign.html",
    "summary": "Venezuela doesn’t play a large role in the drug trade to the United States, so what is motivating the massive military buildup? Julian E. Barnes, who reports on intelligence and international security, discusses the issues with our senior writer Katrin Bennhold."
  },
  {
    "title": "U.S. to Press Europe and Other Allies on Immigration, Document Says",
    "link": "https://www.nytimes.com/2025/11/26/us/politics/trump-rubio-mass-migration.html",
    "summary": "American diplomats were told to raise U.S. concerns about “violent crimes associated with people of a migration background.”"
  },
  {
    "title": "Where the Waters Are Rough, a Fishing Town Confronts Trump’s Priorities",
    "link": "https://www.nytimes.com/2025/11/27/us/politics/newport-oregon-ice.html",
    "summary": "First, Newport, Ore., lost its Coast Guard rescue chopper. Then came the swirl of rumors and evidence that Immigration and Customs Enforcement was coming to town."
  },
  {
    "title": "Gen X-ers Have Money to Spend. Why Are Retailers Ignoring Them?",
    "link": "https://www.nytimes.com/2025/11/27/business/gen-x-holiday-spending.html",
    "summary": "Three in four Americans ages 45 to 60 say they expect to overspend for the holidays. They’re “sort of like the glue within the consumer spectrum.”"
  },
  {
    "title": "Black Friday Deals Can Put People in Debt. Here’s How to Manage It.",
    "link": "https://www.nytimes.com/2025/11/27/business/black-friday-shopping-debt.html",
    "summary": "The convenience of one-click purchases and “buy now, pay later” loans is making it easier for people to shop — and shop and shop — during the holidays."
  },
  {
    "title": "I’ve Written About Loads of Scams. This Phone Scam Almost Got Me.",
    "link": "https://www.nytimes.com/2025/09/18/nyregion/zelle-chase-banking-scam.html",
    "summary": "The caller ID said “Chase Bank,” and the man on the line said I might be a victim of fraud. His supervisor would explain."
  },
  {
    "title": "Did a Brooklyn Couple Kill a Neighbor’s Trees for a Better View in Maine?",
    "link": "https://www.nytimes.com/2025/09/11/us/trees-poison.html",
    "summary": "Maine’s Board of Pesticides Control says two summer residents poisoned a neighbor’s trees so the couple, both Martha Stewart associates, could have a harbor view. They deny it."
  },
  {
    "title": "11 Women, 9 Dogs, Not Much Drama (and No Guys)",
    "link": "https://www.nytimes.com/2025/08/07/well/eleven-women-nine-dogs-not-much-drama-and-no-guys.html",
    "summary": "These retired women in Texas have been through infertility, illness, layoffs, addiction and disappointing marriages. Now they are trying to create a utopia just for themselves."
  },
  {
    "title": "Penn & Teller’s Secret to a 50-Year Partnership",
    "link": "https://www.nytimes.com/2025/08/17/arts/television/penn-teller-magicians-50-years.html",
    "summary": "As their magic act hits 50 years, they’re bigger than ever. They say their secret is not to socialize. But misdirection is also their love language."
  },
  {
    "title": "My Parents Expected to Be Retired. Instead, They Are Raising My Sister’s Kids.",
    "link": "https://www.nytimes.com/2025/05/18/magazine/grandparents-families-children-kids.html",
    "summary": "My mom and dad joined the millions of Americans who parent their children’s children — a beautiful responsibility that comes at a high cost."
  },
  {
    "title": "A Professor’s Final Gift to Her Students: Her Life Savings",
    "link": "https://www.nytimes.com/2025/05/11/us/cris-hassold-professor-new-college-will.html",
    "summary": "Cris Hassold, a professor at New College of Florida for 50 years, left a mark on her 31 favorite students. “I think about her almost every day,” one said."
  },
  {
    "title": "Sean Duffy Longs for the ‘Golden Days’ of Air Travel. What Was That Like?",
    "link": "https://www.nytimes.com/2025/11/27/travel/air-travel-sean-duffy.html",
    "summary": "Back in the ’50s and ’60s, passengers (well-dressed, of course, and with perfect manners) could count on hot meals on china, plenty of legroom, the occasional piano bar, even wool blankets. Those days are gone."
  },
  {
    "title": "Trump Cut Europe Out of Ukraine Talks. Here’s How Europe Pushed Back.",
    "link": "https://www.nytimes.com/2025/11/27/world/europe/europe-ukraine-trump.html",
    "summary": "European leaders were blindsided by President Trump’s 28-point-plan to end the Ukraine war, setting off a dash for influence."
  },
  {
    "title": "France Creates Voluntary Military Service as Europe Faces Russian Threat",
    "link": "https://www.nytimes.com/2025/11/27/world/europe/france-military-service.html",
    "summary": "The effort, aimed at young people, came after an army chief angered many by saying the country must accept the possible loss of “our children” in a future war."
  },
  {
    "title": "Putin Defends Witkoff Against Accusations of Pro-Russia Bias",
    "link": "https://www.nytimes.com/2025/11/27/world/europe/putin-witkoff-trump.html",
    "summary": "The Russian leader called the U.S. special envoy “an intelligent man” who is properly representing his country in peace negotiations."
  },
  {
    "title": "Carney Lifts Climate Laws for New Alberta Pipeline",
    "link": "https://www.nytimes.com/2025/11/27/world/canada/alberta-oil-pipeline-climate-change.html",
    "summary": "Prime Minister Mark Carney reached a tentative deal with the province as part of his program to curb the country’s economic dependence on the United States."
  },
  {
    "title": "In Turkey, Pope Seeks to Soothe an Ancient Christian Divide",
    "link": "https://www.nytimes.com/2025/11/28/world/middleeast/pope-leo-turkey-church.html",
    "summary": "In Istanbul, Pope Leo XIV will meet the patriarch of the Eastern Orthodox Church to show amity between two of the world’s largest Christian groups."
  },
  {
    "title": "Pope Leo Visits Turkey on His First Trip as Pontiff",
    "link": "https://www.nytimes.com/2025/11/27/world/europe/pope-leo-trip-pictures.html",
    "summary": "The pope started his six-day trip, which will also include a visit to Lebanon."
  },
  {
    "title": "SNAP Helping Families Put Thanksgiving Dinner on the Table",
    "link": "https://www.nytimes.com/2025/11/27/us/politics/snap-benefits-trump-thanksgiving.html",
    "summary": "SNAP benefits helped Leanna Nieves of Haverhill, Mass., buy Thanksgiving dinner for her family, but she used the day to set aside what have been chronic worries about the federal program."
  },
  {
    "title": "Gene Therapy Offer a Cure for Babies With the Deadly ‘Bubble Boy Disease’",
    "link": "https://www.nytimes.com/2025/11/27/well/bubble-boy-disease-gene-therapy.html",
    "summary": "“Bubble boy disease” was once a death sentence. A scientific breakthrough changed that."
  },
  {
    "title": "Robert A.M. Stern, Architect Who Reinvented Prewar Splendor, Dies at 86",
    "link": "https://www.nytimes.com/2025/11/27/arts/design/robert-am-stern-dead.html",
    "summary": "He designed museums, schools and libraries before winning international acclaim late in life for 15 Central Park West in Manhattan, hailed as a rebirth of the luxury apartment building."
  },
  {
    "title": "Robert A.M. Stern Is Still Dreaming of a Fresh New York",
    "link": "https://www.nytimes.com/2025/11/10/arts/design/robert-am-stern-2020-book-architecture.html",
    "summary": "The sharp-tongued architect and professor built Manhattan’s most luxurious towers, but his new book shuttles from Billionaires’ Row to the Bronx. (Plus, what he thinks of Rem and Zaha.)"
  },
  {
    "title": "The Uniquely American Heartbreak of Yet Another Tragedy",
    "link": "https://www.nytimes.com/2025/11/27/opinion/national-guard-shot-dc.html",
    "summary": "The National Guard members shot in Washington are the latest victims of a political violence permeating our society."
  },
  {
    "title": "Trump’s Greedy Thanksgiving",
    "link": "https://www.nytimes.com/2025/11/27/opinion/culture/trump-billionaires-thanksgiving.html",
    "summary": "This year, it’s not about giving back; it’s about getting yours."
  },
  {
    "title": "Louvre Raising Ticket Prices for Non-European Visitors",
    "link": "https://www.nytimes.com/2025/11/27/world/europe/louvre-higher-ticket-prices.html",
    "summary": "From Jan. 14, visitors to the museum from outside the European Economic Area will pay 45 percent more for entry to help finance its ambitious renovation plan."
  },
  {
    "title": "The British Public Thinks Immigration Is Up. It’s Actually Down, Sharply.",
    "link": "https://www.nytimes.com/2025/11/27/world/europe/uk-immigration-statistics.html",
    "summary": "Net migration to Britain has fallen by almost 80 percent from its 2023 peak, according to data released on Thursday."
  },
  {
    "title": "Labubu and KPop Demon Hunters Join Macy’s Thanksgiving Day Parade",
    "link": "https://www.nytimes.com/2025/11/27/nyregion/macys-thanksgiving-day-parade.html",
    "summary": "Crowds in New York City bundled up to take in the latest version of a tradition that has run for nearly a century."
  },
  {
    "title": "What to Know About the Coup in Guinea-Bissau",
    "link": "https://www.nytimes.com/2025/11/27/world/africa/guinea-bissau-coup.html",
    "summary": "The opposition has accused the president of putting a general in charge of the government so that he could stay in power and lead by proxy."
  }
]