[
  {
    "title": "Businesses Are Cashing In on Trump’s Tax Cuts",
    "link": "https://www.nytimes.com/2025/12/12/us/politics/trumps-corporate-tax-cuts-economy.html",
    "summary": "Corporate tax revenue has quickly dipped since Republicans passed tax cuts this summer. But economists think these tax breaks might be worth it."
  },
  {
    "title": "Behind the Supreme Court’s Push to Expand Presidential Power",
    "link": "https://www.nytimes.com/video/us/100000010574596/behind-the-supreme-courts-push-to-expand-presidential-power.html",
    "summary": "For more than a decade, the Supreme Court’s conservative majority has chipped away at Congress’s power to insulate independent agencies from politics. Now, the court has signaled its willingness to expand presidential power once again."
  },
  {
    "title": "Trump Commuted David Gentile’s Sentence. His Victims Are Seething.",
    "link": "https://www.nytimes.com/2025/12/12/nyregion/david-gentile-trump-commutation.html",
    "summary": "David Gentile spent just days in prison for his conviction in what prosecutors described as a $1.6 billion scheme that defrauded thousands of investors."
  },
  {
    "title": "A Seized Oil Tanker Off Venezuela and the Big Business of Dark Fleet Smuggling",
    "link": "https://www.nytimes.com/2025/12/12/business/energy-environment/venezuela-oil-tanker-dark-fleet.html",
    "summary": "The U.S. seizure of a vessel off Venezuela is likely to squeeze the country’s government, but do little to counter the tankers that secretively move oil from sanctioned countries."
  },
  {
    "title": "What to Know About Trump’s Seizure of an Oil Tanker Near Venezuela",
    "link": "https://www.nytimes.com/2025/12/11/us/politics/trump-venezuela-tanker.html",
    "summary": "The tanker was headed eastward and had recently carried Iranian oil. The seizure is an escalation in President Trump’s military pressure campaign against Venezuela’s leader, Nicolás Maduro."
  },
  {
    "title": "Troops Involved in Boat Strikes Face a ‘Moral Injury’ Risk, Experts Say",
    "link": "https://www.nytimes.com/2025/12/12/us/troops-involved-in-boat-strikes-face-a-moral-injury-risk-experts-say.html",
    "summary": "Troops who play a part in deadly missions that they see as wrong or unjustified may suffer deep psychological harm as a result, research has shown."
  },
  {
    "title": "China Is Getting Much of What It Wants From the U.S., Including Chips",
    "link": "https://www.nytimes.com/2025/12/12/world/asia/nvidia-china-trump-security-japan.html",
    "summary": "For China, President Trump’s moves to loosen chip controls, soften U.S. rhetoric and stay silent on tensions with Japan amount to a rare string of strategic gains."
  },
  {
    "title": "Historic Shift Underway in China’s Economy as Investment Slump Deepens",
    "link": "https://www.nytimes.com/2025/12/12/business/china-investment-economy.html",
    "summary": "Investment in manufacturing, infrastructure and property is expected to fall this year, a remarkable turn for an economy whose growth reshaped the world."
  },
  {
    "title": "Democrats Release New Epstein Photos Documenting Ties to Trump, Clinton and Others",
    "link": "https://www.nytimes.com/2025/12/12/us/politics/jeffrey-epstein-photos-estate.html",
    "summary": "The images, released without context by Democrats on the Oversight Committee, reveal little new about the deceased sex offender’s ties to prominent men in politics, entertainment and finance."
  },
  {
    "title": "Kids Rarely Read Whole Books Anymore. Even in English Class.",
    "link": "https://www.nytimes.com/2025/12/12/us/high-school-english-teachers-assigning-books.html",
    "summary": "When teachers do assign whole books, they often choose from a stagnant list of classics."
  },
  {
    "title": "How Matt Dinniman’s ‘Dungeon Crawler Carl’ Became a Blockbuster",
    "link": "https://www.nytimes.com/2025/12/12/books/review/dungeon-crawler-carl-matt-dinniman.html",
    "summary": "Matt Dinniman introduced his series about an alien reality TV show free on the web. But readers ate up the goofy humor, now to the tune of 6 million books sold."
  },
  {
    "title": "Ukrainians, Worrying More About Power Cuts, See U.S. Peace Push as Just Noise",
    "link": "https://www.nytimes.com/2025/12/12/world/europe/ukraine-power-outages-peace-plan-russia.html",
    "summary": "Many understand the dance their leaders must perform to appease President Trump. But that doesn’t make them any less weary of the rounds and rounds of talks."
  },
  {
    "title": "How Power Cuts Are Affecting Ukrainians",
    "link": "https://www.nytimes.com/video/world/europe/100000010573084/how-power-cuts-are-affecting-ukrainians.html",
    "summary": "Russia has been targeting energy infrastructure in Ukraine, leaving multiple cities without electricity. Kim Barker, who’s been covering the war, gives us a glimpse into the daily life of Ukrainians living with power cuts."
  },
  {
    "title": "How Ukraine Has Responded to Trump’s Peace Plan and Russia’s Demands for Territory",
    "link": "https://www.nytimes.com/2025/12/12/world/europe/ukraine-trump-peace-plan-counterproposal.html",
    "summary": "A Ukrainian peace plan, sent this week to Washington, pushes back against President Trump’s proposal that Ukraine give up more land for peace."
  },
  {
    "title": "Russia Sues Holder of Frozen Assets Europe Wants for Ukraine Loan",
    "link": "https://www.nytimes.com/2025/12/12/world/europe/russia-ukraine-frozen-assets-belgium-euroclear.html",
    "summary": "The lawsuit was a warning to European officials who are racing to agree to a plan to use Russian government assets in Europe to lend money to Ukraine."
  },
  {
    "title": "Elon Musk Tests Europe’s Willingness to Enforce Its Online Laws",
    "link": "https://www.nytimes.com/2025/12/12/technology/elon-musk-europe.html",
    "summary": "Backed by White House officials, the tech billionaire has lashed out at the European Union after his social media platform X was fined last week."
  },
  {
    "title": "Paramount Says Money Is No Object. Warner Bros. Isn’t Convinced.",
    "link": "https://www.nytimes.com/2025/12/12/business/paramount-warner-bros-netflix-deal.html",
    "summary": "Larry Ellison is backstopping Paramount’s bid for Warner Brothers, but Warner Brothers is concerned that the billionaire has not provided a personal guarantee to pay."
  },
  {
    "title": "Record Flooding Forces Rescues Across Western Washington",
    "link": "https://www.nytimes.com/2025/12/12/us/washington-flooding-rain-atmospheric-river.html",
    "summary": "A major river in the region was set to crest on Friday morning, with more rain on the way."
  },
  {
    "title": "Harold Hamm, Oklahoma Oil Tycoon, Allies With Trump to Reshape U.S. Energy",
    "link": "https://www.nytimes.com/2025/12/12/business/energy-environment/trump-harold-hamm-oil-gas.html",
    "summary": "Harold Hamm, an Oklahoma oil tycoon, has played a central role in reshaping energy policy by allying himself with President Trump."
  },
  {
    "title": "Soon He’ll Be Mayor Mamdani. To His Soccer Teammates, He Was Just Z.",
    "link": "https://www.nytimes.com/2025/12/12/nyregion/mamdani-soccer-talking-headers-brooklyn.html",
    "summary": "Zohran Mamdani isn’t just a superfan. Until recently, he was a key player on the Talking Headers, a rec-league team in Brooklyn."
  },
  {
    "title": "Review of Medical Cannabis Use Finds Little Evidence of Benefit",
    "link": "https://www.nytimes.com/2025/12/12/health/medical-cannabis-benefits.html",
    "summary": "Researchers found a chasm between the health reasons for which the public seeks out cannabis and what gold-standard science actually shows about its effectiveness."
  },
  {
    "title": "Does Paramount’s David Ellison Know What He’s Doing?",
    "link": "https://www.nytimes.com/2025/12/12/opinion/david-ellison-paramount-warner-trump.html",
    "summary": "David Ellison is cozying up to Trump in his effort to save Hollywood. It’s a risky strategy for our democracy."
  },
  {
    "title": "Why Is It So Hard to Build Big Things?",
    "link": "https://www.nytimes.com/2025/12/12/briefing/why-is-it-so-hard-to-build-big-things.html",
    "summary": "Today we look at the state of American inertia."
  },
  {
    "title": "How Philadelphia is Addressing Crime and Safety Through Environmental Design",
    "link": "https://www.nytimes.com/2025/12/12/headway/philadelphia-gun-violence-environmental-design.html",
    "summary": "Environmental design interventions play a subtle role in helping the city reduce gun violence."
  },
  {
    "title": "Tech Support Scammers Stole $85,000 From Him. His Bank Refused a Refund.",
    "link": "https://www.nytimes.com/2025/12/12/business/tech-support-scam-bank-fraud.html",
    "summary": "A retired lawyer lost the money in a tech support scam, a type of online fraud that is surging. Citibank said it couldn’t recover the funds, which criminals wired from inside his account."
  },
  {
    "title": "A Trickle of Aid Reaches a Captured, War-Ravaged City in Sudan",
    "link": "https://www.nytimes.com/2025/12/12/world/africa/sudan-fasher-food-aid.html",
    "summary": "A local group negotiated permission from the paramilitary force controlling El Fasher, offering a rare glimpse into conditions after a massacre."
  },
  {
    "title": "King Charles to Speak About His Cancer in Televised Message",
    "link": "https://www.nytimes.com/2025/12/12/world/europe/king-charles-cancer-update.html",
    "summary": "A video of the king discussing his “recovery journey” will air on Channel 4 on Friday as part of a national cancer awareness campaign in the U.K."
  }
]