[
  {
    "title": "How Rubio Tried to Bring a Pro-Russia Peace Plan to Middle Ground",
    "link": "https://www.nytimes.com/2025/11/24/us/politics/trump-russia-ukraine-peace-plan-middle-ground.html",
    "summary": "While President Trump attacked the Ukrainians, Secretary of State Marco Rubio flew to Geneva to seize control of negotiations that were going off the rails."
  },
  {
    "title": "As Ukraine Sets ‘Red Lines,’ a U.S. Peace Plan Is Slimmed Down",
    "link": "https://www.nytimes.com/2025/11/24/world/europe/ukraine-zelensky-rubio-russia-peace-plan.html",
    "summary": "Washington and Kyiv said that “highly productive” discussions over a proposal to end the war between Russia and Ukraine would continue."
  },
  {
    "title": "What to Know About Trump’s Peace Plan for Russia and Ukraine",
    "link": "https://www.nytimes.com/2025/11/24/us/politics/trump-peace-plan-russia-ukraine.html",
    "summary": "U.S. officials have responded to a storm of criticism about the plan by insisting that it is still a work in progress."
  },
  {
    "title": "Army Chief Says France Must ‘Accept Losing Our Children,’ Igniting Uproar",
    "link": "https://www.nytimes.com/2025/11/24/world/europe/france-voluntary-military-service.html",
    "summary": "The furor erupted as President Emmanuel Macron is expected to present a plan for paid, voluntary military service to bolster the armed forces against the threat from Russia."
  },
  {
    "title": "Schumer Faces Pushback From ‘Fight Club’ Group of Senate Democrats",
    "link": "https://www.nytimes.com/2025/11/24/us/politics/schumer-democrats-senate-fight-club.html",
    "summary": "A group of liberal senators is quietly challenging the minority leader over his approach to the midterms and President Trump, in a sign of the party’s deep frustration."
  },
  {
    "title": "Judge Tosses Criminal Charges Against James Comey and Letitia James",
    "link": "https://www.nytimes.com/2025/11/24/nyregion/james-comey-case-dismissed.html",
    "summary": "The decision is a setback for the president’s efforts to wield the criminal justice system against his perceived enemies."
  },
  {
    "title": "Mark Kelly Under Pentagon Investigation for ‘Illegal Orders’ Video",
    "link": "https://www.nytimes.com/2025/11/24/us/politics/mark-kelly-pentagon-investigation.html",
    "summary": "The defense secretary called the senator’s remarks urging troops not to follow illegal orders “despicable, reckless, and false.”"
  },
  {
    "title": "At a Congressional Hearing, Residents Detail the Trauma of the L.A. Raids",
    "link": "https://www.nytimes.com/2025/11/24/us/ice-raids-congressional-hearing.html",
    "summary": "More than two dozen people described the upheaval the raids had caused in immigrant communities and aired accusations of mistreatment by agents."
  },
  {
    "title": "Trump Is Considering a Push to Extend Obamacare Subsidies",
    "link": "https://www.nytimes.com/2025/11/24/us/politics/trump-obamacare-subsidies-health-care.html",
    "summary": "President Trump has not made a final decision. But he is under pressure to address the cost of health care, which for many Americans will jump if the subsidies expire."
  },
  {
    "title": "How the Coast Guard Revised Its Policy on Swastikas, Nooses and Bullying",
    "link": "https://www.nytimes.com/2025/11/24/us/coast-guard-hate-policy.html",
    "summary": "After days of backlash, the Homeland Security Department said hateful and violent behavior would not be tolerated."
  },
  {
    "title": "Easy Thanksgiving Recipes | Thanksgiving Recipes 2025 | NYT Cooking",
    "link": "https://cooking.nytimes.com/article/easy-thanksgiving-recipes",
    "summary": "These simple recipes for roast turkey, stuffing, pie crust and more will set you up for a spectacular meal."
  },
  {
    "title": "Mamdani Response to Protest Inflames Tensions with Jewish Leaders",
    "link": "https://www.nytimes.com/2025/11/24/nyregion/mamdani-synagogue-protest.html",
    "summary": "The mayor-elect chastised a synagogue that hosted an event promoting migration to Israel and settlements in occupied territories. His stance further tested his strained relationship with pro-Israel Jews."
  },
  {
    "title": "Health Issues in Middle Age Can Be Linked to Pregnancy Years Earlier",
    "link": "https://www.nytimes.com/2025/11/24/well/pregnancy-complications-heart-health.html",
    "summary": "Women with common pregnancy complications are at increased risk for cardiovascular and metabolic health problems later in life. But many patients remain unaware of the connection."
  },
  {
    "title": "Sleep Apnea Linked to Parkinson’s Disease, New Study Finds",
    "link": "https://www.nytimes.com/2025/11/24/well/mind/sleep-apnea-parkinsons-disease.html",
    "summary": "Those with the sleep condition were more likely to develop Parkinson’s disease. But one treatment was found to help."
  },
  {
    "title": "Ozempic Drug Fails to Quell Alzheimer’s in Novo Nordisk Trials",
    "link": "https://www.nytimes.com/2025/11/24/health/ozempic-wegovy-alzheimers-novo-nordisk.html",
    "summary": "The studies were a significant setback for the optimistic view that semaglutide and other GLP-1 drugs could help prevent a number of brain diseases."
  },
  {
    "title": "Viola Fletcher, Oldest Survivor of the Tulsa Race Massacre, Dies at 111",
    "link": "https://www.nytimes.com/2025/11/24/us/viola-fletcher-dead.html",
    "summary": "At 7, she bore witness to one of American history’s most violent spasms of racial violence. She was 106 when the nation reckoned with the crime."
  },
  {
    "title": "Ted Danson and Mary Steenburgen Star in a Love Story, Onscreen and Off",
    "link": "https://www.nytimes.com/2025/11/24/arts/television/ted-danson-and-mary-steenburgen-man-on-the-inside.html",
    "summary": "Married for three decades, the actors get together as characters in the second season of “A Man on the Inside.”"
  },
  {
    "title": "5 Minutes That Will Make You Love Musicals",
    "link": "https://www.nytimes.com/2025/11/24/theater/musicals-broadway-theater-hamilton.html",
    "summary": "Andrew Lloyd Webber, Sara Bareilles, Joshua Henry, Jeanine Tesori, Jason Robert Brown and New York Times writers and editors pick 13 songs to seal the deal."
  },
  {
    "title": "The Incomprehensible March Toward Regime Change in Venezuela",
    "link": "https://www.nytimes.com/2025/11/24/opinion/venezuela-trump-regime-change.html",
    "summary": "The administration’s drug war rhetoric seems like a pretext. But a pretext for what?"
  },
  {
    "title": "America’s Caregivers Are in Crisis",
    "link": "https://www.nytimes.com/2025/11/24/opinion/caregiving-crisis.html",
    "summary": "Caregivers are at the brink of despair."
  },
  {
    "title": "‘Find a Job,’ Ontario Premier Tells Protester While Passing a New Housing Law",
    "link": "https://www.nytimes.com/2025/11/24/world/canada/doug-ford-ontario-housing-bill-60.html",
    "summary": "During a raucous hearing, the Ontario legislature passed a bill backed by Premier Doug Ford meant to expedite housing development and the eviction of tenants who are behind on their rent."
  },
  {
    "title": "Images From Vietnam’s Year of Deadly Wet Weather",
    "link": "https://www.nytimes.com/2025/11/24/world/asia/vietnam-flooding-typhoon-emergency.html",
    "summary": "Scientists suggested that climate change could make central Vietnam a global hot spot for destructive storms. This year has seemed to prove the point."
  },
  {
    "title": "‘Queen of Versailles’ to Close as New Broadway Musicals Struggle",
    "link": "https://www.nytimes.com/2025/11/24/theater/queen-of-versailles-broadway-closing.html",
    "summary": "The show, starring Kristin Chenoweth, will remain open through the holidays. The announcement comes just two weeks after the musical opened."
  }
]