[
  {
    "title": "U.S. Coast Guard Pursues Oil Tanker Linked to Venezuela",
    "link": "https://www.nytimes.com/2025/12/21/us/politics/us-coast-guard-venezuela-oil-tankers.html",
    "summary": "The latest vessel to be targeted by the United States in its pressure campaign on Venezuela was sending distress signals as it headed northeast from the Caribbean into the Atlantic."
  },
  {
    "title": "At Turning Point Fest, Vance Refuses to Take Sides in Fight Over Bigotry",
    "link": "https://www.nytimes.com/2025/12/21/us/politics/vance-republicans-trump-antisemitism.html",
    "summary": "The vice president’s plea for a big-tent coalition at an annual conservative gathering belied the cracks in his party over antisemitism, racism and conspiracy theories."
  },
  {
    "title": "‘60 Minutes’ Pulled a Segment. A Correspondent Calls It ‘Political.’",
    "link": "https://www.nytimes.com/2025/12/21/business/60-minutes-trump-bari-weiss.html",
    "summary": "Sharyn Alfonsi, a “60 Minutes” correspondent, criticized the network’s decision to remove her reporting from Sunday’s edition of the show."
  },
  {
    "title": "Russia Dismisses Reports of Progress in Ukraine Peace Talks",
    "link": "https://www.nytimes.com/2025/12/21/world/europe/ukraine-peace-talks.html",
    "summary": "Proposals that emerged in recent negotiations with the United States were “rather unconstructive,” a Kremlin official said on Sunday."
  },
  {
    "title": "Michele Singer Reiner: A Life Rooted in Activism and Listening to Others",
    "link": "https://www.nytimes.com/2025/12/21/us/michele-singer-reiner.html",
    "summary": "Michele Singer Reiner was the guiding force in the lives of her family, stressing the need to help and respect one another."
  },
  {
    "title": "As Regional Theaters Struggle, Some Defy the Odds",
    "link": "https://www.nytimes.com/2025/12/15/theater/theaters-gulfshore-playhouse-florida-milwaukee-rep-wisconsin.html",
    "summary": "Naples, Fla., and Milwaukee are quite different, but have one thing in common: They are home to regional theaters that are thriving."
  },
  {
    "title": "Sikh Truckers Found Refuge In Trucking Until The Trump Administration’s Crackdown",
    "link": "https://www.nytimes.com/2025/12/21/business/sikhs-truckers-trump-crackdown.html",
    "summary": "Two high-profile crashes and a Trump administration crackdown have brought worry, and wariness, to the community."
  },
  {
    "title": "Guns from the United States are Pouring into Canada, Fueling a Spike in Gun Violence",
    "link": "https://www.nytimes.com/2025/12/21/world/americas/canada-gun-violence-us.html",
    "summary": "The proliferation of illegal firearms from the United States has fueled a spike in gun violence in Canada, where most guns used in crimes are smuggled across the border."
  },
  {
    "title": "How China Tried to Dismantle a Major Underground Church",
    "link": "https://www.nytimes.com/2025/12/21/world/asia/china-christian-zion-church-raid.html",
    "summary": "Videos and photographs show how the Chinese authorities have tried to dismantle Zion Church, a Christian network with branches across the country."
  },
  {
    "title": "‘Orwellian Climate of Fear’: How China Cracks Down on Critics in the U.S.",
    "link": "https://www.nytimes.com/2025/12/21/world/asia/chinese-dissidents-protest-art.html",
    "summary": "The Chinese government once focused on political dissidents and exiled activists. Now, federal officials say, it is targeting artists in the United States whose creative protests test its tolerance."
  },
  {
    "title": "When Did Everything Become ‘K-Shaped’?",
    "link": "https://www.nytimes.com/2025/12/19/business/k-shaped-economy.html",
    "summary": "What started as a term to describe the pandemic recovery has become a catchall in these anxious economic times."
  },
  {
    "title": "How Many Toys Will Parents Buy for Their Kids This Christmas?",
    "link": "https://www.nytimes.com/2025/12/21/business/mattel-ynon-kreiz-toys-tariffs.html",
    "summary": "Ynon Kreiz, the chief executive of Mattel, believes consumers squeezed by tariffs and inflation will cut back on other things before they skimp on Barbies and Hot Wheels."
  },
  {
    "title": "Waymo Suspended Service in San Francisco After Its Cars Stalled During Power Outage",
    "link": "https://www.nytimes.com/2025/12/21/us/waymo-suspended-service-in-san-francisco-after-problems-during-power-outage.html",
    "summary": "The self-driving cars came to a halt at intersections when the power outage knocked out traffic signals, causing tie-ups but no accidents or injuries."
  },
  {
    "title": "600 Readers Told Us About the Best Gifts They Ever Got. These Are the Top 13.",
    "link": "https://www.nytimes.com/2025/12/15/opinion/contributors/holiday-gifts-presents-free.html",
    "summary": "We asked readers to tell us about the most memorable presents they’ve received."
  },
  {
    "title": "France Needs a New France",
    "link": "https://www.nytimes.com/2025/12/22/opinion/france-macron-sixth-republic.html",
    "summary": "The time has come for a Sixth Republic."
  },
  {
    "title": "Heavy Rains Bring Flooding to Northern California",
    "link": "https://www.nytimes.com/2025/12/21/us/flooding-shasta-count-california.html",
    "summary": "As floodwaters submerged cars and prompted rescues in the state’s far north on Sunday, forecasters warned that Central California would receive heavy rain later in the week."
  },
  {
    "title": "Older Americans Quit Weight-Loss Drugs in Droves",
    "link": "https://www.nytimes.com/2025/12/21/health/older-people-glp1-weight.html",
    "summary": "In some studies, half of patients stopped taking GLP-1s within a year despite the benefits, citing the expense and side effects."
  },
  {
    "title": "Élysée Palace Silver and Tableware Stolen by Steward, Prosecutors Say",
    "link": "https://www.nytimes.com/2025/12/21/world/europe/elysee-palace-theft.html",
    "summary": "In what prosecutors say was an inside job, copper pots, porcelain and Baccarat Champagne glasses were stolen from the inventory of the Élysée Palace."
  },
  {
    "title": "James Ransone, Actor Known for ‘The Wire,’ Dies at 46",
    "link": "https://www.nytimes.com/2025/12/21/arts/television/james-ransone-wire-dead.html",
    "summary": "The character actor had grown up in Maryland, where “The Wire” was set, and went on to star in horror films like “It Chapter Two.”"
  }
]