[
  {
    "title": "Trump Says House Republicans Should Vote to Release Epstein Files",
    "link": "https://www.nytimes.com/2025/11/16/us/politics/trump-epstein-files-release-vote.html",
    "summary": "President Trump reversed himself as he faced the prospect that dozens of Republicans could vote this week to compel his administration to release files related to Jeffrey Epstein."
  },
  {
    "title": "U.S. Border Patrol Arrested 81 People in Charlotte, N.C.",
    "link": "https://www.nytimes.com/2025/11/16/us/border-patrol-arrests-charlotte-nc.html",
    "summary": "Border Patrol agents descended on Charlotte this weekend searching for immigrants in the country illegally. It remains unclear how long the agents will stay."
  },
  {
    "title": "Homeland Security Missions Falter Amid Focus on Deportations",
    "link": "https://www.nytimes.com/2025/11/16/us/politics/dhs-agents-reassigned.html",
    "summary": "Under President Trump, an agency intended to keep Americans safe has diverted resources from combating child abuse, trafficking and terrorism."
  },
  {
    "title": "New International Student Enrollment Plummeted This Fall, Survey Finds",
    "link": "https://www.nytimes.com/2025/11/17/us/international-students-enrollment-decrease.html",
    "summary": "The overall number of international students enrolled in U.S. colleges and universities, including those who enrolled in prior years or who are working after graduation, fell only slightly."
  },
  {
    "title": "At Catholic Churches, Trump’s Immigration Crackdown Takes Center Stage",
    "link": "https://www.nytimes.com/2025/11/16/us/catholic-church-immigration-trump.html",
    "summary": "Immigration was on the minds of priests and parishioners following a letter from the nation’s Catholic bishops decrying how immigrants are being treated."
  },
  {
    "title": "The Crypto Industry’s $28 Billion in ‘Dirty Money’",
    "link": "https://www.nytimes.com/2025/11/17/technology/crypto-exchanges-dirty-money.html",
    "summary": "As President Trump has championed crypto and the industry has gone mainstream, funds from scammers and other criminal groups have flowed onto major crypto exchanges."
  },
  {
    "title": "How Fraudsters Use Cryptocurrency A.T.M.s to Target Victims",
    "link": "https://www.nytimes.com/2025/11/17/technology/fraudsters-cryptocurrency-atms.html",
    "summary": "The kiosks, which resemble conventional A.T.M.s and convert cash into virtual currencies, are increasingly under scrutiny as a tool for scammers."
  },
  {
    "title": "How to Not Get Kidnapped for Your Bitcoin",
    "link": "https://www.nytimes.com/2025/11/17/business/how-to-not-get-kidnapped-for-your-bitcoin.html",
    "summary": "Escaping zipties, hiring bodyguards and other practical lessons in self-defense for crypto traders, after a series of gruesome crimes spooked the community."
  },
  {
    "title": "Friends Say a Suspect in the Louvre Heist Had Tried to Leave a Rough Past Behind",
    "link": "https://www.nytimes.com/2025/11/16/world/europe/louvre-heist-suspect.html",
    "summary": "He had been best known as a daring urban dirt-bike rider who had pulled off stunts at iconic sites in Paris, according to several friends."
  },
  {
    "title": "They Got Low Mortgage Rates During the Pandemic. Now They Can’t Move.",
    "link": "https://www.nytimes.com/2025/11/16/business/homeowners-moving-mortgage-rates.html",
    "summary": "Many Americans bought their first houses when mortgage rates dipped to record lows. Some are ready to move but feel locked in by their low rates."
  },
  {
    "title": "A Pill for Women’s Libido Meets a Cultural Moment",
    "link": "https://www.nytimes.com/2025/11/16/style/cindy-eckert-pink-pill-addyi.html",
    "summary": "A decade ago, Cindy Eckert struggled to convince skeptics about a drug for premenopausal women. Lately, her business is booming."
  },
  {
    "title": "In a Brutal Mississippi Jail, Inmates Say They Were Enlisted as Enforcers",
    "link": "https://www.nytimes.com/2025/11/14/us/mississippi-jail-inmates-rankin-county.html",
    "summary": "High-ranking inmates known as trusties were ordered to do guards’ bidding, former inmates and guards said, and the culture of violence in the jail went straight to the top."
  },
  {
    "title": "New Orleans Elects Exonerated Man, Calvin Duncan, as Criminal Court Clerk",
    "link": "https://www.nytimes.com/2025/11/16/us/calvin-duncan-new-orleans-criminal-court-clerk.html",
    "summary": "Mr. Duncan was elected clerk of the criminal court in New Orleans on Saturday, ousting an incumbent who claimed Mr. Duncan had never been cleared of the murder that sent him to prison."
  },
  {
    "title": "At a Shared Symbol of Jihad, the Taliban Defy Their Old Ties With Pakistan",
    "link": "https://www.nytimes.com/2025/11/17/world/asia/at-a-shared-symbol-of-jihad-the-taliban-defy-their-old-ties-with-pakistan.html",
    "summary": "Afghan officials are lashing out against their former allies in the Pakistan military as hostilities between the two countries intensify."
  },
  {
    "title": "Can Ken Burns Win the American Revolution?",
    "link": "https://www.nytimes.com/2025/10/23/arts/television/ken-burns-american-revolution.html",
    "summary": "Burns’s 12-hour documentary about our national origin story is landing in the middle of a culture war. Yes, it’s complicated. No, he does not want to talk about President Trump."
  },
  {
    "title": "Carter Anderson’s Jeans Are Gigantic. His Internet Fame Is Too.",
    "link": "https://www.nytimes.com/2025/11/16/style/jeans-carter-anderson-indigo-invitational.html",
    "summary": "Carter Anderson purchased an outrageous pair of pants to try to win a contest and became an unlikely social media star along the way."
  },
  {
    "title": "Saudi Leader Looking Inward as He Comes to Washington",
    "link": "https://www.nytimes.com/2025/11/17/opinion/saudi-prince-mbs-trump-washington.html",
    "summary": "The crown prince will meet President Trump with an agenda aimed at protecting the kingdom’s interests."
  },
  {
    "title": "A Christian Answer to Trump and Trumpism Is Finally Here",
    "link": "https://www.nytimes.com/2025/11/16/opinion/trump-pope-leo-maga-christianity.html",
    "summary": "Pope Leo doesn’t want to be the anti-Trump. But he is."
  },
  {
    "title": "Women Describe Horrors They Endured in Assad’s Prisons",
    "link": "https://www.nytimes.com/2025/11/16/world/europe/syria-women-assad-prisons.html",
    "summary": "Under the Syrian dictator’s rule, the wives and children of rebels were seized as leverage. Some are now speaking about their trauma."
  },
  {
    "title": "New York Jets Player Kris Boyd Is Critically Wounded in Shooting",
    "link": "https://www.nytimes.com/2025/11/16/nyregion/kris-boyd-shot-jets.html",
    "summary": "Mr. Boyd was wounded early on Sunday in a shooting in Midtown Manhattan. He is in his first year as a defensive player with the team after signing in March."
  },
  {
    "title": "Trump-Style Candidate Heads to Runoff in Chile’s Election",
    "link": "https://www.nytimes.com/2025/11/16/world/americas/chile-presidential-election-on-sunday.html",
    "summary": "The conservative José Antonio Kast will face Jeannette Jara, a Communist Party member, in a vote next month."
  },
  {
    "title": "Trump Gives Legs to South Korea’s Dream for Nuclear-Powered Subs",
    "link": "https://www.nytimes.com/2025/11/17/world/asia/trump-south-korea-nuclear-submarines.html",
    "summary": "For decades, Washington blocked Seoul’s desire for the attack submarines over concerns about nuclear proliferation. President Trump reversed that policy last month, but left key questions unresolved."
  }
]