[
  {
    "title": "For $1 Million, Donors to U.S.A. Birthday Group Offered Access to Trump",
    "link": "https://www.nytimes.com/2026/02/08/us/politics/freedom-250-trump-donors.html",
    "summary": "A new organization blessed by the president is raising money for events and projects that will put a Trumpian spin on the nation’s semiquincentennial."
  },
  {
    "title": "Reaction to Trump’s Racist Post Shows He Is Not Always Immune to Politics",
    "link": "https://www.nytimes.com/2026/02/07/us/politics/trump-social-post-reaction.html",
    "summary": "With the midterm elections nearing, President Trump has found himself in the uncomfortable position of backtracking, even if only by degrees, at key moments."
  },
  {
    "title": "Demanding Support for Trump, Justice Dept. Struggles to Recruit Prosecutors",
    "link": "https://www.nytimes.com/2026/02/07/us/politics/doj-prosecutors-recruiting-trump.html",
    "summary": "Some offices are so decimated that the Justice Department has sent in military lawyers. More recently, officials asked for volunteers from other offices who can quickly deploy to places in desperate need."
  },
  {
    "title": "As American Views of ICE Dim, Warehouses Become a Symbol of Resistance",
    "link": "https://www.nytimes.com/2026/02/08/nyregion/ice-warehouse-new-york-opposition.html",
    "summary": "Plans to confine migrants in retrofitted buildings have ignited bipartisan dissent as the country has grown more critical of immigration officials."
  },
  {
    "title": "Epstein Files Reveal Scope of Ghislaine Maxwell’s Role in Clinton Circle",
    "link": "https://www.nytimes.com/2026/02/08/us/politics/epstein-clintons-maxwell.html",
    "summary": "Jeffrey Epstein’s longtime companion helped advise on the kickoff of the Clinton Global Initiative and arranged for $1 million in funding for it, emails show."
  },
  {
    "title": "Files Detail Epstein’s Dealings With Commerce Secretary Howard Lutnick",
    "link": "https://www.nytimes.com/2026/02/07/nyregion/lutnick-epstein-files-dealings.html",
    "summary": "Mr. Lutnick had claimed to have distanced himself from Jeffrey Epstein even before the disgraced financier was convicted of a sex crime in Florida."
  },
  {
    "title": "Washington Post C.E.O. Will Lewis Steps Down After Stormy Tenure",
    "link": "https://www.nytimes.com/2026/02/07/technology/washington-post-will-lewis.html",
    "summary": "His departure came days after the company cut 30 percent of the staff. He will be replaced in the interim by Jeff D’Onofrio, the chief financial officer, the company said."
  },
  {
    "title": "How Bad Bunny Gives Voice to Puerto Rico’s ‘Crisis Generation’",
    "link": "https://www.nytimes.com/2026/02/08/us/how-bad-bunny-gives-voice-to-puerto-ricos-crisis-generation.html",
    "summary": "Young Puerto Ricans say the star has opened the world’s eyes to their challenges, and to the island’s fraught territorial relationship with the U.S. government."
  },
  {
    "title": "At the Super Bowl, it’s Nice Guy vs. Underdog.",
    "link": "https://www.nytimes.com/2026/02/08/podcasts/the-daily/at-the-super-bowl-its-nice-guy-vs-underdog.html",
    "summary": "Your guide to today’s matchup."
  },
  {
    "title": "Is Wallace Shawn the Only Avant-Garde Artist Who Gets Stopped in Times Square?",
    "link": "https://www.nytimes.com/2026/02/08/t-magazine/wallace-shawn.html",
    "summary": "He’s most commonly recognized for his screen roles as a plotting hit man and an unlikely Lothario, but it’s his work as a playwright that shows more of his true self."
  },
  {
    "title": "The Secret History of the Deep State",
    "link": "https://www.nytimes.com/2026/02/08/opinion/trump-nixon-watergate-radford.html",
    "summary": "Seven pages of grand jury testimony from Richard Nixon were deemed so incendiary that they were hidden from the public for years."
  },
  {
    "title": "A Movie About America Broke My Heart",
    "link": "https://www.nytimes.com/2026/02/08/opinion/shakers-quakers-testament-ann-lee.html",
    "summary": "I am not a Shaker. That didn’t stop me from tearing up at “The Testament of Ann Lee.”"
  },
  {
    "title": "Studying Antarctica’s Ice From the Side of a Helicopter",
    "link": "https://www.nytimes.com/2026/02/06/climate/antarctica-thwaites-glacier-rifts.html",
    "summary": "The fastest way into the gaps between gigantic blocks of a broken-up glacier is by lowering instruments from above, through the door of a helicopter."
  },
  {
    "title": "A First Look Below Antarctica’s Most Menacing Glacier",
    "link": "https://www.nytimes.com/video/climate/100000010684396/thwaites-glacier-antarctica-research.html",
    "summary": "Scientists on the Thwaites Glacier attempted to install equipment beneath the ice to better understand how it is melting. Our climate reporter Raymond Zhong walks us through their landmark experiment and the bittersweet outcome."
  },
  {
    "title": "Savannah Guthrie, in New Video, Promises to Pay for Her Mother’s Return",
    "link": "https://www.nytimes.com/2026/02/07/us/savannah-guthrie-nancy-guthrie-video-message.html",
    "summary": "The “Today” show anchor, in a message on social media with her siblings, said the return of their mother Nancy “is the only way we will have peace.”"
  },
  {
    "title": "What’s Behind the Weird Weather That’s Dominated 2026",
    "link": "https://www.nytimes.com/2026/02/07/weather/cold-snow-forecast-us.html",
    "summary": "While iguanas were stunned by freezing cold in Florida, would-be skiers were looking at dirt on Utah’s slopes. Here’s what’s going on, and when it will finally end."
  },
  {
    "title": "In Bid to Lead Thailand, a Progressive Party Softens Its Image",
    "link": "https://www.nytimes.com/2026/02/07/world/asia/thailand-election-peoples-party.html",
    "summary": "Sunday’s election is a test for the progressive, pro-democracy movement in Thailand, which has been blocked from taking power despite success at the polls."
  }
]