[
  {
    "title": "Trump Officials Take Steps to Target Comey and Brennan, Who Investigated Trump",
    "link": "https://www.nytimes.com/2025/07/09/us/politics/ratcliffe-brennan-cia.html",
    "summary": "It is unclear whether moves targeting the former F.B.I. director James B. Comey and the former C.I.A. director John O. Brennan will lead to charges."
  },
  {
    "title": "James Comey Tracked by Secret Service After Post Critical of Trump",
    "link": "https://www.nytimes.com/2025/07/09/us/politics/james-comey-secret-service.html",
    "summary": "After the former F.B.I. director put a picture on Instagram of seashells arranged to say “86 47,” law enforcement tailed his car and tracked his cellphone, steps usually reserved for serious threats."
  },
  {
    "title": "Trump Pledges 50% Tariffs Against Brazil, Citing ‘Witch Hunt’ Against Bolsonaro",
    "link": "https://www.nytimes.com/2025/07/09/world/americas/brazil-trump-bolsonaro-lula-coup-tariff.html",
    "summary": "Tensions between the United States and Brazil have suddenly burst open. Brazil’s president promised to reciprocate against President Trump’s tariffs."
  },
  {
    "title": "Rubio Visits Asia as Trump Raises Trade-War Tensions",
    "link": "https://www.nytimes.com/2025/07/09/world/asia/rubio-asia-diplomacy-tariffs.html",
    "summary": "Secretary of State Marco Rubio talks about countering China as it expands its global influence. But President Trump’s tariff threats have created friction with U.S. partners."
  },
  {
    "title": "Trump Tariffs Aim to Settle Scores With Countries, No Matter Their Size",
    "link": "https://www.nytimes.com/2025/07/09/business/economy/trump-tariffs-global-trade.html",
    "summary": "The president’s tariff announcements suggest he has not backed away from his initial strategy, where even smaller trading partners will face tariffs."
  },
  {
    "title": "Is Trump Actually Making the U.S. Economy More Competitive?",
    "link": "https://www.nytimes.com/2025/07/09/us/politics/trump-tariffs-taxes-economy.html",
    "summary": "Experts fear that the president’s economic policies could increase costs and stifle innovation."
  },
  {
    "title": "Mamdani, Urged to Keep Tisch as Police Commissioner, Is Considering It",
    "link": "https://www.nytimes.com/2025/07/09/nyregion/mamdani-jessica-tisch-nypd.html",
    "summary": "As Zohran Mamdani runs for mayor in the general election, some leaders are encouraging him to keep Jessica Tisch as New York City’s police commissioner."
  },
  {
    "title": "Zohran Mamdani Expands Campaign Team, Hiring Veteran Democrat",
    "link": "https://www.nytimes.com/2025/07/09/nyregion/mamdani-communications-jeffrey-lerner.html",
    "summary": "Mr. Mamdani, a state assemblyman and the Democratic nominee for mayor of New York City, is taking on a small handful of more experienced campaign hands."
  },
  {
    "title": "Eric Adams Asked Bill Ackman to Vet Campaign Manager Before Hiring Him",
    "link": "https://www.nytimes.com/2025/07/09/nyregion/eric-adams-eugene-noh-bill-ackman.html",
    "summary": "Mr. Ackman and another hedge fund titan, Daniel S. Loeb, interviewed a potential campaign hire for Mayor Adams, who is courting their financial support."
  },
  {
    "title": "Starmer and Macron Agree to Nuclear Deterrence Pact to Fend Off Threat to Europe",
    "link": "https://www.nytimes.com/2025/07/10/world/europe/starmer-macron-nuclear-agreement.html",
    "summary": "The two leaders are set to confirm details of a strengthened defense relationship at a summit Thursday. An agreement on tackling unauthorized migration may also be announced."
  },
  {
    "title": "Tensions Escalate in San Francisco Over Immigration Enforcement",
    "link": "https://www.nytimes.com/2025/07/09/us/ice-immigration-protest-san-francisco.html",
    "summary": "Videos captured a scuffle between protesters and immigration agents outside a courthouse. No injuries were immediately reported, the police said."
  },
  {
    "title": "Immigration Officials Used Shadowy Pro-Israel Group to Target Student Activists",
    "link": "https://www.nytimes.com/2025/07/09/us/politics/ice-canary-mission-student-deportations.html",
    "summary": "A senior Homeland Security official testified in court on Wednesday that his department had relied in part on an anonymously compiled list to identify foreign academics for investigation."
  },
  {
    "title": "Lawmakers in Liberal States Want ICE Agents to Show Their Faces",
    "link": "https://www.nytimes.com/2025/07/09/nyregion/ice-agents-masks-lawmakers-ban.html",
    "summary": "Elected officials in New York and California are trying to upend President Trump’s deportation campaign by banning law enforcement officers from wearing masks in public."
  },
  {
    "title": "Putin Escalates His War Against Ukraine, Undeterred by Trump’s Words",
    "link": "https://www.nytimes.com/2025/07/09/world/europe/russia-ukraine-putin-trump.html",
    "summary": "The Russian leader is convinced that Moscow’s battlefield superiority is growing, and that Ukraine’s defenses may collapse in the coming months, according to people close to the Kremlin."
  },
  {
    "title": "A British Surgeon Shares What She Saw in Gaza’s Hospitals",
    "link": "https://www.nytimes.com/2025/07/09/world/middleeast/gaza-hospitals-uk-surgeon-israel-attacks.html",
    "summary": "A British surgeon described what she saw in the territory, treating people who’d been shot trying to get food and children with life-changing injuries from Israeli bombs."
  },
  {
    "title": "Yemen’s Houthi Militia Took Sailors Hostage After Red Sea Attack, U.S. Says",
    "link": "https://www.nytimes.com/2025/07/09/world/middleeast/houthis-red-sea-hostages.html",
    "summary": "The Yemeni militia, backed by Iran, said it had sunk a Liberian-flagged cargo ship in the Red Sea. Liberia said the attack killed two crew members."
  },
  {
    "title": "Measles Cases Hit Highest Total Since U.S. Eliminated Disease",
    "link": "https://www.nytimes.com/2025/07/09/well/us-measles-record-outbreaks.html",
    "summary": "Experts worry that if vaccination rates do not improve, deadly outbreaks will become the new normal."
  },
  {
    "title": "‘I Feel Like I’ve Been Lied To’: When a Measles Outbreak Hits Home",
    "link": "https://www.nytimes.com/2025/06/22/us/i-feel-like-ive-been-lied-to-when-a-measles-outbreak-hits-home.html",
    "summary": "From a lone clinic in Texas to an entire school district in North Dakota, the virus is upending daily life and revealing a deeper crisis of belief."
  },
  {
    "title": "X CEO Linda Yaccarino Says She Is Leaving Elon Musk’s Platform",
    "link": "https://www.nytimes.com/2025/07/09/technology/linda-yaccarino-x-steps-down.html",
    "summary": "Linda Yaccarino, whom Elon Musk hired to run X in 2023, grappled with the challenges the company faced after Mr. Musk took over."
  },
  {
    "title": "How Elephants Say They Like Them Apples",
    "link": "https://www.nytimes.com/2025/07/09/science/elephants-gesturing-trunk.html",
    "summary": "Researchers found that the animals are capable of using their trunks to make a range of gestures that express their intentions and wants."
  },
  {
    "title": "The World’s Best and Brightest Are Moving, but Not to America",
    "link": "https://www.nytimes.com/2025/07/09/opinion/united-states-migration.html",
    "summary": "Immigration isn’t a crisis. It’s the future."
  },
  {
    "title": "This ‘Trial of the Century’ Is 100. Its Lessons Could Save the Democrats.",
    "link": "https://www.nytimes.com/2025/07/10/opinion/scopes-monkey-trial-democrats.html",
    "summary": "A hundred years later, many religious Americans in rural areas still feel that the cosmopolitan leaders of the Democratic Party look down on them."
  },
  {
    "title": "Dozens Rescued From Tunnel That Collapsed in Los Angeles",
    "link": "https://www.nytimes.com/2025/07/10/us/tunnel-collapse-los-angeles-trapped.html",
    "summary": "The workers climbed over a mound of soil nearly 15 feet tall inside the tunnel, before being shuttled to the entry point more than five miles away."
  },
  {
    "title": "New U.S. Army Shaving Rule Could Affect Many Black Soldiers",
    "link": "https://www.nytimes.com/2025/07/09/us/army-facial-hair-policy-requirements-shaving.html",
    "summary": "Soldiers with skin conditions like razor bumps will no longer be granted permanent medical waivers that allow them to grow beards and could be kicked out of the Army if they are not clean shaven."
  },
  {
    "title": "Umbrellas Optional? East Asia’s Monsoon Rains Are No Longer a Sure Thing",
    "link": "https://www.nytimes.com/2025/07/09/world/asia/monsoon-season-south-korea-japan.html",
    "summary": "Parts of South Korea and Japan have had short rainy seasons this year. Scientists say that climate change has helped make the summer rains more unreliable."
  },
  {
    "title": "A 37,000-Year Chronicle of What Once Ailed Us",
    "link": "https://www.nytimes.com/2025/07/09/science/archaeology-diseases-pathogens.html",
    "summary": "In a new genetic study, scientists have charted the rise of 214 human diseases across ancient Europe and Asia."
  }
]