[
  {
    "title": "Pepper-Sprayed While Pinned Down: A Searing Scene Provokes Outrage",
    "link": "https://www.nytimes.com/2026/01/23/us/minneapolis-man-pepper-sprayed-pinned-video.html",
    "summary": "Images of a man getting pepper-sprayed at close range while being held down by Border Patrol agents fueled more tension in Minneapolis."
  },
  {
    "title": "Why the Power May Not Go Out Until After the Storm Has Passed",
    "link": "https://www.nytimes.com/2026/01/24/business/energy-environment/storm-power-outages.html",
    "summary": "The steady accumulation of snow and freezing rain and a rise in demand for electricity can cause problems long after the sky clears, energy experts said."
  },
  {
    "title": "Trump Threatens Canada With Tariffs as Post-Davos Fallout Continues",
    "link": "https://www.nytimes.com/2026/01/24/world/canada/trump-canada-tariffs.html",
    "summary": "President Trump said he would impose tariffs if Canada made “a deal with China,” though there is no sign that those countries are discussing a broad trade agreement."
  },
  {
    "title": "Despite Trump’s Words, China and Russia Are Not Threatening Greenland",
    "link": "https://www.nytimes.com/2026/01/24/us/politics/trump-china-russia-greenland.html",
    "summary": "U.S. and European officials say they are unaware of any intelligence that shows China and Russia are endangering the island, which is protected by the NATO security umbrella."
  },
  {
    "title": "What Europe Learned From the Greenland Crisis",
    "link": "https://www.nytimes.com/2026/01/24/world/europe/sovereignty-european-union-nato.html",
    "summary": "Territorial integrity is a core tenet of Europe that is at risk from Russian and American imperialism. Brussels has fought back."
  },
  {
    "title": "How a Year of Trump Changed Britain",
    "link": "https://www.nytimes.com/2026/01/24/world/europe/trump-uk-changes.html",
    "summary": "Prime Minister Keir Starmer stood firm over Greenland. But his center-left government and the country as a whole have been buffeted by President Trump."
  },
  {
    "title": "As Trump Focuses Abroad, G.O.P. Toils to Hone Election Message",
    "link": "https://www.nytimes.com/2026/01/24/us/gop-election-message-trump.html",
    "summary": "A new poll shows that voters who will decide control of Congress see a lack of presidential emphasis on critical domestic issues."
  },
  {
    "title": "Low Rates Sound Great. But a Trump Fed Could Cause a Painful ‘Sugar High.’",
    "link": "https://www.nytimes.com/2026/01/23/business/trump-fed-interest-rates-inflation.html",
    "summary": "Dropping rates more than conditions warrant would stimulate the economy in the short term but could lead to trouble, our columnist says."
  },
  {
    "title": "Should New Dietary Guidelines Change How You Eat? Your Biggest Questions, Answered.",
    "link": "https://www.nytimes.com/2026/01/23/well/eat/rfk-jr-dietary-guidelines-food-pyramid-questions.html",
    "summary": "New federal nutrition advice has caused some confusion and controversy."
  },
  {
    "title": "Genetic Data From Over 20,000 U.S. Children Misused for ‘Race Science’",
    "link": "https://www.nytimes.com/2026/01/24/us/children-genetics-race-science.html",
    "summary": "The National Institutes of Health failed to protect brain scans that an international group of fringe researchers used to argue for the intellectual superiority of white people."
  },
  {
    "title": "The World Will Remember Trump’s Greenland Outburst",
    "link": "https://www.nytimes.com/2026/01/24/opinion/trump-nato-greenland.html",
    "summary": "It is time for Americans to step up and defend NATO and our country’s vital interests in its survival."
  },
  {
    "title": "Cold Comfort",
    "link": "https://www.nytimes.com/2026/01/24/briefing/cold-comfort.html",
    "summary": "How can the perpetually shivering warm up to winter?"
  },
  {
    "title": "An Antarctic Mission to Recover a Robot’s Data",
    "link": "https://www.nytimes.com/2026/01/23/climate/antarctica-robot-glider.html",
    "summary": "In the unforgiving polar wilderness, scientists go to great lengths to safeguard the devices that gather precious data."
  },
  {
    "title": "Setting Foot on the Melting Thwaites Glacier",
    "link": "https://www.nytimes.com/video/climate/100000010658848/setting-foot-on-the-melting-thwaites-glacier.html",
    "summary": "Bad weather ​delayed expedition scientists’​ ​efforts to set up camp on Thwaites Glacier ​in Antarctica ​and take measurements ​to determine how quickly it is melting. After the skies cleared, our journalists​, Raymond Zhong and Chang W. Lee​, took us along for their first steps on Thwaites."
  },
  {
    "title": "Washington Post Tears Up Plans to Cover Winter Olympics",
    "link": "https://www.nytimes.com/2026/01/24/business/media/washington-post-winter-olympics.html",
    "summary": "The abrupt change in direction came just weeks before the Olympic Games are set to begin in Italy."
  },
  {
    "title": "1 Killed and 14 Injured in Fire at Bronx Apartment Building",
    "link": "https://www.nytimes.com/2026/01/24/nyregion/bronx-fire-explosion-evacuation.html",
    "summary": "About 150 homes were evacuated overnight on Saturday after a gas explosion set off a four-alarm blaze in a public housing complex."
  },
  {
    "title": "How a Water Balloon Fight in Venezuela Ended in Charges of Treason",
    "link": "https://www.nytimes.com/2026/01/24/world/americas/venezuela-arrests-repression.html",
    "summary": "Venezuela’s interim government has been praised by President Trump. It has also maintained its state security apparatus to stamp out any perceived dissent."
  },
  {
    "title": "Mamdani Joined Nurses on the Picket Lines. That’s Unusual for Mayors.",
    "link": "https://www.nytimes.com/2026/01/24/nyregion/nyc-mayors-labor-strikes.html",
    "summary": "The current mayor of New York City has diverged from his predecessors by joining the striking nurses. Past labor disputes have often involved scolding."
  }
]