[
  {
    "title": "RFK Jr., Rejecting Vaccine Data, Fuels Distrust of Public Health Agencies",
    "link": "https://www.nytimes.com/2025/09/07/us/politics/kennedy-health-vaccines-cdc.html",
    "summary": "By promoting suspicions about the institutions he oversees, critics say Robert F. Kennedy Jr. is jeopardizing public health. He says he is pursuing transparency."
  },
  {
    "title": "Trump Downplays Post Threatening Chicago, Saying He Wants to ‘Clean Up’ City",
    "link": "https://www.nytimes.com/2025/09/07/us/politics/trump-chicago-war-us-open.html",
    "summary": "The president had said on social media that Chicago was “about to find out why it’s called the Department of WAR,” drawing a fierce rebuke from Democrats."
  },
  {
    "title": "Russia Strikes Ukraine Government Building in Largest Drone Assault of War",
    "link": "https://www.nytimes.com/2025/09/07/world/europe/russian-strike-kyiv-ukraine.html",
    "summary": "Ukrainians said it was the first time a key building in Kyiv’s government district had been damaged since the war began. Russia has kept attacking despite Trump administration efforts at peace talks."
  },
  {
    "title": "Russia Steps Up Disinformation Efforts as Trump Abandons Resistance",
    "link": "https://www.nytimes.com/2025/09/07/business/russia-disinformation-trump.html",
    "summary": "The Kremlin has begun a campaign to sway the parliamentary election in Moldova in what could become a new model of election interference online."
  },
  {
    "title": "Immigration Raid Exposes Tensions From Seoul to Washington to Rural Georgia",
    "link": "https://www.nytimes.com/2025/09/06/us/immigration-raid-georgia.html",
    "summary": "The raid at a Georgia plant being built with heavy investment from South Korea reveals strain as a rush to expand manufacturing in the United States clashes with an immigration crackdown."
  },
  {
    "title": "What We Know About the Hyundai-LG Plant Immigration Raid in Georgia",
    "link": "https://www.nytimes.com/2025/09/07/us/politics/hyundai-plant-immigration-raid-georgia.html",
    "summary": "Several hundred workers, most of them South Korean nationals, were detained at the construction site of a sprawling electric vehicle battery plant on Thursday."
  },
  {
    "title": "India’s Investors, Defying Tariffs, Keep Pouring Money Into Stocks",
    "link": "https://www.nytimes.com/2025/09/08/business/india-stocks-investors-trump.html",
    "summary": "Middle-class Indians have been plowing their savings into the stock market, making it far less vulnerable to the shocks of a trade war."
  },
  {
    "title": "Trump Is Met With Mostly Boos at U.S. Open as Security Delays a Match",
    "link": "https://www.nytimes.com/2025/09/07/us/politics/trump-us-open-tennis-boos-delays.html",
    "summary": "With the president in attendance at Arthur Ashe Stadium, the men’s final began as hundreds of people were still waiting to go through security screening."
  },
  {
    "title": "France, at an Impasse, Heads Toward Another Government Collapse",
    "link": "https://www.nytimes.com/2025/09/08/world/europe/france-vote-government-collapse.html",
    "summary": "A vote of confidence scheduled for Monday appears set to topple Prime Minister François Bayrou and put more pressure on President Emmanuel Macron."
  },
  {
    "title": "Why France’s Financial Woes Are Pushing Its Government to the Brink",
    "link": "https://www.nytimes.com/2025/09/07/business/france-government-collapse-economy.html",
    "summary": "The French prime minister has proposed drastic spending cuts and tax increases to shore up the country’s accounts, but his plan could backfire."
  },
  {
    "title": "Houthi Drone Hits Israeli Airport After Warning System Failure",
    "link": "https://www.nytimes.com/2025/09/07/world/middleeast/houthi-drone-israeli-airport.html",
    "summary": "The strike by the Yemeni militants followed the Israeli killing of several of their top leaders a week ago."
  },
  {
    "title": "Japan’s Prime Minister, Shigeru Ishiba, Resigns: What to Know",
    "link": "https://www.nytimes.com/2025/09/08/world/asia/japan-prime-minister-shigeru-ishiba-resigns.html",
    "summary": "Japan, one of the world’s most stable democracies, is experiencing unusually rapid change. Shigeru Ishiba’s departure could herald a leadership crisis."
  },
  {
    "title": "A Town Reluctantly Let a Mosque Expand. Then Came the Backlash.",
    "link": "https://www.nytimes.com/2025/09/07/nyregion/oyster-bay-mosque-lawsuit.html",
    "summary": "A Long Island town board failed to approve a settlement its lawyers had struck with Masjid Al-Baqi after a yearslong dispute tainted by bigotry. The mosque’s federal suit will be heard next month."
  },
  {
    "title": "John Burton, 92, Dies; California Political Boss Who Staged a Comeback",
    "link": "https://www.nytimes.com/2025/09/07/us/politics/john-burton-dead.html",
    "summary": "He left the House of Representatives while struggling with a crack addiction, his political career seemingly over. Actually, it had just begun."
  },
  {
    "title": "Memorable Moments of the 2025 MTV Video Music Awards: Mariah Carey, Lady Gaga and More",
    "link": "https://www.nytimes.com/2025/09/08/arts/music/mtv-video-music-awards-moments.html",
    "summary": "Mariah Carey and Busta Rhymes were honored for the first time, Lady Gaga crossed town and Doja Cat took it back to the 1980s."
  },
  {
    "title": "10 Best Red Carpet Looks at the MTV VMAs: Doja Cat, Sabrina Carpenter & More",
    "link": "https://www.nytimes.com/2025/09/07/style/mtv-video-music-awards-red-carpet-2025-best-dressed.html",
    "summary": "Feathery boas, loopy braids, a rare Labubu and more."
  },
  {
    "title": "A New War Is Emerging in Colombia",
    "link": "https://www.nytimes.com/2025/09/08/opinion/colombia-violence-drugs-petro.html",
    "summary": "Colombia’s return to conflict is a lesson in how hard it is to sustain progress toward peace."
  },
  {
    "title": "Stop Acting Like This Is Normal",
    "link": "https://www.nytimes.com/2025/09/07/opinion/trump-senate-democrats-shutdown.html",
    "summary": "Democrats aren’t powerless, and they don’t have to enable autocracy."
  },
  {
    "title": "West Point Alumni Group Cancels Award Honoring Tom Hanks",
    "link": "https://www.nytimes.com/2025/09/07/us/politics/tom-hanks-west-point-award.html",
    "summary": "The group was to bestow the Sylvanus Thayer Award on the actor, but it said it was canceling the event to focus on preparing academy cadets for the future."
  },
  {
    "title": "Australian Woman, Erin Patterson, Gets Life in Mushroom Murder Case",
    "link": "https://www.nytimes.com/2025/09/07/world/australia/australia-mushroom-murder-erin-patterson.html",
    "summary": "Erin Patterson was found guilty of murdering three of her husband’s relatives and trying to kill a fourth by serving them deadly mushrooms."
  },
  {
    "title": "Brazilians Protest as Bolsonaro Coup Trial Nears Verdict",
    "link": "https://www.nytimes.com/2025/09/07/world/americas/brazil-bolsonaro-trial-protests.html",
    "summary": "Tensions are heating up in Brazil as the nation enters the final week of former President Jair Bolsonaro’s trial on attempted coup charges."
  }
]