[
  {
    "title": "How Oil, Drugs and Immigration Fueled Trump’s Venezuela Campaign",
    "link": "https://www.nytimes.com/2025/12/27/us/politics/venezuela-trump-maduro-oil-boat-strikes-immigration.html",
    "summary": "New details of deliberations show how aides with overlapping agendas drove the United States toward a militarized confrontation with Venezuela."
  },
  {
    "title": "A Dancing Dictator and Bankers in Chains: The Other Venezuela Blockade",
    "link": "https://www.nytimes.com/2025/12/27/world/americas/venezuela-blockade-1903-us.html",
    "summary": "A crisis more than a century ago involved U.S. aims to assert military supremacy, a hard-partying dictator and frictions among the great powers."
  },
  {
    "title": "Trump’s Second-Term Promises: What He’s Done So Far on Immigration, Trade, DEI and More",
    "link": "https://www.nytimes.com/2025/12/27/us/politics/trump-second-term-promises-actions.html",
    "summary": "President Trump has driven illegal crossings at the border to record lows, helped bring about an uneasy cease-fire in Gaza and upended the global trading system."
  },
  {
    "title": "Trump Pursues His Legacy One Name at a Time",
    "link": "https://www.nytimes.com/2025/12/27/us/politics/trump-renaming.html",
    "summary": "In attaching his name to buildings and programs while still president, Donald Trump is walking a path paved by conquerors and autocrats."
  },
  {
    "title": "Another Front in the Trump Immigration Crackdown: Import Warehouses",
    "link": "https://www.nytimes.com/2025/12/27/nyregion/immigration-arrests-import-warehouses-new-jersey.html",
    "summary": "Workers at facilities that stock shipped goods say customs officers who inspect merchandise are helping immigration agents arrest migrants."
  },
  {
    "title": "Russia Pummels Kyiv Before Trump-Zelensky Meeting",
    "link": "https://www.nytimes.com/2025/12/27/world/europe/kyiv-ukraine-russia-trump-zelensky.html",
    "summary": "President Volodymyr Zelensky of Ukraine said that the assault with hundreds of drones and missiles, lasting nearly 10 hours, showed that Moscow was not serious about peace."
  },
  {
    "title": "How One Father Created an Organ Empire",
    "link": "https://www.nytimes.com/2025/12/27/us/national-kidney-registry-paired-organ-donation.html",
    "summary": "The National Kidney Registry has matched thousands of kidney donors with recipients. It has also paid millions of dollars to a company owned by its founder."
  },
  {
    "title": "As Some Boycott Myanmar’s Flawed Election, Others Hope for Change",
    "link": "https://www.nytimes.com/2025/12/28/world/asia/myanmar-election.html",
    "summary": "The voting for Parliament is almost sure to favor the ruling military junta, which is stage-managing the polls. Still, some see them as the most pragmatic way to try to improve conditions."
  },
  {
    "title": "In Myanmar, the Election Is Called Fake, but the Human Suffering Is Real",
    "link": "https://www.nytimes.com/2025/12/27/world/asia/myanmar-election-democracy-junta.html",
    "summary": "A coup set off a brutal civil war and made a poor country poorer. Now its military rulers are seeking a veneer of legitimacy by holding elections."
  },
  {
    "title": "What to Know About the Vote in Myanmar",
    "link": "https://www.nytimes.com/2025/12/27/world/asia/what-to-know-myanmar-vote.html",
    "summary": "Amid a ruinous civil war, the military government is holding elections that are widely seen as a sham, as the main opposition remains barred or jailed."
  },
  {
    "title": "Park Chan-wook and the Funny Thing About Stomach-Churning Horror",
    "link": "https://www.nytimes.com/2025/12/27/movies/park-chan-wook-no-other-choice-korea.html",
    "summary": "When American studios wouldn’t back his film about a laid-off manager committing gruesome murders, the director returned to Korea. Now he has a hit on his hands."
  },
  {
    "title": "The Year in Lists",
    "link": "https://www.nytimes.com/2025/12/27/opinion/the-year-in-lists.html",
    "summary": "As the year drew to a close, we reached out to Opinion columnists and contributors for personal lists."
  },
  {
    "title": "Families Demand Answers a Year After Deadliest Plane Crash in South Korea",
    "link": "https://www.nytimes.com/2025/12/28/world/asia/jeju-air-crash-investigation-anniversary.html",
    "summary": "Many details of the Jeju Air disaster that killed 179 people remain unclear despite multiple investigations by officials and protests by the victims’ families."
  },
  {
    "title": "More Student Loan Borrowers Are Shedding Debts in Bankruptcy",
    "link": "https://www.nytimes.com/2025/12/27/business/student-loans-bankruptcy.html",
    "summary": "A new study suggests that distressed borrowers using a simpler bankruptcy process are succeeding — and that more people like them should try."
  },
  {
    "title": "Hundreds of Flights Canceled at New York Airports, Even With a Few Inches of Snow",
    "link": "https://www.nytimes.com/2025/12/27/business/snowstorm-flight-cancel-new-york-airports.html",
    "summary": "To avoid the ripple effects of real-time adjustments to what was predicted to be up to nine inches of snow, the major airlines said they pre-emptively canceled flights."
  },
  {
    "title": "Gary Graffman, Piano Virtuoso and Renowned Teacher, Dies at 97",
    "link": "https://www.nytimes.com/2025/12/27/arts/music/gary-graffman-dead.html",
    "summary": "Mr. Graffman was a onetime child prodigy whose career was curtailed by a neurological condition that restricted him to his left hand."
  }
]